package l;

import bin.mt.plus.Main;

/* compiled from: 37CJ */
/* renamed from: l.ܿܶܳ, reason: contains not printable characters */
/* loaded from: classes.dex */
public abstract class AbstractC17429 extends AbstractViewOnClickListenerC12490 {

    /* renamed from: ۛ, reason: not valid java name and contains not printable characters */
    public static int f53285;

    /* renamed from: ۨۤ᩺, reason: not valid java name and contains not printable characters */
    private static final short[] f53286;

    /* renamed from: ۤ, reason: not valid java name and contains not printable characters */
    public final int f53287;

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public final native void m40770();

    /* JADX WARN: Code restructure failed: missing block: B:19:0x0080, code lost:
    
        if (l.C3245.m9925() != 0) goto L65;
     */
    /* JADX WARN: Code restructure failed: missing block: B:75:0x0246, code lost:
    
        if (l.C4075.m12263() <= 0) goto L65;
     */
    static {
        /*
            Method dump skipped, instructions count: 856
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.AbstractC17429.<clinit>():void");
    }

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public AbstractC17429(Main main, String str, String str2, C3318 c3318, int i) {
        super(main, str, str2, c3318);
        int i2 = -816297688;
        int i3 = C0714.f2697;
        int i4 = RunnableC0588.f2309;
        int m2566 = C0630.m2566("ۘۤ") ^ i3;
        int i5 = ((m2566 ^ i4) * (-13673)) ^ 752733812;
        int i6 = -1183151612;
        while (true) {
            i2 = (m2566 ^ i6) ^ (i5 & (((i2 ^ i4) * 31265) >> 31));
            switch (i2) {
                case -2085858557:
                case 989637752:
                    if (RunnableC1937.m6387() == 0) {
                        m2566 = (C2105.m6981("۠ܶ") ^ i4) * (-43);
                        i5 = ((m2566 ^ i3) * (-21169)) ^ 2075405136;
                        i6 = -1254809369;
                    } else {
                        m2566 = (C2105.m6981("ᩴ֨") ^ i3) * 25;
                        i5 = ((m2566 ^ i4) * (-9295)) ^ (-2112317725);
                        i6 = -1018932869;
                    }
                case -2036350646:
                case -1746545206:
                    C1916.m6308();
                    throw new RuntimeException();
                case -1968093646:
                case -1212226221:
                    if (C2126.m7040()) {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    } else {
                        m2566 = C2105.m6981("ܿۢ") ^ i4;
                        i5 = ((m2566 ^ i3) * 31895) ^ 1484972023;
                        i6 = -1894954474;
                    }
                case -1870052167:
                case 991618751:
                    if (C0483.f2088 >= 0) {
                        m2566 = (C0630.m2566("᩵۟") + i4) * (-37);
                        i5 = ((m2566 ^ i3) * 7733) ^ 1422930322;
                        i6 = -913994134;
                    } else {
                        m2566 = C2105.m6981("ۗۢ") ^ i4;
                        i5 = ((m2566 ^ i3) * 24429) ^ 96426561;
                        i6 = -72751000;
                    }
                case -1851423377:
                case -1588287895:
                    if (C4616.f14690 <= 0) {
                        m2566 = (C0630.m2566("᩵۟") + i4) * (-37);
                        i5 = ((m2566 ^ i3) * 7733) ^ 1422930322;
                        i6 = -913994134;
                    } else {
                        m2566 = (C0630.m2566("ܺۘ") + i3) * 123;
                        i5 = ((m2566 ^ i4) * 21765) ^ 244396399;
                        i6 = -674325046;
                    }
                case -1688739681:
                case -175168435:
                    if (ViewOnClickListenerC1958.f6529 > 0) {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    } else {
                        m2566 = (C0630.m2566("᩵۟") + i4) * (-37);
                        i5 = ((m2566 ^ i3) * 7733) ^ 1422930322;
                        i6 = -913994134;
                    }
                case -1666357112:
                case 1649593644:
                    if (C0630.m2564()) {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    } else {
                        m2566 = (C0630.m2566("ۚۡ") + i4) * (-5);
                        i5 = ((m2566 ^ i3) * (-31405)) ^ (-459617956);
                        i6 = -379715113;
                    }
                case -1522130300:
                case 391231717:
                    if (C3911.f12484 >= 0) {
                        m2566 = C0630.m2566("֫ۘ") ^ i4;
                        i5 = ((m2566 ^ i3) * 2187) ^ (-279187481);
                        i6 = 1819569519;
                    } else {
                        m2566 = (C2105.m6981("ۚ۠") + i3) * 31;
                        i5 = ((m2566 ^ i4) * (-17411)) ^ 1098350348;
                        i6 = -1694887788;
                    }
                case -1465891426:
                case 99221657:
                    if (C2272.m7503()) {
                        m2566 = (C0630.m2566("᩵۟") + i4) * (-37);
                        i5 = ((m2566 ^ i3) * 7733) ^ 1422930322;
                        i6 = -913994134;
                    } else {
                        m2566 = C2105.m6981("ᩳ۬") ^ i3;
                        i5 = ((m2566 ^ i4) * 7409) ^ (-619010627);
                        i6 = 516252797;
                    }
                case -302224525:
                case 926239509:
                    this.f53287 = i;
                    if (C1773.f6144 <= 0) {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    } else {
                        m2566 = (C0630.m2566("ᩳۙ") + i3) * (-55);
                        i5 = ((m2566 ^ i4) * (-19057)) ^ 1089953403;
                        i6 = 264562385;
                    }
                case -301008691:
                case 2006519081:
                    if (C3683.m11222()) {
                        m2566 = (C2105.m6981("۠ܶ") ^ i4) * (-43);
                        i5 = ((m2566 ^ i3) * (-21169)) ^ 2075405136;
                        i6 = -1254809369;
                    } else {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    }
                case 262603223:
                case 640363258:
                    C4075.m12263();
                    C0630.m2564();
                    m2566 = (C2105.m6981("۠ܶ") ^ i4) * (-43);
                    i5 = ((m2566 ^ i3) * (-21169)) ^ 2075405136;
                    i6 = -1254809369;
                case 385241658:
                case 1648986922:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m2566 = C2105.m6981("ᩴܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-18417)) ^ 339802092;
                        i6 = -1263497938;
                    } else {
                        m2566 = C0630.m2566("۠ۖ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-875)) ^ (-123041295);
                        i6 = -997212844;
                    }
                case 574290512:
                case 1522347132:
                    m40770();
                    return;
                case 1385300285:
                case 1670063594:
                    if (C11340.m28031()) {
                        m2566 = C0630.m2566("ۡ᩺") ^ i4;
                        i5 = ((m2566 ^ i3) * (-16299)) ^ 1896796320;
                        i6 = 828069256;
                    } else {
                        m2566 = (C2105.m6981("۠ܶ") ^ i4) * (-43);
                        i5 = ((m2566 ^ i3) * (-21169)) ^ 2075405136;
                        i6 = -1254809369;
                    }
                default:
                    if (C0630.m2564()) {
                        m2566 = C0630.m2566("֫ۘ") ^ i4;
                        i5 = ((m2566 ^ i3) * 2187) ^ (-279187481);
                        i6 = 1819569519;
                    } else {
                        m2566 = (i3 - C2105.m6981("֫ۛ")) * (-67);
                        i5 = ((m2566 ^ i4) * (-31601)) ^ 275011206;
                        i6 = -482277303;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:23:0x0087, code lost:
    
        if (l.C4263.f13799 > 0) goto L10;
     */
    @Override // l.AbstractViewOnClickListenerC12490
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo2774(l.AbstractViewOnLongClickListenerC14606 r29, int r30) {
        /*
            Method dump skipped, instructions count: 1346
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.AbstractC17429.mo2774(l.ܳܶܳ, int):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m40769(AbstractActivityC3346 abstractActivityC3346) {
        C13695 c13695;
        int i;
        int m2566;
        int i2;
        int i3;
        int m6981;
        int i4;
        int i5;
        int i6 = C3911.f12484;
        int i7 = ServiceConnectionC3453.f10921;
        int m25662 = C0630.m2566("ᩳ᩹") ^ i6;
        int i8 = ((m25662 ^ i7) * (-21109)) ^ (-1011238598);
        short[] sArr = null;
        short[] sArr2 = null;
        int i9 = m25662 ^ 1978361979;
        C13695 c136952 = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i10 = 0;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = -1139597277;
        String str = null;
        int i15 = 0;
        while (true) {
            int i16 = i9 ^ (i8 & (((i14 ^ i7) * (-13321)) >> 31));
            switch (i16) {
                case -2108096877:
                case -1827995640:
                    c13695 = c136952;
                    i = i16;
                    sArr = f53286;
                    if (C3911.f12484 < 0) {
                        m2566 = C0630.m2566("ܺۖ") ^ i6;
                        i2 = ((m2566 ^ i7) * 8471) ^ 566654137;
                        i3 = -385144363;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = C2105.m6981("ۖ᩵") ^ i6;
                    i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                    i3 = -427557780;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1827024541:
                case -684838539:
                    i = i16;
                    i13 = 45353;
                    m2566 = C0630.m2566("ۙۗ") ^ i6;
                    c13695 = c136952;
                    i2 = ((m2566 ^ i7) * (-25133)) ^ (-1653894263);
                    i3 = 353799668;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1697426402:
                case 1583618609:
                    i = i16;
                    C4117.m12364();
                    C4616.m13552();
                    c13695 = c136952;
                    m2566 = C2105.m6981("ۖ᩵") ^ i6;
                    i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                    i3 = -427557780;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1690362673:
                case -1529653454:
                    i = i16;
                    i15 = 2126984912 ^ C2105.m6981(str);
                    if (C0483.f2088 >= 0) {
                        c13695 = c136952;
                        m2566 = C2105.m6981("ۖ᩵") ^ i6;
                        i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                        i3 = -427557780;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    } else {
                        m6981 = C2105.m6981("ۧܰ") ^ i7;
                        i4 = ((m6981 ^ i6) * (-26983)) ^ (-685953526);
                        i5 = 896667529;
                        int i17 = i;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i14 = i17;
                    }
                case -1521977849:
                case 808965892:
                    c13695 = c136952;
                    i = i16;
                    s = sArr[c];
                    s2 = 1014;
                    if (C4159.f13567) {
                        m2566 = C0630.m2566("ۙۖ") ^ i6;
                        i2 = ((m2566 ^ i7) * (-4589)) ^ 1293551703;
                        i3 = -1376164550;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = (i6 - C2105.m6981("ۜᩴ")) * (-87);
                    i2 = ((m2566 ^ i7) * (-26075)) ^ (-1567716178);
                    i3 = -99628874;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1399639750:
                case 266922268:
                    c13695 = c136952;
                    i = i16;
                    c = 5;
                    if (C3911.f12484 < 0) {
                        m2566 = (C2105.m6981("᩶ۛ") + i7) * (-17);
                        i2 = ((m2566 ^ i6) * (-2857)) ^ 1405493953;
                        i3 = 1936068895;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = (i6 - C2105.m6981("ۜᩴ")) * (-87);
                    i2 = ((m2566 ^ i7) * (-26075)) ^ (-1567716178);
                    i3 = -99628874;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1274168955:
                case -143143582:
                    c13695 = c136952;
                    i = i16;
                    if (i10 - (i11 + i12) <= 0) {
                        m2566 = C2105.m6981("ܶۨ") ^ i6;
                        i2 = ((m2566 ^ i7) * (-21601)) ^ 608101373;
                        i3 = -244559094;
                    } else {
                        m2566 = (i7 - C2105.m6981("۫֫")) * (-61);
                        i2 = ((m2566 ^ i6) * 12683) ^ 667561025;
                        i3 = 1580254853;
                    }
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1241171607:
                case -17805396:
                    c136952.m31244();
                    c136952.m31266(true);
                    break;
                case -1232528714:
                case -645584944:
                    i = i16;
                    c136952.m31258(i15);
                    if (C0630.m2564()) {
                        c13695 = c136952;
                        m2566 = (i6 - C2105.m6981("ۜᩴ")) * (-87);
                        i2 = ((m2566 ^ i7) * (-26075)) ^ (-1567716178);
                        i3 = -99628874;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    } else {
                        m6981 = (C2105.m6981("ۜ᩻") + i7) * (-107);
                        i4 = ((m6981 ^ i6) * 16453) ^ (-820079453);
                        i5 = 1174225234;
                        int i172 = i;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i14 = i172;
                    }
                case -1084414247:
                case 395285357:
                    i = i16;
                    i13 = 47798;
                    m2566 = C0630.m2566("ۙۗ") ^ i6;
                    c13695 = c136952;
                    i2 = ((m2566 ^ i7) * (-25133)) ^ (-1653894263);
                    i3 = 353799668;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -1056723119:
                case 754135589:
                    C7811.m20844();
                    if (ViewOnClickListenerC1958.m6429() < 0) {
                        c13695 = c136952;
                        i = i16;
                        m2566 = C2105.m6981("ۖ᩵") ^ i6;
                        i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                        i3 = -427557780;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    } else {
                        m6981 = (i6 - C0630.m2566("ۛ᩸")) * 31;
                        i = i16;
                        i4 = ((m6981 ^ i7) * 9477) ^ 138125015;
                        i5 = 1874329590;
                        int i1722 = i;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i14 = i1722;
                    }
                case -651337740:
                case 1930467507:
                    C2167.m7155();
                    if (C1047.f3863 < 0) {
                        c13695 = c136952;
                        i = i16;
                        m2566 = C2105.m6981("۠᩻") ^ i7;
                        i2 = ((m2566 ^ i6) * 23653) ^ (-770194110);
                        i3 = 771012026;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    c13695 = c136952;
                    i = i16;
                    m2566 = C2105.m6981("ۖ᩵") ^ i6;
                    i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                    i3 = -427557780;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -625956338:
                case -418101353:
                    i = i16;
                    sArr2 = f53286;
                    if (C22628.m50615() != 0) {
                        c13695 = c136952;
                        m2566 = C2105.m6981("۠᩻") ^ i7;
                        i2 = ((m2566 ^ i6) * 23653) ^ (-770194110);
                        i3 = 771012026;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    } else {
                        m6981 = C2105.m6981("ۜۙ") ^ i7;
                        i4 = ((m6981 ^ i6) * 18643) ^ 1000795494;
                        i5 = -1066577452;
                        int i17222 = i;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i14 = i17222;
                    }
                case -509243625:
                case -202018561:
                    i = i16;
                    c136952 = new C13695(abstractActivityC3346, -1);
                    if (C3746.f11829 > 0) {
                        m2566 = C2105.m6981("ۡ֨") ^ i6;
                        c13695 = c136952;
                        i2 = ((m2566 ^ i7) * (-24941)) ^ 544824383;
                        i3 = 1012094716;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = C0630.m2566("۫ۚ") ^ i7;
                    c13695 = c136952;
                    i2 = ((m2566 ^ i6) * 13761) ^ (-478213786);
                    i3 = -1840616394;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case -403310217:
                case 748322777:
                    i = i16;
                    str = C1916.m6311(sArr2, 6, 3, i13);
                    if (C3663.f11553) {
                        m2566 = C0630.m2566("۫ۚ") ^ i7;
                        c13695 = c136952;
                        i2 = ((m2566 ^ i6) * 13761) ^ (-478213786);
                        i3 = -1840616394;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    } else {
                        m6981 = (C2105.m6981("ܳۚ") ^ i6) * 59;
                        i4 = ((m6981 ^ i7) * 28999) ^ (-346919129);
                        i5 = -1388160791;
                        int i172222 = i;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i14 = i172222;
                    }
                case -295803589:
                case 216482838:
                    c13695 = c136952;
                    i = i16;
                    i12 = 257049;
                    if (!C0382.m1848()) {
                        m2566 = C2105.m6981("᩹۫") ^ i7;
                        i2 = ((m2566 ^ i6) * (-30537)) ^ 1117369462;
                        i3 = 461570944;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = C2105.m6981("ۖ᩵") ^ i6;
                    i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                    i3 = -427557780;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                case 6304806:
                case 808705657:
                    RunnableC1108.m3790();
                    break;
                case 1260034098:
                case 1357160589:
                    c13695 = c136952;
                    i = i16;
                    i10 = s * s2;
                    i11 = s * s;
                    if (!C1711.f5919) {
                        m2566 = C0630.m2566("ܺۨ") ^ i7;
                        i2 = ((m2566 ^ i6) * (-5999)) ^ 852781718;
                        i3 = -535799928;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    m2566 = C2105.m6981("۠᩻") ^ i7;
                    i2 = ((m2566 ^ i6) * 23653) ^ (-770194110);
                    i3 = 771012026;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
                default:
                    if (C4263.f13799 <= 0) {
                        c13695 = c136952;
                        i = i16;
                        m2566 = (i6 - C2105.m6981("ۜᩴ")) * (-87);
                        i2 = ((m2566 ^ i7) * (-26075)) ^ (-1567716178);
                        i3 = -99628874;
                        i14 = i;
                        i9 = m2566 ^ i3;
                        i8 = i2;
                        c136952 = c13695;
                    }
                    c13695 = c136952;
                    i = i16;
                    m2566 = C2105.m6981("ۖ᩵") ^ i6;
                    i2 = ((m2566 ^ i7) * 2641) ^ (-895989499);
                    i3 = -427557780;
                    i14 = i;
                    i9 = m2566 ^ i3;
                    i8 = i2;
                    c136952 = c13695;
            }
            return;
        }
    }
}
