package l;

import java.util.List;

/* compiled from: J2RL */
/* renamed from: l.ܶۧ᩷, reason: contains not printable characters */
/* loaded from: classes5.dex */
public class ActivityC15196 extends AbstractActivityC3346 {

    /* renamed from: ۠۫ܳ, reason: not valid java name and contains not printable characters */
    private static final short[] f46411 = {1780, -28808, -25890, 25065, -24098, 29506, -32603, -30439, 27553, -25412, 32713, 26344, -24021, -3667, -3668, -3649, -3668, -3675, -3674, -3655, -3668, -3653, -3687, -3675, -3652, -3666, -3680, -3673, -3712, -3667, -3654, 2231, 23753, 23784, 23803, 23784, 23777, 23778, 23805, 23784, 23807, 23774, 23784, 23777, 23784, 23790, 23801, 23778, 23807, 23756, 23790, 23801, 23780, 23803, 23780, 23801, 23796};

    /* renamed from: ܿۧ, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f46412 = 0;

    /* renamed from: ᩳۧ, reason: not valid java name and contains not printable characters */
    public List f46413;

    @Override // l.AbstractActivityC3346
    /* renamed from: ۚ */
    public final String mo121() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        short[] sArr2 = null;
        int i5 = 0;
        int i6 = 1223454393;
        int i7 = C0422.f1886;
        int i8 = C4075.f12947;
        int m2566 = (i7 - C0630.m2566("᩶۬")) * (-23);
        int i9 = ((m2566 ^ i8) * (-19777)) ^ (-1188431037);
        int i10 = -1836679210;
        while (true) {
            i6 = ((((i6 ^ i8) * (-12831)) >> 31) & i9) ^ (m2566 ^ i10);
            switch (i6) {
                case -2057351051:
                case 164622508:
                    if ((i2 + i3) - i >= 0) {
                        m2566 = (C2105.m6981("۠ܽ") + i8) * (-49);
                        i9 = ((m2566 ^ i7) * 32587) ^ 1843703058;
                        i10 = 599509348;
                    } else {
                        m2566 = (i7 - C0630.m2566("ۧ֨")) * 77;
                        i9 = ((m2566 ^ i8) * (-5557)) ^ (-1096965633);
                        i10 = 654994049;
                    }
                case -2048658061:
                case 1369518869:
                    sArr = f46411;
                    if (C2272.f7362) {
                        m2566 = (C2105.m6981("ۖۡ") ^ i7) * 57;
                        i9 = ((m2566 ^ i8) * 25047) ^ 1742008753;
                        i10 = 1281770380;
                    } else {
                        m2566 = (C0630.m2566("֡֨") + i8) * (-67);
                        i9 = ((m2566 ^ i7) * (-7209)) ^ 1407157805;
                        i10 = 303474800;
                    }
                case -1720103032:
                case 1794575847:
                    s = sArr[c];
                    s2 = 15442;
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m2566 = (i8 - C2105.m6981("᩻۫")) * (-79);
                        i9 = ((m2566 ^ i7) * (-5155)) ^ 1186955988;
                        i10 = 1985621265;
                    } else {
                        m2566 = (C2105.m6981("۟ۛ") + i7) * (-101);
                        i9 = ((m2566 ^ i8) * (-17427)) ^ 522679965;
                        i10 = 1999869687;
                    }
                case -1698767207:
                case -1273924344:
                    if (C0964.f3626 != 0) {
                        m2566 = C0630.m2566("ۢ᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-16427)) ^ (-323819014);
                        i10 = 1376607470;
                    } else {
                        m2566 = (C0630.m2566("ܰۜ") ^ i7) * 45;
                        i9 = ((m2566 ^ i8) * (-17663)) ^ 544606459;
                        i10 = -963716453;
                    }
                case -1497858743:
                case -1072464266:
                    C7811.m20844();
                    C3683.m11222();
                    m2566 = C2105.m6981("۠᩸") ^ i8;
                    i9 = ((m2566 ^ i7) * (-23655)) ^ (-705432313);
                    i10 = -1055340791;
                case -1478322446:
                case 2070034104:
                    C0483.m2121();
                    if (C0798.f2919) {
                        m2566 = C0630.m2566("ۢ᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-16427)) ^ (-323819014);
                        i10 = 1376607470;
                    } else {
                        m2566 = (C2105.m6981("ۖۡ") ^ i7) * 57;
                        i9 = ((m2566 ^ i8) * 25047) ^ 1742008753;
                        i10 = 1281770380;
                    }
                case -1318129037:
                case -975393089:
                    i4 = 23693;
                    m2566 = C2105.m6981("ۧܺ") ^ i8;
                    i9 = ((m2566 ^ i7) * (-9329)) ^ 1112937512;
                    i10 = -1412656854;
                case -1304649403:
                case -887439915:
                    return C3537.m10748(sArr2, i5, 25, i4);
                case -1243073183:
                case -631856416:
                    C1420.m4913();
                    if (C3911.f12484 < 0) {
                        m2566 = C2105.m6981("۠᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-23655)) ^ (-705432313);
                        i10 = -1055340791;
                    } else {
                        m2566 = (C2105.m6981("ۖۡ") ^ i7) * 57;
                        i9 = ((m2566 ^ i8) * 25047) ^ 1742008753;
                        i10 = 1281770380;
                    }
                case -1236107117:
                case 844079852:
                    if (C1711.f5919) {
                        m2566 = (C0630.m2566("ܰۜ") ^ i7) * 45;
                        i9 = ((m2566 ^ i8) * (-17663)) ^ 544606459;
                        i10 = -963716453;
                    } else {
                        m2566 = C0630.m2566("ۡᩴ") ^ i8;
                        i9 = ((m2566 ^ i7) * 27369) ^ (-1218420306);
                        i10 = -1013714351;
                    }
                case -914859026:
                case 1575240760:
                    i = s * s2;
                    i2 = s * s;
                    if (C22628.f73083 <= 0) {
                        m2566 = (C0630.m2566("ܰۜ") ^ i7) * 45;
                        i9 = ((m2566 ^ i8) * (-17663)) ^ 544606459;
                        i10 = -963716453;
                    } else {
                        m2566 = (C2105.m6981("ۜۡ") + i8) * (-49);
                        i9 = ((m2566 ^ i7) * (-1363)) ^ (-1385868697);
                        i10 = -1782566725;
                    }
                case -665800041:
                case 1229142345:
                    C1916.m6308();
                    C3245.m9925();
                    return null;
                case -73182595:
                case 1783876907:
                    if (C4159.m12565() >= 0) {
                        m2566 = C0630.m2566("ۢ᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-16427)) ^ (-323819014);
                        i10 = 1376607470;
                    } else {
                        m2566 = (C2105.m6981("᩶ܰ") + i7) * (-107);
                        i9 = ((m2566 ^ i8) * 30819) ^ (-1947456783);
                        i10 = 705589445;
                    }
                case 597122497:
                case 739432543:
                    sArr2 = f46411;
                    i5 = 32;
                    if (C5695.f17556 >= 0) {
                        m2566 = C2105.m6981("۠᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-23655)) ^ (-705432313);
                        i10 = -1055340791;
                    } else {
                        m2566 = (i7 - C2105.m6981("ᩳ᩶")) * 55;
                        i9 = ((m2566 ^ i8) * 12839) ^ (-1105206538);
                        i10 = -1831915481;
                    }
                case 602023150:
                case 1271401530:
                    c = 31;
                    if (C3746.f11829 <= 0) {
                        m2566 = (i8 - C2105.m6981("᩻۫")) * (-79);
                        i9 = ((m2566 ^ i7) * (-5155)) ^ 1186955988;
                        i10 = 1985621265;
                    } else {
                        m2566 = (i7 - C0630.m2566("֡ۧ")) * (-105);
                        i9 = ((m2566 ^ i8) * 11365) ^ (-1127987450);
                        i10 = 1588765925;
                    }
                case 1280919664:
                case 1575847475:
                    if (C1504.f5354) {
                        m2566 = (C2105.m6981("ۖۡ") ^ i7) * 57;
                        i9 = ((m2566 ^ i8) * 25047) ^ 1742008753;
                        i10 = 1281770380;
                    } else {
                        m2566 = C2105.m6981("ܽܳ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-25177)) ^ (-1663555873);
                        i10 = 1924688316;
                    }
                case 1502313825:
                case 1916919542:
                    i4 = 14930;
                    m2566 = C2105.m6981("ۧܺ") ^ i8;
                    i9 = ((m2566 ^ i7) * (-9329)) ^ 1112937512;
                    i10 = -1412656854;
                case 1727933477:
                case 1940365704:
                    i3 = 59613841;
                    if (C1711.f5919) {
                        m2566 = (i8 - C2105.m6981("᩻۫")) * (-79);
                        i9 = ((m2566 ^ i7) * (-5155)) ^ 1186955988;
                        i10 = 1985621265;
                    } else {
                        m2566 = C2105.m6981("ܿܳ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-21525)) ^ (-1433910986);
                        i10 = 287593593;
                    }
                default:
                    if (C1005.f3721) {
                        m2566 = C2105.m6981("ᩳ۬") ^ i8;
                        i9 = ((m2566 ^ i7) * 10581) ^ 1126476415;
                        i10 = 1040886674;
                    } else {
                        m2566 = C2105.m6981("۠᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-23655)) ^ (-705432313);
                        i10 = -1055340791;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:47:0x0060, code lost:
    
        if (l.C3746.f11829 <= 0) goto L7;
     */
    @Override // l.AbstractActivityC3346, l.ActivityC2124, l.ActivityC0737, l.ActivityC23809, l.ActivityC4927, android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onCreate(android.os.Bundle r27) {
        /*
            Method dump skipped, instructions count: 1106
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC15196.onCreate(android.os.Bundle):void");
    }
}
