package l;

import android.content.Intent;
import android.view.View;
import android.widget.AdapterView;
import java.util.Collections;
import java.util.List;
import moe.shizuku.server.IShizukuService;

/* compiled from: 14V2 */
/* renamed from: l.᩶᩶ܽ, reason: contains not printable characters */
/* loaded from: classes5.dex */
public class ActivityC20401 extends AbstractActivityC3346 implements AdapterView.OnItemClickListener, AdapterView.OnItemLongClickListener {

    /* renamed from: ۠ۖۛ, reason: not valid java name and contains not printable characters */
    private static final short[] f65836 = {7593, -22257, -23205, 17354, 32453, 21428, -24303, -22310, 19922, -24199, 9535, 16880, 30709, 18881, 5444, 24389, 23849, 23772, 17312, 24215, 19094, 6471, 1472, 3760, 3622, -6854, 12914, 4624, 3701, -27701, -27674, -27668, -27653, -27674, -27680, -27679, -27666, -27651, -27658, -27710, -27666, -27679, -27666, -27672, -27670, -27651};

    /* renamed from: ܳۧ, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f65837 = 0;

    /* renamed from: ܿۧ, reason: not valid java name and contains not printable characters */
    public List f65838 = Collections.EMPTY_LIST;

    /* renamed from: ᩳۧ, reason: not valid java name and contains not printable characters */
    public C22517 f65839;

    @Override // l.AbstractActivityC3346
    /* renamed from: ۚ */
    public final String mo121() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        short[] sArr2 = null;
        int i5 = 0;
        int i6 = -337801746;
        int i7 = RunnableC1937.f6483;
        int i8 = C0714.f2697;
        int m2566 = (C0630.m2566("۬ۢ") ^ i7) * 95;
        int i9 = ((m2566 ^ i8) * (-32755)) ^ (-1978198031);
        int i10 = -1534028460;
        while (true) {
            i6 = ((((i6 ^ i8) * (-18747)) >> 31) & i9) ^ (m2566 ^ i10);
            switch (i6) {
                case -2018675344:
                case 1543525988:
                    sArr = f65836;
                    if (C4616.f14690 <= 0) {
                        m2566 = C0630.m2566("ܿ۫") ^ i7;
                        i9 = ((m2566 ^ i8) * (-1655)) ^ 418406569;
                        i10 = 1626885833;
                    } else {
                        m2566 = C2105.m6981("۬ܺ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-14051)) ^ 1066126225;
                        i10 = -270323055;
                    }
                case -2002724427:
                case 1817322501:
                    i4 = 37775;
                    m2566 = (i7 - C2105.m6981("۠ᩴ")) * (-55);
                    i9 = ((m2566 ^ i8) * 6595) ^ 2045431845;
                    i10 = -2079116349;
                case -1957752184:
                case 739244949:
                    C21923.m49329();
                    C4075.m12263();
                    m2566 = (C2105.m6981("ᩳ᩸") ^ i8) * (-49);
                    i9 = ((m2566 ^ i7) * (-1321)) ^ 1088617860;
                    i10 = 1749365827;
                case -1776836889:
                case 1788814908:
                    C21923.m49329();
                    if (RunnableC1108.f4040) {
                        m2566 = (C2105.m6981("ᩳ᩸") ^ i8) * (-49);
                        i9 = ((m2566 ^ i7) * (-1321)) ^ 1088617860;
                        i10 = 1749365827;
                    } else {
                        m2566 = (i7 - C0630.m2566("ۧۚ")) * 77;
                        i9 = ((m2566 ^ i8) * (-2395)) ^ (-1635072557);
                        i10 = -850899010;
                    }
                case -1713285842:
                case 131336481:
                    i3 = 8631844;
                    if (C2167.f7158 >= 0) {
                        m2566 = C0630.m2566("ۚۚ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-2773)) ^ 269662246;
                        i10 = 408444858;
                    } else {
                        m2566 = C2105.m6981("ۤܶ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-7151)) ^ 1706677295;
                        i10 = 237255448;
                    }
                case -1633623057:
                case -1547548021:
                    s = sArr[c];
                    s2 = 5876;
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = C0630.m2566("ܿ۫") ^ i7;
                        i9 = ((m2566 ^ i8) * (-1655)) ^ 418406569;
                        i10 = 1626885833;
                    } else {
                        m2566 = C2105.m6981("᩶ۡ") ^ i8;
                        i9 = ((m2566 ^ i7) * 21243) ^ (-1887961709);
                        i10 = 2078360557;
                    }
                case -1627903485:
                case 1793001431:
                    c = 28;
                    if (C0714.f2697 >= 0) {
                        m2566 = C0630.m2566("ۚۚ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-2773)) ^ 269662246;
                        i10 = 408444858;
                    } else {
                        m2566 = C0630.m2566("᩺۫") ^ i7;
                        i9 = ((m2566 ^ i8) * 8803) ^ (-1648389962);
                        i10 = 841133584;
                    }
                case -1614333728:
                case -1108983558:
                    if (i - (i2 + i3) <= 0) {
                        m2566 = C0630.m2566("ۢۙ") ^ i8;
                        i9 = ((m2566 ^ i7) * 25563) ^ 1092001456;
                        i10 = -501358033;
                    } else {
                        m2566 = C0630.m2566("֡᩻") ^ i8;
                        i9 = ((m2566 ^ i7) * 28421) ^ (-104187321);
                        i10 = 654639925;
                    }
                case -1567643071:
                case -1423515317:
                    C2272.m7503();
                    C2272.m7503();
                    return null;
                case -1529740123:
                case 156448172:
                    C2520.m8026();
                    if (C3746.f11829 <= 0) {
                        m2566 = (i7 - C0630.m2566("ۧۚ")) * 77;
                        i9 = ((m2566 ^ i8) * (-2395)) ^ (-1635072557);
                        i10 = -850899010;
                    } else {
                        m2566 = C0630.m2566("ۚۚ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-2773)) ^ 269662246;
                        i10 = 408444858;
                    }
                case -1454714414:
                case 1759036308:
                    i4 = 45936;
                    m2566 = (i7 - C2105.m6981("۠ᩴ")) * (-55);
                    i9 = ((m2566 ^ i8) * 6595) ^ 2045431845;
                    i10 = -2079116349;
                case -1182344100:
                case -355440786:
                    if (C3537.f11231 >= 0) {
                        m2566 = C0630.m2566("ܿ۫") ^ i7;
                        i9 = ((m2566 ^ i8) * (-1655)) ^ 418406569;
                        i10 = 1626885833;
                    } else {
                        m2566 = C2105.m6981("۠ۘ") ^ i7;
                        i9 = ((m2566 ^ i8) * 2911) ^ 2010179813;
                        i10 = 1799344605;
                    }
                case -1022989338:
                case 1638724930:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = C0630.m2566("ܿ۫") ^ i7;
                        i9 = ((m2566 ^ i8) * (-1655)) ^ 418406569;
                        i10 = 1626885833;
                    } else {
                        m2566 = C0630.m2566("֡ܺ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-7255)) ^ 859868300;
                        i10 = 677754575;
                    }
                case -675254315:
                case -249858449:
                    if (C7106.f21815 != 0) {
                        m2566 = (C2105.m6981("ᩳ᩸") ^ i8) * (-49);
                        i9 = ((m2566 ^ i7) * (-1321)) ^ 1088617860;
                        i10 = 1749365827;
                    } else {
                        m2566 = C0630.m2566("ܰܶ") ^ i8;
                        i9 = ((m2566 ^ i7) * 6317) ^ 656494868;
                        i10 = 714995902;
                    }
                case -173186341:
                case 170492476:
                    i = s * s2;
                    i2 = s * s;
                    if (C0483.f2088 >= 0) {
                        m2566 = C0630.m2566("ܰܶ") ^ i8;
                        i9 = ((m2566 ^ i7) * 6317) ^ 656494868;
                        i10 = 714995902;
                    } else {
                        m2566 = C2105.m6981("ۗ᩹") ^ i7;
                        i9 = ((m2566 ^ i8) * (-12895)) ^ 10957274;
                        i10 = 134374534;
                    }
                case 298457284:
                case 1785281042:
                    return AbstractC2021.m6573(sArr2, i5, 17, i4);
                case 506416693:
                case 1066569816:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C0630.m2566("ܰܶ") ^ i8;
                        i9 = ((m2566 ^ i7) * 6317) ^ 656494868;
                        i10 = 714995902;
                    } else {
                        m2566 = (C2105.m6981("ᩳۖ") ^ i8) * (-93);
                        i9 = ((m2566 ^ i7) * 11951) ^ 1156624708;
                        i10 = -794811047;
                    }
                case 741192965:
                case 891074801:
                    sArr2 = f65836;
                    i5 = 29;
                    if (C0798.f2919) {
                        m2566 = C0630.m2566("ۚۚ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-2773)) ^ 269662246;
                        i10 = 408444858;
                    } else {
                        m2566 = (C0630.m2566("᩺֫") + i7) * 109;
                        i9 = ((m2566 ^ i8) * 13489) ^ 1639309972;
                        i10 = 246414907;
                    }
                default:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = C0630.m2566("ܰܶ") ^ i8;
                        i9 = ((m2566 ^ i7) * 6317) ^ 656494868;
                        i10 = 714995902;
                    } else {
                        m2566 = C2105.m6981("ۤۜ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-16673)) ^ 434009020;
                        i10 = -1310894531;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:58:0x006d, code lost:
    
        if (l.C1504.f5354 != false) goto L10;
     */
    @Override // android.widget.AdapterView.OnItemLongClickListener
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean onItemLongClick(android.widget.AdapterView r26, android.view.View r27, int r28, long r29) {
        /*
            Method dump skipped, instructions count: 1056
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC20401.onItemLongClick(android.widget.AdapterView, android.view.View, int, long):boolean");
    }

    /* JADX WARN: Code restructure failed: missing block: B:27:0x005c, code lost:
    
        if (l.C7106.m19120() > 0) goto L53;
     */
    /* JADX WARN: Code restructure failed: missing block: B:31:0x0065, code lost:
    
        if (l.RunnableC1937.f6483 < 0) goto L61;
     */
    @Override // android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean onCreateOptionsMenu(android.view.Menu r21) {
        /*
            Method dump skipped, instructions count: 792
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC20401.onCreateOptionsMenu(android.view.Menu):boolean");
    }

    @Override // android.widget.AdapterView.OnItemClickListener
    public final void onItemClick(AdapterView adapterView, View view, int i, long j) {
        Intent intent = null;
        AbstractC15440 abstractC15440 = null;
        int i2 = -1121812551;
        int i3 = C1128.f4106;
        int i4 = C3019.f9544;
        int m6981 = C2105.m6981("ۚۤ") ^ i3;
        int i5 = ((m6981 ^ i4) * (-12799)) ^ 998682384;
        int i6 = 1824096464;
        while (true) {
            i2 = ((((i2 ^ i4) * (-29459)) >> 31) & i5) ^ (m6981 ^ i6);
            switch (i2) {
                case -1943187076:
                case -823572814:
                    RunnableC3474.m10630();
                    if (RunnableC0588.f2309 < 0) {
                        m6981 = C0630.m2566("ۜ۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 16945) ^ 2034022081;
                        i6 = -1478073497;
                    } else {
                        m6981 = C2105.m6981("ܿۛ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-19533)) ^ 1919145255;
                        i6 = -2057068965;
                    }
                case -1914208529:
                case 133926212:
                    C1916.m6308();
                    if (C0422.f1886 > 0) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = C0630.m2566("ۜ۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 16945) ^ 2034022081;
                        i6 = -1478073497;
                    }
                case -1556251440:
                case -264323060:
                    if (C0483.f2088 >= 0) {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i3) * 79;
                        i5 = ((m6981 ^ i4) * (-18435)) ^ (-418802074);
                        i6 = 764595268;
                    } else {
                        m6981 = (C2105.m6981("ۡ֨") ^ i4) * (-11);
                        i5 = ((m6981 ^ i3) * (-14931)) ^ 841957622;
                        i6 = -143523075;
                    }
                case -1519075522:
                case 968578927:
                    if (C0798.f2919) {
                        m6981 = C2105.m6981("ܿۛ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-19533)) ^ 1919145255;
                        i6 = -2057068965;
                    } else {
                        m6981 = (C0630.m2566("֫ܺ") ^ i3) * 59;
                        i5 = ((m6981 ^ i4) * (-2747)) ^ (-924985559);
                        i6 = -168274901;
                    }
                case -1053563266:
                case 57444310:
                    if (C1047.m3599() >= 0) {
                        m6981 = C0630.m2566("ۨ᩺") ^ i4;
                        i5 = ((m6981 ^ i3) * (-15885)) ^ 1550109975;
                        i6 = 806258273;
                    } else {
                        m6981 = C0630.m2566("ۢ۫") ^ i4;
                        i5 = ((m6981 ^ i3) * (-3103)) ^ 1353788586;
                        i6 = -861408126;
                    }
                case -976297424:
                case 1681742930:
                    if (C3663.f11553) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = (i3 - C0630.m2566("۠᩺")) * 77;
                        i5 = ((m6981 ^ i4) * 13489) ^ 479263363;
                        i6 = -864690780;
                    }
                case -912238774:
                case -575668477:
                    C7811.m20844();
                    m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                    i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                    i6 = 115066508;
                case -660030281:
                case 1125881970:
                    if (C5695.f17556 >= 0) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = C2105.m6981("ܿۘ") ^ i4;
                        i5 = ((m6981 ^ i3) * 21703) ^ (-1099753599);
                        i6 = 80070036;
                    }
                case -379278563:
                case 831101211:
                    if (C1128.f4106 <= 0) {
                        m6981 = C0630.m2566("ۜ۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 16945) ^ 2034022081;
                        i6 = -1478073497;
                    } else {
                        m6981 = C2105.m6981("֡ᩴ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-17931)) ^ (-1402269926);
                        i6 = 1993618488;
                    }
                case -311103410:
                case 1456229401:
                    intent.setData(abstractC15440.m36522());
                    C4075.m12261(this, intent);
                    break;
                case -248891968:
                case 554082619:
                    intent = new Intent(this, (Class<?>) ActivityC1350.class);
                    if (C1916.f6442) {
                        m6981 = (C0630.m2566("۬ܶ") ^ i3) * 35;
                        i5 = ((m6981 ^ i4) * 28013) ^ (-1355646589);
                        i6 = 1620675759;
                    } else {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i3) * 79;
                        i5 = ((m6981 ^ i4) * (-18435)) ^ (-418802074);
                        i6 = 764595268;
                    }
                case 481408017:
                case 925825751:
                    C3683.m11222();
                    break;
                case 504184084:
                case 1253065449:
                    abstractC15440 = ((C19866) C21923.m49339(this.f65838, i)).m45691();
                    if (C2126.f7087) {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i3) * 79;
                        i5 = ((m6981 ^ i4) * (-18435)) ^ (-418802074);
                        i6 = 764595268;
                    } else {
                        m6981 = C2105.m6981("ۨᩴ") ^ i4;
                        i5 = ((m6981 ^ i3) * 5311) ^ 1600594971;
                        i6 = -1150470811;
                    }
                case 607225694:
                case 2119236355:
                    if (C0714.f2697 >= 0) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = (i4 - C0630.m2566("֨᩸")) * (-119);
                        i5 = ((m6981 ^ i3) * 14289) ^ (-985622604);
                        i6 = 695979504;
                    }
                case 1246179608:
                case 1329926622:
                    if (C2272.f7362) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = C0630.m2566("ۨ᩺") ^ i4;
                        i5 = ((m6981 ^ i3) * (-15885)) ^ 1550109975;
                        i6 = 806258273;
                    }
                default:
                    if (C3911.f12484 >= 0) {
                        m6981 = (i3 - C0630.m2566("᩸ۧ")) * (-27);
                        i5 = ((m6981 ^ i4) * (-8563)) ^ 1214926799;
                        i6 = 115066508;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܰܳ")) * (-57);
                        i5 = ((m6981 ^ i4) * 8899) ^ 1827869928;
                        i6 = -1078344675;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:47:0x0093, code lost:
    
        if (l.C1420.f5096 > 0) goto L51;
     */
    @Override // l.AbstractActivityC3346, l.ActivityC2124, l.ActivityC0737, l.ActivityC23809, l.ActivityC4927, android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onCreate(android.os.Bundle r25) {
        /*
            Method dump skipped, instructions count: 874
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC20401.onCreate(android.os.Bundle):void");
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static void m46723(ActivityC20401 activityC20401) {
        List list = null;
        int i = 851868073;
        int i2 = C4616.f14690;
        int i3 = ViewOnClickListenerC1958.f6529;
        int m2566 = (C0630.m2566("᩻ۡ") ^ i3) * 97;
        int i4 = ((m2566 ^ i2) * (-30899)) ^ (-1233277472);
        int i5 = 100634531;
        while (true) {
            i = ((((i ^ i2) * 28469) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2001444657:
                case 1997258714:
                    if (C4616.f14690 <= 0) {
                        m2566 = (C0630.m2566("ܿ᩺") + i2) * 3;
                        i4 = ((m2566 ^ i3) * (-19923)) ^ 1507582753;
                        i5 = 1209965115;
                    } else {
                        m2566 = (i2 - C0630.m2566("۫ᩳ")) * (-29);
                        i4 = ((m2566 ^ i3) * (-24651)) ^ 1492257802;
                        i5 = 1939330276;
                    }
                case -1903339102:
                case 1722576571:
                    if (C0237.f1507 != 0) {
                        m2566 = (C0630.m2566("ۡۗ") ^ i3) * (-99);
                        i4 = ((m2566 ^ i2) * 27129) ^ (-1675012457);
                        i5 = 469765905;
                    } else {
                        m2566 = C0630.m2566("۠۟") ^ i3;
                        i4 = ((m2566 ^ i2) * (-5899)) ^ (-20199272);
                        i5 = 1619817502;
                    }
                case -1768054810:
                case 883887062:
                    if (C0964.f3626 != 0) {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    } else {
                        m2566 = C2105.m6981("ᩳ۬") ^ i2;
                        i4 = ((m2566 ^ i3) * 14777) ^ 1814708430;
                        i5 = 522262369;
                    }
                case -1591480569:
                case 316840555:
                    activityC20401.f65839.notifyDataSetChanged();
                    break;
                case -1442115491:
                case 1567301946:
                    if (C7106.f21815 != 0) {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    } else {
                        m2566 = (i3 - C2105.m6981("۠ᩳ")) * (-85);
                        i4 = ((m2566 ^ i2) * 19265) ^ (-21675964);
                        i5 = -406691176;
                    }
                case -1149577956:
                case -138909932:
                    C1504.m5179();
                    if (C3746.m11369() < 0) {
                        m2566 = (C0630.m2566("ۡۗ") ^ i3) * (-99);
                        i4 = ((m2566 ^ i2) * 27129) ^ (-1675012457);
                        i5 = 469765905;
                    } else {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    }
                case -1094080289:
                case 1779535990:
                    activityC20401.f65838 = list;
                    if (C2520.m8026()) {
                        m2566 = (C0630.m2566("ۗۗ") + i2) * 101;
                        i4 = ((m2566 ^ i3) * (-7183)) ^ 690660288;
                        i5 = 354295066;
                    } else {
                        m2566 = (i2 - C0630.m2566("᩺ۢ")) * (-75);
                        i4 = ((m2566 ^ i3) * (-18867)) ^ (-935269841);
                        i5 = -1257591405;
                    }
                case -671502705:
                case -442296846:
                    list = C1789.m5956();
                    if (C3911.f12484 >= 0) {
                        m2566 = (C0630.m2566("ܿ᩺") + i2) * 3;
                        i4 = ((m2566 ^ i3) * (-19923)) ^ 1507582753;
                        i5 = 1209965115;
                    } else {
                        m2566 = (i2 - C0630.m2566("ܽۗ")) * 45;
                        i4 = ((m2566 ^ i3) * (-10869)) ^ (-1621310358);
                        i5 = -1468928971;
                    }
                case -607563708:
                case -192623060:
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("ܿ᩺") + i2) * 3;
                        i4 = ((m2566 ^ i3) * (-19923)) ^ 1507582753;
                        i5 = 1209965115;
                    } else {
                        m2566 = (C0630.m2566("ܺܳ") + i2) * 101;
                        i4 = ((m2566 ^ i3) * 20923) ^ (-1545006735);
                        i5 = -1492787706;
                    }
                case -280700308:
                case 1455459437:
                    if (C21923.f70183 != 0) {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    } else {
                        m2566 = C0630.m2566("᩶᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * 26921) ^ 1155764883;
                        i5 = -143382094;
                    }
                case -276839109:
                case 1469473284:
                    if (C3432.m10477() <= 0) {
                        m2566 = (C0630.m2566("ܿ᩺") + i2) * 3;
                        i4 = ((m2566 ^ i3) * (-19923)) ^ 1507582753;
                        i5 = 1209965115;
                    } else {
                        m2566 = C2105.m6981("ۛۖ") ^ i3;
                        i4 = ((m2566 ^ i2) * 16453) ^ (-198095799);
                        i5 = 589873334;
                    }
                case 855044469:
                case 1772400205:
                    C2272.m7503();
                    if (C0237.m1481() < 0) {
                        m2566 = (C0630.m2566("ۡۗ") ^ i3) * (-99);
                        i4 = ((m2566 ^ i2) * 27129) ^ (-1675012457);
                        i5 = 469765905;
                    } else {
                        m2566 = (C0630.m2566("ܿ᩺") + i2) * 3;
                        i4 = ((m2566 ^ i3) * (-19923)) ^ 1507582753;
                        i5 = 1209965115;
                    }
                case 919088264:
                case 966390648:
                    if (C2167.f7158 >= 0) {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    } else {
                        m2566 = (C2105.m6981("۠ۘ") + i3) * (-89);
                        i4 = ((m2566 ^ i2) * 3947) ^ (-2132356213);
                        i5 = 1271636357;
                    }
                case 1009260458:
                case 1425296037:
                    RunnableC0588.m2441();
                    m2566 = (C0630.m2566("ۡۗ") ^ i3) * (-99);
                    i4 = ((m2566 ^ i2) * 27129) ^ (-1675012457);
                    i5 = 469765905;
                case 1783137324:
                case 2089990830:
                    C1294.m4372();
                    break;
                default:
                    if (C0237.f1507 != 0) {
                        m2566 = C0630.m2566("ۘ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 1291) ^ (-1125292398);
                        i5 = 1327475012;
                    } else {
                        m2566 = C2105.m6981("֡᩻") ^ i3;
                        i4 = ((m2566 ^ i2) * (-20461)) ^ 493428318;
                        i5 = 1043528891;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractActivityC3346, l.ActivityC0737, android.app.Activity
    public final void onResume() {
        List list = null;
        int i = -1872949616;
        int i2 = C2520.f8000;
        int i3 = C3432.f10845;
        int m2566 = C0630.m2566("ܰۤ") ^ i2;
        int i4 = ((m2566 ^ i3) * 6225) ^ 1306890805;
        int i5 = 1735879687;
        while (true) {
            i = ((((i ^ i3) * 24465) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1980907703:
                case -589116038:
                    C3432.m10477();
                    m2566 = (C2105.m6981("ᩳۜ") ^ i2) * 55;
                    i4 = ((m2566 ^ i3) * 29973) ^ 1852680608;
                    i5 = -384546870;
                case -1902335703:
                case -1061413480:
                    if (C2272.m7503()) {
                        m2566 = (C2105.m6981("ܰ֨") + i3) * 97;
                        i4 = ((m2566 ^ i2) * (-28201)) ^ 759131241;
                        i5 = -1590726446;
                    } else {
                        m2566 = C0630.m2566("᩺۠") ^ i3;
                        i4 = ((m2566 ^ i2) * 23797) ^ 1712007825;
                        i5 = 1966121459;
                    }
                case -1861007746:
                case 329290939:
                    C0483.m2121();
                    if (C1916.f6442) {
                        m2566 = (C0630.m2566("᩶᩶") + i3) * 97;
                        i4 = ((m2566 ^ i2) * (-14365)) ^ 2123608199;
                        i5 = 337305505;
                    } else {
                        m2566 = (C2105.m6981("ᩳۜ") ^ i2) * 55;
                        i4 = ((m2566 ^ i3) * 29973) ^ 1852680608;
                        i5 = -384546870;
                    }
                case -1155518256:
                case -411033500:
                    if (C4075.f12947 >= 0) {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    } else {
                        m2566 = C0630.m2566("ܶ۟") ^ i2;
                        i4 = ((m2566 ^ i3) * 27501) ^ 1532753847;
                        i5 = -1753990619;
                    }
                case -1098987565:
                case -965540383:
                    C0237.m1481();
                    if (AbstractC2021.f6743 > 0) {
                        m2566 = (C2105.m6981("ᩳۜ") ^ i2) * 55;
                        i4 = ((m2566 ^ i3) * 29973) ^ 1852680608;
                        i5 = -384546870;
                    } else {
                        m2566 = C0630.m2566("᩸᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4453)) ^ (-739780130);
                        i5 = -1497923218;
                    }
                case -1071136387:
                case 884087630:
                    if (C2167.f7158 >= 0) {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    } else {
                        m2566 = C2105.m6981("ܽۚ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1805)) ^ 1224013880;
                        i5 = 1787409204;
                    }
                case -1043429734:
                case -321699353:
                    super.onResume();
                    if (C3911.f12484 >= 0) {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    } else {
                        m2566 = C2105.m6981("ۢܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * 21497) ^ 189351579;
                        i5 = 1892532536;
                    }
                case -1004073659:
                case 1922994358:
                    this.f65838 = list;
                    this.f65839.notifyDataSetChanged();
                    break;
                case -750146789:
                case -76950046:
                    if (C0050.f910 >= 0) {
                        m2566 = (C2105.m6981("ᩳۜ") ^ i2) * 55;
                        i4 = ((m2566 ^ i3) * 29973) ^ 1852680608;
                        i5 = -384546870;
                    } else {
                        m2566 = C2105.m6981("ᩴۧ") ^ i3;
                        i4 = ((m2566 ^ i2) * 20279) ^ 686435328;
                        i5 = 1584979058;
                    }
                case -568508706:
                case -402565007:
                    C1711.m5736();
                    break;
                case -517104547:
                case 1409627606:
                    if (C2520.f8000 >= 0) {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    } else {
                        m2566 = C0630.m2566("ۧۚ") ^ i3;
                        i4 = ((m2566 ^ i2) * 24377) ^ 1047772739;
                        i5 = 1385473951;
                    }
                case -344998487:
                case 711532304:
                    if (C4159.f13567) {
                        m2566 = (i2 - C0630.m2566("ۚܺ")) * (-43);
                        i4 = ((m2566 ^ i3) * (-19535)) ^ 1927649693;
                        i5 = 1271603292;
                    } else {
                        m2566 = C0630.m2566("᩸᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4453)) ^ (-739780130);
                        i5 = -1497923218;
                    }
                case 483398680:
                case 899302238:
                    if (C2105.m6982() != 0) {
                        m2566 = (C0630.m2566("᩶᩶") + i3) * 97;
                        i4 = ((m2566 ^ i2) * (-14365)) ^ 2123608199;
                        i5 = 337305505;
                    } else {
                        m2566 = (C2105.m6981("֨᩸") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-32195)) ^ 799898954;
                        i5 = -1301545044;
                    }
                case 1008888690:
                case 1957114615:
                    if (C4117.f13076 <= 0) {
                        m2566 = (C2105.m6981("ᩳۜ") ^ i2) * 55;
                        i4 = ((m2566 ^ i3) * 29973) ^ 1852680608;
                        i5 = -384546870;
                    } else {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    }
                case 1023786548:
                case 1725476578:
                    if (C1047.f3863 >= 0) {
                        m2566 = (i2 - C2105.m6981("ۨܽ")) * 49;
                        i4 = ((m2566 ^ i3) * 18925) ^ (-1037958167);
                        i5 = 2083323694;
                    } else {
                        m2566 = C2105.m6981("ۜ۫") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31185)) ^ (-431896173);
                        i5 = -294096961;
                    }
                default:
                    list = C1789.m5956();
                    if (C3019.m9255() <= 0) {
                        m2566 = (C2105.m6981("ܰ֨") + i3) * 97;
                        i4 = ((m2566 ^ i2) * (-28201)) ^ 759131241;
                        i5 = -1590726446;
                    } else {
                        m2566 = (i3 - C0630.m2566("֡ۘ")) * (-29);
                        i4 = ((m2566 ^ i2) * (-30907)) ^ 1436413968;
                        i5 = -1193199082;
                    }
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m46722(ActivityC20401 activityC20401, C19866 c19866) {
        AbstractC15440 abstractC15440 = null;
        int i = -2100188035;
        int i2 = C2520.f8000;
        int i3 = C11340.f33930;
        int m2566 = C0630.m2566("ᩳᩴ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-17801)) ^ (-668671831);
        int i5 = 1575914183;
        while (true) {
            i = ((((i ^ i3) * (-365)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2073395905:
                case 1810932522:
                    RunnableC0588.m2441();
                    if (C1773.m5908() > 0) {
                        m2566 = (C2105.m6981("᩷ۙ") + i2) * (-23);
                        i4 = ((m2566 ^ i3) * (-6865)) ^ (-1704644894);
                        i5 = -1621515590;
                    } else {
                        m2566 = (C2105.m6981("ۖ᩺") + i3) * 109;
                        i4 = ((m2566 ^ i2) * 13667) ^ (-1757062872);
                        i5 = 1751300391;
                    }
                case -1970650108:
                case -226325843:
                    if (C3432.f10845 >= 0) {
                        m2566 = C0630.m2566("ܶܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * 21301) ^ (-1210653521);
                        i5 = 1865617135;
                    } else {
                        m2566 = C0630.m2566("֨۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-25565)) ^ 1089678503;
                        i5 = -374007425;
                    }
                case -1875848461:
                case 1044024327:
                    if (C2126.f7087) {
                        m2566 = (i2 - C0630.m2566("ᩴۘ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * 16481) ^ 727283876;
                        i5 = 1441819132;
                    } else {
                        m2566 = (C2105.m6981("᩷ۙ") + i2) * (-23);
                        i4 = ((m2566 ^ i3) * (-6865)) ^ (-1704644894);
                        i5 = -1621515590;
                    }
                case -1769128087:
                case 1290771756:
                    if (C1005.f3721) {
                        m2566 = (C2105.m6981("᩹ۚ") ^ i3) * (-113);
                        i4 = ((m2566 ^ i2) * 12533) ^ 1125506020;
                        i5 = 129178876;
                    } else {
                        m2566 = (C2105.m6981("ۖ᩺") + i3) * 109;
                        i4 = ((m2566 ^ i2) * 13667) ^ (-1757062872);
                        i5 = 1751300391;
                    }
                case -1429916695:
                case -1428585208:
                    activityC20401.f65839.notifyDataSetChanged();
                    break;
                case -1262782893:
                case 261423583:
                    if (C3911.f12484 >= 0) {
                        m2566 = (i2 - C0630.m2566("ᩴۘ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * 16481) ^ 727283876;
                        i5 = 1441819132;
                    } else {
                        m2566 = C0630.m2566("᩵ۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-26017)) ^ 520140027;
                        i5 = -1876428296;
                    }
                case -1155936489:
                case -649728220:
                    C0483.m2121();
                    C0964.m3413();
                    m2566 = (C2105.m6981("᩷ۙ") + i2) * (-23);
                    i4 = ((m2566 ^ i3) * (-6865)) ^ (-1704644894);
                    i5 = -1621515590;
                case -1096775308:
                case -699855630:
                    if (C0714.f2697 >= 0) {
                        m2566 = C0630.m2566("ܶܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * 21301) ^ (-1210653521);
                        i5 = 1865617135;
                    } else {
                        m2566 = (i3 - C0630.m2566("᩶ۖ")) * 115;
                        i4 = ((m2566 ^ i2) * (-8923)) ^ 1874713961;
                        i5 = -1073833415;
                    }
                case -1062048999:
                case 1660479677:
                    if (C0050.f910 >= 0) {
                        m2566 = C2105.m6981("᩸ܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-25673)) ^ (-1226756717);
                        i5 = -1076248620;
                    } else {
                        m2566 = (C2105.m6981("ܰ֨") + i2) * (-31);
                        i4 = ((m2566 ^ i3) * 30597) ^ 311638460;
                        i5 = 426054291;
                    }
                case -323088580:
                case 1472330744:
                    C4616.m13552();
                    break;
                case -159465853:
                case 461376170:
                    if (C0050.f910 >= 0) {
                        m2566 = (C2105.m6981("ۖ᩺") + i3) * 109;
                        i4 = ((m2566 ^ i2) * 13667) ^ (-1757062872);
                        i5 = 1751300391;
                    } else {
                        m2566 = C2105.m6981("᩶᩶") ^ i3;
                        i4 = ((m2566 ^ i2) * 6305) ^ (-2057778963);
                        i5 = 1118066325;
                    }
                case -12956431:
                case 1145061868:
                    activityC20401.f65838 = C1789.m5956();
                    if (C2167.f7158 >= 0) {
                        m2566 = (i2 - C0630.m2566("ᩴۘ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * 16481) ^ 727283876;
                        i5 = 1441819132;
                    } else {
                        m2566 = C2105.m6981("֫ۖ") ^ i2;
                        i4 = ((m2566 ^ i3) * 8399) ^ 256620652;
                        i5 = 560024886;
                    }
                case 76536892:
                case 1235355966:
                    AbstractC2021.m6569(abstractC15440);
                    if (C3663.f11553) {
                        m2566 = C2105.m6981("᩸ܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-25673)) ^ (-1226756717);
                        i5 = -1076248620;
                    } else {
                        m2566 = C2105.m6981("ۚۙ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10649) ^ 1495612386;
                        i5 = -1872052753;
                    }
                case 850465272:
                case 1583959151:
                    abstractC15440 = c19866.m45691();
                    if (C1916.m6308() >= 0) {
                        m2566 = (C2105.m6981("᩷ۙ") + i2) * (-23);
                        i4 = ((m2566 ^ i3) * (-6865)) ^ (-1704644894);
                        i5 = -1621515590;
                    } else {
                        m2566 = C0630.m2566("᩺۫") ^ i2;
                        i4 = ((m2566 ^ i3) * 18837) ^ 1108547151;
                        i5 = -1039795493;
                    }
                case 1318618852:
                case 2014282220:
                    C1773.m5908();
                    if (C3019.f9544 < 0) {
                        m2566 = (C2105.m6981("᩷ۙ") + i2) * (-23);
                        i4 = ((m2566 ^ i3) * (-6865)) ^ (-1704644894);
                        i5 = -1621515590;
                    } else {
                        m2566 = C0630.m2566("ܶܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * 21301) ^ (-1210653521);
                        i5 = 1865617135;
                    }
                default:
                    if (C21923.f70183 != 0) {
                        m2566 = (C2105.m6981("ۖ᩺") + i3) * 109;
                        i4 = ((m2566 ^ i2) * 13667) ^ (-1757062872);
                        i5 = 1751300391;
                    } else {
                        m2566 = C2105.m6981("᩻ۧ") ^ i3;
                        i4 = ((m2566 ^ i2) * 14643) ^ 1070818056;
                        i5 = 345733097;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:29:0x006b, code lost:
    
        if (l.C3245.f10203 <= 0) goto L17;
     */
    /* JADX WARN: Code restructure failed: missing block: B:31:0x007a, code lost:
    
        r0 = (l.C2105.m6981("۬ܰ") + r19) * (-7);
        r10 = ((r0 ^ r20) * 17563) ^ (-134275348);
        r22 = -1504186208;
     */
    /* JADX WARN: Code restructure failed: missing block: B:34:0x0070, code lost:
    
        if (l.ViewOnClickListenerC1958.f6529 <= 0) goto L17;
     */
    /* JADX WARN: Code restructure failed: missing block: B:37:0x0077, code lost:
    
        if (l.C3663.m11168() < 0) goto L19;
     */
    @Override // android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean onOptionsItemSelected(android.view.MenuItem r25) {
        /*
            Method dump skipped, instructions count: 888
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC20401.onOptionsItemSelected(android.view.MenuItem):boolean");
    }
}
