package l;

import android.view.Menu;
import android.view.MenuItem;
import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: 77J6 */
/* renamed from: l.ܰ۠᩷, reason: contains not printable characters */
/* loaded from: classes4.dex */
public class ActivityC13702 extends AbstractActivityC3346 {

    /* renamed from: ۖۜ֫, reason: not valid java name and contains not printable characters */
    private static final short[] f40896 = {6210, 9382, -2709, -6436, 29786, 29814, 29795, 29810, 29797, 29822, 29814, 29819, 29751, 29790, 29812, 29816, 29817, 29796, -3951, -1007, -6048, 9903, 8260, 11240, 1608, 2147, -13099, 16257, -8598, -15138, 1846, 4734, -15420, -8688, -13946, 60, -20164, -20208, -20219, -20204, -20221, -20200, -20208, -20195, -20168, -20206, -20194, -20193, -20222, -20191, -20221, -20204, -20217, -20200, -20204, -20218, -20176, -20206, -20219, -20200, -20217, -20200, -20219, -20216};

    /* renamed from: ܿۧ, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f40897 = 0;

    /* renamed from: ᩳۧ, reason: not valid java name and contains not printable characters */
    public C11587 f40898;

    @Override // l.AbstractActivityC3346
    /* renamed from: ۚ */
    public final String mo121() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = 0;
        short[] sArr2 = null;
        int i6 = 0;
        int i7 = 870863080;
        int i8 = C0630.f2410;
        int i9 = C3432.f10845;
        int m2566 = (C0630.m2566("᩺᩺") + i8) * (-125);
        int i10 = ((m2566 ^ i9) * 10997) ^ (-255072400);
        int i11 = 1333555159;
        while (true) {
            i7 = ((((i7 ^ i9) * (-28593)) >> 31) & i10) ^ (m2566 ^ i11);
            switch (i7) {
                case -2136618792:
                case 1595328399:
                    i5 = 45425;
                    m2566 = C0630.m2566("ܿ᩸") ^ i8;
                    i10 = ((m2566 ^ i9) * (-23605)) ^ (-1543126588);
                    i11 = -808631949;
                case -2095072032:
                case 316392002:
                    int i12 = i3 + i4;
                    if ((i12 + i12) - i2 < 0) {
                        m2566 = C2105.m6981("ۙ᩸") ^ i9;
                        i10 = ((m2566 ^ i8) * (-19233)) ^ (-1202146301);
                        i11 = -1043038022;
                    } else {
                        m2566 = (C2105.m6981("᩵ܽ") + i8) * 53;
                        i10 = ((m2566 ^ i9) * 26369) ^ (-862650247);
                        i11 = -1738927735;
                    }
                case -1964942619:
                case -1659915637:
                    s = sArr[c];
                    if (C3663.m11168() >= 0) {
                        m2566 = (i8 - C2105.m6981("۠ᩴ")) * (-43);
                        i10 = ((m2566 ^ i9) * 29497) ^ 673079741;
                        i11 = 800663611;
                    } else {
                        m2566 = (i8 - C2105.m6981("ۢ᩹")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i10 = ((m2566 ^ i9) * 3851) ^ (-2009107796);
                        i11 = 1558293897;
                    }
                case -1907838136:
                case -1327582925:
                    if (C11340.f33930 >= 0) {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    } else {
                        m2566 = (C0630.m2566("ۙܰ") ^ i8) * (-3);
                        i10 = ((m2566 ^ i9) * 32459) ^ (-1396269780);
                        i11 = -1947852147;
                    }
                case -1848056898:
                case -339139295:
                    C4117.m12364();
                    if (C3911.f12484 < 0) {
                        m2566 = (i9 - C2105.m6981("᩹֫")) * 55;
                        i10 = ((m2566 ^ i8) * 7963) ^ 365608148;
                        i11 = 1485090269;
                    } else {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    }
                case -1786948308:
                case 1729387701:
                    sArr2 = f40896;
                    i6 = 36;
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (i9 - C2105.m6981("᩹֫")) * 55;
                        i10 = ((m2566 ^ i8) * 7963) ^ 365608148;
                        i11 = 1485090269;
                    } else {
                        m2566 = (i8 - C0630.m2566("ᩳۜ")) * 75;
                        i10 = ((m2566 ^ i9) * 14325) ^ 898146358;
                        i11 = 197950130;
                    }
                case -1738108580:
                case 1246282488:
                    C1916.m6308();
                    if (C2105.m6982() == 0) {
                        m2566 = (i9 - C2105.m6981("᩹֫")) * 55;
                        i10 = ((m2566 ^ i8) * 7963) ^ 365608148;
                        i11 = 1485090269;
                    } else {
                        m2566 = C0630.m2566("᩶ܳ") ^ i8;
                        i10 = ((m2566 ^ i9) * (-22909)) ^ (-1549283363);
                        i11 = -1089782086;
                    }
                case -1691379155:
                case 567135544:
                    return C1916.m6311(sArr2, i6, 28, i5);
                case -1311737955:
                case 821923107:
                    i2 = i * i;
                    i3 = s * s;
                    if (C3911.m11924() <= 0) {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    } else {
                        m2566 = (i9 - C2105.m6981("ܳۡ")) * (-13);
                        i10 = ((m2566 ^ i8) * (-16653)) ^ (-1311562781);
                        i11 = -997435289;
                    }
                case -1104502745:
                case 1062646055:
                    C0964.m3413();
                    C1504.m5179();
                    return null;
                case -751988787:
                case 1456233573:
                    C0964.m3413();
                    m2566 = (i9 - C2105.m6981("᩹֫")) * 55;
                    i10 = ((m2566 ^ i8) * 7963) ^ 365608148;
                    i11 = 1485090269;
                case -440866175:
                case -59855387:
                    if (RunnableC3474.f10992 > 0) {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    } else {
                        m2566 = (i8 - C2105.m6981("۠ᩴ")) * (-43);
                        i10 = ((m2566 ^ i9) * 29497) ^ 673079741;
                        i11 = 800663611;
                    }
                case -92203195:
                case 347161911:
                    sArr = f40896;
                    if (C2958.f9394 >= 0) {
                        m2566 = (i8 - C2105.m6981("۠ᩴ")) * (-43);
                        i10 = ((m2566 ^ i9) * 29497) ^ 673079741;
                        i11 = 800663611;
                    } else {
                        m2566 = C0630.m2566("ۛ֨") ^ i9;
                        i10 = ((m2566 ^ i8) * 14057) ^ 1009755875;
                        i11 = -1659905868;
                    }
                case 36194427:
                case 1678328288:
                    if (C7811.f24123 >= 0) {
                        m2566 = (i9 - C2105.m6981("᩹֫")) * 55;
                        i10 = ((m2566 ^ i8) * 7963) ^ 365608148;
                        i11 = 1485090269;
                    } else {
                        m2566 = C2105.m6981("ۨۖ") ^ i9;
                        i10 = ((m2566 ^ i8) * 2797) ^ 154532820;
                        i11 = -2014057625;
                    }
                case 177165769:
                case 2099045394:
                    i4 = 1087849;
                    if (C3432.f10845 >= 0) {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    } else {
                        m2566 = C0630.m2566("ܰۧ") ^ i9;
                        i10 = ((m2566 ^ i8) * 32709) ^ 2143935583;
                        i11 = 906691199;
                    }
                case 854027425:
                case 2090543605:
                    c = '#';
                    if (C22628.m50615() != 0) {
                        m2566 = C0630.m2566("᩶ܳ") ^ i8;
                        i10 = ((m2566 ^ i9) * (-22909)) ^ (-1549283363);
                        i11 = -1089782086;
                    } else {
                        m2566 = C0630.m2566("ܳۨ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-6181)) ^ (-496343977);
                        i11 = 1073080280;
                    }
                case 967676193:
                case 1958753581:
                    i5 = 20937;
                    m2566 = C0630.m2566("ܿ᩸") ^ i8;
                    i10 = ((m2566 ^ i9) * (-23605)) ^ (-1543126588);
                    i11 = -808631949;
                case 1531843190:
                case 1661603559:
                    i = s + 1043;
                    if (C2105.f7037 != 0) {
                        m2566 = (i9 - C2105.m6981("۟֫")) * 91;
                        i10 = ((m2566 ^ i8) * 7783) ^ (-788602278);
                        i11 = 396783340;
                    } else {
                        m2566 = (C0630.m2566("ᩴᩳ") + i8) * (-13);
                        i10 = ((m2566 ^ i9) * 21353) ^ (-574384495);
                        i11 = -720852126;
                    }
                default:
                    if (C1773.f6144 <= 0) {
                        m2566 = C2105.m6981("۠ܽ") ^ i9;
                        i10 = ((m2566 ^ i8) * (-9719)) ^ (-2135833501);
                        i11 = -472327408;
                    } else {
                        m2566 = C0630.m2566("֨ܽ") ^ i8;
                        i10 = ((m2566 ^ i9) * 12447) ^ (-1443173474);
                        i11 = -721884517;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:56:0x0092, code lost:
    
        if (l.RunnableC1937.f6483 >= 0) goto L69;
     */
    @Override // l.AbstractActivityC3346, l.ActivityC2124, l.ActivityC0737, l.ActivityC23809, l.ActivityC4927, android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onCreate(android.os.Bundle r24) {
        /*
            Method dump skipped, instructions count: 878
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC13702.onCreate(android.os.Bundle):void");
    }

    @Override // android.app.Activity
    public final boolean onCreateOptionsMenu(Menu menu) {
        int m2566;
        int i;
        int i2;
        int i3;
        int m6981;
        int i4;
        int i5;
        int i6 = C3911.f12484;
        int i7 = C2167.f7158;
        int m69812 = C2105.m6981("֡ܿ") ^ i6;
        int i8 = ((m69812 ^ i7) * (-31241)) ^ (-1722648882);
        MenuItem menuItem = null;
        String str = null;
        short[] sArr = null;
        short[] sArr2 = null;
        int i9 = m69812 ^ (-1037404114);
        int i10 = 0;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        short s = 0;
        int i14 = 0;
        short s2 = 0;
        int i15 = 0;
        int i16 = 0;
        char c = 0;
        int i17 = 1441031557;
        int i18 = 0;
        short[] sArr3 = null;
        int i19 = 0;
        while (true) {
            i17 = i9 ^ (i8 & (((i17 ^ i7) * (-17395)) >> 31));
            switch (i17) {
                case -2094715924:
                case -1376369545:
                    i3 = i10;
                    s = sArr3[c];
                    i18 = s * 2;
                    if (C0050.f910 >= 0) {
                        i10 = i3;
                        m6981 = (C2105.m6981("ܰܿ") + i6) * (-123);
                        i3 = i10;
                        i4 = ((m6981 ^ i7) * 25197) ^ 623584472;
                        i5 = 1968987500;
                        int i20 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i20;
                    } else {
                        m6981 = C2105.m6981("ۢ۬") ^ i6;
                        i4 = ((m6981 ^ i7) * (-8809)) ^ (-154070768);
                        i5 = 859344670;
                        int i202 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i202;
                    }
                case -2032464484:
                case -444913976:
                    i3 = i10;
                    c = 24;
                    if (C7106.f21815 == 0) {
                        m6981 = (C0630.m2566("۬᩶") + i6) * 91;
                        i4 = ((m6981 ^ i7) * (-18919)) ^ 1453463280;
                        i5 = -1092453262;
                        int i2022 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i2022;
                    }
                    m6981 = C0630.m2566("ۨۗ") ^ i7;
                    i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                    i5 = -589887003;
                    int i20222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i20222;
                case -2013137908:
                case -317047406:
                    i3 = i10;
                    i13 = 3;
                    if (C4616.f14690 > 0) {
                        m6981 = C2105.m6981("ᩴۗ") ^ i6;
                        i4 = ((m6981 ^ i7) * (-6731)) ^ 129210421;
                        i5 = 1475099055;
                        int i202222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i202222;
                    }
                    m6981 = C0630.m2566("֨᩹") ^ i6;
                    i4 = ((m6981 ^ i7) * (-10867)) ^ (-1738255340);
                    i5 = -34691315;
                    int i2022222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i2022222;
                case -1704195992:
                case 1924088340:
                    if (C3019.f9544 < 0) {
                        m2566 = (C0630.m2566("᩻᩶") + i7) * (-51);
                        i = ((m2566 ^ i6) * (-23417)) ^ (-949966528);
                        i2 = 1291975974;
                        i9 = m2566 ^ i2;
                        i8 = i;
                    } else {
                        m6981 = (C2105.m6981("ܰܿ") + i6) * (-123);
                        i3 = i10;
                        i4 = ((m6981 ^ i7) * 25197) ^ 623584472;
                        i5 = 1968987500;
                        int i20222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i20222222;
                    }
                case -1426041505:
                case 716952043:
                    sArr = f40896;
                    i16 = 25;
                    if (C0483.m2121()) {
                        int m69813 = C2105.m6981("ۚܿ") ^ i7;
                        i9 = m69813 ^ 877423121;
                        i8 = ((m69813 ^ i6) * (-21141)) ^ (-1474748884);
                        i10 = 0;
                    } else {
                        i10 = 0;
                        m6981 = (C2105.m6981("ܰܿ") + i6) * (-123);
                        i3 = i10;
                        i4 = ((m6981 ^ i7) * 25197) ^ 623584472;
                        i5 = 1968987500;
                        int i202222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i202222222;
                    }
                case -1331039073:
                case 2059969195:
                    i12 = C2105.m6981(str);
                    i19 = 2098476189;
                    if (RunnableC1937.f6483 >= 0) {
                        i3 = i10;
                        m6981 = C0630.m2566("ۨۗ") ^ i7;
                        i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                        i5 = -589887003;
                        int i2022222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i2022222222;
                    } else {
                        m2566 = (C0630.m2566("᩺᩺") + i6) * 85;
                        i = ((m2566 ^ i7) * 13055) ^ (-493422420);
                        i2 = -2039796846;
                        i9 = m2566 ^ i2;
                        i8 = i;
                    }
                case -1324604071:
                case 2087833212:
                    i3 = i10;
                    i11 = C2105.m6981(RunnableC1108.m3789(sArr, i16, i13, i15));
                    if (ViewOnClickListenerC1958.m6429() < 0) {
                        m6981 = (C2105.m6981("ܳܽ") + i7) * (-113);
                        i4 = ((m6981 ^ i6) * 8589) ^ 1827347457;
                        i5 = -161107756;
                        int i20222222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i20222222222;
                    }
                    m6981 = C0630.m2566("֨᩹") ^ i6;
                    i4 = ((m6981 ^ i7) * (-10867)) ^ (-1738255340);
                    i5 = -34691315;
                    int i202222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i202222222222;
                case -1271425562:
                case 753917611:
                    C5695.m16037(menuItem, i12 ^ i19).setShowAsAction(2);
                    return true;
                case -1255145358:
                case 92363052:
                    C2126.m7040();
                    C1916.m6308();
                    return false;
                case -872206528:
                case 617212805:
                    i3 = i10;
                    sArr3 = f40896;
                    if (C1420.f5096 > 0) {
                        m6981 = (C2105.m6981("ۗ᩷") + i7) * (-29);
                        i4 = ((m6981 ^ i6) * (-5969)) ^ 1771704061;
                        i5 = -2073281030;
                        int i2022222222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i2022222222222;
                    }
                    m6981 = C0630.m2566("ۨۗ") ^ i7;
                    i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                    i5 = -589887003;
                    int i20222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i20222222222222;
                case -707037887:
                case -404999666:
                    i3 = i10;
                    i14 = i18 + 1;
                    s2 = 1;
                    if (C4117.f13076 > 0) {
                        m6981 = (C2105.m6981("ۚ᩷") ^ i7) * (-45);
                        i4 = ((m6981 ^ i6) * (-25385)) ^ (-1310641515);
                        i5 = -18180806;
                        int i202222222222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i202222222222222;
                    }
                    m6981 = C0630.m2566("ۨۗ") ^ i7;
                    i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                    i5 = -589887003;
                    int i2022222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i2022222222222222;
                case -435954012:
                case 2136286724:
                    int i21 = 2120384230 ^ i11;
                    menuItem = C2105.m6974(menu, i10, i21, i10, i21);
                    sArr2 = f40896;
                    if (C2105.m6982() != 0) {
                        m6981 = C0630.m2566("֨ۧ") ^ i7;
                        i3 = i10;
                        i4 = ((m6981 ^ i6) * 26427) ^ 1707409592;
                        i5 = 1127887473;
                    } else {
                        i3 = i10;
                        m6981 = C0630.m2566("ܰܺ") ^ i7;
                        i4 = ((m6981 ^ i6) * 19449) ^ 296406278;
                        i5 = -863990385;
                    }
                    int i20222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i20222222222222222;
                case -31934357:
                case 1647235651:
                    C1711.m5736();
                    ServiceConnectionC3453.m10564();
                    i3 = i10;
                    m6981 = C0630.m2566("ۨۗ") ^ i7;
                    i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                    i5 = -589887003;
                    int i202222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i202222222222222222;
                case 282590420:
                case 366405539:
                    str = C1047.m3603(sArr2, 28, 3, i15);
                    if (C5695.f17556 < 0) {
                        m2566 = (C0630.m2566("۫ۧ") + i6) * (-101);
                        i = ((m2566 ^ i7) * 18551) ^ 390936063;
                        i2 = -1832778048;
                        i9 = m2566 ^ i2;
                        i8 = i;
                    }
                    m2566 = (C0630.m2566("᩻᩶") + i7) * (-51);
                    i = ((m2566 ^ i6) * (-23417)) ^ (-949966528);
                    i2 = 1291975974;
                    i9 = m2566 ^ i2;
                    i8 = i;
                case 453855433:
                case 474485159:
                    ServiceConnectionC3453.m10564();
                    if (C2958.f9394 < 0) {
                        i3 = i10;
                        m6981 = C0630.m2566("ۨۗ") ^ i7;
                        i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                        i5 = -589887003;
                        int i2022222222222222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i2022222222222222222;
                    } else {
                        m2566 = (C0630.m2566("᩻᩶") + i7) * (-51);
                        i = ((m2566 ^ i6) * (-23417)) ^ (-949966528);
                        i2 = 1291975974;
                        i9 = m2566 ^ i2;
                        i8 = i;
                    }
                case 479165556:
                case 2146515966:
                    i3 = i10;
                    i15 = 21877;
                    m6981 = (C2105.m6981("᩹֫") + i6) * 73;
                    i4 = ((m6981 ^ i7) * 19063) ^ 2015739275;
                    i5 = -49632076;
                    int i20222222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i20222222222222222222;
                case 486245162:
                case 1697806296:
                    if (C1420.f5096 > 0) {
                        i3 = i10;
                        m6981 = C0630.m2566("֨᩹") ^ i6;
                        i4 = ((m6981 ^ i7) * (-10867)) ^ (-1738255340);
                        i5 = -34691315;
                        int i202222222222222222222 = i3;
                        i9 = m6981 ^ i5;
                        i8 = i4;
                        i10 = i202222222222222222222;
                    }
                    i3 = i10;
                    m6981 = C0630.m2566("ۨۗ") ^ i7;
                    i4 = ((m6981 ^ i6) * 31957) ^ 1463757906;
                    i5 = -589887003;
                    int i2022222222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i2022222222222222222222;
                case 892996827:
                case 1000463266:
                    i3 = i10;
                    int i22 = s + s2;
                    if (i14 - (i22 * i22) <= 0) {
                        m6981 = C0630.m2566("ۘۧ") ^ i6;
                        i4 = ((m6981 ^ i7) * 17611) ^ (-712311522);
                        i5 = -1726822684;
                    } else {
                        m6981 = C2105.m6981("ۚ֨") ^ i7;
                        i4 = ((m6981 ^ i6) * 10427) ^ 860394104;
                        i5 = 1893299207;
                    }
                    int i20222222222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i20222222222222222222222;
                default:
                    i3 = i10;
                    i15 = 60247;
                    m6981 = (C2105.m6981("᩹֫") + i6) * 73;
                    i4 = ((m6981 ^ i7) * 19063) ^ 2015739275;
                    i5 = -49632076;
                    int i202222222222222222222222 = i3;
                    i9 = m6981 ^ i5;
                    i8 = i4;
                    i10 = i202222222222222222222222;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:36:0x0073, code lost:
    
        if (l.C1773.f6144 <= 0) goto L71;
     */
    /* JADX WARN: Code restructure failed: missing block: B:40:0x007b, code lost:
    
        if (l.C3537.m10746() <= 0) goto L71;
     */
    @Override // android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean onOptionsItemSelected(android.view.MenuItem r20) {
        /*
            Method dump skipped, instructions count: 844
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ActivityC13702.onOptionsItemSelected(android.view.MenuItem):boolean");
    }
}
