package l;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;
import com.alipay.sdk.m.y.q;
import java.util.Collections;
import java.util.List;
import moe.shizuku.server.IShizukuService;

/* compiled from: X2T4 */
/* renamed from: l.֨ᩳ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public class ActivityC1292 extends AbstractActivityC3346 {

    /* renamed from: ܺۧ, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f4534 = 0;

    /* renamed from: ܿ᩹᩹, reason: not valid java name and contains not printable characters */
    private static final short[] f4535 = {6965, -17653, -22329, -23514, -18302, -32226, -22560, -27566, -18983, -17362, -13290, -13302, -13293, -13311, -13297, -13304, -13265, -13310, -24254, -32046, -16965, 24028, 18612, 17970, -23735, 18382, 24333, 7767, 4061, 4065, 4088, 4074, 4068, 4067, 4037, 4068, 4094, 4089, 4066, 4095, 4084, 4044, 4078, 4089, 4068, 4091, 4068, 4089, 4084};

    /* renamed from: ۜۧ, reason: not valid java name and contains not printable characters */
    public int f4536;

    /* renamed from: ۡۧ, reason: not valid java name and contains not printable characters */
    public C12346 f4537;

    /* renamed from: ۢۧ, reason: not valid java name and contains not printable characters */
    public C2447 f4538;

    /* renamed from: ܳۧ, reason: not valid java name and contains not printable characters */
    public TextView f4539;

    /* renamed from: ܿۧ, reason: not valid java name and contains not printable characters */
    public List f4540 = Collections.EMPTY_LIST;

    /* renamed from: ᩳۧ, reason: not valid java name and contains not printable characters */
    public C16108 f4541;

    /* renamed from: ᩷ۧ, reason: not valid java name and contains not printable characters */
    public String f4542;

    /* renamed from: ᩻ۧ, reason: not valid java name and contains not printable characters */
    public C16709 f4543;

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m4356(ActivityC1292 activityC1292) {
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 191546990;
        int i5 = C0714.f2697;
        int i6 = C4117.f13076;
        int m6981 = C2105.m6981("۫ܶ") ^ i6;
        int i7 = ((m6981 ^ i5) * 19287) ^ 1568780586;
        int i8 = -667182143;
        while (true) {
            i4 = ((((i4 ^ i5) * 12779) >> 31) & i7) ^ (m6981 ^ i8);
            switch (i4) {
                case -1992251558:
                case 1084272793:
                    i2 = 1;
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C2105.m6981("᩸ۙ") ^ i5;
                        i7 = ((m6981 ^ i6) * (-15557)) ^ (-2075837411);
                        i8 = -1815863197;
                    } else {
                        m6981 = (i6 - C2105.m6981("᩶ۨ")) * (-77);
                        i7 = ((m6981 ^ i5) * (-4643)) ^ (-29167019);
                        i8 = -506478877;
                    }
                case -1919807812:
                case -172459040:
                    if (C2520.f8000 >= 0) {
                        m6981 = (C0630.m2566("ۖܺ") ^ i6) * (-125);
                        i7 = ((m6981 ^ i5) * (-12157)) ^ 485228719;
                        i8 = 1250146376;
                    } else {
                        m6981 = C0630.m2566("֡ۚ") ^ i5;
                        i7 = ((m6981 ^ i6) * 24823) ^ (-195884602);
                        i8 = -823189539;
                    }
                case -1896686387:
                case 564065824:
                    i = activityC1292.f4536;
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("᩸ۙ") ^ i5;
                        i7 = ((m6981 ^ i6) * (-15557)) ^ (-2075837411);
                        i8 = -1815863197;
                    } else {
                        m6981 = C0630.m2566("۠᩵") ^ i6;
                        i7 = ((m6981 ^ i5) * 12689) ^ (-1810259942);
                        i8 = -271301382;
                    }
                case -1866325637:
                case 495452447:
                    C0422.m1963();
                    if (C1294.f4556 < 0) {
                        m6981 = C0630.m2566("ۖۖ") ^ i5;
                        i7 = ((m6981 ^ i6) * 24301) ^ (-401559649);
                        i8 = -1044291741;
                    } else {
                        m6981 = (C0630.m2566("ۖܺ") ^ i6) * (-125);
                        i7 = ((m6981 ^ i5) * (-12157)) ^ 485228719;
                        i8 = 1250146376;
                    }
                case -1562267950:
                case -717702335:
                    C1420.m4913();
                    if (C2958.m9034() <= 0) {
                        m6981 = (i5 - C2105.m6981("ۖ֨")) * (-69);
                        i7 = ((m6981 ^ i6) * 17339) ^ (-647373071);
                        i8 = -80359927;
                    } else {
                        m6981 = C0630.m2566("ۖۖ") ^ i5;
                        i7 = ((m6981 ^ i6) * 24301) ^ (-401559649);
                        i8 = -1044291741;
                    }
                case -1189269048:
                case 1919445325:
                    if (C0050.m940() <= 0) {
                        m6981 = (i5 - C2105.m6981("ۖ֨")) * (-69);
                        i7 = ((m6981 ^ i6) * 17339) ^ (-647373071);
                        i8 = -80359927;
                    } else {
                        m6981 = C0630.m2566("᩺ۙ") ^ i5;
                        i7 = ((m6981 ^ i6) * (-10295)) ^ 351215348;
                        i8 = 1766886472;
                    }
                case -1123253683:
                case 636896676:
                    C4159.m12565();
                    if (C0714.f2697 >= 0) {
                        m6981 = (i5 - C2105.m6981("ۖ֨")) * (-69);
                        i7 = ((m6981 ^ i6) * 17339) ^ (-647373071);
                        i8 = -80359927;
                    } else {
                        m6981 = C2105.m6981("᩸ۙ") ^ i5;
                        i7 = ((m6981 ^ i6) * (-15557)) ^ (-2075837411);
                        i8 = -1815863197;
                    }
                case -611474564:
                case 759578691:
                    activityC1292.f4536 = i3;
                    if (C4117.f13076 > 0) {
                        C0964.m3402(new C9054(activityC1292, i3));
                        break;
                    }
                    m6981 = (C2105.m6981("ܿ᩷") + i6) * 73;
                    i7 = ((m6981 ^ i5) * 4955) ^ 1656934727;
                    i8 = 46674234;
                case -417550902:
                case 1710534707:
                    if (C3537.f11231 >= 0) {
                        m6981 = (C2105.m6981("ܿ᩷") + i6) * 73;
                        i7 = ((m6981 ^ i5) * 4955) ^ 1656934727;
                        i8 = 46674234;
                    } else {
                        m6981 = (C2105.m6981("ۙۘ") + i5) * 45;
                        i7 = ((m6981 ^ i6) * (-24579)) ^ 853434222;
                        i8 = 372653651;
                    }
                case 127115755:
                case 1608340608:
                    C21923.m49329();
                    break;
                case 127596332:
                case 324649779:
                    i3 = i + i2;
                    if (C3746.f11829 <= 0) {
                        m6981 = (C2105.m6981("ܿ᩷") + i6) * 73;
                        i7 = ((m6981 ^ i5) * 4955) ^ 1656934727;
                        i8 = 46674234;
                    } else {
                        m6981 = (C0630.m2566("ܺ۠") ^ i6) * (-13);
                        i7 = ((m6981 ^ i5) * 11299) ^ (-1985618187);
                        i8 = 1279857615;
                    }
                case 305669599:
                case 400500430:
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C2105.m6981("᩸ۙ") ^ i5;
                        i7 = ((m6981 ^ i6) * (-15557)) ^ (-2075837411);
                        i8 = -1815863197;
                    } else {
                        m6981 = C0630.m2566("ۙܽ") ^ i6;
                        i7 = ((m6981 ^ i5) * (-23511)) ^ 1102750969;
                        i8 = 1120822675;
                    }
                case 583524922:
                case 1613086943:
                    if (C7811.m20844() != 0) {
                        m6981 = C0630.m2566("ۖۖ") ^ i5;
                        i7 = ((m6981 ^ i6) * 24301) ^ (-401559649);
                        i8 = -1044291741;
                    } else {
                        m6981 = C0630.m2566("ܰۗ") ^ i6;
                        i7 = ((m6981 ^ i5) * 12615) ^ (-1098191529);
                        i8 = -1552874272;
                    }
                case 1334747070:
                case 1845804755:
                    C7811.m20844();
                    m6981 = (i5 - C2105.m6981("ۖ֨")) * (-69);
                    i7 = ((m6981 ^ i6) * 17339) ^ (-647373071);
                    i8 = -80359927;
                default:
                    if (C4616.f14690 <= 0) {
                        m6981 = (i5 - C2105.m6981("ۖ֨")) * (-69);
                        i7 = ((m6981 ^ i6) * 17339) ^ (-647373071);
                        i8 = -80359927;
                    } else {
                        m6981 = (i5 - C2105.m6981("ۛ۠")) * (-61);
                        i7 = ((m6981 ^ i6) * 7) ^ (-1981797108);
                        i8 = 899476498;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractActivityC3346
    /* renamed from: ۚ */
    public final String mo121() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        short[] sArr2 = null;
        int i5 = 0;
        int i6 = 1355648791;
        int i7 = C0483.f2088;
        int i8 = C11340.f33930;
        int m6981 = C2105.m6981("ۘ᩻") ^ i7;
        int i9 = ((m6981 ^ i8) * (-6597)) ^ 644598769;
        int i10 = -1743202518;
        while (true) {
            i6 = ((((i6 ^ i8) * (-16547)) >> 31) & i9) ^ (m6981 ^ i10);
            switch (i6) {
                case -2143169110:
                case 404361847:
                    sArr2 = f4535;
                    i5 = 28;
                    if (C2958.m9034() <= 0) {
                        m6981 = (i7 - C2105.m6981("۟᩶")) * 27;
                        i9 = ((m6981 ^ i8) * (-11493)) ^ (-1863211441);
                        i10 = -445259876;
                    } else {
                        m6981 = (C0630.m2566("֫ۖ") ^ i7) * 101;
                        i9 = ((m6981 ^ i8) * 19755) ^ 314270346;
                        i10 = 973565713;
                    }
                case -2102780323:
                case -1361320588:
                    if (C3683.f11629 >= 0) {
                        m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                        i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                        i10 = -1770541569;
                    } else {
                        m6981 = (C0630.m2566("۠ۤ") ^ i8) * (-121);
                        i9 = ((m6981 ^ i7) * 7269) ^ 1786908744;
                        i10 = -296921097;
                    }
                case -2009721582:
                case -1628453096:
                    s = sArr[c];
                    s2 = 22280;
                    if (C2958.f9394 >= 0) {
                        m6981 = (C0630.m2566("ۗ᩻") + i8) * (-71);
                        i9 = ((m6981 ^ i7) * (-18969)) ^ 1836641850;
                        i10 = 1306070623;
                    } else {
                        m6981 = (C0630.m2566("ۤۙ") + i8) * 73;
                        i9 = ((m6981 ^ i7) * (-20989)) ^ (-263515815);
                        i10 = -475029670;
                    }
                case -1857520364:
                case 1676382755:
                    i = s * s2;
                    i2 = s * s;
                    if (C1711.f5919) {
                        m6981 = (i8 - C0630.m2566("ۖۘ")) * (-21);
                        i9 = ((m6981 ^ i7) * (-6363)) ^ (-1515817630);
                        i10 = -1693387735;
                    } else {
                        m6981 = C0630.m2566("᩷ᩳ") ^ i7;
                        i9 = ((m6981 ^ i8) * 17413) ^ (-1609172196);
                        i10 = -1535980302;
                    }
                case -1635924348:
                case -831673009:
                    if (C3746.m11369() >= 0) {
                        m6981 = (i7 - C2105.m6981("۟᩶")) * 27;
                        i9 = ((m6981 ^ i8) * (-11493)) ^ (-1863211441);
                        i10 = -445259876;
                    } else {
                        m6981 = C2105.m6981("ۙᩴ") ^ i8;
                        i9 = ((m6981 ^ i7) * (-21603)) ^ (-1597662961);
                        i10 = -534760039;
                    }
                case -1562162208:
                case 1507988863:
                    if (C0630.m2564()) {
                        m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                        i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                        i10 = -1770541569;
                    } else {
                        m6981 = (i7 - C2105.m6981("ۢܺ")) * (-19);
                        i9 = ((m6981 ^ i8) * (-26939)) ^ 10840074;
                        i10 = 1984487910;
                    }
                case -1544037395:
                case -469008082:
                    i4 = 3981;
                    m6981 = C0630.m2566("ܽ᩷") ^ i7;
                    i9 = ((m6981 ^ i8) * (-10893)) ^ (-1030641918);
                    i10 = 1600289139;
                case -1472911809:
                case 1842679640:
                    if (C4616.f14690 > 0) {
                        m6981 = C0630.m2566("ۜ֨") ^ i7;
                        i9 = ((m6981 ^ i8) * 4811) ^ (-1848326166);
                        i10 = 555560558;
                    } else {
                        m6981 = (i8 - C0630.m2566("ۖۘ")) * (-21);
                        i9 = ((m6981 ^ i7) * (-6363)) ^ (-1515817630);
                        i10 = -1693387735;
                    }
                case -1418235743:
                case 1013230456:
                    i4 = 5766;
                    m6981 = C0630.m2566("ܽ᩷") ^ i7;
                    i9 = ((m6981 ^ i8) * (-10893)) ^ (-1030641918);
                    i10 = 1600289139;
                case -586301476:
                case 104340713:
                    c = 27;
                    if (C0382.f1805) {
                        m6981 = C0630.m2566("᩷ۗ") ^ i8;
                        i9 = ((m6981 ^ i7) * (-3629)) ^ 1774462887;
                        i10 = 1254546276;
                    } else {
                        m6981 = (i8 - C0630.m2566("ۖۘ")) * (-21);
                        i9 = ((m6981 ^ i7) * (-6363)) ^ (-1515817630);
                        i10 = -1693387735;
                    }
                case -263105393:
                case 1195077514:
                    sArr = f4535;
                    if (C4117.f13076 <= 0) {
                        m6981 = C0630.m2566("ۜ֨") ^ i7;
                        i9 = ((m6981 ^ i8) * 4811) ^ (-1848326166);
                        i10 = 555560558;
                    } else {
                        m6981 = C0630.m2566("֡᩶") ^ i7;
                        i9 = ((m6981 ^ i8) * (-29693)) ^ (-386019691);
                        i10 = 1096702066;
                    }
                case -29449695:
                case 22245370:
                    C4616.m13552();
                    m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                    i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                    i10 = -1770541569;
                case 59526615:
                case 107463204:
                    if (C2105.m6982() == 0) {
                        m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                        i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                        i10 = -1770541569;
                    } else {
                        m6981 = C0630.m2566("ۜ֨") ^ i7;
                        i9 = ((m6981 ^ i8) * 4811) ^ (-1848326166);
                        i10 = 555560558;
                    }
                case 102800101:
                case 873135134:
                    if (C0422.m1963()) {
                        m6981 = C2105.m6981("᩺ۗ") ^ i7;
                        i9 = ((m6981 ^ i8) * 18457) ^ (-728816901);
                        i10 = 1912309994;
                    } else {
                        m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                        i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                        i10 = -1770541569;
                    }
                case 244973447:
                case 287556704:
                    RunnableC1108.m3790();
                    C0964.m3413();
                    return null;
                case 524010064:
                case 1708521887:
                    RunnableC1937.m6387();
                    if (C0422.m1963()) {
                        m6981 = (C2105.m6981("֫ۧ") + i8) * q.h;
                        i9 = ((m6981 ^ i7) * (-19185)) ^ 990446034;
                        i10 = -1770541569;
                    } else {
                        m6981 = (i7 - C2105.m6981("۟᩶")) * 27;
                        i9 = ((m6981 ^ i8) * (-11493)) ^ (-1863211441);
                        i10 = -445259876;
                    }
                case 728540254:
                case 2069025837:
                    i3 = 124099600;
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ۜ֨") ^ i7;
                        i9 = ((m6981 ^ i8) * 4811) ^ (-1848326166);
                        i10 = 555560558;
                    } else {
                        m6981 = (i7 - C0630.m2566("᩶ۘ")) * 53;
                        i9 = ((m6981 ^ i8) * (-12705)) ^ (-776729939);
                        i10 = -485662166;
                    }
                case 857799353:
                case 1637358319:
                    return C2272.m7507(sArr2, i5, 21, i4);
                default:
                    if ((i2 + i3) - i < 0) {
                        m6981 = C2105.m6981("ܶ᩷") ^ i8;
                        i9 = ((m6981 ^ i7) * 22743) ^ 468884171;
                        i10 = 2136845724;
                    } else {
                        m6981 = (C0630.m2566("ۙܺ") + i8) * (-41);
                        i9 = ((m6981 ^ i7) * (-30649)) ^ (-564430645);
                        i10 = -1494526890;
                    }
            }
        }
    }

    @Override // l.AbstractActivityC3346, l.ActivityC2124, l.ActivityC0737, l.ActivityC23809, l.ActivityC4927, android.app.Activity
    public final void onCreate(Bundle bundle) {
        int m6981;
        int i;
        int i2;
        int i3;
        int i4;
        Intent intent;
        short[] sArr;
        short[] sArr2;
        short[] sArr3;
        C9762 c9762;
        int i5;
        short[] sArr4;
        int i6;
        Intent intent2;
        short[] sArr5;
        int i7;
        int i8;
        int i9;
        short[] sArr6;
        short[] sArr7;
        short[] sArr8;
        C9762 c97622;
        int m2566;
        int i10;
        int i11;
        Intent intent3;
        short[] sArr9;
        int i12;
        int i13;
        short[] sArr10;
        C9762 c97623;
        int m69812;
        int i14;
        int i15;
        int i16;
        int i17;
        short[] sArr11;
        int m69813;
        int i18;
        int i19;
        C9762 c97624;
        short[] sArr12;
        int m69814;
        int i20;
        int i21;
        int i22;
        final ActivityC1292 activityC1292 = this;
        int i23 = 0;
        short[] sArr13 = null;
        int i24 = 0;
        int i25 = 0;
        int i26 = 1370188430;
        int i27 = C11340.f33930;
        int i28 = C4117.f13076;
        int m25662 = C0630.m2566("᩸ۜ") ^ i27;
        int i29 = ((m25662 ^ i28) * 27825) ^ 733204903;
        int i30 = m25662 ^ (-1287854066);
        Intent intent4 = null;
        String str = null;
        ViewGroup viewGroup = null;
        C16108 c16108 = null;
        String str2 = null;
        short[] sArr14 = null;
        short[] sArr15 = null;
        int i31 = 0;
        int i32 = 0;
        int i33 = 0;
        int i34 = 0;
        int i35 = 0;
        int i36 = 0;
        short s = 0;
        C2447 c2447 = null;
        short[] sArr16 = null;
        C9762 c97625 = null;
        TextView textView = null;
        int i37 = 0;
        boolean z = false;
        C9762 c97626 = null;
        short[] sArr17 = null;
        while (true) {
            i26 = i30 ^ (i29 & (((i26 ^ i28) * 29273) >> 31));
            switch (i26) {
                case -2130537349:
                case 857238396:
                    int i38 = i37;
                    C9762 c97627 = c97626;
                    RunnableC3474.m10625(c97627, new View.OnClickListener() { // from class: l.᩻ᩳ᩷
                        @Override // android.view.View.OnClickListener
                        public final void onClick(View view) {
                            int i39 = -1456727430;
                            int i40 = C1294.f4556;
                            int i41 = C2167.f7158;
                            int m25663 = C0630.m2566("ۡۤ") ^ i40;
                            int i42 = ((m25663 ^ i41) * (-6769)) ^ 55138008;
                            int i43 = -1251314128;
                            while (true) {
                                i39 = ((((i39 ^ i41) * 22643) >> 31) & i42) ^ (m25663 ^ i43);
                                switch (i39) {
                                    case -1704805379:
                                    case 592462560:
                                        if (C1128.f4106 <= 0) {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        } else {
                                            m25663 = (C2105.m6981("ۛܶ") + i41) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                                            i42 = ((m25663 ^ i40) * (-18005)) ^ (-14377327);
                                            i43 = 1575932075;
                                        }
                                    case -1427153679:
                                    case 284300854:
                                        if (C1420.f5096 <= 0) {
                                            m25663 = (i41 - C2105.m6981("᩻᩺")) * 55;
                                            i42 = ((m25663 ^ i40) * 8093) ^ (-1433078071);
                                            i43 = 1536075051;
                                        } else {
                                            m25663 = (C0630.m2566("ۢᩴ") + i41) * (-55);
                                            i42 = ((m25663 ^ i40) * 15327) ^ 561605249;
                                            i43 = 1555520469;
                                        }
                                    case -1177536919:
                                    case 182629006:
                                        C4117.m12364();
                                        m25663 = (i41 - C2105.m6981("᩻᩺")) * 55;
                                        i42 = ((m25663 ^ i40) * 8093) ^ (-1433078071);
                                        i43 = 1536075051;
                                    case -1164065965:
                                    case -927925064:
                                        C2272.m7505(ActivityC1292.this);
                                        break;
                                    case -1104903043:
                                    case 1332810665:
                                        int i44 = ActivityC1292.f4534;
                                        if (C3245.f10203 <= 0) {
                                            m25663 = C2105.m6981("᩷ܺ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-31059)) ^ 562805872;
                                            i43 = -302226208;
                                        } else {
                                            m25663 = C0630.m2566("֫᩹") ^ i41;
                                            i42 = ((m25663 ^ i40) * 25371) ^ 1087234906;
                                            i43 = 1674282331;
                                        }
                                    case -1095769951:
                                    case -345199638:
                                        C0382.m1848();
                                        ServiceConnectionC3453.m10564();
                                        break;
                                    case -915315826:
                                    case 1123543400:
                                        C1504.m5179();
                                        if (C0422.f1886 > 0) {
                                            m25663 = (i41 - C2105.m6981("᩻᩺")) * 55;
                                            i42 = ((m25663 ^ i40) * 8093) ^ (-1433078071);
                                            i43 = 1536075051;
                                        } else {
                                            m25663 = C2105.m6981("ۗۗ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-29133)) ^ (-2099941769);
                                            i43 = -1796704613;
                                        }
                                    case -725786553:
                                    case 1537023804:
                                        if (C2272.f7362) {
                                            m25663 = C2105.m6981("᩷ܺ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-31059)) ^ 562805872;
                                            i43 = -302226208;
                                        } else {
                                            m25663 = (C2105.m6981("᩺᩺") ^ i40) * 93;
                                            i42 = ((m25663 ^ i41) * (-8163)) ^ 1319886322;
                                            i43 = -2018800151;
                                        }
                                    case -704206935:
                                    case 1888903506:
                                        if (C2167.f7158 >= 0) {
                                            m25663 = C2105.m6981("ۗۗ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-29133)) ^ (-2099941769);
                                            i43 = -1796704613;
                                        } else {
                                            m25663 = (C0630.m2566("ۤܶ") + i40) * 67;
                                            i42 = ((m25663 ^ i41) * 2481) ^ (-1817063659);
                                            i43 = 1906703434;
                                        }
                                    case -309841648:
                                    case 1004542544:
                                        RunnableC1937.m6387();
                                        if (C3911.f12484 < 0) {
                                            m25663 = (i41 - C2105.m6981("᩻᩺")) * 55;
                                            i42 = ((m25663 ^ i40) * 8093) ^ (-1433078071);
                                            i43 = 1536075051;
                                        } else {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        }
                                    case -170936231:
                                    case 801381164:
                                        if (C3245.m9925() != 0) {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        } else {
                                            m25663 = (i41 - C0630.m2566("ۖ֨")) * 67;
                                            i42 = ((m25663 ^ i40) * (-547)) ^ 916813271;
                                            i43 = -1372577881;
                                        }
                                    case 93385554:
                                    case 442637368:
                                        if (C3746.f11829 <= 0) {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        } else {
                                            m25663 = (C0630.m2566("ۘۜ") + i41) * 95;
                                            i42 = ((m25663 ^ i40) * 5961) ^ 850059678;
                                            i43 = -51226710;
                                        }
                                    case 132286871:
                                    case 1331536667:
                                        if (C1916.f6442) {
                                            m25663 = C0630.m2566("ۜۛ") ^ i40;
                                            i42 = ((m25663 ^ i41) * 2989) ^ (-1218541839);
                                            i43 = -543290362;
                                        } else {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        }
                                    case 229014241:
                                    case 310576749:
                                        if (C1711.m5736() <= 0) {
                                            m25663 = C2105.m6981("ۗۗ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-29133)) ^ (-2099941769);
                                            i43 = -1796704613;
                                        } else {
                                            m25663 = (C0630.m2566("ܶ᩵") ^ i40) * (-21);
                                            i42 = ((m25663 ^ i41) * (-22393)) ^ 1647335590;
                                            i43 = -1028271995;
                                        }
                                    case 731582633:
                                    case 1726259993:
                                        if (C1773.m5908() <= 0) {
                                            m25663 = C0630.m2566("᩹ۡ") ^ i41;
                                            i42 = ((m25663 ^ i40) * 2859) ^ (-1707521768);
                                            i43 = -1961814095;
                                        } else {
                                            m25663 = C0630.m2566("۫ۛ") ^ i40;
                                            i42 = ((m25663 ^ i41) * 5521) ^ 1837716912;
                                            i43 = -1940379237;
                                        }
                                    default:
                                        C0483.m2121();
                                        if (RunnableC1108.m3790()) {
                                            m25663 = C2105.m6981("ܳܶ") ^ i40;
                                            i42 = ((m25663 ^ i41) * (-19243)) ^ (-531743903);
                                            i43 = 383280673;
                                        } else {
                                            m25663 = (i41 - C2105.m6981("᩻᩺")) * 55;
                                            i42 = ((m25663 ^ i40) * 8093) ^ (-1433078071);
                                            i43 = 1536075051;
                                        }
                                }
                                return;
                            }
                        }
                    });
                    intent4 = C2126.m7034(this);
                    sArr16 = f4535;
                    int m25663 = (C0630.m2566("᩶۠") ^ i27) * (-37);
                    i = ((m25663 ^ i28) * (-30477)) ^ 395833259;
                    c97626 = c97627;
                    i37 = i38;
                    i30 = m25663 ^ (-860613490);
                    i29 = i;
                case -1954593472:
                case -452258483:
                    if (C3683.m11222()) {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m69815 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m69815 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m69815 ^ 570780464;
                        i37 = i22;
                    } else {
                        m6981 = C2105.m6981("ۢ֡") ^ i27;
                        i = ((m6981 ^ i28) * 3147) ^ 1657873586;
                        i2 = 439776124;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case -1950738139:
                case -1048269674:
                    i6 = i37;
                    intent2 = intent4;
                    sArr5 = sArr16;
                    i7 = i36;
                    i8 = i25;
                    i9 = i24;
                    sArr6 = sArr17;
                    sArr7 = sArr14;
                    C9762 c97628 = c97626;
                    sArr8 = sArr13;
                    c97622 = c97628;
                    i33 = 52448;
                    m2566 = C0630.m2566("֨ۧ") ^ i27;
                    i29 = ((m2566 ^ i28) * 15743) ^ (-922349422);
                    i10 = 404149821;
                    int i39 = m2566 ^ i10;
                    sArr14 = sArr7;
                    sArr17 = sArr6;
                    i24 = i9;
                    i37 = i6;
                    i30 = i39;
                    i25 = i8;
                    i36 = i7;
                    activityC1292 = this;
                    sArr16 = sArr5;
                    intent4 = intent2;
                    short[] sArr18 = sArr8;
                    c97626 = c97622;
                    sArr13 = sArr18;
                case -1926665798:
                case 700172322:
                    if (C7106.m19121(str)) {
                        i5 = i37;
                        intent = intent4;
                        sArr4 = sArr16;
                        m69814 = (i28 - C2105.m6981("֫֨")) * (-63);
                        sArr12 = sArr4;
                        i20 = ((m69814 ^ i27) * 8129) ^ (-1703703566);
                        i21 = -494227698;
                        int i40 = m69814 ^ i21;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = i40;
                        i29 = i20;
                        i37 = i22;
                    } else {
                        m6981 = (C0630.m2566("۫ۙ") ^ i28) * 29;
                        i = ((m6981 ^ i27) * (-17141)) ^ (-931234917);
                        i2 = 1148111975;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case -1915780536:
                case 1396387491:
                    i11 = i37;
                    intent3 = intent4;
                    sArr9 = sArr16;
                    i12 = i36;
                    i13 = i25;
                    int i41 = i24;
                    short[] sArr19 = sArr17;
                    short[] sArr20 = sArr14;
                    C9762 c97629 = c97626;
                    sArr10 = sArr13;
                    c97623 = c97629;
                    short s2 = s;
                    int i42 = s2 + 15265;
                    if (i23 - (i42 * i42) > 0) {
                        m69812 = (C2105.m6981("֨ۜ") ^ i28) * 51;
                        i14 = ((m69812 ^ i27) * (-7255)) ^ (-1567197298);
                        i15 = -1045825428;
                    } else {
                        m69812 = (C2105.m6981("ۛܽ") + i28) * 99;
                        i14 = ((m69812 ^ i27) * 13845) ^ 584560001;
                        i15 = 1790873250;
                    }
                    i16 = m69812 ^ i15;
                    s = s2;
                    sArr14 = sArr20;
                    sArr17 = sArr19;
                    i24 = i41;
                    activityC1292 = this;
                    i25 = i13;
                    i36 = i12;
                    sArr16 = sArr9;
                    intent4 = intent3;
                    i19 = i11;
                    i30 = i16;
                    i29 = i14;
                    i37 = i19;
                    short[] sArr21 = sArr10;
                    c97626 = c97623;
                    sArr13 = sArr21;
                case -1868306174:
                case -862823350:
                    activityC1292.f4543 = C13265.m32219(activityC1292.f4542);
                    sArr17 = f4535;
                    i31 = 18;
                    m6981 = C0630.m2566("ۚۘ") ^ i27;
                    i = ((m6981 ^ i28) * (-31259)) ^ (-1035680799);
                    i2 = -6996317;
                    i30 = m6981 ^ i2;
                    i29 = i;
                case -1699027876:
                case -833732872:
                    i5 = i37;
                    sArr4 = sArr16;
                    intent = intent4;
                    String m6570 = AbstractC2021.m6570(intent, C1005.m3502(sArr4, 10, 8, i33));
                    activityC1292.f4542 = m6570;
                    if (m6570 != null) {
                        int m25664 = (C0630.m2566("ܳᩳ") + i27) * (-107);
                        i29 = ((m25664 ^ i28) * 29261) ^ 1212792567;
                        str = m6570;
                        sArr16 = sArr4;
                        i37 = i5;
                        i30 = m25664 ^ 2017627182;
                        intent4 = intent;
                    } else {
                        str = m6570;
                        m69814 = (i28 - C2105.m6981("֫֨")) * (-63);
                        sArr12 = sArr4;
                        i20 = ((m69814 ^ i27) * 8129) ^ (-1703703566);
                        i21 = -494227698;
                        int i402 = m69814 ^ i21;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = i402;
                        i29 = i20;
                        i37 = i22;
                    }
                case -1676979957:
                case -84589511:
                    i6 = i37;
                    intent2 = intent4;
                    sArr5 = sArr16;
                    i7 = i36;
                    i8 = i25;
                    i9 = i24;
                    sArr6 = sArr17;
                    sArr7 = sArr14;
                    C9762 c976210 = c97626;
                    sArr8 = sArr13;
                    c97622 = c976210;
                    i33 = 52326;
                    m2566 = C0630.m2566("֨ۧ") ^ i27;
                    i29 = ((m2566 ^ i28) * 15743) ^ (-922349422);
                    i10 = 404149821;
                    int i392 = m2566 ^ i10;
                    sArr14 = sArr7;
                    sArr17 = sArr6;
                    i24 = i9;
                    i37 = i6;
                    i30 = i392;
                    i25 = i8;
                    i36 = i7;
                    activityC1292 = this;
                    sArr16 = sArr5;
                    intent4 = intent2;
                    short[] sArr182 = sArr8;
                    c97626 = c97622;
                    sArr13 = sArr182;
                case -1475131333:
                case 1872821845:
                    C2126.m7039(textView, new ViewOnClickListenerC8558(3, activityC1292));
                    c2447 = activityC1292.f4538;
                    m6981 = (C0630.m2566("ۗۘ") + i28) * (-9);
                    i = ((m6981 ^ i27) * 28095) ^ (-292149013);
                    i2 = -1164549643;
                    i30 = m6981 ^ i2;
                    i29 = i;
                case -1458961973:
                case 285862662:
                    activityC1292.f4538.m7900((View) viewGroup);
                    z = false;
                    textView = (TextView) C2958.m9024(viewGroup, 0);
                    activityC1292.f4539 = textView;
                    if (C4075.m12263() <= 0) {
                        i3 = i36;
                        i4 = i24;
                        intent = intent4;
                        sArr = sArr16;
                        sArr2 = sArr17;
                        sArr3 = sArr13;
                        c9762 = c97626;
                        int m69816 = (i28 - C2105.m6981("ۙܿ")) * 115;
                        int i43 = i3;
                        i29 = ((m69816 ^ i27) * (-20257)) ^ 832500796;
                        i30 = m69816 ^ 2001903251;
                        c97626 = c9762;
                        sArr13 = sArr3;
                        sArr17 = sArr2;
                        i24 = i4;
                        i36 = i43;
                        sArr16 = sArr;
                        intent4 = intent;
                    } else {
                        m6981 = C2105.m6981("᩻ۛ") ^ i27;
                        i = ((m6981 ^ i28) * (-28871)) ^ (-820246227);
                        i2 = 2084197575;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case -1442316883:
                case 219104233:
                    ViewOnClickListenerC1958.m6442(c2447, c16108);
                    i35 = C2105.m6981(C11340.m28025(f4535, 24, 3, i33));
                    if (C21923.f70183 != 0) {
                        i3 = i36;
                        i4 = i24;
                        intent = intent4;
                        sArr = sArr16;
                        sArr2 = sArr17;
                        sArr3 = sArr13;
                        c9762 = c97626;
                        int m698162 = (i28 - C2105.m6981("ۙܿ")) * 115;
                        int i432 = i3;
                        i29 = ((m698162 ^ i27) * (-20257)) ^ 832500796;
                        i30 = m698162 ^ 2001903251;
                        c97626 = c9762;
                        sArr13 = sArr3;
                        sArr17 = sArr2;
                        i24 = i4;
                        i36 = i432;
                        sArr16 = sArr;
                        intent4 = intent;
                    } else {
                        m6981 = (C2105.m6981("ܶ۟") + i27) * (-75);
                        i = ((m6981 ^ i28) * 16975) ^ 1292408311;
                        i2 = -1354575859;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case -1380298687:
                case -836989249:
                    C1128.m3851();
                    if (C1294.f4556 >= 0) {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m698152 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m698152 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m698152 ^ 570780464;
                        i37 = i22;
                    } else {
                        m6981 = (i27 - C0630.m2566("ۢᩴ")) * 91;
                        i = ((m6981 ^ i28) * 13551) ^ (-1948296029);
                        i2 = 275383566;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case -1282353503:
                case 1179719023:
                    C2520.m8026();
                    RunnableC1108.m3790();
                    break;
                case -1025647114:
                case -114149461:
                    C4616.m13552();
                    i5 = i37;
                    c97624 = c97625;
                    intent = intent4;
                    sArr12 = sArr16;
                    int m6981522 = (i27 - C2105.m6981("۠᩻")) * (-15);
                    c97625 = c97624;
                    i29 = ((m6981522 ^ i28) * 5759) ^ 668455940;
                    sArr16 = sArr12;
                    intent4 = intent;
                    i22 = i5;
                    i30 = m6981522 ^ 570780464;
                    i37 = i22;
                case -939679822:
                case 355914950:
                    i5 = i37;
                    c97624 = c97625;
                    intent = intent4;
                    sArr12 = sArr16;
                    activityC1292.f10584 = c97624;
                    C2272.m7515(activityC1292, c97624);
                    C1773.m5915(this);
                    C9762 c976211 = activityC1292.f10584;
                    if (C2167.f7158 >= 0) {
                        c97626 = c976211;
                        int m69815222 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m69815222 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m69815222 ^ 570780464;
                        i37 = i22;
                    } else {
                        c97625 = c97624;
                        m69814 = (C2105.m6981("֫ۧ") ^ i27) * 55;
                        c97626 = c976211;
                        i20 = ((m69814 ^ i28) * 1151) ^ 1473696958;
                        i21 = 338156827;
                        int i4022 = m69814 ^ i21;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = i4022;
                        i29 = i20;
                        i37 = i22;
                    }
                case -898342143:
                case 2015482020:
                    C12346 c12346 = (C12346) C0964.m3409(activityC1292, 2126043283 ^ i35);
                    activityC1292.f4537 = c12346;
                    c12346.setEnabled(z);
                    i32 = activityC1292.f4536;
                    if (C4159.f13567) {
                        m6981 = C0630.m2566("۫ۚ") ^ i28;
                        i = ((m6981 ^ i27) * (-3517)) ^ (-752449653);
                        i2 = 896445082;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    } else {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m698152222 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m698152222 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m698152222 ^ 570780464;
                        i37 = i22;
                    }
                case -868464834:
                case 223514096:
                    i6 = i37;
                    intent2 = intent4;
                    sArr5 = sArr16;
                    i7 = i36;
                    i8 = i25;
                    i9 = i24;
                    sArr6 = sArr17;
                    sArr7 = sArr14;
                    C9762 c976212 = c97626;
                    sArr8 = sArr13;
                    c97622 = c976212;
                    super.onCreate(bundle);
                    m10214();
                    str2 = C11340.m28025(f4535, 1, 3, i33);
                    m2566 = C0630.m2566("᩸ᩳ") ^ i28;
                    i29 = ((m2566 ^ i27) * 7229) ^ (-425066456);
                    i10 = 575553669;
                    int i3922 = m2566 ^ i10;
                    sArr14 = sArr7;
                    sArr17 = sArr6;
                    i24 = i9;
                    i37 = i6;
                    i30 = i3922;
                    i25 = i8;
                    i36 = i7;
                    activityC1292 = this;
                    sArr16 = sArr5;
                    intent4 = intent2;
                    short[] sArr1822 = sArr8;
                    c97626 = c97622;
                    sArr13 = sArr1822;
                case -641669406:
                case -548758637:
                    viewGroup = (ViewGroup) C4263.m12813(activityC1292, C0630.m2566(C0630.m2575(sArr15, i37, 3, i33)) ^ 2100931437);
                    if (!AbstractC2021.m6574()) {
                        m6981 = C2105.m6981("᩵ܳ") ^ i27;
                        i = ((m6981 ^ i28) * 13785) ^ (-734335184);
                        i2 = 2099453353;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                    m6981 = (i27 - C0630.m2566("ۢᩴ")) * 91;
                    i = ((m6981 ^ i28) * 13551) ^ (-1948296029);
                    i2 = 275383566;
                    i30 = m6981 ^ i2;
                    i29 = i;
                case -587044150:
                case 1351652419:
                    int i44 = i37;
                    sArr2 = sArr17;
                    i3 = i36;
                    c9762 = c97626;
                    intent = intent4;
                    sArr = sArr16;
                    C0964.m3409(activityC1292, i3);
                    short[] sArr22 = f4535;
                    i25 = 3;
                    if (C0422.f1886 <= 0) {
                        sArr3 = sArr22;
                        i37 = i44;
                        i4 = 7;
                        int m6981622 = (i28 - C2105.m6981("ۙܿ")) * 115;
                        int i4322 = i3;
                        i29 = ((m6981622 ^ i27) * (-20257)) ^ 832500796;
                        i30 = m6981622 ^ 2001903251;
                        c97626 = c9762;
                        sArr13 = sArr3;
                        sArr17 = sArr2;
                        i24 = i4;
                        i36 = i4322;
                        sArr16 = sArr;
                        intent4 = intent;
                    } else {
                        int m25665 = (C0630.m2566("۟ᩳ") + i27) * 85;
                        c97626 = c9762;
                        i36 = i3;
                        sArr13 = sArr22;
                        sArr16 = sArr;
                        i37 = i44;
                        i30 = m25665 ^ 739138495;
                        i29 = ((m25665 ^ i28) * 24869) ^ (-800313115);
                        intent4 = intent;
                        sArr17 = sArr2;
                        i24 = 7;
                    }
                case -73018567:
                case 1581306831:
                    int i45 = i37;
                    short[] sArr23 = sArr13;
                    int i46 = i24;
                    short[] sArr24 = sArr17;
                    int i47 = i25;
                    c97625 = (C9762) C4263.m12813(activityC1292, C0630.m2566(C1294.m4373(sArr23, i46, i47, i33)) ^ 2119192487);
                    int m69817 = (C2105.m6981("ܿۘ") ^ i28) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                    sArr16 = sArr16;
                    intent4 = intent4;
                    i30 = m69817 ^ 753679328;
                    i29 = ((m69817 ^ i27) * 31955) ^ 595448030;
                    i37 = i45;
                    i25 = i47;
                    sArr17 = sArr24;
                    i24 = i46;
                    c97626 = c97626;
                    sArr13 = sArr23;
                case 251387748:
                case 2060236704:
                    C3245.m9925();
                    if (C7106.f21815 == 0) {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m6981522222 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m6981522222 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m6981522222 ^ 570780464;
                        i37 = i22;
                    } else {
                        i11 = i37;
                        intent3 = intent4;
                        sArr9 = sArr16;
                        i12 = i36;
                        i13 = i25;
                        i17 = i24;
                        sArr11 = sArr17;
                        C9762 c976213 = c97626;
                        sArr10 = sArr13;
                        c97623 = c976213;
                        m69813 = C0630.m2566("ۡܰ") ^ i28;
                        i14 = ((m69813 ^ i27) * 14189) ^ (-1355560263);
                        i18 = -1810588866;
                        i16 = m69813 ^ i18;
                        sArr17 = sArr11;
                        i24 = i17;
                        i25 = i13;
                        i36 = i12;
                        sArr16 = sArr9;
                        intent4 = intent3;
                        i19 = i11;
                        i30 = i16;
                        i29 = i14;
                        i37 = i19;
                        short[] sArr212 = sArr10;
                        c97626 = c97623;
                        sArr13 = sArr212;
                    }
                case 300834273:
                case 1055503078:
                    int i48 = i37;
                    int i49 = i24;
                    short[] sArr25 = sArr17;
                    C9762 c976214 = c97626;
                    sArr10 = sArr13;
                    c97623 = c976214;
                    short[] sArr26 = sArr14;
                    int m69818 = C2105.m6981(C1420.m4902(sArr26, 4, 3, i33)) ^ 2127737766;
                    int m69819 = (C2105.m6981("ۗܽ") ^ i28) * 11;
                    i29 = ((m69819 ^ i27) * (-5647)) ^ (-1422704978);
                    sArr14 = sArr26;
                    sArr17 = sArr25;
                    i24 = i49;
                    i25 = i25;
                    i36 = m69818;
                    sArr16 = sArr16;
                    intent4 = intent4;
                    i19 = i48;
                    i30 = m69819 ^ 1739046497;
                    i37 = i19;
                    short[] sArr2122 = sArr10;
                    c97626 = c97623;
                    sArr13 = sArr2122;
                case 562056768:
                case 1174748612:
                    RunnableC1108.m3781(this);
                    break;
                case 733987489:
                case 987925465:
                    i34 = C0630.m2566(C0382.m1840(sArr17, i31, 3, i33));
                    if (C0714.m2805()) {
                        m6981 = (C0630.m2566("۟ۙ") ^ i28) * (-93);
                        i = ((m6981 ^ i27) * (-30171)) ^ (-55280725);
                        i2 = 1998654799;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    } else {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m69815222222 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m69815222222 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m69815222222 ^ 570780464;
                        i37 = i22;
                    }
                case 1215807437:
                case 1842670298:
                    c16108 = new C16108(activityC1292);
                    activityC1292.f4541 = c16108;
                    if (C1504.f5354) {
                        i5 = i37;
                        c97624 = c97625;
                        intent = intent4;
                        sArr12 = sArr16;
                        int m698152222222 = (i27 - C2105.m6981("۠᩻")) * (-15);
                        c97625 = c97624;
                        i29 = ((m698152222222 ^ i28) * 5759) ^ 668455940;
                        sArr16 = sArr12;
                        intent4 = intent;
                        i22 = i5;
                        i30 = m698152222222 ^ 570780464;
                        i37 = i22;
                    } else {
                        m6981 = (i28 - C2105.m6981("֡ܺ")) * 5;
                        i = ((m6981 ^ i27) * 19019) ^ (-1882703782);
                        i2 = 468419851;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
                case 1477896465:
                case 1954845913:
                    i11 = i37;
                    intent3 = intent4;
                    sArr9 = sArr16;
                    i12 = i36;
                    i13 = i25;
                    i17 = i24;
                    sArr11 = sArr17;
                    C9762 c976215 = c97626;
                    sArr10 = sArr13;
                    c97623 = c976215;
                    C4263.m12813(activityC1292, C2105.m6981(str2) ^ 2126637009);
                    sArr14 = f4535;
                    if (C4263.f13799 > 0) {
                        m69813 = C2105.m6981("ۛܰ") ^ i27;
                        i14 = ((m69813 ^ i28) * 35) ^ (-904849587);
                        i18 = -976969368;
                        i16 = m69813 ^ i18;
                        sArr17 = sArr11;
                        i24 = i17;
                        i25 = i13;
                        i36 = i12;
                        sArr16 = sArr9;
                        intent4 = intent3;
                        i19 = i11;
                        i30 = i16;
                        i29 = i14;
                        i37 = i19;
                        short[] sArr21222 = sArr10;
                        c97626 = c97623;
                        sArr13 = sArr21222;
                    }
                    m69813 = C0630.m2566("ۡܰ") ^ i28;
                    i14 = ((m69813 ^ i27) * 14189) ^ (-1355560263);
                    i18 = -1810588866;
                    i16 = m69813 ^ i18;
                    sArr17 = sArr11;
                    i24 = i17;
                    i25 = i13;
                    i36 = i12;
                    sArr16 = sArr9;
                    intent4 = intent3;
                    i19 = i11;
                    i30 = i16;
                    i29 = i14;
                    i37 = i19;
                    short[] sArr212222 = sArr10;
                    c97626 = c97623;
                    sArr13 = sArr212222;
                case 1656214917:
                case 1671949682:
                    int i50 = i32 + 1;
                    activityC1292.f4536 = i50;
                    C4263.m12821(new C9054(activityC1292, i50));
                    break;
                case 1729492054:
                case 2056703934:
                    i6 = i37;
                    intent2 = intent4;
                    sArr5 = sArr16;
                    i7 = i36;
                    i8 = i25;
                    i9 = i24;
                    sArr6 = sArr17;
                    sArr7 = sArr14;
                    C9762 c976216 = c97626;
                    sArr8 = sArr13;
                    c97622 = c976216;
                    s = f4535[0];
                    i23 = s * 61060;
                    m2566 = C0630.m2566("᩸۟") ^ i27;
                    i29 = ((m2566 ^ i28) * 9799) ^ 2126150415;
                    i10 = -2028850440;
                    int i39222 = m2566 ^ i10;
                    sArr14 = sArr7;
                    sArr17 = sArr6;
                    i24 = i9;
                    i37 = i6;
                    i30 = i39222;
                    i25 = i8;
                    i36 = i7;
                    activityC1292 = this;
                    sArr16 = sArr5;
                    intent4 = intent2;
                    short[] sArr18222 = sArr8;
                    c97626 = c97622;
                    sArr13 = sArr18222;
                default:
                    activityC1292.f4538 = (C2447) C4263.m12813(activityC1292, 2125048139 ^ i34);
                    sArr15 = f4535;
                    i37 = 21;
                    if (C0050.f910 >= 0) {
                        i3 = i36;
                        i4 = i24;
                        intent = intent4;
                        sArr = sArr16;
                        sArr2 = sArr17;
                        sArr3 = sArr13;
                        c9762 = c97626;
                        int m69816222 = (i28 - C2105.m6981("ۙܿ")) * 115;
                        int i43222 = i3;
                        i29 = ((m69816222 ^ i27) * (-20257)) ^ 832500796;
                        i30 = m69816222 ^ 2001903251;
                        c97626 = c9762;
                        sArr13 = sArr3;
                        sArr17 = sArr2;
                        i24 = i4;
                        i36 = i43222;
                        sArr16 = sArr;
                        intent4 = intent;
                    } else {
                        m6981 = (i28 - C0630.m2566("᩹ۙ")) * (-61);
                        i = ((m6981 ^ i27) * 18163) ^ (-2023396998);
                        i2 = -1913534426;
                        i30 = m6981 ^ i2;
                        i29 = i;
                    }
            }
            return;
        }
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static void m4362(final ActivityC1292 activityC1292, final int i, final Runnable runnable) {
        Runnable runnable2 = null;
        int i2 = 944981617;
        int i3 = C4075.f12947;
        int i4 = C2520.f8000;
        int m2566 = C0630.m2566("۫᩶") ^ i3;
        int i5 = ((m2566 ^ i4) * 13723) ^ (-586193436);
        int i6 = 2042822348;
        while (true) {
            i2 = ((((i2 ^ i4) * (-11445)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -1914246209:
                case -1591307938:
                    if (C1916.m6308() >= 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩹")) * (-57);
                        i5 = ((m2566 ^ i3) * (-1839)) ^ 486384859;
                        i6 = 545297121;
                    } else {
                        m2566 = C2105.m6981("֨ᩴ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-29521)) ^ (-303957541);
                        i6 = 695784384;
                    }
                case -1572133887:
                case -823332456:
                    runnable2 = new Runnable(activityC1292) { // from class: l.ۜᩳ᩷

                        /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
                        public final /* synthetic */ ActivityC1292 f21398;

                        @Override // java.lang.Runnable
                        public final void run() {
                            int i7 = 0;
                            Runnable runnable3 = null;
                            int i8 = 164644888;
                            int i9 = RunnableC1937.f6483;
                            int i10 = C2958.f9394;
                            int m25662 = C0630.m2566("ۗ᩷") ^ i9;
                            int i11 = ((m25662 ^ i10) * 25959) ^ (-1125389021);
                            int i12 = 90123939;
                            while (true) {
                                i8 = ((((i8 ^ i10) * (-11155)) >> 31) & i11) ^ (m25662 ^ i12);
                                switch (i8) {
                                    case -1878012960:
                                    case 49547891:
                                        if (C1005.f3721) {
                                            m25662 = (C0630.m2566("᩵᩷") + i9) * 67;
                                            i11 = ((m25662 ^ i10) * (-23263)) ^ 2134908265;
                                            i12 = 909429270;
                                        } else {
                                            m25662 = (i10 - C0630.m2566("ܺܰ")) * 37;
                                            i11 = ((m25662 ^ i9) * 12585) ^ 193065387;
                                            i12 = 2094495143;
                                        }
                                    case -1799610615:
                                    case 595805345:
                                        i7 = i;
                                        if (RunnableC3474.m10630()) {
                                            m25662 = C0630.m2566("᩸ۗ") ^ i10;
                                            i11 = ((m25662 ^ i9) * 31759) ^ (-1009981063);
                                            i12 = 1838977372;
                                        } else {
                                            m25662 = (C0630.m2566("᩵᩷") + i9) * 67;
                                            i11 = ((m25662 ^ i10) * (-23263)) ^ 2134908265;
                                            i12 = 909429270;
                                        }
                                    case -1732415340:
                                    case -1499021613:
                                        if (C0050.f910 >= 0) {
                                            m25662 = C2105.m6981("ܳ᩶") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-14141)) ^ (-1327821698);
                                            i12 = 1204722085;
                                        } else {
                                            m25662 = (C2105.m6981("ۢ᩺") ^ i9) * 15;
                                            i11 = ((m25662 ^ i10) * 14543) ^ (-1944374510);
                                            i12 = -1069369777;
                                        }
                                    case -1495154672:
                                    case 1112072087:
                                        runnable3 = runnable;
                                        if (C2272.f7362) {
                                            m25662 = C2105.m6981("ܳ᩶") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-14141)) ^ (-1327821698);
                                            i12 = 1204722085;
                                        } else {
                                            m25662 = C2105.m6981("ܶ᩷") ^ i9;
                                            i11 = ((m25662 ^ i10) * (-11341)) ^ (-206081506);
                                            i12 = -660737649;
                                        }
                                    case -1410909126:
                                    case 1963902223:
                                        if (C2520.f8000 >= 0) {
                                            m25662 = C0630.m2566("֡ܿ") ^ i9;
                                            i11 = ((m25662 ^ i10) * (-32683)) ^ (-2040571791);
                                            i12 = -321598603;
                                        } else {
                                            m25662 = (i9 - C2105.m6981("ۨ᩷")) * 41;
                                            i11 = ((m25662 ^ i10) * (-18479)) ^ (-2058607595);
                                            i12 = 311786633;
                                        }
                                    case -1267068469:
                                    case 1338853978:
                                        if (C7106.m19120() <= 0) {
                                            m25662 = C0630.m2566("֡ܿ") ^ i9;
                                            i11 = ((m25662 ^ i10) * (-32683)) ^ (-2040571791);
                                            i12 = -321598603;
                                        } else {
                                            m25662 = C0630.m2566("ۗ۟") ^ i9;
                                            i11 = ((m25662 ^ i10) * 2389) ^ 5276578;
                                            i12 = -1659762698;
                                        }
                                    case -1107664498:
                                    case 289364130:
                                        C3019.m9255();
                                        C4075.m12263();
                                        break;
                                    case -1085806021:
                                    case 1334945721:
                                        if (C0422.f1886 <= 0) {
                                            m25662 = C0630.m2566("֡ܿ") ^ i9;
                                            i11 = ((m25662 ^ i10) * (-32683)) ^ (-2040571791);
                                            i12 = -321598603;
                                        } else {
                                            m25662 = C2105.m6981("ۡ֡") ^ i10;
                                            i11 = ((m25662 ^ i9) * 20845) ^ (-523141460);
                                            i12 = -2144549512;
                                        }
                                    case -935783708:
                                    case 1275947105:
                                        if (C2105.f7037 != 0) {
                                            m25662 = C2105.m6981("ܳ᩶") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-14141)) ^ (-1327821698);
                                            i12 = 1204722085;
                                        } else {
                                            m25662 = (C0630.m2566("۟ܺ") ^ i9) * (-67);
                                            i11 = ((m25662 ^ i10) * (-21329)) ^ 189037158;
                                            i12 = -2080671143;
                                        }
                                    case -492104844:
                                    case 1382893780:
                                        if (C2167.m7155()) {
                                            m25662 = C2105.m6981("ܳ᩶") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-14141)) ^ (-1327821698);
                                            i12 = 1204722085;
                                        } else {
                                            m25662 = C0630.m2566("۫ۘ") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-10915)) ^ (-97701198);
                                            i12 = -1162633117;
                                        }
                                    case -478649650:
                                    case 1233048740:
                                        ActivityC1292.m4357(this.f21398, i7, runnable3);
                                        break;
                                    case -302346424:
                                    case 431240818:
                                        C4075.m12263();
                                        m25662 = (i10 - C0630.m2566("ܺܰ")) * 37;
                                        i11 = ((m25662 ^ i9) * 12585) ^ 193065387;
                                        i12 = 2094495143;
                                    case -201458468:
                                    case 427310258:
                                        if (C0382.f1805) {
                                            m25662 = (C0630.m2566("ᩴۢ") + i10) * (-103);
                                            i11 = ((m25662 ^ i9) * (-14513)) ^ 1799990366;
                                            i12 = 535136490;
                                        } else {
                                            m25662 = C2105.m6981("᩶᩹") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-10075)) ^ 127220133;
                                            i12 = 1697537972;
                                        }
                                    case 217121332:
                                    case 1234740655:
                                        if (C3746.f11829 <= 0) {
                                            m25662 = C2105.m6981("᩶᩹") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-10075)) ^ 127220133;
                                            i12 = 1697537972;
                                        } else {
                                            m25662 = C2105.m6981("ۗ᩹") ^ i10;
                                            i11 = ((m25662 ^ i9) * 32227) ^ (-313222221);
                                            i12 = -329643865;
                                        }
                                    case 1730480495:
                                    case 2100797921:
                                        C3537.m10746();
                                        if (C3663.m11168() >= 0) {
                                            m25662 = (C0630.m2566("᩵᩷") + i9) * 67;
                                            i11 = ((m25662 ^ i10) * (-23263)) ^ 2134908265;
                                            i12 = 909429270;
                                        } else {
                                            m25662 = C2105.m6981("᩶᩹") ^ i10;
                                            i11 = ((m25662 ^ i9) * (-10075)) ^ 127220133;
                                            i12 = 1697537972;
                                        }
                                    default:
                                        C5695.m16023();
                                        if (C0798.f2919) {
                                            m25662 = (C0630.m2566("᩵᩷") + i9) * 67;
                                            i11 = ((m25662 ^ i10) * (-23263)) ^ 2134908265;
                                            i12 = 909429270;
                                        } else {
                                            m25662 = C0630.m2566("֡ܿ") ^ i9;
                                            i11 = ((m25662 ^ i10) * (-32683)) ^ (-2040571791);
                                            i12 = -321598603;
                                        }
                                }
                                return;
                            }
                        }

                        {
                            int i7 = -737011648;
                            int i8 = C2958.f9394;
                            int i9 = C4616.f14690;
                            int m25662 = C0630.m2566("֫ᩴ") ^ i8;
                            int i10 = ((m25662 ^ i9) * 31997) ^ (-258587898);
                            int i11 = 249648841;
                            while (true) {
                                i7 = ((((i7 ^ i9) * 32407) >> 31) & i10) ^ (m25662 ^ i11);
                                switch (i7) {
                                    case -2098036583:
                                    case 1676366478:
                                        if (C0630.f2410 <= 0) {
                                            m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                            i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                            i11 = -1084929399;
                                        } else {
                                            m25662 = (i8 - C0630.m2566("ۚ᩹")) * 65;
                                            i10 = ((m25662 ^ i9) * (-27923)) ^ 1031268902;
                                            i11 = -1042252396;
                                        }
                                    case -2094100054:
                                    case -454572457:
                                        C1773.m5908();
                                        if (C3537.f11231 >= 0) {
                                            m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                            i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                            i11 = -1084929399;
                                        } else {
                                            m25662 = (C2105.m6981("᩸᩺") + i8) * (-101);
                                            i10 = ((m25662 ^ i9) * 20275) ^ (-637864749);
                                            i11 = 306733056;
                                        }
                                    case -1919731640:
                                    case 792680247:
                                        if (RunnableC1108.m3790()) {
                                            m25662 = (C2105.m6981("᩸᩺") + i8) * (-101);
                                            i10 = ((m25662 ^ i9) * 20275) ^ (-637864749);
                                            i11 = 306733056;
                                        } else {
                                            m25662 = (i9 - C0630.m2566("᩻ۖ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                                            i10 = ((m25662 ^ i8) * 15321) ^ 205203629;
                                            i11 = 776381661;
                                        }
                                    case -1806491657:
                                    case -71088521:
                                        this.f21398 = activityC1292;
                                        if (C2167.m7155()) {
                                            m25662 = (i8 - C0630.m2566("ۚ᩹")) * 65;
                                            i10 = ((m25662 ^ i9) * (-27923)) ^ 1031268902;
                                            i11 = -1042252396;
                                        } else {
                                            m25662 = C2105.m6981("ᩴ᩻") ^ i9;
                                            i10 = ((m25662 ^ i8) * 24109) ^ 1723258581;
                                            i11 = -1053843495;
                                        }
                                    case -1678373386:
                                    case 725562591:
                                        if (C0798.f2919) {
                                            m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                            i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                            i11 = -1084929399;
                                        } else {
                                            m25662 = (i8 - C2105.m6981("ܳ۫")) * 23;
                                            i10 = ((m25662 ^ i9) * (-7135)) ^ (-763233560);
                                            i11 = -1573382968;
                                        }
                                    case -1662577646:
                                    case -58940372:
                                        C7811.m20844();
                                        C1047.m3599();
                                        m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                        i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                        i11 = -1084929399;
                                    case -1540037727:
                                    case 1505295232:
                                        if (C3245.f10203 <= 0) {
                                            m25662 = C2105.m6981("۬᩶") ^ i8;
                                            i10 = ((m25662 ^ i9) * (-17009)) ^ (-2147360754);
                                            i11 = 1980545591;
                                        } else {
                                            m25662 = (C0630.m2566("ܰۙ") + i9) * 85;
                                            i10 = ((m25662 ^ i8) * (-23839)) ^ 222422303;
                                            i11 = -1127064571;
                                        }
                                    case -1512676883:
                                    case 1169996925:
                                        if (C0237.f1507 != 0) {
                                            m25662 = (i9 - C2105.m6981("֫ܽ")) * (-77);
                                            i10 = ((m25662 ^ i8) * (-23177)) ^ (-540481812);
                                            i11 = -616069229;
                                        } else {
                                            m25662 = (i9 - C2105.m6981("ᩴܿ")) * 85;
                                            i10 = ((m25662 ^ i8) * 28389) ^ 809144732;
                                            i11 = -1657296271;
                                        }
                                    case -1173408802:
                                    case -119421689:
                                        if (C4117.f13076 <= 0) {
                                            m25662 = (C2105.m6981("᩸᩺") + i8) * (-101);
                                            i10 = ((m25662 ^ i9) * 20275) ^ (-637864749);
                                            i11 = 306733056;
                                        } else {
                                            m25662 = (C0630.m2566("ۘۘ") ^ i8) * 77;
                                            i10 = ((m25662 ^ i9) * 21803) ^ 817518224;
                                            i11 = -1878700364;
                                        }
                                    case -1033031057:
                                    case -80823775:
                                        if (C21923.f70183 != 0) {
                                            m25662 = C2105.m6981("۬᩶") ^ i8;
                                            i10 = ((m25662 ^ i9) * (-17009)) ^ (-2147360754);
                                            i11 = 1980545591;
                                        } else {
                                            m25662 = C2105.m6981("֫ۤ") ^ i9;
                                            i10 = ((m25662 ^ i8) * (-21541)) ^ (-210070213);
                                            i11 = -191728927;
                                        }
                                    case -1014690099:
                                    case 1618963160:
                                        return;
                                    case -769058120:
                                    case -582082631:
                                        if (C3432.f10845 >= 0) {
                                            m25662 = (i8 - C0630.m2566("ۚ᩹")) * 65;
                                            i10 = ((m25662 ^ i9) * (-27923)) ^ 1031268902;
                                            i11 = -1042252396;
                                        } else {
                                            m25662 = C2105.m6981("۟ܿ") ^ i8;
                                            i10 = ((m25662 ^ i9) * (-29999)) ^ 915672407;
                                            i11 = 1358194490;
                                        }
                                    case -409530466:
                                    case 1488347099:
                                        if (C0798.f2919) {
                                            m25662 = (C2105.m6981("᩸᩺") + i8) * (-101);
                                            i10 = ((m25662 ^ i9) * 20275) ^ (-637864749);
                                            i11 = 306733056;
                                        } else {
                                            m25662 = (C0630.m2566("ۧۛ") ^ i8) * (-15);
                                            i10 = ((m25662 ^ i9) * 29655) ^ 754062971;
                                            i11 = 1479481394;
                                        }
                                    case -75179163:
                                    case 525986110:
                                        AbstractC2021.m6574();
                                        throw new RuntimeException();
                                    case 1172142834:
                                    case 1182396328:
                                        if (C2167.f7158 >= 0) {
                                            m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                            i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                            i11 = -1084929399;
                                        } else {
                                            m25662 = (i8 - C2105.m6981("ۗ᩶")) * 23;
                                            i10 = ((m25662 ^ i9) * 8109) ^ (-1009773641);
                                            i11 = -1952510368;
                                        }
                                    default:
                                        if (C2167.f7158 >= 0) {
                                            m25662 = (i9 - C2105.m6981("᩸ۤ")) * 15;
                                            i10 = ((m25662 ^ i8) * 32279) ^ 1491034198;
                                            i11 = -1084929399;
                                        } else {
                                            m25662 = (i9 - C2105.m6981("֫ܽ")) * (-77);
                                            i10 = ((m25662 ^ i8) * (-23177)) ^ (-540481812);
                                            i11 = -616069229;
                                        }
                                }
                            }
                        }
                    };
                    if (C0714.f2697 >= 0) {
                        m2566 = C0630.m2566("ۡ۬") ^ i3;
                        i5 = ((m2566 ^ i4) * 31469) ^ 486998717;
                        i6 = -536072834;
                    } else {
                        m2566 = (i3 - C2105.m6981("ᩴ۟")) * 9;
                        i5 = ((m2566 ^ i4) * (-21849)) ^ (-516644171);
                        i6 = 21907805;
                    }
                case -1562586536:
                case 1757556803:
                    if (AbstractC2021.m6574()) {
                        m2566 = C2105.m6981("ܿܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3737)) ^ 1520155209;
                        i6 = 1486205536;
                    } else {
                        m2566 = (C0630.m2566("֨ۙ") + i3) * (-79);
                        i5 = ((m2566 ^ i4) * 19445) ^ (-564624770);
                        i6 = -161250465;
                    }
                case -1309897388:
                case -655301496:
                    if (C2167.f7158 >= 0) {
                        m2566 = C2105.m6981("ܿܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3737)) ^ 1520155209;
                        i6 = 1486205536;
                    } else {
                        m2566 = (C0630.m2566("֡ۧ") + i4) * (-77);
                        i5 = ((m2566 ^ i3) * 10121) ^ 1610562848;
                        i6 = -2021345490;
                    }
                case -1274202722:
                case -1004015703:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩹")) * (-57);
                        i5 = ((m2566 ^ i3) * (-1839)) ^ 486384859;
                        i6 = 545297121;
                    } else {
                        m2566 = C2105.m6981("֡ۜ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-9939)) ^ (-426698198);
                        i6 = 96292668;
                    }
                case -939101076:
                case -242772782:
                    RunnableC3474.m10630();
                    if (C3911.m11924() > 0) {
                        m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                        i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                        i6 = -2070662321;
                    } else {
                        m2566 = (C2105.m6981("ᩴᩴ") + i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-18725)) ^ 1506679729;
                        i6 = -2052491144;
                    }
                case -900151544:
                case 2074816794:
                    activityC1292.f4538.stopScroll();
                    if (activityC1292.f4538.isComputingLayout()) {
                        m2566 = (C0630.m2566("᩹ܶ") + i4) * (-21);
                        i5 = ((m2566 ^ i3) * 14241) ^ 2145367269;
                        i6 = -1600642086;
                    } else {
                        m2566 = (C2105.m6981("ۢ᩶") ^ i3) * 37;
                        i5 = ((m2566 ^ i4) * 11739) ^ (-836782864);
                        i6 = 2043726341;
                    }
                case -862224967:
                case -220530127:
                    runnable2.run();
                    break;
                case -791788433:
                case 761216955:
                    C0237.m1481();
                    C4159.m12565();
                    m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                    i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                    i6 = -2070662321;
                case -688905785:
                case 732922913:
                    activityC1292.f4538.post(runnable2);
                    break;
                case -60514426:
                case 2025691168:
                    if (C4159.m12565() >= 0) {
                        m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                        i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                        i6 = -2070662321;
                    } else {
                        m2566 = (i4 - C2105.m6981("۠ۜ")) * 101;
                        i5 = ((m2566 ^ i3) * (-16425)) ^ (-317883042);
                        i6 = 1613352848;
                    }
                case 240928312:
                case 736747925:
                    if (RunnableC1108.m3790()) {
                        m2566 = C0630.m2566("ۡ۬") ^ i3;
                        i5 = ((m2566 ^ i4) * 31469) ^ 486998717;
                        i6 = -536072834;
                    } else {
                        m2566 = C0630.m2566("۬ܺ") ^ i4;
                        i5 = ((m2566 ^ i3) * 14519) ^ (-929190217);
                        i6 = 1162404866;
                    }
                case 253355478:
                case 2005266728:
                    if (AbstractC2021.m6574()) {
                        m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                        i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                        i6 = -2070662321;
                    } else {
                        m2566 = (i3 - C2105.m6981("۬ۚ")) * (-49);
                        i5 = ((m2566 ^ i4) * 6373) ^ (-1354435961);
                        i6 = -387468914;
                    }
                case 500090470:
                case 1980042313:
                    if (C1294.f4556 >= 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩹")) * (-57);
                        i5 = ((m2566 ^ i3) * (-1839)) ^ 486384859;
                        i6 = 545297121;
                    } else {
                        m2566 = C2105.m6981("ۚ۟") ^ i3;
                        i5 = ((m2566 ^ i4) * 21177) ^ (-80671587);
                        i6 = 1353395733;
                    }
                case 942915584:
                case 989914645:
                    C4263.m12819();
                    if (C1047.f3863 >= 0) {
                        m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                        i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                        i6 = -2070662321;
                    } else {
                        m2566 = C2105.m6981("ܿܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3737)) ^ 1520155209;
                        i6 = 1486205536;
                    }
                case 1318663083:
                case 1750589581:
                    RunnableC1937.m6387();
                    if (C2958.f9394 < 0) {
                        m2566 = (C2105.m6981("ᩴᩴ") + i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-18725)) ^ 1506679729;
                        i6 = -2052491144;
                    } else {
                        m2566 = (i4 - C0630.m2566("ܰ᩹")) * (-57);
                        i5 = ((m2566 ^ i3) * (-1839)) ^ 486384859;
                        i6 = 545297121;
                    }
                case 1768118890:
                case 1818861475:
                    C1128.m3851();
                    break;
                default:
                    if (C0422.f1886 <= 0) {
                        m2566 = (C0630.m2566("ܺۢ") ^ i4) * 53;
                        i5 = ((m2566 ^ i3) * (-10877)) ^ 1988218965;
                        i6 = -2070662321;
                    } else {
                        m2566 = C0630.m2566("ۙ᩵") ^ i4;
                        i5 = ((m2566 ^ i3) * 14047) ^ 551545063;
                        i6 = 1334036801;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractActivityC3346, l.ActivityC0737, android.app.Activity
    public final void onResume() {
        Runnable runnable = null;
        C2447 c2447 = null;
        int i = 1063874405;
        int i2 = C1420.f5096;
        int i3 = ServiceConnectionC3453.f10921;
        int m6981 = (C2105.m6981("ܶ᩷") + i3) * 41;
        int i4 = ((m6981 ^ i2) * 15415) ^ 197117238;
        int i5 = 1491520524;
        while (true) {
            i = ((((i ^ i2) * 9327) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1988328793:
                case -870255618:
                    C0237.m1481();
                    C1916.m6308();
                    m6981 = (i3 - C0630.m2566("֡ܶ")) * (-13);
                    i4 = ((m6981 ^ i2) * 6033) ^ 1308518416;
                    i5 = -1251498863;
                case -1664828094:
                case 1847860356:
                    if (C4159.m12565() >= 0) {
                        m6981 = C2105.m6981("᩻ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32063)) ^ (-614757294);
                        i5 = -1371026799;
                    } else {
                        m6981 = C2105.m6981("ᩳۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * 19019) ^ (-788142809);
                        i5 = 989938582;
                    }
                case -1624980843:
                case -373847783:
                    if (C0714.f2697 >= 0) {
                        m6981 = C2105.m6981("᩶ܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * 4579) ^ (-724881268);
                        i5 = 1611557995;
                    } else {
                        m6981 = C0630.m2566("ۢۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 533) ^ (-863261669);
                        i5 = 410672104;
                    }
                case -1561772167:
                case 215405692:
                    if (C4263.m12819() >= 0) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-13);
                        i4 = ((m6981 ^ i2) * 6033) ^ 1308518416;
                        i5 = -1251498863;
                    } else {
                        m6981 = C2105.m6981("᩶ܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * 4579) ^ (-724881268);
                        i5 = 1611557995;
                    }
                case -1550062994:
                case 1636384438:
                    runnable.run();
                    m6981 = C0630.m2566("᩹ۡ") ^ i2;
                    i4 = ((m6981 ^ i3) * 28539) ^ 1665931076;
                    i5 = 1087545962;
                case -1422355179:
                case 59132008:
                    super.onResume();
                    if (C0798.m2998() != 0) {
                        m6981 = (C2105.m6981("ۡۢ") + i2) * 115;
                        i4 = ((m6981 ^ i3) * 21957) ^ (-1094915294);
                        i5 = -1197247055;
                    } else {
                        m6981 = C2105.m6981("֡֫") ^ i3;
                        i4 = ((m6981 ^ i2) * 5741) ^ (-1642342854);
                        i5 = 88131651;
                    }
                case -966907194:
                case -421949970:
                    c2447.stopScroll();
                    if (this.f4538.isComputingLayout()) {
                        m6981 = (i2 - C2105.m6981("᩸ᩳ")) * 57;
                        i4 = ((m6981 ^ i3) * 21029) ^ 1407354755;
                        i5 = -433285962;
                    } else {
                        m6981 = C0630.m2566("۬ۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * 19013) ^ (-435665715);
                        i5 = 1332527723;
                    }
                case -878771270:
                case 572629251:
                    if (C2126.f7087) {
                        m6981 = (C0630.m2566("ܺ۬") ^ i3) * (-85);
                        i4 = ((m6981 ^ i2) * 2507) ^ 990968659;
                        i5 = 1562399146;
                    } else {
                        m6981 = C0630.m2566("᩺֡") ^ i3;
                        i4 = ((m6981 ^ i2) * 15291) ^ 1661192212;
                        i5 = -1712295423;
                    }
                case -690434950:
                case 440166358:
                    runnable = new Runnable() { // from class: l.ܳᩳ᩷
                        @Override // java.lang.Runnable
                        public final void run() {
                            C1294.m4376(ActivityC1292.this.f4541);
                        }
                    };
                    if (C21923.f70183 != 0) {
                        m6981 = (C2105.m6981("ۡۢ") + i2) * 115;
                        i4 = ((m6981 ^ i3) * 21957) ^ (-1094915294);
                        i5 = -1197247055;
                    } else {
                        m6981 = C0630.m2566("ۡܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32625)) ^ (-1000470240);
                        i5 = -1962166666;
                    }
                case -671773645:
                case 1341553999:
                    if (this.f4541 != null) {
                        m6981 = (C2105.m6981("᩹ܿ") ^ i3) * 69;
                        i4 = ((m6981 ^ i2) * (-23205)) ^ 1782692466;
                        i5 = -943208008;
                    } else {
                        m6981 = C0630.m2566("᩹ۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28539) ^ 1665931076;
                        i5 = 1087545962;
                    }
                case -301009697:
                case 108685422:
                    if (C4616.f14690 <= 0) {
                        m6981 = C2105.m6981("᩻ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32063)) ^ (-614757294);
                        i5 = -1371026799;
                    } else {
                        m6981 = C0630.m2566("۬ۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28519)) ^ 1402055617;
                        i5 = 770579051;
                    }
                case -247276889:
                case 966621729:
                    this.f4538.post(runnable);
                    break;
                case -74656578:
                case 450012673:
                    if (C1128.f4106 <= 0) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-13);
                        i4 = ((m6981 ^ i2) * 6033) ^ 1308518416;
                        i5 = -1251498863;
                    } else {
                        m6981 = C2105.m6981("ܿ᩻") ^ i2;
                        i4 = ((m6981 ^ i3) * (-22891)) ^ (-1448032791);
                        i5 = 1169180902;
                    }
                case 52118134:
                case 2118732758:
                    break;
                case 161269847:
                case 1119028217:
                    if (C2126.f7087) {
                        m6981 = (C0630.m2566("ܺ۬") ^ i3) * (-85);
                        i4 = ((m6981 ^ i2) * 2507) ^ 990968659;
                        i5 = 1562399146;
                    } else {
                        m6981 = (C2105.m6981("ۡۢ") + i2) * 115;
                        i4 = ((m6981 ^ i3) * 21957) ^ (-1094915294);
                        i5 = -1197247055;
                    }
                case 583698917:
                case 1108764432:
                    C2105.m6982();
                    C3019.m9255();
                    break;
                case 1192516019:
                case 1963244822:
                    if (C21923.m49329()) {
                        m6981 = (C2105.m6981("ۡۢ") + i2) * 115;
                        i4 = ((m6981 ^ i3) * 21957) ^ (-1094915294);
                        i5 = -1197247055;
                    } else {
                        m6981 = (C0630.m2566("ۗۗ") ^ i3) * 27;
                        i4 = ((m6981 ^ i2) * 2605) ^ 914736491;
                        i5 = 94294158;
                    }
                case 1240688812:
                case 1744609139:
                    c2447 = this.f4538;
                    if (C3746.f11829 <= 0) {
                        m6981 = C2105.m6981("᩻ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32063)) ^ (-614757294);
                        i5 = -1371026799;
                    } else {
                        m6981 = (C0630.m2566("ܰ᩹") + i2) * 13;
                        i4 = ((m6981 ^ i3) * 30043) ^ (-1927957541);
                        i5 = -1753201961;
                    }
                case 1287766971:
                case 1538284606:
                    if (C0964.f3626 != 0) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-13);
                        i4 = ((m6981 ^ i2) * 6033) ^ 1308518416;
                        i5 = -1251498863;
                    } else {
                        m6981 = (C0630.m2566("ܳۜ") + i2) * 85;
                        i4 = ((m6981 ^ i3) * (-16131)) ^ 1057717940;
                        i5 = 1228425883;
                    }
                default:
                    if (C5695.f17556 < 0) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-13);
                        i4 = ((m6981 ^ i2) * 6033) ^ 1308518416;
                        i5 = -1251498863;
                    } else {
                        m6981 = (C2105.m6981("ۡۢ") + i2) * 115;
                        i4 = ((m6981 ^ i3) * 21957) ^ (-1094915294);
                        i5 = -1197247055;
                    }
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static /* synthetic */ void m4357(ActivityC1292 activityC1292, int i, Runnable runnable) {
        int i2 = -1382636288;
        int i3 = C1420.f5096;
        int i4 = C0050.f910;
        int m2566 = C0630.m2566("᩷ܶ") ^ i3;
        int i5 = ((m2566 ^ i4) * (-16479)) ^ 1629329442;
        int i6 = -1414594613;
        while (true) {
            i2 = ((((i2 ^ i4) * (-27391)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2035550873:
                case -319944827:
                    if (C0050.f910 >= 0) {
                        m2566 = C2105.m6981("ۡۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * 25199) ^ (-365396366);
                        i6 = 299344911;
                    } else {
                        m2566 = C2105.m6981("᩷᩹") ^ i3;
                        i5 = ((m2566 ^ i4) * (-31329)) ^ (-645911382);
                        i6 = -1786941637;
                    }
                case -2017587981:
                case 1991436691:
                    if (C0964.f3626 != 0) {
                        m2566 = C0630.m2566("ۗۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8839)) ^ 1826829245;
                        i6 = -2123437631;
                    } else {
                        m2566 = (C0630.m2566("ܰ֨") ^ i3) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i5 = ((m2566 ^ i4) * (-28655)) ^ 1878263953;
                        i6 = -1420596084;
                    }
                case -1503874991:
                case -1335668682:
                    if (C1420.m4913()) {
                        m2566 = C2105.m6981("ۡۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * 25199) ^ (-365396366);
                        i6 = 299344911;
                    } else {
                        m2566 = (C0630.m2566("۠ܺ") ^ i4) * 11;
                        i5 = ((m2566 ^ i3) * (-18275)) ^ 1533071795;
                        i6 = -1381129688;
                    }
                case -1338727888:
                case 478087290:
                    if (C0382.f1805) {
                        m2566 = (C2105.m6981("ܳۛ") ^ i3) * (-117);
                        i5 = ((m2566 ^ i4) * 9085) ^ 1816294533;
                        i6 = -1030941905;
                    } else {
                        m2566 = C0630.m2566("ۗۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8839)) ^ 1826829245;
                        i6 = -2123437631;
                    }
                case -1312319484:
                case -692782515:
                    if (C2520.f8000 >= 0) {
                        m2566 = (C2105.m6981("ᩴᩴ") ^ i3) * (-63);
                        i5 = ((m2566 ^ i4) * (-7931)) ^ (-1690774135);
                        i6 = 1168648099;
                    } else {
                        m2566 = (i4 - C0630.m2566("֨ۛ")) * (-17);
                        i5 = ((m2566 ^ i3) * (-11913)) ^ 1565696483;
                        i6 = 1400771166;
                    }
                case -1029379913:
                case -454042913:
                    if (C4263.m12819() < 0) {
                        m2566 = C2105.m6981("ۡۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * 25199) ^ (-365396366);
                        i6 = 299344911;
                    } else {
                        m2566 = (C0630.m2566("᩵ᩴ") + i4) * 53;
                        i5 = ((m2566 ^ i3) * 12635) ^ 139894347;
                        i6 = 997287259;
                    }
                case -1009169507:
                case -971193189:
                    if (C1504.f5354) {
                        m2566 = (i4 - C2105.m6981("ܽܰ")) * (-67);
                        i5 = ((m2566 ^ i3) * (-27683)) ^ 266716509;
                        i6 = -218549945;
                    } else {
                        m2566 = (C2105.m6981("ۤܿ") ^ i4) * (-77);
                        i5 = ((m2566 ^ i3) * (-18087)) ^ (-208551413);
                        i6 = 1919421794;
                    }
                case -912932367:
                case 1785410870:
                    if (C11340.f33930 >= 0) {
                        m2566 = C0630.m2566("ۗۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8839)) ^ 1826829245;
                        i6 = -2123437631;
                    } else {
                        m2566 = C2105.m6981("ᩴܽ") ^ i3;
                        i5 = ((m2566 ^ i4) * 31899) ^ (-860483545);
                        i6 = 359787433;
                    }
                case -685605511:
                case 1602162374:
                    C1711.m5731(runnable);
                    C1294.m4376(activityC1292.f4541);
                    break;
                case -632164684:
                case 1793628482:
                    break;
                case -395894848:
                case 1044677282:
                    if (C0237.f1507 != 0) {
                        m2566 = (C0630.m2566("᩵ᩴ") + i4) * 53;
                        i5 = ((m2566 ^ i3) * 12635) ^ 139894347;
                        i6 = 997287259;
                    } else {
                        m2566 = C0630.m2566("ۖۛ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-4577)) ^ (-231655060);
                        i6 = -522530828;
                    }
                case -390088800:
                case 1974415913:
                    if (C0237.f1507 == 0) {
                        m2566 = (C2105.m6981("ᩴᩴ") ^ i3) * (-63);
                        i5 = ((m2566 ^ i4) * (-7931)) ^ (-1690774135);
                        i6 = 1168648099;
                    } else {
                        m2566 = C2105.m6981("ۡۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * 25199) ^ (-365396366);
                        i6 = 299344911;
                    }
                case 335331743:
                case 1265631326:
                    C1005.m3501();
                    C2958.m9034();
                    break;
                case 348944311:
                case 1939645413:
                    ViewOnClickListenerC1958.m6429();
                    C2126.m7040();
                    m2566 = (i4 - C2105.m6981("ܽܰ")) * (-67);
                    i5 = ((m2566 ^ i3) * (-27683)) ^ 266716509;
                    i6 = -218549945;
                case 735849089:
                case 1454902132:
                    if (C5695.f17556 >= 0) {
                        m2566 = (C2105.m6981("ᩴᩴ") ^ i3) * (-63);
                        i5 = ((m2566 ^ i4) * (-7931)) ^ (-1690774135);
                        i6 = 1168648099;
                    } else {
                        m2566 = C2105.m6981("ᩴۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 6149) ^ (-486970037);
                        i6 = 1288009630;
                    }
                case 826813546:
                case 1377674126:
                    if (C21923.m49329()) {
                        m2566 = (C2105.m6981("ᩴᩴ") ^ i3) * (-63);
                        i5 = ((m2566 ^ i4) * (-7931)) ^ (-1690774135);
                        i6 = 1168648099;
                    } else {
                        m2566 = (i4 - C2105.m6981("ܽܰ")) * (-67);
                        i5 = ((m2566 ^ i3) * (-27683)) ^ 266716509;
                        i6 = -218549945;
                    }
                case 1646576733:
                case 1884080850:
                    if (C4075.m12263() <= 0) {
                        m2566 = C0630.m2566("ۗۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8839)) ^ 1826829245;
                        i6 = -2123437631;
                    } else {
                        m2566 = C0630.m2566("᩸᩶") ^ i3;
                        i5 = ((m2566 ^ i4) * 30835) ^ (-1210749903);
                        i6 = -983408627;
                    }
                default:
                    if (i != activityC1292.f4536) {
                        m2566 = (i4 - C0630.m2566("᩸᩸")) * (-83);
                        i5 = ((m2566 ^ i3) * (-11137)) ^ 447300787;
                        i6 = -841223397;
                    } else {
                        m2566 = C0630.m2566("֡۟") ^ i3;
                        i5 = ((m2566 ^ i4) * (-15115)) ^ (-1630913078);
                        i6 = 481648652;
                    }
            }
            return;
        }
    }
}
