package l;

import android.os.Binder;

/* compiled from: F5X0 */
/* renamed from: l.ۗۡ᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class BinderC3141 extends Binder {

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public long f9825;

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public final ServiceC13018 f9826;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public final void m9569() {
        C22202 c22202;
        long j = 0;
        long j2 = 0;
        int i = 186214191;
        int i2 = C0050.f910;
        int i3 = C0630.f2410;
        int m6981 = C2105.m6981("֫᩶") ^ i3;
        int i4 = ((m6981 ^ i2) * 32327) ^ (-677324523);
        int i5 = 19777191;
        while (true) {
            i = ((((i ^ i2) * 11753) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2114206854:
                case -1972619597:
                    if (C0050.m940() <= 0) {
                        m6981 = C0630.m2566("᩶ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 18761) ^ (-1335569017);
                        i5 = -139246074;
                    } else {
                        m6981 = C2105.m6981("ۨ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * 28741) ^ (-543136854);
                        i5 = -279520504;
                    }
                case -2036347839:
                case 1829165208:
                    C1420.m4913();
                    m6981 = C0630.m2566("ۡ᩵") ^ i2;
                    i4 = ((m6981 ^ i3) * 22725) ^ 441773766;
                    i5 = -319831236;
                case -1972790382:
                case -456501493:
                    if (C4159.f13567) {
                        m6981 = C0630.m2566("۠֡") ^ i2;
                        i4 = ((m6981 ^ i3) * 25873) ^ 136364678;
                        i5 = 1669372928;
                    } else {
                        m6981 = C0630.m2566("۟ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25739) ^ (-2023534486);
                        i5 = 934729898;
                    }
                case -1927207068:
                case 1654926429:
                    c22202 = this.f9826.f38966;
                    c22202.show();
                    break;
                case -1748205987:
                case 1997344791:
                    if (C0798.f2919) {
                        m6981 = C0630.m2566("֨ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7387)) ^ (-1972034237);
                        i5 = 1751106768;
                    } else {
                        m6981 = (i3 - C0630.m2566("۬֨")) * 43;
                        i4 = ((m6981 ^ i2) * 8241) ^ 2044746444;
                        i5 = -194277861;
                    }
                case -1635204315:
                case -1243167522:
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("ᩴ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-22415)) ^ (-1733857912);
                        i5 = -158133766;
                    } else {
                        m6981 = (C0630.m2566("ۙ᩶") + i2) * 7;
                        i4 = ((m6981 ^ i3) * 8543) ^ 1518043257;
                        i5 = -1020329403;
                    }
                case -1624941686:
                case -142235520:
                    if (C2105.f7037 != 0) {
                        m6981 = C0630.m2566("֨ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7387)) ^ (-1972034237);
                        i5 = 1751106768;
                    } else {
                        m6981 = C2105.m6981("ۙۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27999) ^ (-2080745640);
                        i5 = 591114250;
                    }
                case -1573293654:
                case -1173314636:
                    if (j - j2 < 300) {
                        m6981 = C2105.m6981("᩵ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-7737)) ^ 1869211525;
                        i5 = -1142206387;
                    } else {
                        m6981 = (i3 - C2105.m6981("֫֡")) * 115;
                        i4 = ((m6981 ^ i2) * 21647) ^ 2088389804;
                        i5 = -544331123;
                    }
                case -1407143880:
                case 1270742473:
                    if (C0630.f2410 <= 0) {
                        m6981 = C0630.m2566("۟ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25739) ^ (-2023534486);
                        i5 = 934729898;
                    } else {
                        m6981 = C0630.m2566("᩶ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 18761) ^ (-1335569017);
                        i5 = -139246074;
                    }
                case -1405288887:
                case 1706099606:
                    if (C0964.f3626 != 0) {
                        m6981 = C0630.m2566("֨ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7387)) ^ (-1972034237);
                        i5 = 1751106768;
                    } else {
                        m6981 = (C0630.m2566("֫ᩳ") + i3) * 53;
                        i4 = ((m6981 ^ i2) * (-19785)) ^ 301626626;
                        i5 = 1286034805;
                    }
                case -1004009530:
                case 732255869:
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C0630.m2566("۟ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25739) ^ (-2023534486);
                        i5 = 934729898;
                    } else {
                        m6981 = C0630.m2566("ܺᩴ") ^ i2;
                        i4 = ((m6981 ^ i3) * 13193) ^ (-248491291);
                        i5 = 1802082668;
                    }
                case -805782347:
                case 1363356844:
                    if (C2105.f7037 != 0) {
                        m6981 = C0630.m2566("֨ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7387)) ^ (-1972034237);
                        i5 = 1751106768;
                    } else {
                        m6981 = (C2105.m6981("ᩳۡ") + i3) * 57;
                        i4 = ((m6981 ^ i2) * 29601) ^ (-1498129658);
                        i5 = -690550401;
                    }
                case -543263121:
                case -130413622:
                    j2 = this.f9825;
                    if (C11340.f33930 >= 0) {
                        m6981 = C0630.m2566("֨ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7387)) ^ (-1972034237);
                        i5 = 1751106768;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۤ֡")) * 5;
                        i4 = ((m6981 ^ i2) * 28563) ^ (-585220724);
                        i5 = 2137048985;
                    }
                case 185950307:
                case 1621876767:
                    C2520.m8026();
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("۟ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25739) ^ (-2023534486);
                        i5 = 934729898;
                    } else {
                        m6981 = C0630.m2566("ۡ᩵") ^ i2;
                        i4 = ((m6981 ^ i3) * 22725) ^ 441773766;
                        i5 = -319831236;
                    }
                case 230194261:
                case 1537074122:
                    j = ViewOnClickListenerC1958.m6432();
                    if (C4117.m12364() != 0) {
                        m6981 = C2105.m6981("ᩴ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-22415)) ^ (-1733857912);
                        i5 = -158133766;
                    } else {
                        m6981 = C2105.m6981("۟֡") ^ i2;
                        i4 = ((m6981 ^ i3) * 19797) ^ 1271847108;
                        i5 = 1352219040;
                    }
                case 550830336:
                case 854564125:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("᩶ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 18761) ^ (-1335569017);
                        i5 = -139246074;
                    } else {
                        m6981 = C2105.m6981("ᩴ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-22415)) ^ (-1733857912);
                        i5 = -158133766;
                    }
                case 1196258919:
                case 1903619862:
                    break;
                default:
                    C3432.m10477();
                    C1005.m3501();
                    break;
            }
            return;
        }
    }

    public BinderC3141(ServiceC13018 serviceC13018) {
        this.f9826 = serviceC13018;
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final C12534 m9567() {
        C12534 c12534;
        c12534 = this.f9826.f38967;
        return c12534;
    }

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final void m9568() {
        C22202 c22202;
        c22202 = this.f9826.f38966;
        c22202.hide();
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final void m9566() {
        this.f9825 = C1294.m4371();
    }
}
