package l;

import android.app.Activity;
import android.content.Context;
import android.content.ContextWrapper;
import android.content.SharedPreferences;
import android.content.res.Configuration;
import com.google.android.material.slider.BaseSlider;
import com.umeng.commonsdk.statistics.UMErrorCode;
import moe.shizuku.server.IShizukuService;

/* compiled from: K7FD */
/* renamed from: l.ۧ᩹᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C11297 {
    /* JADX WARN: Code restructure failed: missing block: B:10:0x0033, code lost:
    
        if (l.C0714.m2805() == false) goto L49;
     */
    /* JADX WARN: Code restructure failed: missing block: B:16:0x0039, code lost:
    
        if (l.C0237.f1507 != 0) goto L37;
     */
    /* JADX WARN: Code restructure failed: missing block: B:20:0x0042, code lost:
    
        if (l.C1047.f3863 < 0) goto L45;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m27944(l.ApplicationC20075 r9) {
        /*
            Method dump skipped, instructions count: 564
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C11297.m27944(l.᩶ۡ᩷):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static Context m27941(Context context, int i, boolean z) {
        Context context2 = null;
        Context context3 = null;
        int i2 = 2067100024;
        int i3 = C4117.f13076;
        int i4 = C3432.f10845;
        int m2566 = C0630.m2566("ۚۘ") ^ i3;
        int i5 = ((m2566 ^ i4) * 27019) ^ 1116417972;
        int i6 = -327175214;
        while (true) {
            i2 = ((((i2 ^ i4) * 22477) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2146381640:
                case 988076322:
                    if (C0798.m2998() == 0) {
                        m2566 = (C2105.m6981("֫᩵") ^ i3) * (-27);
                        i5 = ((m2566 ^ i4) * 29089) ^ (-690658004);
                        i6 = -2140241076;
                    } else {
                        m2566 = C2105.m6981("᩷ۛ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-20139)) ^ (-474306496);
                        i6 = 942560793;
                    }
                case -2125507184:
                case -2102178072:
                    if (C3663.m11168() >= 0) {
                        m2566 = C2105.m6981("᩷ۛ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-20139)) ^ (-474306496);
                        i6 = 942560793;
                    } else {
                        m2566 = C2105.m6981("۬֨") ^ i3;
                        i5 = ((m2566 ^ i4) * (-1425)) ^ (-1316393058);
                        i6 = -1831294449;
                    }
                case -2119064829:
                case -708327887:
                    if (C4117.f13076 <= 0) {
                        m2566 = C2105.m6981("ۗ᩶") ^ i4;
                        i5 = ((m2566 ^ i3) * 17895) ^ (-1959207252);
                        i6 = 1777965089;
                    } else {
                        m2566 = C0630.m2566("ᩴۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-19977)) ^ 648030033;
                        i6 = -1520817546;
                    }
                case -1971502973:
                case -402218556:
                    AbstractC2021.m6574();
                    return null;
                case -1965731670:
                case 1106101684:
                    if (AbstractC2021.f6743 <= 0) {
                        m2566 = C2105.m6981("ۨܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22961)) ^ 803926502;
                        i6 = 889476827;
                    } else {
                        m2566 = (i4 - C0630.m2566("ۙܺ")) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        i5 = ((m2566 ^ i3) * 25959) ^ 377082777;
                        i6 = -1006700015;
                    }
                case -1858221340:
                case -1162415541:
                    if (C1005.f3721) {
                        m2566 = C0630.m2566("ۘᩳ") ^ i4;
                        i5 = ((m2566 ^ i3) * 9539) ^ (-825797874);
                        i6 = 1624470402;
                    } else {
                        m2566 = C2105.m6981("ۗ᩶") ^ i4;
                        i5 = ((m2566 ^ i3) * 17895) ^ (-1959207252);
                        i6 = 1777965089;
                    }
                case -1576619499:
                case 1071382794:
                    SharedPreferences sharedPreferences = C4925.f15523;
                    if (C21943.m49432(context2.getResources().getConfiguration(), i)) {
                        m2566 = (i4 - C0630.m2566("ᩴ᩷")) * 63;
                        i5 = ((m2566 ^ i3) * 3181) ^ 1755921961;
                        i6 = -1890204544;
                    } else {
                        m2566 = C2105.m6981("ܳۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * 19) ^ (-1044259338);
                        i6 = 1128827552;
                    }
                case -1005458284:
                case -340447849:
                    if (C0483.f2088 >= 0) {
                        m2566 = C2105.m6981("ۨܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22961)) ^ 803926502;
                        i6 = 889476827;
                    } else {
                        m2566 = C2105.m6981("ۛ۫") ^ i3;
                        i5 = ((m2566 ^ i4) * 21611) ^ 918530698;
                        i6 = 1918024396;
                    }
                case -868632407:
                case 1466897423:
                    if (C21923.f70183 != 0) {
                        m2566 = C2105.m6981("ۗ᩶") ^ i4;
                        i5 = ((m2566 ^ i3) * 17895) ^ (-1959207252);
                        i6 = 1777965089;
                    } else {
                        m2566 = C0630.m2566("ܽᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 21431) ^ (-1038005226);
                        i6 = 874731749;
                    }
                case -823623704:
                case 1487536749:
                    C7811.m20844();
                    m2566 = C2105.m6981("ۗۤ") ^ i4;
                    i5 = ((m2566 ^ i3) * (-7491)) ^ 863787549;
                    i6 = 1063895366;
                case -664689404:
                case 614202139:
                    if (RunnableC1108.m3790()) {
                        m2566 = C2105.m6981("ۨܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22961)) ^ 803926502;
                        i6 = 889476827;
                    } else {
                        m2566 = (i4 - C0630.m2566("۠ۙ")) * (-73);
                        i5 = ((m2566 ^ i3) * (-28337)) ^ (-1008612220);
                        i6 = -1857486032;
                    }
                case -641900983:
                case -208631245:
                    if (C2167.f7158 >= 0) {
                        m2566 = C2105.m6981("ۗۤ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-7491)) ^ 863787549;
                        i6 = 1063895366;
                    } else {
                        m2566 = C2105.m6981("ۛܰ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-12951)) ^ (-1571903788);
                        i6 = -602140232;
                    }
                case -588436106:
                case 1834222154:
                    if (C1005.f3721) {
                        m2566 = C2105.m6981("ۗۤ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-7491)) ^ 863787549;
                        i6 = 1063895366;
                    } else {
                        m2566 = C2105.m6981("ۨܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22961)) ^ 803926502;
                        i6 = 889476827;
                    }
                case -223604290:
                case 6805531:
                    return context2;
                case 360838675:
                case 1026153316:
                    Configuration configuration = context2.getResources().getConfiguration();
                    if (C4117.f13076 <= 0) {
                        m2566 = C2105.m6981("ۗ᩶") ^ i4;
                        i5 = ((m2566 ^ i3) * 17895) ^ (-1959207252);
                        i6 = 1777965089;
                    } else {
                        Configuration configuration2 = new Configuration(configuration);
                        C21943.m49427(configuration2, i);
                        context3 = context2.createConfigurationContext(configuration2);
                        m2566 = C0630.m2566("᩻ܶ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-16213)) ^ 775385964;
                        i6 = -760697386;
                    }
                case 1034433309:
                case 1659517076:
                    context2 = C9523.m24403(context);
                    if (z) {
                        m2566 = C2105.m6981("᩷ܰ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-17689)) ^ 712661670;
                        i6 = -1902363779;
                    } else {
                        context3 = context2;
                        m2566 = C0630.m2566("᩻ܶ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-16213)) ^ 775385964;
                        i6 = -760697386;
                    }
                case 1057413205:
                case 1740622565:
                    return context3;
                case 1425735645:
                case 1860499450:
                    if (C3245.f10203 > 0) {
                        m2566 = C2105.m6981("ۗۤ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-7491)) ^ 863787549;
                        i6 = 1063895366;
                    } else {
                        m2566 = (C2105.m6981("֫᩵") ^ i3) * (-27);
                        i5 = ((m2566 ^ i4) * 29089) ^ (-690658004);
                        i6 = -2140241076;
                    }
                case 1556172771:
                case 1826136284:
                    if (C3683.f11629 >= 0) {
                        m2566 = C2105.m6981("ۨܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22961)) ^ 803926502;
                        i6 = 889476827;
                    } else {
                        m2566 = C2105.m6981("ۗ֡") ^ i4;
                        i5 = ((m2566 ^ i3) * 9237) ^ (-881576847);
                        i6 = 878434066;
                    }
                default:
                    int i7 = C21943.f70295;
                    if (C4925.f15523 != null) {
                        m2566 = (i4 - C2105.m6981("֫᩺")) * (-75);
                        i5 = ((m2566 ^ i3) * (-12223)) ^ 245242677;
                        i6 = 1363293464;
                    } else {
                        context3 = context2;
                        m2566 = C0630.m2566("᩻ܶ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-16213)) ^ 775385964;
                        i6 = -760697386;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:13:0x0037, code lost:
    
        if (l.C1773.f6144 > 0) goto L23;
     */
    /* JADX WARN: Code restructure failed: missing block: B:33:0x008e, code lost:
    
        if (l.C0237.f1507 == 0) goto L61;
     */
    /* JADX WARN: Code restructure failed: missing block: B:37:0x0096, code lost:
    
        if (l.C4263.m12819() >= 0) goto L82;
     */
    /* JADX WARN: Code restructure failed: missing block: B:6:0x002e, code lost:
    
        if (l.C4075.f12947 < 0) goto L82;
     */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m27946(android.content.Context r14) {
        /*
            Method dump skipped, instructions count: 1042
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C11297.m27946(android.content.Context):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m27942(Activity activity, int i, boolean z) {
        int i2 = 732374125;
        int i3 = C3019.f9544;
        int i4 = C4117.f13076;
        int m6981 = C2105.m6981("ۤܽ") ^ i4;
        int i5 = ((m6981 ^ i3) * 22025) ^ (-1424423478);
        int i6 = 1771098440;
        while (true) {
            i2 = ((((i2 ^ i3) * 20349) >> 31) & i5) ^ (m6981 ^ i6);
            switch (i2) {
                case -2146585791:
                case 1808208466:
                    if (C2167.f7158 >= 0) {
                        m6981 = (C2105.m6981("ܺ֡") + i4) * 73;
                        i5 = ((m6981 ^ i3) * (-32525)) ^ 1859437711;
                        i6 = 1414936380;
                    } else {
                        m6981 = (i4 - C2105.m6981("᩹֡")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i5 = ((m6981 ^ i3) * 14611) ^ 1523838475;
                        i6 = 1605586329;
                    }
                case -1902543361:
                case -390961412:
                    if (C3019.f9544 >= 0) {
                        m6981 = (C2105.m6981("ܺ֡") + i4) * 73;
                        i5 = ((m6981 ^ i3) * (-32525)) ^ 1859437711;
                        i6 = 1414936380;
                    } else {
                        m6981 = C2105.m6981("ۚ᩵") ^ i4;
                        i5 = ((m6981 ^ i3) * (-20637)) ^ (-895072269);
                        i6 = 1137235428;
                    }
                case -1663315211:
                case 1010704384:
                    if (C21943.m49432(activity.getResources().getConfiguration(), i)) {
                        m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                        i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                        i6 = 118680338;
                    } else {
                        m6981 = C2105.m6981("ۜ᩵") ^ i4;
                        i5 = ((m6981 ^ i3) * 9833) ^ 477729324;
                        i6 = 120899311;
                    }
                case -1631115441:
                case 352428440:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    } else {
                        m6981 = C0630.m2566("ܳܰ") ^ i3;
                        i5 = ((m6981 ^ i4) * 6253) ^ (-1154011581);
                        i6 = 135263326;
                    }
                case -1399677999:
                case -236976771:
                    if (C3432.f10845 >= 0) {
                        m6981 = (C2105.m6981("ܿۨ") ^ i4) * 27;
                        i5 = ((m6981 ^ i3) * (-8485)) ^ 363560890;
                        i6 = 1489616591;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۘ֨")) * 81;
                        i5 = ((m6981 ^ i4) * 4747) ^ (-1804690370);
                        i6 = 486821586;
                    }
                case -816639253:
                case -373577779:
                    ViewOnClickListenerC1958.m6429();
                    if (C0630.m2564()) {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    } else {
                        m6981 = (C2105.m6981("۫᩹") ^ i3) * 39;
                        i5 = ((m6981 ^ i4) * (-10979)) ^ 1890034246;
                        i6 = -334155275;
                    }
                case -611912463:
                case 1713733613:
                    if (activity.isDestroyed()) {
                        m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                        i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                        i6 = 118680338;
                    } else {
                        m6981 = C2105.m6981("֫۬") ^ i3;
                        i5 = ((m6981 ^ i4) * (-26395)) ^ (-2116716549);
                        i6 = -778100911;
                    }
                case -573558765:
                case 916215719:
                    SharedPreferences sharedPreferences = C4925.f15523;
                    if (C2958.m9033(activity)) {
                        m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                        i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                        i6 = 118680338;
                    } else {
                        m6981 = (i4 - C0630.m2566("᩶ܿ")) * 31;
                        i5 = ((m6981 ^ i3) * (-3429)) ^ 574234554;
                        i6 = 1501786195;
                    }
                case -544456089:
                case 1305830432:
                    if (C7106.f21815 == 0) {
                        m6981 = (C2105.m6981("ܺ֡") + i4) * 73;
                        i5 = ((m6981 ^ i3) * (-32525)) ^ 1859437711;
                        i6 = 1414936380;
                    } else {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    }
                case -426224377:
                case -337075966:
                    C1504.m5179();
                    C22628.m50615();
                    break;
                case -149338382:
                case 36019320:
                    if (C0630.f2410 <= 0) {
                        m6981 = (C2105.m6981("۫᩹") ^ i3) * 39;
                        i5 = ((m6981 ^ i4) * (-10979)) ^ 1890034246;
                        i6 = -334155275;
                    } else {
                        m6981 = C2105.m6981("۫ۜ") ^ i4;
                        i5 = ((m6981 ^ i3) * 789) ^ (-1480188354);
                        i6 = 588134169;
                    }
                case -139825978:
                case 1586483883:
                    if (C1128.f4106 <= 0) {
                        m6981 = (C2105.m6981("۫᩹") ^ i3) * 39;
                        i5 = ((m6981 ^ i4) * (-10979)) ^ 1890034246;
                        i6 = -334155275;
                    } else {
                        m6981 = (C2105.m6981("֡ۢ") + i3) * (-101);
                        i5 = ((m6981 ^ i4) * (-1715)) ^ (-1929810121);
                        i6 = 1556433342;
                    }
                case -29204671:
                case 2139720981:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ۡ᩸") ^ i4;
                        i5 = ((m6981 ^ i3) * (-26861)) ^ (-372346);
                        i6 = -1717934085;
                    } else {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    }
                case 163017022:
                case 1647856821:
                    if (C1128.m3851() <= 0) {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    } else {
                        m6981 = C0630.m2566("᩹ۜ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-21229)) ^ (-1048712529);
                        i6 = -2040160223;
                    }
                case 655823308:
                case 1626129560:
                    RunnableC0588.m2441();
                    C1047.m3599();
                    m6981 = (C2105.m6981("ܺ֡") + i4) * 73;
                    i5 = ((m6981 ^ i3) * (-32525)) ^ 1859437711;
                    i6 = 1414936380;
                case 660725068:
                case 1674905207:
                    break;
                case 742613186:
                case 948651380:
                    int i7 = C21943.f70295;
                    if (C4925.f15523 != null) {
                        m6981 = C2105.m6981("ᩳۙ") ^ i3;
                        i5 = ((m6981 ^ i4) * 1061) ^ 678371905;
                        i6 = -616635247;
                    } else {
                        m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                        i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                        i6 = 118680338;
                    }
                case 852751602:
                case 1192775553:
                    if (z) {
                        m6981 = (C2105.m6981("۬ᩳ") + i4) * (-7);
                        i5 = ((m6981 ^ i3) * 19275) ^ (-392190228);
                        i6 = -1728222390;
                    } else {
                        m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                        i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                        i6 = 118680338;
                    }
                case 1040658051:
                case 1375581009:
                    activity.recreate();
                    m6981 = (C2105.m6981("ۗۖ") + i3) * (-117);
                    i5 = ((m6981 ^ i4) * 19325) ^ (-359492479);
                    i6 = 118680338;
                case 1062836022:
                case 1479044354:
                    if (C1773.m5908() <= 0) {
                        m6981 = C0630.m2566("ۚۚ") ^ i3;
                        i5 = ((m6981 ^ i4) * 30913) ^ 540177411;
                        i6 = -894024836;
                    } else {
                        m6981 = C2105.m6981("ۗܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12653)) ^ (-1892535890);
                        i6 = 138842954;
                    }
                case 1208194735:
                case 1976004847:
                    if (C1294.f4556 >= 0) {
                        m6981 = (C2105.m6981("ܿۨ") ^ i4) * 27;
                        i5 = ((m6981 ^ i3) * (-8485)) ^ 363560890;
                        i6 = 1489616591;
                    } else {
                        m6981 = (C0630.m2566("ۡ᩷") + i3) * 13;
                        i5 = ((m6981 ^ i4) * 20077) ^ 227108246;
                        i6 = -101561454;
                    }
                default:
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C0630.m2566("ۡ᩸") ^ i4;
                        i5 = ((m6981 ^ i3) * (-26861)) ^ (-372346);
                        i6 = -1717934085;
                    } else {
                        m6981 = C0630.m2566("ۗ᩷") ^ i4;
                        i5 = ((m6981 ^ i3) * (-6773)) ^ (-229722095);
                        i6 = -94638090;
                    }
            }
            return;
        }
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static void m27945(Activity activity, int i, boolean z) {
        int i2 = -550196532;
        int i3 = C4117.f13076;
        int i4 = C2167.f7158;
        int m2566 = (C0630.m2566("ۙܶ") + i3) * 51;
        int i5 = ((m2566 ^ i4) * (-8481)) ^ (-1813095300);
        int i6 = -411119794;
        while (true) {
            i2 = ((((i2 ^ i4) * 2923) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -1917777997:
                case 1279819558:
                    if (C1047.m3599() >= 0) {
                        m2566 = (i3 - C0630.m2566("ۧ۠")) * (-25);
                        i5 = ((m2566 ^ i4) * 29483) ^ 669805125;
                        i6 = -571416384;
                    } else {
                        m2566 = C2105.m6981("֡ۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 26245) ^ 1629863980;
                        i6 = 1660067987;
                    }
                case -1775037016:
                case -1389672862:
                    if (C1916.f6442) {
                        m2566 = (C0630.m2566("᩹֫") + i4) * 59;
                        i5 = ((m2566 ^ i3) * (-5461)) ^ (-25618056);
                        i6 = 2031997183;
                    } else {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    }
                case -1691867637:
                case 1512470311:
                    if (C3683.f11629 >= 0) {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    } else {
                        m2566 = (C0630.m2566("ۖ᩹") + i4) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i5 = ((m2566 ^ i3) * (-8143)) ^ 580613545;
                        i6 = -1395959411;
                    }
                case -1528770851:
                case 104634034:
                    C4159.m12565();
                    m2566 = (C0630.m2566("ܿ۫") ^ i4) * 31;
                    i5 = ((m2566 ^ i3) * 31339) ^ 2124109537;
                    i6 = -2071851623;
                case -1516073579:
                case -705362929:
                    C3911.m11924();
                    C0382.m1848();
                    break;
                case -1378869160:
                case 379417627:
                    if (C0382.f1805) {
                        m2566 = (C0630.m2566("ܿ۫") ^ i4) * 31;
                        i5 = ((m2566 ^ i3) * 31339) ^ 2124109537;
                        i6 = -2071851623;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۧ۠")) * (-25);
                        i5 = ((m2566 ^ i4) * 29483) ^ 669805125;
                        i6 = -571416384;
                    }
                case -1297490764:
                case 494861517:
                    if (C3432.f10845 >= 0) {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    } else {
                        m2566 = C0630.m2566("֫۬") ^ i3;
                        i5 = ((m2566 ^ i4) * 18945) ^ (-1872079685);
                        i6 = 849290194;
                    }
                case -1146840605:
                case -474574468:
                    if (C2272.f7362) {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    } else {
                        m2566 = C0630.m2566("֫ۛ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-29889)) ^ (-1523659261);
                        i6 = -840889796;
                    }
                case -1087733148:
                case -610034420:
                    if (C0422.f1886 <= 0) {
                        m2566 = (i3 - C0630.m2566("ۧ۠")) * (-25);
                        i5 = ((m2566 ^ i4) * 29483) ^ 669805125;
                        i6 = -571416384;
                    } else {
                        m2566 = (C2105.m6981("ܳۨ") + i4) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i5 = ((m2566 ^ i3) * 3601) ^ (-1024624910);
                        i6 = 963215077;
                    }
                case -1035618006:
                case 1856859479:
                    if (C1711.f5919) {
                        m2566 = C2105.m6981("᩷ܽ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3633)) ^ 1518297574;
                        i6 = -232099876;
                    } else {
                        m2566 = (i3 - C2105.m6981("ܰܰ")) * 87;
                        i5 = ((m2566 ^ i4) * 25677) ^ 76437011;
                        i6 = -1516832307;
                    }
                case -17907082:
                case 1657919822:
                    C9523.m24397((ContextWrapper) activity);
                    m27942(activity, i, z);
                    break;
                case 216672416:
                case 1296190242:
                    if (C3245.m9925() == 0) {
                        m2566 = (C0630.m2566("ܿ۫") ^ i4) * 31;
                        i5 = ((m2566 ^ i3) * 31339) ^ 2124109537;
                        i6 = -2071851623;
                    } else {
                        m2566 = C2105.m6981("᩷ܽ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3633)) ^ 1518297574;
                        i6 = -232099876;
                    }
                case 378778444:
                case 767624547:
                    if (C2272.f7362) {
                        m2566 = C0630.m2566("ܽۛ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-13557)) ^ (-1247835018);
                        i6 = 1954958144;
                    } else {
                        m2566 = (C0630.m2566("ܶܽ") + i3) * (-15);
                        i5 = ((m2566 ^ i4) * 28811) ^ (-1990351360);
                        i6 = 348956920;
                    }
                case 723048075:
                case 1536529954:
                    C4075.m12263();
                    if (C1005.m3501()) {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    } else {
                        m2566 = C2105.m6981("᩷ܽ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-3633)) ^ 1518297574;
                        i6 = -232099876;
                    }
                case 1205123919:
                case 1683361748:
                    if (C2520.f8000 >= 0) {
                        m2566 = (C0630.m2566("ܿ۫") ^ i4) * 31;
                        i5 = ((m2566 ^ i3) * 31339) ^ 2124109537;
                        i6 = -2071851623;
                    } else {
                        m2566 = C0630.m2566("ۘᩳ") ^ i4;
                        i5 = ((m2566 ^ i3) * 30829) ^ (-493769849);
                        i6 = -1793188453;
                    }
                default:
                    if (C1294.f4556 >= 0) {
                        m2566 = (C2105.m6981("ܳۛ") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-3897)) ^ (-2128685395);
                        i6 = -280513954;
                    } else {
                        m2566 = C2105.m6981("ۡ۫") ^ i3;
                        i5 = ((m2566 ^ i4) * 21183) ^ (-118105108);
                        i6 = -463431111;
                    }
            }
            return;
        }
    }

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public static void m27947(Activity activity, int i, boolean z) {
        int i2 = 434920996;
        int i3 = RunnableC1937.f6483;
        int i4 = C3537.f11231;
        int m2566 = (C0630.m2566("֨ۜ") + i4) * (-53);
        int i5 = ((m2566 ^ i3) * 32241) ^ (-466912710);
        int i6 = -544389522;
        while (true) {
            i2 = ((((i2 ^ i3) * (-27815)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2121345677:
                case 1939661390:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C2105.m6981("۫᩹") ^ i3;
                        i5 = ((m2566 ^ i4) * 10751) ^ (-721599357);
                        i6 = -1768037603;
                    } else {
                        m2566 = (C2105.m6981("ܺᩳ") ^ i4) * 63;
                        i5 = ((m2566 ^ i3) * 26079) ^ 1597961522;
                        i6 = 1805629172;
                    }
                case -2104330040:
                case 507653759:
                    C1128.m3851();
                    if (C7106.f21815 == 0) {
                        m2566 = (C0630.m2566("ܶ᩶") ^ i4) * (-73);
                        i5 = ((m2566 ^ i3) * (-14073)) ^ 696656308;
                        i6 = 698095323;
                    } else {
                        m2566 = C2105.m6981("۫᩹") ^ i3;
                        i5 = ((m2566 ^ i4) * 10751) ^ (-721599357);
                        i6 = -1768037603;
                    }
                case -2075271630:
                case -144957319:
                    if (C22628.f73083 <= 0) {
                        m2566 = (C2105.m6981("᩶᩹") + i4) * (-109);
                        i5 = ((m2566 ^ i3) * (-11639)) ^ (-69260942);
                        i6 = -1399909112;
                    } else {
                        m2566 = C2105.m6981("ۛܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * 2131) ^ (-1589974592);
                        i6 = -516359488;
                    }
                case -2025026073:
                case -523362219:
                    C2958.m9034();
                    C2167.m7155();
                    break;
                case -1936465736:
                case -1278478087:
                    if (C4159.m12565() >= 0) {
                        m2566 = (C0630.m2566("ܶ᩶") ^ i4) * (-73);
                        i5 = ((m2566 ^ i3) * (-14073)) ^ 696656308;
                        i6 = 698095323;
                    } else {
                        m2566 = C2105.m6981("ܳۤ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-27061)) ^ 1294648950;
                        i6 = 2050961570;
                    }
                case -1417225479:
                case 1726005908:
                    if (C0964.f3626 != 0) {
                        m2566 = C2105.m6981("۫᩹") ^ i3;
                        i5 = ((m2566 ^ i4) * 10751) ^ (-721599357);
                        i6 = -1768037603;
                    } else {
                        m2566 = (C2105.m6981("᩻ۡ") ^ i4) * 87;
                        i5 = ((m2566 ^ i3) * (-561)) ^ 1940020627;
                        i6 = -1198838680;
                    }
                case -1309590885:
                case 1514622811:
                    if (C3537.f11231 >= 0) {
                        m2566 = C2105.m6981("ܳۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-4619)) ^ (-2082528842);
                        i6 = 1898781035;
                    } else {
                        m2566 = C2105.m6981("ۨۨ") ^ i3;
                        i5 = ((m2566 ^ i4) * 23487) ^ (-195105123);
                        i6 = -494935964;
                    }
                case -1283812649:
                case -1281140598:
                    if (C2958.f9394 >= 0) {
                        m2566 = (i4 - C2105.m6981("ܿ֫")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i5 = ((m2566 ^ i3) * (-12621)) ^ (-1013904093);
                        i6 = 430568218;
                    } else {
                        m2566 = (C0630.m2566("֡ۜ") + i3) * (-57);
                        i5 = ((m2566 ^ i4) * (-16993)) ^ 1182485684;
                        i6 = 2071337175;
                    }
                case -1138352867:
                case 409260605:
                    C1005.m3501();
                    C3746.m11369();
                    m2566 = C2105.m6981("ܳۧ") ^ i3;
                    i5 = ((m2566 ^ i4) * (-4619)) ^ (-2082528842);
                    i6 = 1898781035;
                case -916285679:
                case 156485490:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (C0630.m2566("ܶ᩶") ^ i4) * (-73);
                        i5 = ((m2566 ^ i3) * (-14073)) ^ 696656308;
                        i6 = 698095323;
                    } else {
                        m2566 = C2105.m6981("ܺ֨") ^ i4;
                        i5 = ((m2566 ^ i3) * (-4451)) ^ (-187738730);
                        i6 = -1946245441;
                    }
                case -321338931:
                case -20722436:
                    if (RunnableC1108.f4040) {
                        m2566 = (C0630.m2566("۫ܶ") ^ i3) * 23;
                        i5 = ((m2566 ^ i4) * 11835) ^ (-1839247476);
                        i6 = -771248506;
                    } else {
                        m2566 = C2105.m6981("ܳۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-4619)) ^ (-2082528842);
                        i6 = 1898781035;
                    }
                case -143553992:
                case 1688666243:
                    if (C1711.f5919) {
                        m2566 = C2105.m6981("ܳۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-4619)) ^ (-2082528842);
                        i6 = 1898781035;
                    } else {
                        m2566 = (C2105.m6981("᩶᩹") + i4) * (-109);
                        i5 = ((m2566 ^ i3) * (-11639)) ^ (-69260942);
                        i6 = -1399909112;
                    }
                case 125750489:
                case 1526243368:
                    if (C3911.f12484 >= 0) {
                        m2566 = C2105.m6981("ܳۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-4619)) ^ (-2082528842);
                        i6 = 1898781035;
                    } else {
                        m2566 = (C0630.m2566("ܶ᩶") ^ i4) * (-73);
                        i5 = ((m2566 ^ i3) * (-14073)) ^ 696656308;
                        i6 = 698095323;
                    }
                case 558178174:
                case 1258814852:
                    if (C4159.f13567) {
                        m2566 = C0630.m2566("ܺۡ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12093) ^ (-636841366);
                        i6 = 573096244;
                    } else {
                        m2566 = (C0630.m2566("ܶ᩶") ^ i4) * (-73);
                        i5 = ((m2566 ^ i3) * (-14073)) ^ 696656308;
                        i6 = 698095323;
                    }
                case 1893465646:
                case 2090138306:
                    if (C2105.f7037 != 0) {
                        m2566 = (C2105.m6981("᩶᩹") + i4) * (-109);
                        i5 = ((m2566 ^ i3) * (-11639)) ^ (-69260942);
                        i6 = -1399909112;
                    } else {
                        m2566 = (i4 - C2105.m6981("ܶܽ")) * 81;
                        i5 = ((m2566 ^ i3) * 18751) ^ 2098954170;
                        i6 = -398898012;
                    }
                default:
                    C9523.m24397((ContextWrapper) activity);
                    m27942(activity, i, z);
                    break;
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m27943(Context context) {
        m27946(context);
        ServiceC19288.m44482();
    }
}
