package l;

import java.util.ArrayList;
import java.util.HashMap;

/* compiled from: G1XN */
/* renamed from: l.ۨۖ᩷, reason: contains not printable characters */
/* loaded from: classes4.dex */
public class C11423 extends AbstractC5447 {

    /* renamed from: ۗ, reason: not valid java name and contains not printable characters */
    public HashMap f34164;

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public ArrayList f34165;

    /* renamed from: ۫, reason: not valid java name and contains not printable characters */
    public boolean f34166;

    /* renamed from: ۬, reason: not valid java name and contains not printable characters */
    public HashMap f34167;

    public C11423() {
        HashMap hashMap = null;
        int i = 162793114;
        int i2 = RunnableC0588.f2309;
        int i3 = C3019.f9544;
        int m6981 = C2105.m6981("ۤܽ") ^ i3;
        int i4 = ((m6981 ^ i2) * (-9769)) ^ 1513526295;
        int i5 = -1477513196;
        while (true) {
            i = ((((i ^ i2) * (-32407)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1945433138:
                case -108287934:
                    if (RunnableC3474.m10630()) {
                        m6981 = (i3 - C0630.m2566("ᩴۛ")) * (-73);
                        i4 = ((m6981 ^ i2) * 11917) ^ (-825466165);
                        i5 = -884609718;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩵") + i2) * 5;
                        i4 = ((m6981 ^ i3) * 9347) ^ 699364860;
                        i5 = -673784956;
                    }
                case -1904300959:
                case -20764729:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = C0630.m2566("ܰ֡") ^ i2;
                        i4 = ((m6981 ^ i3) * (-19731)) ^ 1817402660;
                        i5 = 1572080020;
                    } else {
                        m6981 = C2105.m6981("ܽ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16853)) ^ 1876280922;
                        i5 = -668891201;
                    }
                case -1636094539:
                case 264103076:
                    if (C4263.m12819() >= 0) {
                        m6981 = (i3 - C2105.m6981("᩷ۘ")) * 53;
                        i4 = ((m6981 ^ i2) * (-24329)) ^ (-1090118255);
                        i5 = 896311557;
                    } else {
                        m6981 = (C2105.m6981("ۜܰ") + i2) * (-75);
                        i4 = ((m6981 ^ i3) * 6289) ^ (-1223137949);
                        i5 = -986205602;
                    }
                case -1623992628:
                case -702138026:
                    if (C1504.f5354) {
                        m6981 = C0630.m2566("ܰ֡") ^ i2;
                        i4 = ((m6981 ^ i3) * (-19731)) ^ 1817402660;
                        i5 = 1572080020;
                    } else {
                        m6981 = (i3 - C2105.m6981("᩷ۘ")) * 53;
                        i4 = ((m6981 ^ i2) * (-24329)) ^ (-1090118255);
                        i5 = 896311557;
                    }
                case -1219289096:
                case -1001450934:
                    C22628.m50615();
                    throw new RuntimeException();
                case -1148133142:
                case 2141516594:
                    if (C3911.f12484 >= 0) {
                        m6981 = (i3 - C2105.m6981("᩷ۘ")) * 53;
                        i4 = ((m6981 ^ i2) * (-24329)) ^ (-1090118255);
                        i5 = 896311557;
                    } else {
                        m6981 = C0630.m2566("ܿܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 17571) ^ 351761520;
                        i5 = -164560986;
                    }
                case -911286813:
                case 822614479:
                    this.f34167 = new HashMap();
                    return;
                case -640941885:
                case 582002698:
                    if (C1711.f5919) {
                        m6981 = (i2 - C2105.m6981("ܿ᩹")) * 21;
                        i4 = ((m6981 ^ i3) * (-8953)) ^ 1472068263;
                        i5 = 436699347;
                    } else {
                        m6981 = C0630.m2566("֨֡") ^ i2;
                        i4 = ((m6981 ^ i3) * 18581) ^ 1328312632;
                        i5 = 394651447;
                    }
                case -157377755:
                case 117352238:
                    if (C3245.f10203 <= 0) {
                        m6981 = C0630.m2566("ܿܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 17571) ^ 351761520;
                        i5 = -164560986;
                    } else {
                        m6981 = (i2 - C0630.m2566("֨ᩴ")) * 67;
                        i4 = ((m6981 ^ i3) * (-27619)) ^ (-914686956);
                        i5 = -1233908354;
                    }
                case -128713312:
                case 1246733629:
                    hashMap = new HashMap();
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("ܿܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 17571) ^ 351761520;
                        i5 = -164560986;
                    } else {
                        m6981 = (C0630.m2566("۠۠") ^ i3) * (-15);
                        i4 = ((m6981 ^ i2) * 3151) ^ (-1697017079);
                        i5 = 1701335632;
                    }
                case -87353577:
                case 1770243926:
                    this.f34164 = hashMap;
                    if (C2272.f7362) {
                        m6981 = (i2 - C2105.m6981("ܿ᩹")) * 21;
                        i4 = ((m6981 ^ i3) * (-8953)) ^ 1472068263;
                        i5 = 436699347;
                    } else {
                        m6981 = C0630.m2566("۠֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-20827)) ^ 193926984;
                        i5 = 604999384;
                    }
                case 245926013:
                case 668730049:
                    if (C1504.f5354) {
                        m6981 = (C2105.m6981("ܺ᩵") + i2) * 5;
                        i4 = ((m6981 ^ i3) * 9347) ^ 699364860;
                        i5 = -673784956;
                    } else {
                        m6981 = (C0630.m2566("۬֡") ^ i2) * (-47);
                        i4 = ((m6981 ^ i3) * (-13357)) ^ 89633906;
                        i5 = 1131405048;
                    }
                case 356085752:
                case 1994630304:
                    if (C1128.f4106 <= 0) {
                        m6981 = C0630.m2566("ܰ֡") ^ i2;
                        i4 = ((m6981 ^ i3) * (-19731)) ^ 1817402660;
                        i5 = 1572080020;
                    } else {
                        m6981 = C0630.m2566("ܳܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-10537)) ^ 655968193;
                        i5 = 1077352715;
                    }
                case 462524801:
                case 724839529:
                    C1773.m5908();
                    if (C2272.f7362) {
                        m6981 = (i3 - C2105.m6981("᩷ۘ")) * 53;
                        i4 = ((m6981 ^ i2) * (-24329)) ^ (-1090118255);
                        i5 = 896311557;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩵") + i2) * 5;
                        i4 = ((m6981 ^ i3) * 9347) ^ 699364860;
                        i5 = -673784956;
                    }
                case 897640513:
                case 1750365568:
                    if (C4075.f12947 >= 0) {
                        m6981 = (i2 - C2105.m6981("ܿ᩹")) * 21;
                        i4 = ((m6981 ^ i3) * (-8953)) ^ 1472068263;
                        i5 = 436699347;
                    } else {
                        m6981 = (C2105.m6981("᩶ۖ") + i3) * (-5);
                        i4 = ((m6981 ^ i2) * 4409) ^ 1060155382;
                        i5 = 1417003540;
                    }
                default:
                    C2167.m7155();
                    m6981 = C0630.m2566("ܰ֡") ^ i2;
                    i4 = ((m6981 ^ i3) * (-19731)) ^ 1817402660;
                    i5 = 1572080020;
            }
        }
    }
}
