package l;

import com.alipay.sdk.m.y.q;
import java.util.ArrayList;

/* compiled from: G9A5 */
/* renamed from: l.ۨ۟ܽ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final class C11561 extends AbstractC7548 {

    /* renamed from: ᩵᩺᩷, reason: not valid java name and contains not printable characters */
    private static final short[] f34499 = {8669, -17754, -17737, -17737, -17677, -17666, -17737, -17671, -17745, -17687, -17679, -17674, -17752, -17751, -17679, -17680, -17676, -17666, -17668, -17737, -17737, -17756};

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public final ArrayList f34500;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ActivityC13676 f34501;

    public C11561(ActivityC13676 activityC13676) {
        ArrayList arrayList = null;
        int i = 2012980417;
        int i2 = C0714.f2697;
        int i3 = C7811.f24123;
        this.f34501 = activityC13676;
        int m2566 = C0630.m2566("֨ۧ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-20057)) ^ (-1594160060);
        int i5 = 44160034;
        while (true) {
            i = ((((i ^ i3) * 17557) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2075188583:
                case 1744612946:
                    C1711.m5736();
                    C0630.m2564();
                    m2566 = (i3 - C0630.m2566("᩷ۗ")) * (-29);
                    i4 = ((m2566 ^ i2) * 21713) ^ (-1626423393);
                    i5 = 328872198;
                case -1930528768:
                case -1472011865:
                    arrayList = new ArrayList();
                    if (C1504.f5354) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17497)) ^ (-372793004);
                        i5 = -1907741185;
                    } else {
                        m2566 = C0630.m2566("ܿۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * 23629) ^ 1028264672;
                        i5 = -1799764264;
                    }
                case -1929552825:
                case -1529353088:
                    if (AbstractC2021.f6743 <= 0) {
                        m2566 = C2105.m6981("ۨۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-14163)) ^ (-1459967003);
                        i5 = -374118221;
                    } else {
                        m2566 = (C2105.m6981("۬᩶") + i3) * (-113);
                        i4 = ((m2566 ^ i2) * 17421) ^ 272895422;
                        i5 = 1728980339;
                    }
                case -1018282781:
                case 452344646:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17497)) ^ (-372793004);
                        i5 = -1907741185;
                    } else {
                        m2566 = (C2105.m6981("᩹۬") + i3) * (-29);
                        i4 = ((m2566 ^ i2) * (-10539)) ^ (-1958286463);
                        i5 = -2134272475;
                    }
                case -941058578:
                case 422847933:
                    if (C21923.f70183 != 0) {
                        m2566 = C0630.m2566("֨ۘ") ^ i2;
                        i4 = ((m2566 ^ i3) * 31711) ^ 165928761;
                        i5 = -1688409408;
                    } else {
                        m2566 = (C0630.m2566("ۜۧ") ^ i3) * (-115);
                        i4 = ((m2566 ^ i2) * (-13437)) ^ 470774518;
                        i5 = 420591248;
                    }
                case -879924173:
                case 568910852:
                    C2272.m7503();
                    C2520.m8026();
                    throw new RuntimeException();
                case -676715774:
                case 455171558:
                    if (C2126.m7040()) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17497)) ^ (-372793004);
                        i5 = -1907741185;
                    } else {
                        m2566 = C2105.m6981("֨۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-20049)) ^ 1734718898;
                        i5 = 1893273808;
                    }
                case -304164231:
                case 137600204:
                    if (C2126.m7040()) {
                        m2566 = C0630.m2566("֨ۘ") ^ i2;
                        i4 = ((m2566 ^ i3) * 31711) ^ 165928761;
                        i5 = -1688409408;
                    } else {
                        m2566 = C2105.m6981("֡ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 13429) ^ (-1601868640);
                        i5 = 2001770808;
                    }
                case -115394916:
                case 1571532675:
                    if (C3245.m9925() != 0) {
                        m2566 = C2105.m6981("ۨۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-14163)) ^ (-1459967003);
                        i5 = -374118221;
                    } else {
                        m2566 = C0630.m2566("ᩳܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * 27169) ^ (-1587237740);
                        i5 = -1429036149;
                    }
                case -23675767:
                case 463179961:
                    this.f34500 = arrayList;
                    return;
                case 194632557:
                case 748888798:
                    if (C7811.f24123 < 0) {
                        m2566 = (i3 - C0630.m2566("᩷ۗ")) * (-29);
                        i4 = ((m2566 ^ i2) * 21713) ^ (-1626423393);
                        i5 = 328872198;
                    } else {
                        m2566 = C2105.m6981("ۨۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-14163)) ^ (-1459967003);
                        i5 = -374118221;
                    }
                case 323003212:
                case 478763848:
                    if (C0422.f1886 <= 0) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17497)) ^ (-372793004);
                        i5 = -1907741185;
                    } else {
                        m2566 = C2105.m6981("ܰ᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * (-26203)) ^ (-217908129);
                        i5 = -1753495834;
                    }
                case 353584877:
                case 1670535298:
                    C0714.m2805();
                    if (C1294.f4556 < 0) {
                        m2566 = (i3 - C0630.m2566("᩷ۗ")) * (-29);
                        i4 = ((m2566 ^ i2) * 21713) ^ (-1626423393);
                        i5 = 328872198;
                    } else {
                        m2566 = C0630.m2566("᩶֨") ^ i3;
                        i4 = ((m2566 ^ i2) * (-25477)) ^ (-225195253);
                        i5 = -1655644565;
                    }
                case 919433742:
                case 1399130862:
                    if (C0630.f2410 <= 0) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17497)) ^ (-372793004);
                        i5 = -1907741185;
                    } else {
                        m2566 = C0630.m2566("ᩴ֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 12971) ^ 1348614792;
                        i5 = 354685040;
                    }
                case 1469215083:
                case 1882436325:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = C0630.m2566("֨ۘ") ^ i2;
                        i4 = ((m2566 ^ i3) * 31711) ^ 165928761;
                        i5 = -1688409408;
                    } else {
                        m2566 = (C0630.m2566("֡ܰ") ^ i2) * 81;
                        i4 = ((m2566 ^ i3) * 32045) ^ (-1822894511);
                        i5 = 838591836;
                    }
                default:
                    if (C7106.f21815 != 0) {
                        m2566 = (i3 - C0630.m2566("᩷ۗ")) * (-29);
                        i4 = ((m2566 ^ i2) * 21713) ^ (-1626423393);
                        i5 = 328872198;
                    } else {
                        m2566 = C0630.m2566("֨ۘ") ^ i2;
                        i4 = ((m2566 ^ i3) * 31711) ^ 165928761;
                        i5 = -1688409408;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    public final void mo1008() {
        m20272(this.f34501, 300);
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x006e, code lost:
    
        if (l.C7811.f24123 >= 0) goto L62;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x0076, code lost:
    
        if (l.C0382.m1848() == false) goto L17;
     */
    /* JADX WARN: Code restructure failed: missing block: B:19:0x0081, code lost:
    
        r1 = l.C2105.m6981("ۚ᩸") ^ r20;
        r14 = ((r1 ^ r21) * (-11995)) ^ (-1881784490);
        r23 = -989701983;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x007d, code lost:
    
        if (l.C1005.m3501() != false) goto L62;
     */
    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1009() {
        /*
            Method dump skipped, instructions count: 950
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C11561.mo1009():void");
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1006() {
        this.f34501.m29791(this.f34500);
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        C0237.m1487(this);
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        ActivityC13676 activityC13676 = null;
        int i = 2050171722;
        int i2 = C3245.f10203;
        int i3 = C3019.f9544;
        int m2566 = C0630.m2566("᩷ᩴ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-31573)) ^ (-61703460);
        int i5 = 517585746;
        while (true) {
            i = ((((i ^ i3) * (-23157)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1824256616:
                case -1012778611:
                    C2105.m6982();
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C0630.m2566("᩵ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30653)) ^ (-785468834);
                        i5 = -775412350;
                    } else {
                        m2566 = C2105.m6981("۫ܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8175)) ^ (-489399702);
                        i5 = 842959359;
                    }
                case -1812345366:
                case 262309029:
                    if (C1711.f5919) {
                        m2566 = C2105.m6981("ᩴۡ") ^ i3;
                        i4 = ((m2566 ^ i2) * 20307) ^ 30220852;
                        i5 = -565557356;
                    } else {
                        m2566 = C2105.m6981("ܳ֫") ^ i2;
                        i4 = ((m2566 ^ i3) * 4609) ^ 73725899;
                        i5 = -224790849;
                    }
                case -1673168817:
                case -1145337596:
                    if (C0964.m3413()) {
                        m2566 = (i3 - C0630.m2566("۠᩻")) * 65;
                        i4 = ((m2566 ^ i2) * 927) ^ 1086046271;
                        i5 = 339758915;
                    } else {
                        m2566 = C0630.m2566("ܳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12151)) ^ (-1389096494);
                        i5 = 1011733926;
                    }
                case -1332540865:
                case 921705634:
                    if (C3019.m9255() <= 0) {
                        m2566 = C0630.m2566("ܳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12151)) ^ (-1389096494);
                        i5 = 1011733926;
                    } else {
                        m2566 = (C0630.m2566("ܿܶ") + i3) * 97;
                        i4 = ((m2566 ^ i2) * 26005) ^ (-1664951087);
                        i5 = 2145554162;
                    }
                case -1233379284:
                case 1017359847:
                    if (C2272.m7503()) {
                        m2566 = C2105.m6981("ᩴۡ") ^ i3;
                        i4 = ((m2566 ^ i2) * 20307) ^ 30220852;
                        i5 = -565557356;
                    } else {
                        m2566 = C2105.m6981("֡ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-3289)) ^ 1472348890;
                        i5 = 889300055;
                    }
                case -1126136858:
                case -1090785225:
                    if (C3432.f10845 >= 0) {
                        m2566 = C0630.m2566("ܳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12151)) ^ (-1389096494);
                        i5 = 1011733926;
                    } else {
                        m2566 = (C0630.m2566("ᩳۧ") ^ i2) * (-33);
                        i4 = ((m2566 ^ i3) * 21739) ^ 371692833;
                        i5 = 1051348987;
                    }
                case -1073443115:
                case 483838049:
                    activityC13676 = this.f34501;
                    if (C11340.f33930 >= 0) {
                        m2566 = C2105.m6981("ᩴۡ") ^ i3;
                        i4 = ((m2566 ^ i2) * 20307) ^ 30220852;
                        i5 = -565557356;
                    } else {
                        m2566 = (C2105.m6981("ۨ۬") + i3) * q.h;
                        i4 = ((m2566 ^ i2) * (-11475)) ^ 1289276995;
                        i5 = 1245100413;
                    }
                case -805588516:
                case -773020170:
                    C3911.m11924();
                    if (C0050.f910 >= 0) {
                        m2566 = C0630.m2566("᩵ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30653)) ^ (-785468834);
                        i5 = -775412350;
                    } else {
                        m2566 = (C0630.m2566("ۚ᩶") ^ i2) * (-25);
                        i4 = ((m2566 ^ i3) * (-17453)) ^ (-1341385855);
                        i5 = 1639911905;
                    }
                case -790607345:
                case -686684028:
                    if (C1916.f6442) {
                        m2566 = (C2105.m6981("ۗ۟") ^ i2) * (-91);
                        i4 = ((m2566 ^ i3) * (-29843)) ^ 497923588;
                        i5 = -1575463711;
                    } else {
                        m2566 = C2105.m6981("ᩴۡ") ^ i3;
                        i4 = ((m2566 ^ i2) * 20307) ^ 30220852;
                        i5 = -565557356;
                    }
                case -592918017:
                case 1970246293:
                    if (C1504.f5354) {
                        m2566 = C0630.m2566("ܳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12151)) ^ (-1389096494);
                        i5 = 1011733926;
                    } else {
                        m2566 = C0630.m2566("ۨ᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * 1079) ^ (-1683478836);
                        i5 = 2119742615;
                    }
                case -543171158:
                case -157632563:
                    C1128.m3851();
                    C11340.m28031();
                    m2566 = C0630.m2566("᩵ۙ") ^ i2;
                    i4 = ((m2566 ^ i3) * (-30653)) ^ (-785468834);
                    i5 = -775412350;
                case -329060655:
                case 393759081:
                    if (C1047.m3599() >= 0) {
                        m2566 = C2105.m6981("۫ܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8175)) ^ (-489399702);
                        i5 = 842959359;
                    } else {
                        m2566 = (C2105.m6981("ۘ᩵") ^ i3) * 41;
                        i4 = ((m2566 ^ i2) * (-32119)) ^ (-1737350962);
                        i5 = -1251862159;
                    }
                case -206420242:
                case 1913238116:
                    C5695.m16023();
                    break;
                case 462288966:
                case 1115356249:
                    C4075.m12246(activityC13676, exc, null);
                    break;
                case 870904969:
                case 1943250770:
                    if (ViewOnClickListenerC1958.m6429() >= 0) {
                        m2566 = C0630.m2566("᩵ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30653)) ^ (-785468834);
                        i5 = -775412350;
                    } else {
                        m2566 = C0630.m2566("ܳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12151)) ^ (-1389096494);
                        i5 = 1011733926;
                    }
                default:
                    if (C3663.m11168() >= 0) {
                        m2566 = C2105.m6981("۫ܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8175)) ^ (-489399702);
                        i5 = 842959359;
                    } else {
                        m2566 = C0630.m2566("ۢۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-237)) ^ (-1763700009);
                        i5 = -1669172123;
                    }
            }
            return;
        }
    }
}
