package l;

import android.graphics.Bitmap;
import android.graphics.drawable.Drawable;
import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: 4649 */
/* renamed from: l.ۨܺ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C11813 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public boolean f35235;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public Bitmap f35236;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public Drawable f35237;

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public int f35238;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public InterfaceC1629 f35239;

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static C11813 m28875(Bitmap bitmap) {
        C11813 c11813 = null;
        boolean z = false;
        int i = 1824276119;
        int i2 = C3432.f10845;
        int i3 = C22628.f73083;
        int m6981 = (C2105.m6981("ܺ᩻") ^ i3) * 75;
        int i4 = ((m6981 ^ i2) * (-20881)) ^ (-1127634025);
        int i5 = -1804997160;
        while (true) {
            i = ((((i ^ i2) * 26285) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1940503303:
                case -155717377:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32165)) ^ (-814137020);
                        i5 = -1613125568;
                    } else {
                        m6981 = C2105.m6981("ۡۜ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11707)) ^ (-2055665485);
                        i5 = 218800530;
                    }
                case -1903689280:
                case 1543099954:
                    if (C3019.f9544 >= 0) {
                        m6981 = (C2105.m6981("ܳܰ") + i2) * 53;
                        i4 = ((m6981 ^ i3) * 14387) ^ 2032333661;
                        i5 = -1991828652;
                    } else {
                        m6981 = C0630.m2566("᩹۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 20813) ^ (-1332163765);
                        i5 = -1387810163;
                    }
                case -1774314456:
                case -1439017762:
                    C0237.m1481();
                    C1420.m4913();
                    m6981 = (C0630.m2566("֫۠") + i2) * 119;
                    i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                    i5 = 2108861433;
                case -1441278800:
                case 1759788640:
                    if (C0964.f3626 == 0) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32165)) ^ (-814137020);
                        i5 = -1613125568;
                    } else {
                        m6981 = C0630.m2566("ܶۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-6767)) ^ 1277376158;
                        i5 = -181690252;
                    }
                case -1428951251:
                case 1600466114:
                    z = true;
                    if (C0798.m2998() != 0) {
                        m6981 = (i2 - C0630.m2566("ۤ֨")) * (-81);
                        i4 = ((m6981 ^ i3) * 12689) ^ 272779903;
                        i5 = -600787268;
                    } else {
                        m6981 = (C2105.m6981("᩹ۛ") + i2) * 85;
                        i4 = ((m6981 ^ i3) * (-29247)) ^ 885473570;
                        i5 = -1789057134;
                    }
                case -1342150203:
                case 1191838311:
                    if (C1294.m4372() <= 0) {
                        m6981 = (C0630.m2566("֫۠") + i2) * 119;
                        i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                        i5 = 2108861433;
                    } else {
                        m6981 = C0630.m2566("ܰ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 15997) ^ 2132187072;
                        i5 = -813034629;
                    }
                case -1255348039:
                case 407949879:
                    if (C0422.f1886 <= 0) {
                        m6981 = C0630.m2566("ܶۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-6767)) ^ 1277376158;
                        i5 = -181690252;
                    } else {
                        m6981 = C0630.m2566("ۖ֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 3835) ^ 256753264;
                        i5 = -1445552878;
                    }
                case -1249369632:
                case 976890515:
                    c11813.f35235 = z;
                    c11813.f35237 = m28874(bitmap, z);
                    return c11813;
                case -1060617994:
                case 1735207714:
                    if (C0483.f2088 >= 0) {
                        m6981 = (C0630.m2566("֫۠") + i2) * 119;
                        i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                        i5 = 2108861433;
                    } else {
                        m6981 = (C2105.m6981("ܳܰ") + i2) * 53;
                        i4 = ((m6981 ^ i3) * 14387) ^ 2032333661;
                        i5 = -1991828652;
                    }
                case -648018700:
                case 337597104:
                    c11813 = new C11813();
                    if (AbstractC2021.m6574()) {
                        m6981 = (i2 - C0630.m2566("ۤ֨")) * (-81);
                        i4 = ((m6981 ^ i3) * 12689) ^ 272779903;
                        i5 = -600787268;
                    } else {
                        m6981 = (i3 - C0630.m2566("۬ܿ")) * 63;
                        i4 = ((m6981 ^ i2) * (-5079)) ^ (-736580764);
                        i5 = 633773550;
                    }
                case -396079627:
                case 482484143:
                    if (C1047.f3863 >= 0) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32165)) ^ (-814137020);
                        i5 = -1613125568;
                    } else {
                        m6981 = C0630.m2566("۟ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-8065)) ^ (-50075054);
                        i5 = 1927929695;
                    }
                case -199128099:
                case 646406046:
                    C4263.m12819();
                    if (C0237.f1507 == 0) {
                        m6981 = (C0630.m2566("֫۠") + i2) * 119;
                        i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                        i5 = 2108861433;
                    } else {
                        m6981 = C0630.m2566("ܺ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32165)) ^ (-814137020);
                        i5 = -1613125568;
                    }
                case -185405751:
                case 954825578:
                    c11813.f35236 = bitmap;
                    if (ViewOnClickListenerC1958.m6429() >= 0) {
                        m6981 = (C0630.m2566("֫۠") + i2) * 119;
                        i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                        i5 = 2108861433;
                    } else {
                        m6981 = C2105.m6981("ۤۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-6209)) ^ (-112683796);
                        i5 = 533162099;
                    }
                case -93720536:
                case 1927133671:
                    if (C22628.f73083 <= 0) {
                        m6981 = (i2 - C0630.m2566("ۤ֨")) * (-81);
                        i4 = ((m6981 ^ i3) * 12689) ^ 272779903;
                        i5 = -600787268;
                    } else {
                        m6981 = (C0630.m2566("ܰۜ") ^ i2) * 63;
                        i4 = ((m6981 ^ i3) * (-12017)) ^ (-1572175785);
                        i5 = 1722618499;
                    }
                case 811674974:
                case 2027079727:
                    return null;
                case 821656443:
                case 1570970990:
                    if (bitmap == null) {
                        m6981 = C2105.m6981("᩻᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * 24133) ^ 672151398;
                        i5 = 1295155628;
                    } else {
                        m6981 = C0630.m2566("᩹ۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-6935)) ^ 1849592918;
                        i5 = 1819763797;
                    }
                case 1266124770:
                case 1735296798:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = (C0630.m2566("֫۠") + i2) * 119;
                        i4 = ((m6981 ^ i3) * 21715) ^ (-268698302);
                        i5 = 2108861433;
                    } else {
                        m6981 = (C0630.m2566("ۡܰ") ^ i3) * 67;
                        i4 = ((m6981 ^ i2) * (-21087)) ^ (-2012337410);
                        i5 = -1809173660;
                    }
                default:
                    C4075.m12263();
                    RunnableC1937.m6387();
                    return null;
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static C11813 m28876(InterfaceC1629 interfaceC1629) {
        C11813 c11813 = null;
        int i = -784141077;
        int i2 = RunnableC0588.f2309;
        int i3 = C4075.f12947;
        int m2566 = (C0630.m2566("᩷᩷") + i3) * 75;
        int i4 = ((m2566 ^ i2) * 14453) ^ 770713477;
        int i5 = 1427977224;
        while (true) {
            i = ((((i ^ i2) * 605) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2058713092:
                case -233029456:
                    c11813.f35239 = interfaceC1629;
                    return c11813;
                case -1874168766:
                case 1317247617:
                    if (C4159.f13567) {
                        m2566 = (i3 - C2105.m6981("ۜۜ")) * (-103);
                        i4 = ((m2566 ^ i2) * (-14211)) ^ 833587116;
                        i5 = -1019218095;
                    } else {
                        m2566 = C2105.m6981("᩸ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 1639) ^ 1228080243;
                        i5 = 1400432705;
                    }
                case -1857741802:
                case -1497669152:
                    if (interfaceC1629 == null) {
                        m2566 = (C0630.m2566("ܽۚ") + i2) * (-41);
                        i4 = ((m2566 ^ i3) * 12779) ^ 1612380718;
                        i5 = 1364694165;
                    } else {
                        m2566 = (i3 - C2105.m6981("᩹֨")) * (-21);
                        i4 = ((m2566 ^ i2) * 21867) ^ (-1543243605);
                        i5 = 219275263;
                    }
                case -1705767668:
                case 1789263665:
                    if (C3432.f10845 >= 0) {
                        m2566 = (i3 - C0630.m2566("֨֡")) * (-119);
                        i4 = ((m2566 ^ i2) * (-27673)) ^ (-1452105182);
                        i5 = -273698767;
                    } else {
                        m2566 = C0630.m2566("֫ܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * 17047) ^ (-129702690);
                        i5 = -618806711;
                    }
                case -1584294442:
                case -1396781082:
                    if (C3663.m11168() >= 0) {
                        m2566 = C2105.m6981("۬ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 23479) ^ (-1965011049);
                        i5 = 964814739;
                    } else {
                        m2566 = (i3 - C2105.m6981("᩻ۨ")) * (-27);
                        i4 = ((m2566 ^ i2) * 20165) ^ (-1211439717);
                        i5 = 251009173;
                    }
                case -1327869389:
                case -1311102056:
                    if (C4117.f13076 <= 0) {
                        m2566 = C2105.m6981("᩸ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 1639) ^ 1228080243;
                        i5 = 1400432705;
                    } else {
                        m2566 = C2105.m6981("ۢۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * 15251) ^ 1116841539;
                        i5 = -613155636;
                    }
                case -1268768469:
                case 120098977:
                    return null;
                case -1210985844:
                case 1917936742:
                    C1128.m3851();
                    if (C2520.f8000 < 0) {
                        m2566 = C2105.m6981("ۨۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19333)) ^ 2017269536;
                        i5 = 1781215196;
                    } else {
                        m2566 = C2105.m6981("᩸ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 1639) ^ 1228080243;
                        i5 = 1400432705;
                    }
                case -1030353143:
                case 482783306:
                    if (C3663.f11553) {
                        m2566 = C2105.m6981("۬ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 23479) ^ (-1965011049);
                        i5 = 964814739;
                    } else {
                        m2566 = C2105.m6981("ܿۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * 19995) ^ (-1815637322);
                        i5 = 893769676;
                    }
                case -618610137:
                case 2113830795:
                    RunnableC1108.m3790();
                    C4616.m13552();
                    m2566 = C2105.m6981("ۨۛ") ^ i2;
                    i4 = ((m2566 ^ i3) * (-19333)) ^ 2017269536;
                    i5 = 1781215196;
                case -527706679:
                case 1371449790:
                    if (C7106.f21815 != 0) {
                        m2566 = (i3 - C0630.m2566("֨֡")) * (-119);
                        i4 = ((m2566 ^ i2) * (-27673)) ^ (-1452105182);
                        i5 = -273698767;
                    } else {
                        m2566 = C2105.m6981("ܳܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5091)) ^ 15831891;
                        i5 = -1454396229;
                    }
                case -204469120:
                case 1662258892:
                    C2958.m9034();
                    C2167.m7155();
                    return null;
                case 113569721:
                case 1122405140:
                    if (C3245.f10203 <= 0) {
                        m2566 = C2105.m6981("۬ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 23479) ^ (-1965011049);
                        i5 = 964814739;
                    } else {
                        m2566 = C0630.m2566("᩸ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-6989)) ^ 525827349;
                        i5 = -901620745;
                    }
                case 177631757:
                case 1116266273:
                    if (C4263.f13799 <= 0) {
                        m2566 = C2105.m6981("ۨۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19333)) ^ 2017269536;
                        i5 = 1781215196;
                    } else {
                        m2566 = (i3 - C0630.m2566("֨֡")) * (-119);
                        i4 = ((m2566 ^ i2) * (-27673)) ^ (-1452105182);
                        i5 = -273698767;
                    }
                case 817149257:
                case 1312326360:
                    if (C1005.f3721) {
                        m2566 = C2105.m6981("ܰ۟") ^ i3;
                        i4 = ((m2566 ^ i2) * (-27013)) ^ (-1039158539);
                        i5 = 303036795;
                    } else {
                        m2566 = C2105.m6981("ۨۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19333)) ^ 2017269536;
                        i5 = 1781215196;
                    }
                case 930248527:
                case 1109029199:
                    if (C3746.f11829 <= 0) {
                        m2566 = C2105.m6981("۬ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 23479) ^ (-1965011049);
                        i5 = 964814739;
                    } else {
                        m2566 = (C2105.m6981("۫ܿ") + i2) * 29;
                        i4 = ((m2566 ^ i3) * (-31923)) ^ 638683623;
                        i5 = 694138813;
                    }
                case 1449738126:
                case 1492820874:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m2566 = C2105.m6981("۬ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 23479) ^ (-1965011049);
                        i5 = 964814739;
                    } else {
                        m2566 = C2105.m6981("ᩳۨ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-20103)) ^ (-1333312034);
                        i5 = 2051304381;
                    }
                default:
                    c11813 = new C11813();
                    if (C1047.f3863 >= 0) {
                        m2566 = C2105.m6981("ۨۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19333)) ^ 2017269536;
                        i5 = 1781215196;
                    } else {
                        m2566 = C2105.m6981("ᩴۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-25721)) ^ 1960184143;
                        i5 = -2059504378;
                    }
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final Bitmap m28877() {
        InterfaceC1629 interfaceC1629 = null;
        Bitmap bitmap = null;
        Object obj = null;
        Bitmap bitmap2 = null;
        boolean z = false;
        int i = 1465193314;
        int i2 = C4616.f14690;
        int i3 = C2520.f8000;
        int m2566 = (C0630.m2566("ۙ᩷") + i2) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
        int i4 = ((m2566 ^ i3) * (-29155)) ^ (-1940669322);
        int i5 = -192982329;
        while (true) {
            i = ((((i ^ i3) * 32599) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2113359413:
                case -1603746838:
                    if (this.f35238 != C21943.f70295) {
                        m2566 = C2105.m6981("ۧۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * 11909) ^ 823628308;
                        i5 = -178567158;
                    } else {
                        m2566 = (i2 - C0630.m2566("۟ۙ")) * 57;
                        i4 = ((m2566 ^ i3) * 4833) ^ 493548331;
                        i5 = 191892384;
                    }
                case -2082102308:
                case 611955243:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C2105.m6981("ܶܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                        i5 = -1307304421;
                    } else {
                        m2566 = C2105.m6981("᩸֡") ^ i3;
                        i4 = ((m2566 ^ i2) * 19321) ^ 1112188359;
                        i5 = 1744847670;
                    }
                case -1934654835:
                case -1153273271:
                    interfaceC1629 = this.f35239;
                    if (C2105.f7037 != 0) {
                        m2566 = (C2105.m6981("ۤۗ") ^ i2) * 115;
                        i4 = ((m2566 ^ i3) * (-28009)) ^ (-299951010);
                        i5 = -356382842;
                    } else {
                        m2566 = (C2105.m6981("ᩳۤ") ^ i3) * (-83);
                        i4 = ((m2566 ^ i2) * 9505) ^ 390461843;
                        i5 = -5856333;
                    }
                case -1933561361:
                case 245273162:
                    C0050.m940();
                    if (C3432.f10845 < 0) {
                        m2566 = (C2105.m6981("ᩳۡ") ^ i3) * (-41);
                        i4 = ((m2566 ^ i2) * 7397) ^ (-299707948);
                        i5 = 1976493869;
                    } else {
                        m2566 = C0630.m2566("֨᩸") ^ i2;
                        i4 = ((m2566 ^ i3) * (-23955)) ^ 1032314488;
                        i5 = -454142973;
                    }
                case -1798066538:
                case -1451140449:
                    return bitmap;
                case -1687564386:
                case 881777067:
                    if (bitmap != null) {
                        m2566 = C0630.m2566("۠᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * 2731) ^ (-965404041);
                        i5 = -1531740003;
                    } else {
                        m2566 = C2105.m6981("ۧۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * 11909) ^ 823628308;
                        i5 = -178567158;
                    }
                case -1601983248:
                case 170578154:
                    RunnableC0588.m2441();
                    if (C4075.f12947 >= 0) {
                        m2566 = C2105.m6981("ܶܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                        i5 = -1307304421;
                    } else {
                        m2566 = (C2105.m6981("ᩳۡ") ^ i3) * (-41);
                        i4 = ((m2566 ^ i2) * 7397) ^ (-299707948);
                        i5 = 1976493869;
                    }
                case -1545909107:
                case 235203067:
                    if (C0382.f1805) {
                        m2566 = (C0630.m2566("᩷۠") ^ i3) * (-69);
                        i4 = ((m2566 ^ i2) * (-1119)) ^ 1035854776;
                        i5 = 2143472388;
                    } else {
                        m2566 = (C2105.m6981("ۤۗ") ^ i2) * 115;
                        i4 = ((m2566 ^ i3) * (-28009)) ^ (-299951010);
                        i5 = -356382842;
                    }
                case -1300131623:
                case -475549365:
                    if (C1773.f6144 <= 0) {
                        m2566 = C2105.m6981("ܶܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                        i5 = -1307304421;
                    } else {
                        m2566 = (C0630.m2566("ܶۙ") ^ i2) * (-83);
                        i4 = ((m2566 ^ i3) * 12979) ^ 755853374;
                        i5 = -808587368;
                    }
                case -1286003193:
                case 2066963251:
                    this.f35237 = m28874(bitmap2, z);
                    return bitmap2;
                case -1235735069:
                case 322213057:
                    obj = interfaceC1629.get();
                    if (C3537.f11231 >= 0) {
                        m2566 = (C2105.m6981("ۤۗ") ^ i2) * 115;
                        i4 = ((m2566 ^ i3) * (-28009)) ^ (-299951010);
                        i5 = -356382842;
                    } else {
                        m2566 = (i2 - C2105.m6981("ۗۖ")) * (-71);
                        i4 = ((m2566 ^ i3) * 24907) ^ 1681151727;
                        i5 = 562607158;
                    }
                case -1098822465:
                case 1190376424:
                    bitmap = this.f35236;
                    if (interfaceC1629 != null) {
                        m2566 = C0630.m2566("ܺۚ") ^ i3;
                        i4 = ((m2566 ^ i2) * 28457) ^ 1018747041;
                        i5 = -1087703265;
                    } else {
                        m2566 = (i2 - C0630.m2566("۟ۙ")) * 57;
                        i4 = ((m2566 ^ i3) * 4833) ^ 493548331;
                        i5 = 191892384;
                    }
                case -1057988996:
                case 1280979198:
                    if (C1773.m5908() <= 0) {
                        m2566 = C0630.m2566("֨᩸") ^ i2;
                        i4 = ((m2566 ^ i3) * (-23955)) ^ 1032314488;
                        i5 = -454142973;
                    } else {
                        m2566 = (C0630.m2566("ۢۢ") + i2) * (-121);
                        i4 = ((m2566 ^ i3) * (-28521)) ^ (-192335366);
                        i5 = -1093700357;
                    }
                case -1034599661:
                case -45774177:
                    C11340.m28031();
                    if (C1047.f3863 >= 0) {
                        m2566 = (C2105.m6981("ᩳۡ") ^ i3) * (-41);
                        i4 = ((m2566 ^ i2) * 7397) ^ (-299707948);
                        i5 = 1976493869;
                    } else {
                        m2566 = C0630.m2566("᩹᩻") ^ i3;
                        i4 = ((m2566 ^ i2) * (-28293)) ^ 1259359336;
                        i5 = 723790726;
                    }
                case -924702392:
                case -606672029:
                    this.f35236 = bitmap2;
                    z = false;
                    if (AbstractC2021.m6574()) {
                        m2566 = C0630.m2566("֨᩸") ^ i2;
                        i4 = ((m2566 ^ i3) * (-23955)) ^ 1032314488;
                        i5 = -454142973;
                    } else {
                        m2566 = C2105.m6981("᩶ۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 3841) ^ (-1683754619);
                        i5 = -258693054;
                    }
                case -740275686:
                case 1160484186:
                    this.f35238 = C21943.f70295;
                    if (C22628.m50615() != 0) {
                        m2566 = C2105.m6981("ܶܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                        i5 = -1307304421;
                    } else {
                        m2566 = (C2105.m6981("᩸ۤ") ^ i3) * 93;
                        i4 = ((m2566 ^ i2) * (-2967)) ^ 1778848378;
                        i5 = 173766331;
                    }
                case -673922437:
                case 1704748673:
                    RunnableC1937.m6387();
                    C3663.m11168();
                    m2566 = C2105.m6981("ܶܳ") ^ i2;
                    i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                    i5 = -1307304421;
                case 985877888:
                case 1193999698:
                    if (C3245.f10203 <= 0) {
                        m2566 = C2105.m6981("ܶܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1651)) ^ 404027355;
                        i5 = -1307304421;
                    } else {
                        m2566 = C0630.m2566("ۨ۠") ^ i2;
                        i4 = ((m2566 ^ i3) * 19425) ^ (-174792082);
                        i5 = 1793143494;
                    }
                case 1672042671:
                case 2070838095:
                    bitmap2 = (Bitmap) obj;
                    if (C4263.f13799 <= 0) {
                        m2566 = (C2105.m6981("ۤۗ") ^ i2) * 115;
                        i4 = ((m2566 ^ i3) * (-28009)) ^ (-299951010);
                        i5 = -356382842;
                    } else {
                        m2566 = (C2105.m6981("ܶ᩶") + i3) * (-65);
                        i4 = ((m2566 ^ i2) * 2925) ^ (-116929065);
                        i5 = 1363100623;
                    }
                default:
                    C0050.m940();
                    C5695.m16023();
                    return null;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:13:0x0030, code lost:
    
        if (l.C4159.f13567 == false) goto L61;
     */
    /* JADX WARN: Code restructure failed: missing block: B:17:0x0039, code lost:
    
        if (l.C3245.f10203 <= 0) goto L61;
     */
    /* JADX WARN: Code restructure failed: missing block: B:21:0x0042, code lost:
    
        if (l.RunnableC1937.f6483 >= 0) goto L61;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static android.graphics.drawable.Drawable m28874(android.graphics.Bitmap r8, boolean r9) {
        /*
            Method dump skipped, instructions count: 652
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C11813.m28874(android.graphics.Bitmap, boolean):android.graphics.drawable.Drawable");
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final Drawable m28878() {
        m28877();
        return this.f35237;
    }

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final Drawable m28879() {
        return m28874(m28877(), this.f35235);
    }
}
