package l;

import bin.mt.plus.Main;
import com.google.android.material.slider.BaseSlider;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.ArrayList;
import java.util.Iterator;
import moe.shizuku.server.IShizukuService;

/* compiled from: P4ND */
/* renamed from: l.۫ۗܽ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public class C12143 extends AbstractC6138 {

    /* renamed from: ᩻֨᩸, reason: not valid java name and contains not printable characters */
    private static final short[] f36242 = {8117, 9446, 9449, 9452, 9445, -16410, -17764, 21962, 22164, 20040, 23358, 9211, 11358, 11345, 11348, 11357, 11336, 11357, 11338, 11358, 11351, 11338, 11349, 11353, 11350, 11355, 11357, 11368, 11338, 11345, 11351, 11338, 11345, 11340, 11329, 11357, 11350, 11353, 11354, 11348, 11357, 11373, 11348, 11340, 11338, 11353, 11347, 11357, 11357, 11336, 11385, 11336, 11347, 11371, 11345, 11359, 11386, 11348, 11351, 11355, 11347, 11286, 11340, 11349, 11336, -20471, -19537, -19014, 11385, 11350, 11356, 11338, 11351, 11345, 11356, 11381, 11353, 11350, 11345, 11358, 11357, 11339, 11340, 11286, 11328, 11349, 11348, 23390, -20137, -20613, -18981, -21448, 17903, 11367, 11351, 11336, 11340, 7778, 5098, -8089, 7936, -28620, -28620, -28620};

    /* renamed from: ۖ֫, reason: not valid java name and contains not printable characters */
    public ArrayList f36243;

    /* renamed from: ܺ֫, reason: not valid java name and contains not printable characters */
    public AbstractC15440 f36244;

    @Override // l.AbstractC3817
    /* renamed from: ֫ */
    public final void mo2777(Main main, C16560 c16560, C16560 c165602, C17222 c17222) {
        int i = 1878358990;
        int i2 = C4616.f14690;
        int i3 = C3537.f11231;
        int m6981 = C2105.m6981("֫ᩳ") ^ i3;
        int i4 = ((m6981 ^ i2) * (-23183)) ^ 1458251192;
        int i5 = 1652691687;
        while (true) {
            i = ((((i ^ i2) * 11489) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2131907396:
                case -1115255048:
                    C7811.m20844();
                    C0483.m2121();
                    break;
                case -2066699775:
                case 1982772320:
                    if (C2272.f7362) {
                        m6981 = (C0630.m2566("ۤۨ") ^ i2) * 49;
                        i4 = ((m6981 ^ i3) * (-887)) ^ (-1987385167);
                        i5 = -115329318;
                    } else {
                        m6981 = (C2105.m6981("ܳ۫") + i2) * 53;
                        i4 = ((m6981 ^ i3) * (-5957)) ^ 1472225163;
                        i5 = 566960736;
                    }
                case -2014810815:
                case 787817154:
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ۖۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-4895)) ^ 308794965;
                        i5 = 1071543458;
                    } else {
                        m6981 = (C2105.m6981("᩹֨") + i3) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m6981 ^ i2) * (-8649)) ^ 1449877008;
                        i5 = 1953642070;
                    }
                case -1989477571:
                case 30971370:
                    if (m11542(c16560)) {
                        m6981 = C0630.m2566("ۚܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * 26077) ^ 2061863455;
                        i5 = 311750479;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۗۗ")) * 37;
                        i4 = ((m6981 ^ i2) * (-477)) ^ 537872537;
                        i5 = 925281879;
                    }
                case -1938409925:
                case 654627377:
                    C2958.m9034();
                    if (C2520.m8026()) {
                        m6981 = (C0630.m2566("᩸᩻") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m6981 ^ i2) * 10183) ^ (-23458797);
                        i5 = 1720923337;
                    } else {
                        m6981 = (C0630.m2566("ۤۨ") ^ i2) * 49;
                        i4 = ((m6981 ^ i3) * (-887)) ^ (-1987385167);
                        i5 = -115329318;
                    }
                case -1937508007:
                case 2030729886:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("ۛ᩶") ^ i3;
                        i4 = ((m6981 ^ i2) * 7111) ^ (-561244065);
                        i5 = -1752926689;
                    } else {
                        m6981 = (C2105.m6981("ۡۜ") ^ i2) * 61;
                        i4 = ((m6981 ^ i3) * (-18221)) ^ (-337109517);
                        i5 = 753787330;
                    }
                case -1935623158:
                case 737840147:
                    if (C1773.f6144 <= 0) {
                        m6981 = C2105.m6981("ۖۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-4895)) ^ 308794965;
                        i5 = 1071543458;
                    } else {
                        m6981 = C0630.m2566("ۘۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2083)) ^ (-538638058);
                        i5 = 1564093980;
                    }
                case -1863624226:
                case -221749807:
                    ServiceConnectionC3453.m10564();
                    if (ServiceConnectionC3453.f10921 < 0) {
                        m6981 = (C0630.m2566("᩸᩻") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m6981 ^ i2) * 10183) ^ (-23458797);
                        i5 = 1720923337;
                    } else {
                        m6981 = C2105.m6981("ۖۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-4895)) ^ 308794965;
                        i5 = 1071543458;
                    }
                case -1566816575:
                case 1089692955:
                    if (C1711.f5919) {
                        m6981 = (C0630.m2566("ۤۨ") ^ i2) * 49;
                        i4 = ((m6981 ^ i3) * (-887)) ^ (-1987385167);
                        i5 = -115329318;
                    } else {
                        m6981 = (C2105.m6981("֡᩺") ^ i3) * (-65);
                        i4 = ((m6981 ^ i2) * 24995) ^ 551505963;
                        i5 = 364344074;
                    }
                case -1481807322:
                case 1178440878:
                    C3683.m11222();
                    if (C4117.f13076 > 0) {
                        m6981 = C2105.m6981("ۖۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-4895)) ^ 308794965;
                        i5 = 1071543458;
                    } else {
                        m6981 = C0630.m2566("֫۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 5009) ^ (-1095025216);
                        i5 = -1429381541;
                    }
                case -1392789313:
                case -1287924603:
                    if (C1504.f5354) {
                        m6981 = (C0630.m2566("᩸᩻") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m6981 ^ i2) * 10183) ^ (-23458797);
                        i5 = 1720923337;
                    } else {
                        m6981 = (C2105.m6981("᩶ۜ") ^ i2) * (-105);
                        i4 = ((m6981 ^ i3) * 6451) ^ 937664606;
                        i5 = 703020034;
                    }
                case -709523725:
                case 354372938:
                    if (C3019.m9255() <= 0) {
                        m6981 = C0630.m2566("ۛ᩶") ^ i3;
                        i4 = ((m6981 ^ i2) * 7111) ^ (-561244065);
                        i5 = -1752926689;
                    } else {
                        m6981 = (C0630.m2566("᩹۠") + i2) * (-101);
                        i4 = ((m6981 ^ i3) * 13139) ^ 624003286;
                        i5 = 829607100;
                    }
                case -295198173:
                case 203708759:
                    C4075.m12263();
                    m6981 = (C0630.m2566("᩸᩻") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                    i4 = ((m6981 ^ i2) * 10183) ^ (-23458797);
                    i5 = 1720923337;
                case 375541741:
                case 2110858017:
                    if (C3019.m9258(c17222)) {
                        m6981 = (C0630.m2566("ۡ᩸") ^ i2) * 29;
                        i4 = ((m6981 ^ i3) * 11081) ^ 975724590;
                        i5 = 1659637649;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۗۗ")) * 37;
                        i4 = ((m6981 ^ i2) * (-477)) ^ 537872537;
                        i5 = 925281879;
                    }
                case 618652376:
                case 2090973589:
                    if (C3911.m11924() <= 0) {
                        m6981 = (C0630.m2566("ۤۨ") ^ i2) * 49;
                        i4 = ((m6981 ^ i3) * (-887)) ^ (-1987385167);
                        i5 = -115329318;
                    } else {
                        m6981 = C2105.m6981("ۤ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * 26987) ^ (-1186141050);
                        i5 = 1561935959;
                    }
                case 875555372:
                case 1150645590:
                    C3683.m11221(c16560, C1005.m3496(this.f36244));
                    c16560.m39015();
                    m6981 = (i3 - C2105.m6981("ۗۗ")) * 37;
                    i4 = ((m6981 ^ i2) * (-477)) ^ 537872537;
                    i5 = 925281879;
                case 936282280:
                case 2077203542:
                    if (C1711.m5736() <= 0) {
                        m6981 = C0630.m2566("֫۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 5009) ^ (-1095025216);
                        i5 = -1429381541;
                    } else {
                        m6981 = (C0630.m2566("۠ۘ") ^ i3) * 83;
                        i4 = ((m6981 ^ i2) * (-13983)) ^ 1118511468;
                        i5 = -1078752339;
                    }
                case 1320148842:
                case 2025425413:
                    break;
                default:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (C0630.m2566("ۤۨ") ^ i2) * 49;
                        i4 = ((m6981 ^ i3) * (-887)) ^ (-1987385167);
                        i5 = -115329318;
                    } else {
                        m6981 = (C2105.m6981("ܿ᩹") + i2) * (-57);
                        i4 = ((m6981 ^ i3) * (-26025)) ^ 1902256605;
                        i5 = 1256993596;
                    }
            }
            return;
        }
    }

    public C12143() {
        ArrayList arrayList = null;
        int i = 1205008614;
        int i2 = C22628.f73083;
        int i3 = C4075.f12947;
        int m6981 = C2105.m6981("ۙ֨") ^ i3;
        int i4 = ((m6981 ^ i2) * 9715) ^ 719099201;
        int i5 = 1302042039;
        while (true) {
            i = ((((i ^ i2) * (-11133)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2030362680:
                case 771025368:
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    } else {
                        m6981 = (C0630.m2566("ۘۡ") ^ i3) * 57;
                        i4 = ((m6981 ^ i2) * (-27835)) ^ (-525756910);
                        i5 = 105376439;
                    }
                case -1931089106:
                case 407226227:
                    C3746.m11369();
                    if (C0050.f910 >= 0) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    } else {
                        m6981 = C2105.m6981("ܽܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-5743)) ^ 38378886;
                        i5 = 835200880;
                    }
                case -1711420092:
                case 841357218:
                    if (C0382.f1805) {
                        m6981 = (C2105.m6981("ۛۗ") + i3) * (-73);
                        i4 = ((m6981 ^ i2) * 24349) ^ (-932279350);
                        i5 = -1253139010;
                    } else {
                        m6981 = (C0630.m2566("᩻ܺ") ^ i2) * (-25);
                        i4 = ((m6981 ^ i3) * 10331) ^ (-1987548535);
                        i5 = -1520436713;
                    }
                case -1693511622:
                case -1323450073:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    } else {
                        m6981 = C2105.m6981("۟۬") ^ i2;
                        i4 = ((m6981 ^ i3) * 5467) ^ 1201912755;
                        i5 = -2012913481;
                    }
                case -1495407862:
                case 913724341:
                    if (ViewOnClickListenerC1958.f6529 > 0) {
                        m6981 = (i3 - C2105.m6981("᩹ۤ")) * (-15);
                        i4 = ((m6981 ^ i2) * (-27857)) ^ 642494101;
                        i5 = 909238010;
                    } else {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    }
                case -1467498094:
                case 613830699:
                    this.f36243 = arrayList;
                    return;
                case -1415958464:
                case 81178925:
                    if (C0964.f3626 != 0) {
                        m6981 = (i3 - C2105.m6981("᩹ۤ")) * (-15);
                        i4 = ((m6981 ^ i2) * (-27857)) ^ 642494101;
                        i5 = 909238010;
                    } else {
                        m6981 = (C0630.m2566("۟᩷") + i3) * (-17);
                        i4 = ((m6981 ^ i2) * (-10245)) ^ (-1888896709);
                        i5 = -2065357835;
                    }
                case -1337719238:
                case 1274318113:
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (i3 - C2105.m6981("᩹ۤ")) * (-15);
                        i4 = ((m6981 ^ i2) * (-27857)) ^ 642494101;
                        i5 = 909238010;
                    } else {
                        m6981 = (C2105.m6981("֫ᩳ") ^ i3) * 87;
                        i4 = ((m6981 ^ i2) * (-21827)) ^ 706378999;
                        i5 = -775118504;
                    }
                case -1187073776:
                case 887861127:
                    C2958.m9034();
                    throw new RuntimeException();
                case -1108951623:
                case 1664833560:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    } else {
                        m6981 = C0630.m2566("ܿ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 8231) ^ (-17628934);
                        i5 = 2115464270;
                    }
                case -977248896:
                case 592199677:
                    arrayList = new ArrayList();
                    if (C7106.f21815 != 0) {
                        m6981 = (C0630.m2566("᩻ܺ") ^ i2) * (-25);
                        i4 = ((m6981 ^ i3) * 10331) ^ (-1987548535);
                        i5 = -1520436713;
                    } else {
                        m6981 = (C2105.m6981("᩺۬") ^ i3) * 65;
                        i4 = ((m6981 ^ i2) * (-30233)) ^ 1525757442;
                        i5 = 796853709;
                    }
                case -769520366:
                case 2145653042:
                    C22628.m50615();
                    m6981 = (i3 - C2105.m6981("᩹ۤ")) * (-15);
                    i4 = ((m6981 ^ i2) * (-27857)) ^ 642494101;
                    i5 = 909238010;
                case -460471074:
                case 1192655264:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ܺ᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * (-8473)) ^ 261935626;
                        i5 = 1242033580;
                    } else {
                        m6981 = C0630.m2566("۠ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * 25445) ^ (-78368622);
                        i5 = -1407313928;
                    }
                case -50780129:
                case 1963379269:
                    if (C3019.f9544 >= 0) {
                        m6981 = C2105.m6981("ܽܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-5743)) ^ 38378886;
                        i5 = 835200880;
                    } else {
                        m6981 = C2105.m6981("ۗۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 11283) ^ 2072183376;
                        i5 = -781313828;
                    }
                case 1513603646:
                case 1937126590:
                    if (C2126.f7087) {
                        m6981 = (C0630.m2566("᩻ܺ") ^ i2) * (-25);
                        i4 = ((m6981 ^ i3) * 10331) ^ (-1987548535);
                        i5 = -1520436713;
                    } else {
                        m6981 = C2105.m6981("ܽۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27849)) ^ (-1424418524);
                        i5 = -1636183577;
                    }
                default:
                    C3746.m11369();
                    if (C2105.f7037 == 0) {
                        m6981 = (i3 - C2105.m6981("᩹ۤ")) * (-15);
                        i4 = ((m6981 ^ i2) * (-27857)) ^ 642494101;
                        i5 = 909238010;
                    } else {
                        m6981 = C2105.m6981("ۡܿ") ^ i3;
                        i4 = ((m6981 ^ i2) * 29823) ^ 1248045956;
                        i5 = 780545708;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:18:0x0080, code lost:
    
        if (l.C1504.f5354 == false) goto L65;
     */
    /* JADX WARN: Code restructure failed: missing block: B:24:0x0089, code lost:
    
        if (l.C3746.f11829 <= 0) goto L34;
     */
    @Override // l.AbstractC3817
    /* renamed from: ᩷ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo2782() {
        /*
            Method dump skipped, instructions count: 788
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12143.mo2782():void");
    }

    @Override // l.AbstractC3817
    /* renamed from: ۠ */
    public final C11813 mo2779() {
        return C23777.f76962;
    }

    @Override // l.AbstractC3817
    /* renamed from: ۧ */
    public final void mo2781(C17222 c17222) {
        Iterator it = null;
        AbstractC15440 abstractC15440 = null;
        int i = 1718634501;
        int i2 = C0050.f910;
        int i3 = C3537.f11231;
        int m6981 = (C2105.m6981("ᩳۙ") + i2) * (-103);
        int i4 = ((m6981 ^ i3) * 1355) ^ 670063586;
        int i5 = -437889476;
        while (true) {
            i = ((((i ^ i3) * 19181) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2087581923:
                case -319598448:
                    abstractC15440 = this.f36244;
                    if (abstractC15440 != null) {
                        m6981 = (i2 - C0630.m2566("ܳۙ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m6981 ^ i3) * (-7377)) ^ (-916729665);
                        i5 = -117157650;
                    } else {
                        m6981 = (i2 - C2105.m6981("ۧ᩷")) * 91;
                        i4 = ((m6981 ^ i3) * (-13557)) ^ (-1882354236);
                        i5 = -1239848974;
                    }
                case -1931501519:
                case -1511298900:
                    if (C21923.f70183 != 0) {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    } else {
                        m6981 = (C2105.m6981("᩹ܺ") ^ i3) * 87;
                        i4 = ((m6981 ^ i2) * 8221) ^ (-1249248307);
                        i5 = -1211335440;
                    }
                case -1892652028:
                case -1102319907:
                    if (C4616.f14690 <= 0) {
                        m6981 = C2105.m6981("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15563) ^ 1421047744;
                        i5 = -1362702579;
                    } else {
                        m6981 = (C0630.m2566("᩶ۨ") ^ i3) * (-105);
                        i4 = ((m6981 ^ i2) * 14603) ^ 372946246;
                        i5 = 756091668;
                    }
                case -1820809928:
                case 1360039925:
                    if (C3019.m9258(c17222)) {
                        m6981 = (i2 - C2105.m6981("ۧ᩷")) * 91;
                        i4 = ((m6981 ^ i3) * (-13557)) ^ (-1882354236);
                        i5 = -1239848974;
                    } else {
                        m6981 = (C0630.m2566("ۢۢ") + i3) * (-11);
                        i4 = ((m6981 ^ i2) * 28299) ^ 701109470;
                        i5 = 2123433231;
                    }
                case -1748079170:
                case 2017629739:
                    it = C2958.m9029(this.f36243);
                    m6981 = (i3 - C0630.m2566("᩻᩷")) * 95;
                    i4 = ((m6981 ^ i2) * (-3883)) ^ (-1349529538);
                    i5 = 2140427519;
                case -1474995806:
                case -327163415:
                    if (C11340.f33930 >= 0) {
                        m6981 = (i3 - C2105.m6981("᩵֡")) * (-15);
                        i4 = ((m6981 ^ i2) * (-20597)) ^ (-821009563);
                        i5 = 1117650440;
                    } else {
                        m6981 = C0630.m2566("۠ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * 23161) ^ (-2121836463);
                        i5 = 821761685;
                    }
                case -1377482579:
                case -1271283362:
                    if (C1773.m5910(it)) {
                        m6981 = (C2105.m6981("ۚ۟") + i3) * (-71);
                        i4 = ((m6981 ^ i2) * (-30707)) ^ 796405225;
                        i5 = 32282533;
                    } else {
                        m6981 = C2105.m6981("ᩴۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18459)) ^ 1879158717;
                        i5 = 261424687;
                    }
                case -1347236962:
                case -242968595:
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ۧ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 23137) ^ (-44324097);
                        i5 = 1876772864;
                    } else {
                        m6981 = C2105.m6981("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15563) ^ 1421047744;
                        i5 = -1362702579;
                    }
                case -1113405675:
                case -80570378:
                    if (C3245.f10203 <= 0) {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    } else {
                        m6981 = (C0630.m2566("۠ۢ") + i2) * (-117);
                        i4 = ((m6981 ^ i3) * (-17123)) ^ 363474778;
                        i5 = 1683680806;
                    }
                case -727953166:
                case 444239479:
                    AbstractC2021.m6569((AbstractC15440) C2272.m7513(it));
                    m6981 = (i3 - C0630.m2566("᩻᩷")) * 95;
                    i4 = ((m6981 ^ i2) * (-3883)) ^ (-1349529538);
                    i5 = 2140427519;
                case -715103079:
                case 1786555731:
                    if (C7106.f21815 != 0) {
                        m6981 = (i3 - C2105.m6981("᩵֡")) * (-15);
                        i4 = ((m6981 ^ i2) * (-20597)) ^ (-821009563);
                        i5 = 1117650440;
                    } else {
                        m6981 = (C0630.m2566("ۡ᩶") ^ i3) * (-29);
                        i4 = ((m6981 ^ i2) * 4903) ^ (-1614208135);
                        i5 = -410414339;
                    }
                case -697185611:
                case 2105030043:
                    RunnableC3474.m10626(abstractC15440);
                    m6981 = (i2 - C2105.m6981("ۧ᩷")) * 91;
                    i4 = ((m6981 ^ i3) * (-13557)) ^ (-1882354236);
                    i5 = -1239848974;
                case -678546212:
                case -140892357:
                    if (C0422.f1886 <= 0) {
                        m6981 = C0630.m2566("ۡ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4649)) ^ 249177326;
                        i5 = -1480101071;
                    } else {
                        m6981 = (i2 - C2105.m6981("ᩴ᩺")) * 75;
                        i4 = ((m6981 ^ i3) * 2491) ^ 1663175429;
                        i5 = -704121042;
                    }
                case -629621024:
                case -154305661:
                    if (C4117.f13076 <= 0) {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    } else {
                        m6981 = (C2105.m6981("ۙۖ") ^ i2) * 123;
                        i4 = ((m6981 ^ i3) * 28179) ^ 390327042;
                        i5 = -185148802;
                    }
                case -515717416:
                case 309632351:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    } else {
                        m6981 = (i2 - C2105.m6981("ۜ۫")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i3) * (-31495)) ^ 1394300799;
                        i5 = 275683864;
                    }
                case -476664812:
                case -96612583:
                    RunnableC3474.m10630();
                    if (C4616.m13552() != 0) {
                        m6981 = (i3 - C2105.m6981("᩵֡")) * (-15);
                        i4 = ((m6981 ^ i2) * (-20597)) ^ (-821009563);
                        i5 = 1117650440;
                    } else {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    }
                case -363881287:
                case 1533194853:
                    if (C2520.f8000 >= 0) {
                        m6981 = (i3 - C2105.m6981("᩵֡")) * (-15);
                        i4 = ((m6981 ^ i2) * (-20597)) ^ (-821009563);
                        i5 = 1117650440;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܶᩴ")) * 51;
                        i4 = ((m6981 ^ i2) * 2801) ^ 899978610;
                        i5 = 607979824;
                    }
                case -214752893:
                case -93380480:
                    C0422.m1956();
                    break;
                case -188394346:
                case 1263361108:
                    C4263.m12819();
                    C0964.m3413();
                    break;
                case 157731747:
                case 1808983904:
                    RunnableC1937.m6387();
                    m6981 = (i3 - C2105.m6981("᩵֡")) * (-15);
                    i4 = ((m6981 ^ i2) * (-20597)) ^ (-821009563);
                    i5 = 1117650440;
                case 614071309:
                case 1382063320:
                    if (C1711.m5736() <= 0) {
                        m6981 = C0630.m2566("ܳۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29065)) ^ 1891877165;
                        i5 = -171757333;
                    } else {
                        m6981 = C0630.m2566("ۡ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4649)) ^ 249177326;
                        i5 = -1480101071;
                    }
                default:
                    if (C0630.f2410 <= 0) {
                        m6981 = (i3 - C2105.m6981("ܶᩴ")) * 51;
                        i4 = ((m6981 ^ i2) * 2801) ^ 899978610;
                        i5 = 607979824;
                    } else {
                        m6981 = C2105.m6981("᩹ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-29743)) ^ (-1448233578);
                        i5 = 1566958433;
                    }
            }
            return;
        }
    }

    /*  JADX ERROR: Type inference failed
        jadx.core.utils.exceptions.JadxOverflowException: Type inference error: updates count limit reached
        	at jadx.core.utils.ErrorsCounter.addError(ErrorsCounter.java:59)
        	at jadx.core.utils.ErrorsCounter.error(ErrorsCounter.java:31)
        	at jadx.core.dex.attributes.nodes.NotificationAttrNode.addError(NotificationAttrNode.java:19)
        	at jadx.core.dex.visitors.typeinference.TypeInferenceVisitor.visit(TypeInferenceVisitor.java:77)
        */
    @Override // l.AbstractC3817
    /* renamed from: ۢ */
    public final l.C17222 mo2780() {
        /*
            Method dump skipped, instructions count: 11728
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12143.mo2780():l.ܿ۠ۢ");
    }

    /* JADX WARN: Code restructure failed: missing block: B:26:0x0064, code lost:
    
        if (l.ViewOnClickListenerC1958.f6529 <= 0) goto L43;
     */
    /* JADX WARN: Code restructure failed: missing block: B:34:0x0089, code lost:
    
        if (l.C2520.f8000 < 0) goto L65;
     */
    @Override // l.AbstractC3817
    /* renamed from: ۘ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.lang.CharSequence mo2778() {
        /*
            Method dump skipped, instructions count: 848
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12143.mo2778():java.lang.CharSequence");
    }
}
