package l;

import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: 51RP */
/* renamed from: l.۫᩵ۡ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final class C12613 implements InterfaceC4227 {

    /* renamed from: ᩸۫ܳ, reason: not valid java name and contains not printable characters */
    private static final short[] f38016 = {4004, -5774, -5783, -5803, -5774, -5772, -5777, -5784, -5791, -5842, -5848, -5848, -5848, -5841, 5973, 22044, 22027, 22042, 22076, 22027, 22042, 22043, 22044, 22016, 22061, 22017, 22026, 22027, 22100, 22094, 22031, 22029, 22029, 22027, 22045, 22045, 22065, 22042, 22017, 22021, 22027, 22016};

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewOnClickListenerC5850 f38017;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C21373 f38018;

    /* JADX WARN: Code restructure failed: missing block: B:30:0x006a, code lost:
    
        if (l.C0714.f2697 < 0) goto L68;
     */
    /* JADX WARN: Code restructure failed: missing block: B:35:0x0073, code lost:
    
        if (l.C3019.f9544 >= 0) goto L68;
     */
    /* JADX WARN: Code restructure failed: missing block: B:39:0x0079, code lost:
    
        if (l.C4616.f14690 <= 0) goto L68;
     */
    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo3454(l.C19750 r20) {
        /*
            Method dump skipped, instructions count: 832
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12613.mo3454(l.᩵᩹ۘ):void");
    }

    public C12613(C21373 c21373, ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        int i = 1713585506;
        int i2 = C4263.f13799;
        int i3 = C4117.f13076;
        int m2566 = C0630.m2566("ܰܿ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-4037)) ^ (-921774194);
        int i5 = -916018260;
        while (true) {
            i = ((((i ^ i3) * (-8393)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2057684376:
                case -1873183798:
                    C0483.m2121();
                    C5695.m16023();
                    m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                    i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                    i5 = -267496916;
                case -1685407627:
                case 205617670:
                    if (C3683.f11629 >= 0) {
                        m2566 = C0630.m2566("ۘᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 4489) ^ (-473308815);
                        i5 = -1399311482;
                    } else {
                        m2566 = C0630.m2566("ܰۚ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-15713)) ^ (-116940075);
                        i5 = 463646949;
                    }
                case -1266317953:
                case -95336518:
                    C22628.m50615();
                    if (C5695.f17556 >= 0) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = C0630.m2566("ܽ۠") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13895)) ^ 1035023054;
                        i5 = -1543129695;
                    }
                case -1148196922:
                case 1298911208:
                    if (C4159.f13567) {
                        m2566 = (C2105.m6981("ۗ᩸") ^ i2) * (-123);
                        i4 = ((m2566 ^ i3) * 4753) ^ (-1209407618);
                        i5 = 298156160;
                    } else {
                        m2566 = C0630.m2566("ۢۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-4987)) ^ (-1048046875);
                        i5 = 45017923;
                    }
                case -961965747:
                case 1674648889:
                    if (C2126.f7087) {
                        m2566 = C0630.m2566("ۘᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 4489) ^ (-473308815);
                        i5 = -1399311482;
                    } else {
                        m2566 = C2105.m6981("۠ۧ") ^ i2;
                        i4 = ((m2566 ^ i3) * 18369) ^ (-1872952931);
                        i5 = 733285878;
                    }
                case -667310370:
                case -254039605:
                    if (C0964.f3626 != 0) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = C0630.m2566("֨ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * 3455) ^ 932355782;
                        i5 = 1832929156;
                    }
                case -46504821:
                case 1462110085:
                    this.f38018 = c21373;
                    if (C3911.f12484 >= 0) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = C2105.m6981("ᩳܳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-11993)) ^ 587525472;
                        i5 = 1823945254;
                    }
                case 333478934:
                case 494687164:
                    if (C3683.f11629 >= 0) {
                        m2566 = (C0630.m2566("ܽ֫") + i2) * (-51);
                        i4 = ((m2566 ^ i3) * 13931) ^ 882977125;
                        i5 = -1987846638;
                    } else {
                        m2566 = (C0630.m2566("᩻ܳ") ^ i3) * 33;
                        i4 = ((m2566 ^ i2) * 24805) ^ 493480757;
                        i5 = 702916495;
                    }
                case 350123194:
                case 418784812:
                    C1005.m3501();
                    if (C2272.f7362) {
                        m2566 = C0630.m2566("ۘᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 4489) ^ (-473308815);
                        i5 = -1399311482;
                    } else {
                        m2566 = C0630.m2566("ۢۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-4987)) ^ (-1048046875);
                        i5 = 45017923;
                    }
                case 363930774:
                case 435869968:
                    if (C0382.m1848()) {
                        m2566 = C0630.m2566("ۢۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-4987)) ^ (-1048046875);
                        i5 = 45017923;
                    } else {
                        m2566 = C0630.m2566("ۢۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-29297)) ^ 1737090100;
                        i5 = 941461352;
                    }
                case 397978661:
                case 1495062659:
                    if (C0714.f2697 >= 0) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = (C0630.m2566("ۚۖ") + i3) * 91;
                        i4 = ((m2566 ^ i2) * (-21923)) ^ (-1365342145);
                        i5 = -904422489;
                    }
                case 535427289:
                case 1260598476:
                    if (C1711.f5919) {
                        m2566 = (C0630.m2566("ܽ֫") + i2) * (-51);
                        i4 = ((m2566 ^ i3) * 13931) ^ 882977125;
                        i5 = -1987846638;
                    } else {
                        m2566 = C0630.m2566("ۗ۠") ^ i3;
                        i4 = ((m2566 ^ i2) * 24549) ^ (-1036202785);
                        i5 = 187922987;
                    }
                case 921837140:
                case 2106804929:
                    C2520.m8026();
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = C0630.m2566("ۘᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 4489) ^ (-473308815);
                        i5 = -1399311482;
                    }
                case 981308321:
                case 2024787816:
                    if (C3663.f11553) {
                        m2566 = (C0630.m2566("ܺ֫") + i3) * (-7);
                        i4 = ((m2566 ^ i2) * 26413) ^ 68769974;
                        i5 = -267496916;
                    } else {
                        m2566 = (i2 - C2105.m6981("ܽᩴ")) * 61;
                        i4 = ((m2566 ^ i3) * 2925) ^ 57870263;
                        i5 = -1990090618;
                    }
                case 1206044146:
                case 1350053812:
                    C4075.m12263();
                    C7106.m19120();
                    throw new RuntimeException();
                default:
                    this.f38017 = viewOnClickListenerC5850;
                    return;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:88:0x006a, code lost:
    
        if (l.C22628.f73083 > 0) goto L7;
     */
    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo3455(org.json.JSONObject r32) {
        /*
            Method dump skipped, instructions count: 1462
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12613.mo3455(org.json.JSONObject):void");
    }

    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    public final void mo3453() {
        C21373 c21373 = null;
        int i = 1432323999;
        int i2 = RunnableC3474.f10992;
        int i3 = C22628.f73083;
        int m6981 = C2105.m6981("ܿᩳ") ^ i3;
        int i4 = ((m6981 ^ i2) * 14305) ^ (-1034066614);
        int i5 = -736802652;
        while (true) {
            i = ((((i ^ i2) * 8307) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2141970322:
                case 914927587:
                    if (C4159.f13567) {
                        m6981 = (i2 - C0630.m2566("֡ܶ")) * (-61);
                        i4 = ((m6981 ^ i3) * 23279) ^ (-2057675392);
                        i5 = 187508186;
                    } else {
                        m6981 = (C2105.m6981("᩻ۡ") ^ i3) * (-43);
                        i4 = ((m6981 ^ i2) * 17425) ^ 490764299;
                        i5 = 122342651;
                    }
                case -1920826496:
                case 360828204:
                    AbstractC2021.m6574();
                    m6981 = (C2105.m6981("ܺ᩺") + i2) * 3;
                    i4 = ((m6981 ^ i3) * (-30723)) ^ (-1845525493);
                    i5 = -768455433;
                case -1795887220:
                case 400244407:
                    if (C2958.f9394 >= 0) {
                        m6981 = (C2105.m6981("᩻ۡ") ^ i3) * (-43);
                        i4 = ((m6981 ^ i2) * 17425) ^ 490764299;
                        i5 = 122342651;
                    } else {
                        m6981 = C2105.m6981("ܺ֨") ^ i3;
                        i4 = ((m6981 ^ i2) * 16661) ^ 1359370241;
                        i5 = -1402943069;
                    }
                case -1719457042:
                case -249378161:
                    if (C1420.f5096 <= 0) {
                        m6981 = (C2105.m6981("᩻ۡ") ^ i3) * (-43);
                        i4 = ((m6981 ^ i2) * 17425) ^ 490764299;
                        i5 = 122342651;
                    } else {
                        m6981 = C2105.m6981("֫ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * 31275) ^ (-1094250182);
                        i5 = 430066211;
                    }
                case -1609208782:
                case 1304926455:
                    if (C0964.f3626 != 0) {
                        m6981 = C2105.m6981("ۛۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * 671) ^ (-728862628);
                        i5 = 1174256725;
                    } else {
                        m6981 = (i3 - C2105.m6981("᩹ᩴ")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m6981 ^ i2) * (-3869)) ^ (-704569804);
                        i5 = -2053708306;
                    }
                case -1363827989:
                case -881812040:
                    if (C2105.f7037 == 0) {
                        m6981 = (C2105.m6981("ܺ᩺") + i2) * 3;
                        i4 = ((m6981 ^ i3) * (-30723)) ^ (-1845525493);
                        i5 = -768455433;
                    } else {
                        m6981 = (C2105.m6981("᩷᩷") + i3) * 57;
                        i4 = ((m6981 ^ i2) * 7525) ^ (-1931899982);
                        i5 = 365483335;
                    }
                case -1039170757:
                case 1635902907:
                    if (C4263.m12819() >= 0) {
                        m6981 = (C2105.m6981("᩻ۡ") ^ i3) * (-43);
                        i4 = ((m6981 ^ i2) * 17425) ^ 490764299;
                        i5 = 122342651;
                    } else {
                        m6981 = (C2105.m6981("ܰۖ") + i2) * 31;
                        i4 = ((m6981 ^ i3) * (-7309)) ^ (-1769047961);
                        i5 = 1541314403;
                    }
                case -982608721:
                case -135195536:
                    RunnableC0588.m2441();
                    C2167.m7155();
                    break;
                case -503925421:
                case -153287421:
                    c21373 = this.f38018;
                    if (C1773.f6144 <= 0) {
                        m6981 = C2105.m6981("ۛۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * 671) ^ (-728862628);
                        i5 = 1174256725;
                    } else {
                        m6981 = (C2105.m6981("֡᩻") + i2) * 81;
                        i4 = ((m6981 ^ i3) * 23235) ^ (-500718937);
                        i5 = 1870546267;
                    }
                case -414109574:
                case 1881039339:
                    if (C2272.m7503()) {
                        m6981 = (C2105.m6981("᩻ۡ") ^ i3) * (-43);
                        i4 = ((m6981 ^ i2) * 17425) ^ 490764299;
                        i5 = 122342651;
                    } else {
                        m6981 = (C2105.m6981("᩷᩷") + i3) * 57;
                        i4 = ((m6981 ^ i2) * 7525) ^ (-1931899982);
                        i5 = 365483335;
                    }
                case -199264718:
                case 1932686237:
                    C4117.m12364();
                    if (C0714.m2805()) {
                        m6981 = C2105.m6981("۫ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 14009) ^ (-1057109272);
                        i5 = -1432711864;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩺") + i2) * 3;
                        i4 = ((m6981 ^ i3) * (-30723)) ^ (-1845525493);
                        i5 = -768455433;
                    }
                case 131907426:
                case 284661857:
                    break;
                case 541747006:
                case 1116821309:
                    C3911.m11920(c21373.f68856);
                    break;
                case 576434960:
                case 1185308422:
                    if (RunnableC0588.m2441() >= 0) {
                        m6981 = C2105.m6981("۫ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 14009) ^ (-1057109272);
                        i5 = -1432711864;
                    } else {
                        m6981 = C0630.m2566("᩶᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-7891)) ^ (-601627876);
                        i5 = -135279846;
                    }
                case 742521433:
                case 823554686:
                    if (C0050.f910 >= 0) {
                        m6981 = (C2105.m6981("᩷᩷") + i3) * 57;
                        i4 = ((m6981 ^ i2) * 7525) ^ (-1931899982);
                        i5 = 365483335;
                    } else {
                        m6981 = C0630.m2566("ۖۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-15615)) ^ 1551146082;
                        i5 = 1433847115;
                    }
                case 771568523:
                case 1129464548:
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("۫ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 14009) ^ (-1057109272);
                        i5 = -1432711864;
                    } else {
                        m6981 = C0630.m2566("ܰ᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * (-2387)) ^ 180321816;
                        i5 = 659319779;
                    }
                case 882692647:
                case 1110552778:
                    if (C0483.f2088 >= 0) {
                        m6981 = C2105.m6981("۫ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 14009) ^ (-1057109272);
                        i5 = -1432711864;
                    } else {
                        m6981 = (i3 - C0630.m2566("۟ۧ")) * 33;
                        i4 = ((m6981 ^ i2) * 26637) ^ (-2012748271);
                        i5 = -1317680961;
                    }
                default:
                    if (c21373.f68856.m31868()) {
                        m6981 = C2105.m6981("ܿۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28059) ^ (-565480940);
                        i5 = 843013882;
                    } else {
                        m6981 = (C0630.m2566("ᩳܳ") + i2) * (-37);
                        i4 = ((m6981 ^ i3) * (-25415)) ^ 711640031;
                        i5 = -1710625438;
                    }
            }
            return;
        }
    }
}
