package l;

import android.view.View;
import android.widget.TextView;
import com.google.android.material.slider.BaseSlider;

/* compiled from: H1R6 */
/* renamed from: l.۬ۚۡ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final class C12905 extends AbstractC7548 {

    /* renamed from: ᩴ᩷ܿ, reason: not valid java name and contains not printable characters */
    private static final short[] f38716 = {8496, 29793, 26353, -23671, 26564, 32412, 29209, 25054, -25513, -32357, 24658, 29920, -21841, 24761, -20124, 26216, 4728, -18732, 23482, -24041};

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public String f38717;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewOnClickListenerC5850 f38718;

    public C12905(ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        String str = null;
        int i = 1540499501;
        int i2 = ServiceConnectionC3453.f10921;
        int i3 = C5695.f17556;
        this.f38718 = viewOnClickListenerC5850;
        int m2566 = C0630.m2566("ۡ۫") ^ i3;
        int i4 = ((m2566 ^ i2) * (-23201)) ^ (-73304333);
        int i5 = -1953765237;
        while (true) {
            i = ((((i ^ i2) * 15413) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2079035757:
                case -1341700218:
                    if (C1294.f4556 >= 0) {
                        m2566 = (C0630.m2566("ܶ᩷") ^ i3) * 73;
                        i4 = ((m2566 ^ i2) * (-14013)) ^ (-438226273);
                        i5 = 2071889712;
                    } else {
                        m2566 = (i3 - C2105.m6981("֨ۚ")) * (-55);
                        i4 = ((m2566 ^ i2) * (-25899)) ^ (-2123456636);
                        i5 = -1598339957;
                    }
                case -1642783135:
                case 1836919055:
                    if (C0483.f2088 >= 0) {
                        m2566 = C2105.m6981("ۢ᩶") ^ i3;
                        i4 = ((m2566 ^ i2) * (-19237)) ^ 520010127;
                        i5 = 572297855;
                    } else {
                        m2566 = C2105.m6981("ۨۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5511)) ^ (-232271594);
                        i5 = 1543865341;
                    }
                case -1443596666:
                case -1411857405:
                    if (C3537.f11231 >= 0) {
                        m2566 = (C0630.m2566("ܳܽ") ^ i3) * (-73);
                        i4 = ((m2566 ^ i2) * 30821) ^ 411671601;
                        i5 = -1969927175;
                    } else {
                        m2566 = (C0630.m2566("ۗ᩸") ^ i3) * (-59);
                        i4 = ((m2566 ^ i2) * (-17541)) ^ (-835958305);
                        i5 = -1624388910;
                    }
                case -1345678068:
                case 989403131:
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("ܳܽ") ^ i3) * (-73);
                        i4 = ((m2566 ^ i2) * 30821) ^ 411671601;
                        i5 = -1969927175;
                    } else {
                        m2566 = (i2 - C2105.m6981("ܰᩳ")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m2566 ^ i3) * (-23241)) ^ (-1531231841);
                        i5 = -923455998;
                    }
                case -1326273927:
                case 272234964:
                    RunnableC3474.m10630();
                    m2566 = C2105.m6981("ۢ᩶") ^ i3;
                    i4 = ((m2566 ^ i2) * (-19237)) ^ 520010127;
                    i5 = 572297855;
                case -1179681040:
                case 108171850:
                    if (C1047.m3599() >= 0) {
                        m2566 = (C0630.m2566("ܶ᩷") ^ i3) * 73;
                        i4 = ((m2566 ^ i2) * (-14013)) ^ (-438226273);
                        i5 = 2071889712;
                    } else {
                        m2566 = C0630.m2566("ۗܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * 21383) ^ (-1511410742);
                        i5 = 1128119104;
                    }
                case -1138250350:
                case -819241476:
                    C2272.m7503();
                    C4159.m12565();
                    throw new RuntimeException();
                case -917449190:
                case 628969962:
                    if (C5695.f17556 >= 0) {
                        m2566 = C2105.m6981("ۨۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5511)) ^ (-232271594);
                        i5 = 1543865341;
                    } else {
                        m2566 = C2105.m6981("ᩳۜ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-28715)) ^ 229044714;
                        i5 = -38292427;
                    }
                case -888234372:
                case 2074753033:
                    if (C3245.f10203 <= 0) {
                        m2566 = (C0630.m2566("ܳܽ") ^ i3) * (-73);
                        i4 = ((m2566 ^ i2) * 30821) ^ 411671601;
                        i5 = -1969927175;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۤۘ")) * (-49);
                        i4 = ((m2566 ^ i3) * (-2477)) ^ 1522098521;
                        i5 = 1843716574;
                    }
                case -779275422:
                case 353209060:
                    C4075.m12263();
                    if (C0050.f910 >= 0) {
                        m2566 = C2105.m6981("ۢ᩶") ^ i3;
                        i4 = ((m2566 ^ i2) * (-19237)) ^ 520010127;
                        i5 = 572297855;
                    } else {
                        m2566 = C2105.m6981("᩷ۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * 15767) ^ 1225519860;
                        i5 = 1927401536;
                    }
                case -543963722:
                case 453688395:
                    C7106.m19120();
                    if (C1047.f3863 >= 0) {
                        m2566 = C2105.m6981("ۨۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5511)) ^ (-232271594);
                        i5 = 1543865341;
                    } else {
                        m2566 = (C0630.m2566("ܳܽ") ^ i3) * (-73);
                        i4 = ((m2566 ^ i2) * 30821) ^ 411671601;
                        i5 = -1969927175;
                    }
                case -432288697:
                case 277065387:
                    if (C3746.m11369() >= 0) {
                        m2566 = (C0630.m2566("ܶ᩷") ^ i3) * 73;
                        i4 = ((m2566 ^ i2) * (-14013)) ^ (-438226273);
                        i5 = 2071889712;
                    } else {
                        m2566 = (C0630.m2566("۬ۨ") ^ i2) * (-7);
                        i4 = ((m2566 ^ i3) * (-11901)) ^ 1196014179;
                        i5 = -303142851;
                    }
                case -32055594:
                case 1723602166:
                    str = "";
                    if (C3245.f10203 <= 0) {
                        m2566 = (C0630.m2566("ܶ᩷") ^ i3) * 73;
                        i4 = ((m2566 ^ i2) * (-14013)) ^ (-438226273);
                        i5 = 2071889712;
                    } else {
                        m2566 = (C0630.m2566("ۢᩴ") ^ i2) * (-45);
                        i4 = ((m2566 ^ i3) * (-3081)) ^ (-1405999055);
                        i5 = 1784802546;
                    }
                case 854703476:
                case 1560585954:
                    if (C2126.f7087) {
                        m2566 = C2105.m6981("᩷ۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * 15767) ^ 1225519860;
                        i5 = 1927401536;
                    } else {
                        m2566 = C2105.m6981("ۜ᩶") ^ i3;
                        i4 = ((m2566 ^ i2) * 23969) ^ 1817976625;
                        i5 = -2097674035;
                    }
                case 1758695313:
                case 1834448259:
                    this.f38717 = str;
                    return;
                default:
                    if (C0798.m2998() != 0) {
                        m2566 = C2105.m6981("ۨۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5511)) ^ (-232271594);
                        i5 = 1543865341;
                    } else {
                        m2566 = (C0630.m2566("᩸ۚ") + i3) * (-33);
                        i4 = ((m2566 ^ i2) * (-31097)) ^ 1567519579;
                        i5 = -757771305;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    public final void mo1008() {
        C3019.m9260(this, this.f38718);
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
        int i = -1664621445;
        int i2 = C0050.f910;
        int i3 = C1047.f3863;
        int m6981 = (C2105.m6981("ۘۛ") ^ i2) * 99;
        int i4 = ((m6981 ^ i3) * (-19403)) ^ (-651506362);
        int i5 = 1736717166;
        while (true) {
            i = ((((i ^ i3) * 16329) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1893888706:
                case -263653002:
                    if (RunnableC1108.f4040) {
                        m6981 = C2105.m6981("ۨ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * 22415) ^ (-1582286584);
                        i5 = -141616671;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۗܳ")) * 49;
                        i4 = ((m6981 ^ i2) * 13591) ^ (-908023975);
                        i5 = 160334544;
                    }
                case -1654054916:
                case 979320177:
                    C3663.m11168();
                    if (C1420.f5096 <= 0) {
                        m6981 = (i2 - C0630.m2566("ᩴܰ")) * 25;
                        i4 = ((m6981 ^ i3) * (-639)) ^ 1143623700;
                        i5 = -1026153459;
                    } else {
                        m6981 = C0630.m2566("ܽۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28329) ^ 1457115919;
                        i5 = -158348094;
                    }
                case -1536193234:
                case 440504397:
                    C4117.m12364();
                    break;
                case -1459023171:
                case 1330791476:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (i3 - C2105.m6981("ۗܳ")) * 49;
                        i4 = ((m6981 ^ i2) * 13591) ^ (-908023975);
                        i5 = 160334544;
                    } else {
                        m6981 = C2105.m6981("ܶ᩹") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21181)) ^ (-1932294540);
                        i5 = -1212813315;
                    }
                case -1371912555:
                case -1222723766:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (i2 - C0630.m2566("ᩴܰ")) * 25;
                        i4 = ((m6981 ^ i3) * (-639)) ^ 1143623700;
                        i5 = -1026153459;
                    } else {
                        m6981 = C0630.m2566("ܳ֡") ^ i2;
                        i4 = ((m6981 ^ i3) * (-9799)) ^ (-1203309002);
                        i5 = -551535881;
                    }
                case -744513866:
                case 1094202197:
                    if (RunnableC1108.f4040) {
                        m6981 = (C0630.m2566("ܶܶ") ^ i3) * (-69);
                        i4 = ((m6981 ^ i2) * 2507) ^ (-1757496800);
                        i5 = 774003205;
                    } else {
                        m6981 = (C0630.m2566("֨᩺") + i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-32121)) ^ 2123877304;
                        i5 = 880122963;
                    }
                case -742880364:
                case 170538701:
                    if (ViewOnClickListenerC1958.f6529 > 0) {
                        m6981 = (i2 - C0630.m2566("ᩴܰ")) * 25;
                        i4 = ((m6981 ^ i3) * (-639)) ^ 1143623700;
                        i5 = -1026153459;
                    } else {
                        m6981 = (C0630.m2566("֨᩺") + i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-32121)) ^ 2123877304;
                        i5 = 880122963;
                    }
                case -581392068:
                case 551215773:
                    if (C11340.f33930 >= 0) {
                        m6981 = (i2 - C0630.m2566("ᩴܰ")) * 25;
                        i4 = ((m6981 ^ i3) * (-639)) ^ 1143623700;
                        i5 = -1026153459;
                    } else {
                        m6981 = C0630.m2566("ܰ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 2269) ^ 944413595;
                        i5 = -988850191;
                    }
                case -460691410:
                case 1060488428:
                    ServiceConnectionC3453.m10564();
                    if (C0714.m2805()) {
                        m6981 = (i2 - C0630.m2566("ᩴܰ")) * 25;
                        i4 = ((m6981 ^ i3) * (-639)) ^ 1143623700;
                        i5 = -1026153459;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۗܳ")) * 49;
                        i4 = ((m6981 ^ i2) * 13591) ^ (-908023975);
                        i5 = 160334544;
                    }
                case -333387832:
                case 595968882:
                    viewOnClickListenerC5850 = this.f38718;
                    if (C1128.m3851() <= 0) {
                        m6981 = C2105.m6981("ܳۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-32591)) ^ 475358158;
                        i5 = 1640817830;
                    } else {
                        m6981 = (C2105.m6981("ۛܳ") ^ i3) * 91;
                        i4 = ((m6981 ^ i2) * 881) ^ (-1990516197);
                        i5 = -1373443120;
                    }
                case 187357614:
                case 1383852700:
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ܳۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-32591)) ^ 475358158;
                        i5 = 1640817830;
                    } else {
                        m6981 = (C0630.m2566("ۗ᩹") ^ i2) * 23;
                        i4 = ((m6981 ^ i3) * (-19419)) ^ (-891214281);
                        i5 = 467793330;
                    }
                case 537968122:
                case 1070192126:
                    if (C1711.m5736() <= 0) {
                        m6981 = (i3 - C2105.m6981("ۗܳ")) * 49;
                        i4 = ((m6981 ^ i2) * 13591) ^ (-908023975);
                        i5 = 160334544;
                    } else {
                        m6981 = C2105.m6981("ۚܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23111)) ^ (-1993131339);
                        i5 = 1344305091;
                    }
                case 967487233:
                case 1030783375:
                    if (C2167.f7158 >= 0) {
                        m6981 = (C0630.m2566("֨᩺") + i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-32121)) ^ 2123877304;
                        i5 = 880122963;
                    } else {
                        m6981 = (C2105.m6981("۬ܽ") + i3) * (-89);
                        i4 = ((m6981 ^ i2) * 30209) ^ (-1155102142);
                        i5 = 2126726723;
                    }
                case 986517655:
                case 1793060160:
                    if (C1294.f4556 >= 0) {
                        m6981 = (C0630.m2566("֨᩺") + i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-32121)) ^ 2123877304;
                        i5 = 880122963;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩷᩹")) * 119;
                        i4 = ((m6981 ^ i3) * (-12439)) ^ (-1423596270);
                        i5 = 1327910709;
                    }
                case 1763260282:
                case 1909238896:
                    C3911.m11924();
                    RunnableC1108.m3790();
                    m6981 = (i3 - C2105.m6981("ۗܳ")) * 49;
                    i4 = ((m6981 ^ i2) * 13591) ^ (-908023975);
                    i5 = 160334544;
                default:
                    ServiceConnectionC3453.m10561(viewOnClickListenerC5850, exc, null);
                    break;
            }
            return;
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        C3911.m11927(this);
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1006() {
        int m2566;
        int i;
        int i2;
        short[] sArr;
        int i3;
        int i4;
        String str;
        int i5;
        int i6;
        short[] sArr2;
        int m25662;
        int i7;
        int m6981;
        short[] sArr3;
        int i8;
        int i9;
        int i10;
        int i11 = 1514706957;
        int i12 = C3911.f12484;
        int i13 = C0714.f2697;
        int m25663 = (C0630.m2566("ۜ᩹") ^ i12) * (-115);
        int i14 = ((m25663 ^ i13) * 31113) ^ 755124243;
        int i15 = m25663 ^ 1322481715;
        View view = null;
        ViewOnClickListenerC19575 viewOnClickListenerC19575 = null;
        String str2 = null;
        short[] sArr4 = null;
        short[] sArr5 = null;
        int i16 = 0;
        int i17 = 0;
        int i18 = 0;
        boolean z = false;
        int i19 = 0;
        int i20 = 0;
        short s = 0;
        int i21 = 0;
        int i22 = 0;
        int i23 = 0;
        int i24 = 0;
        int i25 = 0;
        ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
        short[] sArr6 = null;
        String str3 = null;
        int i26 = 0;
        while (true) {
            i11 = i15 ^ (i14 & (((i11 ^ i13) * 1677) >> 31));
            switch (i11) {
                case -2115930294:
                case -2102768101:
                    if (C2126.f7087) {
                        m2566 = C0630.m2566("۫ۤ") ^ i13;
                        i = ((m2566 ^ i12) * (-12139)) ^ (-1569029660);
                        i2 = 1503181567;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    } else {
                        short[] sArr7 = sArr6;
                        i6 = i16;
                        sArr2 = sArr7;
                        m6981 = C2105.m6981("ܳ֨") ^ i13;
                        sArr3 = sArr2;
                        i8 = ((m6981 ^ i12) * 32681) ^ 1556396483;
                        i9 = 1867737920;
                        i10 = m6981 ^ i9;
                        i14 = i8;
                        i16 = i6;
                        sArr6 = sArr3;
                        i15 = i10;
                    }
                case -2103668779:
                case 159369563:
                    sArr = sArr6;
                    i3 = i23;
                    i4 = i16;
                    int i27 = i22;
                    str = str3;
                    i5 = i27;
                    short s2 = f38716[0];
                    int i28 = s2 + 15775;
                    if (C3663.m11168() >= 0) {
                        s = s2;
                        i21 = i28;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i29 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i29;
                        i16 = i4;
                        sArr6 = sArr;
                        String str4 = str;
                        i22 = i5;
                        str3 = str4;
                    } else {
                        int m25664 = (C0630.m2566("ᩳ۬") ^ i13) * 51;
                        int i30 = ((m25664 ^ i12) * (-7293)) ^ 1969062901;
                        i23 = i3;
                        i15 = m25664 ^ 1210342393;
                        s = s2;
                        i21 = i28;
                        i14 = i30;
                        i16 = i4;
                        sArr6 = sArr;
                        String str42 = str;
                        i22 = i5;
                        str3 = str42;
                    }
                case -2041815752:
                case 1294621663:
                    C1047.m3601((TextView) C1005.m3507(view, i17), str3);
                    if (C7106.f21815 != 0) {
                        sArr = sArr6;
                        i3 = i23;
                        i4 = i16;
                        int i31 = i22;
                        str = str3;
                        i5 = i31;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i292 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i292;
                        i16 = i4;
                        sArr6 = sArr;
                        String str422 = str;
                        i22 = i5;
                        str3 = str422;
                    } else {
                        m2566 = (C0630.m2566("ܺܶ") ^ i12) * (-41);
                        i = ((m2566 ^ i13) * (-2305)) ^ 453570588;
                        i2 = 717803759;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                case -1789783314:
                case -1214062050:
                    i18 = 2104053000 ^ C2105.m6981(C3019.m9250(f38716, 7, 3, i26));
                    if (C3663.m11168() >= 0) {
                        sArr = sArr6;
                        i3 = i23;
                        i4 = i16;
                        int i312 = i22;
                        str = str3;
                        i5 = i312;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i2922 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i2922;
                        i16 = i4;
                        sArr6 = sArr;
                        String str4222 = str;
                        i22 = i5;
                        str3 = str4222;
                    } else {
                        m2566 = (C2105.m6981("ۡ᩸") ^ i13) * (-91);
                        i = ((m2566 ^ i12) * 9209) ^ 122059427;
                        i2 = 473692722;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                case -1786175924:
                case 1973966496:
                    C2126.m7039(C1005.m3507(view, i18), viewOnClickListenerC19575);
                    str2 = RunnableC1108.m3789(f38716, 10, 3, i26);
                    if (C3911.f12484 < 0) {
                        m2566 = C2105.m6981("᩵ܰ") ^ i12;
                        i = ((m2566 ^ i13) * 30195) ^ 1709129472;
                        i2 = -75831006;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                    m2566 = C0630.m2566("ܳۤ") ^ i13;
                    i = ((m2566 ^ i12) * 25759) ^ (-1949957930);
                    i2 = 216379927;
                    i15 = m2566 ^ i2;
                    i14 = i;
                case -1727621219:
                case 1628394623:
                    C3746.m11360(C11340.m28028(view, i19), 8);
                    break;
                case -1600628485:
                case -852308356:
                    C0798.m2998();
                    C1294.m4372();
                    m2566 = C0630.m2566("۫ۤ") ^ i13;
                    i = ((m2566 ^ i12) * (-12139)) ^ (-1569029660);
                    i2 = 1503181567;
                    i15 = m2566 ^ i2;
                    i14 = i;
                case -1250649612:
                case -548828392:
                    short[] sArr8 = sArr6;
                    i6 = i16;
                    int i32 = i23;
                    int i33 = i22;
                    String str5 = str3;
                    i24 = C0630.m2566(C7811.m20837(sArr8, i32, i33, i26));
                    i25 = 2098503585;
                    if (C0714.m2805()) {
                        int m25665 = (i13 - C0630.m2566("۠ܳ")) * 51;
                        i14 = ((m25665 ^ i12) * 23365) ^ (-595323916);
                        i16 = i6;
                        sArr6 = sArr8;
                        i22 = i33;
                        str3 = str5;
                        i15 = m25665 ^ 317349023;
                        i23 = i32;
                    } else {
                        i23 = i32;
                        sArr2 = sArr8;
                        i22 = i33;
                        str3 = str5;
                        m6981 = C2105.m6981("ܳ֨") ^ i13;
                        sArr3 = sArr2;
                        i8 = ((m6981 ^ i12) * 32681) ^ 1556396483;
                        i9 = 1867737920;
                        i10 = m6981 ^ i9;
                        i14 = i8;
                        i16 = i6;
                        sArr6 = sArr3;
                        i15 = i10;
                    }
                case -1056988734:
                case 1266422689:
                    viewOnClickListenerC5850 = this.f38718;
                    view = C3537.m10739(viewOnClickListenerC5850, i24 ^ i25);
                    sArr4 = f38716;
                    i20 = 4;
                    if (C0483.f2088 >= 0) {
                        i16 = 3;
                        int m69812 = (C2105.m6981("ۤܽ") ^ i12) * (-111);
                        int i34 = i16;
                        int i35 = ((m69812 ^ i13) * (-11859)) ^ 1227636113;
                        i10 = m69812 ^ (-520090995);
                        i14 = i35;
                        i16 = i34;
                        i15 = i10;
                    } else {
                        int m25666 = (C0630.m2566("ۚܶ") ^ i13) * (-75);
                        i14 = ((m25666 ^ i12) * 6893) ^ (-1051898359);
                        i15 = m25666 ^ 544550835;
                        i16 = 3;
                    }
                case -1012539759:
                case -622814756:
                    i6 = i16;
                    str3 = this.f38717;
                    int i36 = ViewOnClickListenerC5850.f17941;
                    sArr2 = f38716;
                    i23 = 1;
                    i22 = 3;
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = C2105.m6981("֨ܳ") ^ i12;
                        sArr3 = sArr2;
                        i8 = ((m6981 ^ i13) * 3119) ^ 605454561;
                        i9 = 967449478;
                        i10 = m6981 ^ i9;
                        i14 = i8;
                        i16 = i6;
                        sArr6 = sArr3;
                        i15 = i10;
                    }
                    m6981 = C2105.m6981("ܳ֨") ^ i13;
                    sArr3 = sArr2;
                    i8 = ((m6981 ^ i12) * 32681) ^ 1556396483;
                    i9 = 1867737920;
                    i10 = m6981 ^ i9;
                    i14 = i8;
                    i16 = i6;
                    sArr6 = sArr3;
                    i15 = i10;
                case -964439883:
                case 1594182833:
                    sArr = sArr6;
                    i3 = i23;
                    i4 = i16;
                    int i37 = i22;
                    str = str3;
                    i5 = i37;
                    i26 = 58934;
                    m25662 = C2105.m6981("᩶᩷") ^ i12;
                    i14 = ((m25662 ^ i13) * (-3703)) ^ (-1485839908);
                    i7 = 1006694664;
                    int i29222 = m25662 ^ i7;
                    i23 = i3;
                    i15 = i29222;
                    i16 = i4;
                    sArr6 = sArr;
                    String str42222 = str;
                    i22 = i5;
                    str3 = str42222;
                case -748079251:
                case 36064001:
                    C3663.m11168();
                    if (AbstractC2021.f6743 > 0) {
                        sArr = sArr6;
                        i3 = i23;
                        i4 = i16;
                        int i3122 = i22;
                        str = str3;
                        i5 = i3122;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i292222 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i292222;
                        i16 = i4;
                        sArr6 = sArr;
                        String str422222 = str;
                        i22 = i5;
                        str3 = str422222;
                    } else {
                        m2566 = C0630.m2566("ܳۤ") ^ i13;
                        i = ((m2566 ^ i12) * 25759) ^ (-1949957930);
                        i2 = 216379927;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                case -673743429:
                case -135133062:
                    C3683.m11222();
                    break;
                case -518220408:
                case 1684594862:
                    RunnableC0588.m2441();
                    if (C0630.f2410 <= 0) {
                        m2566 = C0630.m2566("۫ۤ") ^ i13;
                        i = ((m2566 ^ i12) * (-12139)) ^ (-1569029660);
                        i2 = 1503181567;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    } else {
                        sArr = sArr6;
                        i3 = i23;
                        i4 = i16;
                        int i31222 = i22;
                        str = str3;
                        i5 = i31222;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i2922222 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i2922222;
                        i16 = i4;
                        sArr6 = sArr;
                        String str4222222 = str;
                        i22 = i5;
                        str3 = str4222222;
                    }
                case -116721817:
                case 469297183:
                    i19 = 2102706133 ^ C2105.m6981(C22628.m50602(sArr5, 13, 3, i26));
                    if (z) {
                        m2566 = (i12 - C0630.m2566("ۗ֡")) * 109;
                        i = ((m2566 ^ i13) * (-16605)) ^ 812833044;
                        i2 = 794156528;
                    } else {
                        m2566 = C2105.m6981("֫ܿ") ^ i12;
                        i = ((m2566 ^ i13) * 6845) ^ (-1925766859);
                        i2 = -389245154;
                    }
                    i15 = m2566 ^ i2;
                    i14 = i;
                case 136349635:
                case 1759676865:
                    sArr = sArr6;
                    i3 = i23;
                    i4 = i16;
                    int i38 = i22;
                    str = str3;
                    i5 = i38;
                    i26 = 65107;
                    m25662 = C2105.m6981("᩶᩷") ^ i12;
                    i14 = ((m25662 ^ i13) * (-3703)) ^ (-1485839908);
                    i7 = 1006694664;
                    int i29222222 = m25662 ^ i7;
                    i23 = i3;
                    i15 = i29222222;
                    i16 = i4;
                    sArr6 = sArr;
                    String str42222222 = str;
                    i22 = i5;
                    str3 = str42222222;
                case 237963263:
                case 1318589126:
                    C2126.m7039(C11340.m28028(view, i19), viewOnClickListenerC19575);
                    break;
                case 286186741:
                case 683591115:
                    sArr = sArr6;
                    i3 = i23;
                    i4 = i16;
                    int i39 = i22;
                    str = str3;
                    i5 = i39;
                    int i40 = (s * s) + 248850625;
                    if ((i21 * i21) - (i40 + i40) > 0) {
                        m25662 = C2105.m6981("ۖܰ") ^ i13;
                        i14 = ((m25662 ^ i12) * (-32421)) ^ (-145577630);
                        i7 = 1221333426;
                    } else {
                        m25662 = (C2105.m6981("ᩴ᩹") + i12) * 73;
                        i14 = ((m25662 ^ i13) * 11599) ^ 42085435;
                        i7 = -543705047;
                    }
                    int i292222222 = m25662 ^ i7;
                    i23 = i3;
                    i15 = i292222222;
                    i16 = i4;
                    sArr6 = sArr;
                    String str422222222 = str;
                    i22 = i5;
                    str3 = str422222222;
                case 496694380:
                case 607725989:
                    C4159.m12564(C1005.m3507(view, C0630.m2566(str2) ^ 2103984630), viewOnClickListenerC19575);
                    z = C9523.m24407();
                    sArr5 = f38716;
                    if (ViewOnClickListenerC1958.f6529 > 0) {
                        m2566 = (C2105.m6981("ۖۗ") ^ i13) * (-81);
                        i = ((m2566 ^ i12) * 16431) ^ 1574348743;
                        i2 = -482667909;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                    m2566 = C0630.m2566("۫ۤ") ^ i13;
                    i = ((m2566 ^ i12) * (-12139)) ^ (-1569029660);
                    i2 = 1503181567;
                    i15 = m2566 ^ i2;
                    i14 = i;
                case 793690240:
                case 1453245202:
                    C19258 m5912 = C1773.m5912(viewOnClickListenerC5850);
                    C0798.m3013(m5912, view);
                    viewOnClickListenerC19575 = new ViewOnClickListenerC19575(2, viewOnClickListenerC5850, C3683.m11213(m5912));
                    if (C0798.m2998() != 0) {
                        int m698122 = (C2105.m6981("ۤܽ") ^ i12) * (-111);
                        int i342 = i16;
                        int i352 = ((m698122 ^ i13) * (-11859)) ^ 1227636113;
                        i10 = m698122 ^ (-520090995);
                        i14 = i352;
                        i16 = i342;
                        i15 = i10;
                    } else {
                        m2566 = (i13 - C0630.m2566("ᩳۧ")) * (-27);
                        i = ((m2566 ^ i12) * (-9481)) ^ (-782518504);
                        i2 = 1756193187;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
                default:
                    i17 = 2103095648 ^ C2105.m6981(C3537.m10748(sArr4, i20, i16, i26));
                    if (C1294.f4556 >= 0) {
                        sArr = sArr6;
                        i3 = i23;
                        i4 = i16;
                        int i312222 = i22;
                        str = str3;
                        i5 = i312222;
                        m25662 = C0630.m2566("۫ܽ") ^ i12;
                        i14 = ((m25662 ^ i13) * (-25601)) ^ 1653399745;
                        i7 = 1182507868;
                        int i2922222222 = m25662 ^ i7;
                        i23 = i3;
                        i15 = i2922222222;
                        i16 = i4;
                        sArr6 = sArr;
                        String str4222222222 = str;
                        i22 = i5;
                        str3 = str4222222222;
                    } else {
                        m2566 = (C0630.m2566("ۨܶ") ^ i12) * 11;
                        i = ((m2566 ^ i13) * (-27893)) ^ 105471643;
                        i2 = -1495165130;
                        i15 = m2566 ^ i2;
                        i14 = i;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:20:0x0068, code lost:
    
        if (l.C1504.f5354 != false) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:26:0x0072, code lost:
    
        if (l.C21923.f70183 == 0) goto L18;
     */
    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1009() {
        /*
            Method dump skipped, instructions count: 780
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C12905.mo1009():void");
    }
}
