package l;

import java.util.concurrent.atomic.AtomicBoolean;
import java.util.concurrent.atomic.AtomicInteger;
import moe.shizuku.server.IShizukuService;

/* compiled from: C2R7 */
/* renamed from: l.֨ᩴ᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class C1313 extends AbstractC9606 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AtomicInteger f4714;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C6495 f4715;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AtomicBoolean f4716;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AtomicBoolean f4717;

    @Override // l.AbstractC9606
    public final void onScrollStateChanged(C13132 c13132, int i) {
        boolean z = false;
        boolean z2 = false;
        C6495 c6495 = null;
        int i2 = 319128709;
        int i3 = C1420.f5096;
        int i4 = C2958.f9394;
        int m2566 = C0630.m2566("ۜۢ") ^ i3;
        int i5 = ((m2566 ^ i4) * (-7131)) ^ (-772110259);
        int i6 = -2052378337;
        while (true) {
            i2 = ((((i2 ^ i4) * (-3983)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2072130539:
                case 1847571402:
                    if (C0422.f1886 <= 0) {
                        m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                        i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                        i6 = -749661124;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۜ֨")) * (-99);
                        i5 = ((m2566 ^ i4) * 13835) ^ (-1105948904);
                        i6 = -1244106718;
                    }
                case -1994356399:
                case 165724784:
                    if (C2958.f9394 >= 0) {
                        m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                        i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                        i6 = -749661124;
                    } else {
                        m2566 = C0630.m2566("֫ۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-9109)) ^ 1176200595;
                        i6 = 1478872511;
                    }
                case -1931124125:
                case 1827844274:
                    z2 = false;
                    m2566 = C2105.m6981("᩻ܺ") ^ i3;
                    i5 = ((m2566 ^ i4) * 7173) ^ 1333024884;
                    i6 = -690663716;
                case -1793283753:
                case -1758482257:
                    if (this.f4717.compareAndSet(!z2, z2)) {
                        m2566 = C2105.m6981("ۧܺ") ^ i3;
                        i5 = ((m2566 ^ i4) * 23715) ^ 1031013887;
                        i6 = 17856116;
                    } else {
                        m2566 = C2105.m6981("۟۠") ^ i4;
                        i5 = ((m2566 ^ i3) * 2805) ^ (-1264540086);
                        i6 = 1095076832;
                    }
                case -1684944558:
                case -821771400:
                    z2 = true;
                    m2566 = C2105.m6981("᩻ܺ") ^ i3;
                    i5 = ((m2566 ^ i4) * 7173) ^ 1333024884;
                    i6 = -690663716;
                case -1580578974:
                case 1693496904:
                    C3537.m10746();
                    if (C0964.f3626 != 0) {
                        m2566 = (C2105.m6981("۟֡") ^ i3) * (-17);
                        i5 = ((m2566 ^ i4) * (-3119)) ^ 1299874388;
                        i6 = -1859390035;
                    } else {
                        m2566 = C0630.m2566("۠ۡ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-11375)) ^ (-853553312);
                        i6 = -440602983;
                    }
                case -1502156532:
                case -1067257266:
                    RunnableC1108.m3790();
                    if (C4616.f14690 <= 0) {
                        m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                        i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                        i6 = -749661124;
                    } else {
                        m2566 = (C2105.m6981("۟֡") ^ i3) * (-17);
                        i5 = ((m2566 ^ i4) * (-3119)) ^ 1299874388;
                        i6 = -1859390035;
                    }
                case -1476580584:
                case 1448050752:
                    if (C0050.m940() <= 0) {
                        m2566 = (i4 - C2105.m6981("۫᩸")) * (-121);
                        i5 = ((m2566 ^ i3) * 29163) ^ (-2135190670);
                        i6 = -615372199;
                    } else {
                        m2566 = C2105.m6981("ۘ᩶") ^ i4;
                        i5 = ((m2566 ^ i3) * 6367) ^ 891850612;
                        i6 = -71828757;
                    }
                case -1392008796:
                case 1382570226:
                    if (C0382.f1805) {
                        m2566 = (C0630.m2566("۬֡") ^ i3) * (-101);
                        i5 = ((m2566 ^ i4) * 11941) ^ 268208196;
                        i6 = -424159645;
                    } else {
                        m2566 = C0630.m2566("۠ۡ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-11375)) ^ (-853553312);
                        i6 = -440602983;
                    }
                case -1357897048:
                case -89229151:
                    z = true;
                    if (i != 0) {
                        m2566 = (C2105.m6981("ܽ۟") + i4) * 39;
                        i5 = ((m2566 ^ i3) * 3769) ^ 1213460265;
                        i6 = -1008516771;
                    } else {
                        m2566 = (C2105.m6981("ۘ۬") + i4) * 101;
                        i5 = ((m2566 ^ i3) * 32713) ^ 1082420458;
                        i6 = -605807419;
                    }
                case -1268282730:
                case 631333526:
                    break;
                case -966708979:
                case -530927495:
                    if (C1294.f4556 >= 0) {
                        m2566 = (i4 - C2105.m6981("۫᩸")) * (-121);
                        i5 = ((m2566 ^ i3) * 29163) ^ (-2135190670);
                        i6 = -615372199;
                    } else {
                        m2566 = C2105.m6981("ۚ֡") ^ i4;
                        i5 = ((m2566 ^ i3) * (-1371)) ^ (-2070843829);
                        i6 = 1902103685;
                    }
                case -837178823:
                case 1662313351:
                    if (C3432.f10845 >= 0) {
                        m2566 = C0630.m2566("۠ۡ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-11375)) ^ (-853553312);
                        i6 = -440602983;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۧ᩸")) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        i5 = ((m2566 ^ i4) * 8773) ^ 921616559;
                        i6 = -599404816;
                    }
                case -289530169:
                case 1371630110:
                    C11340.m28031();
                    C3911.m11924();
                    m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                    i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                    i6 = -749661124;
                case 159191052:
                case 832676761:
                    if (C22628.m50615() != 0) {
                        m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                        i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                        i6 = -749661124;
                    } else {
                        m2566 = (C2105.m6981("ܺۨ") + i3) * 41;
                        i5 = ((m2566 ^ i4) * (-22677)) ^ 892877417;
                        i6 = -1195981483;
                    }
                case 244698850:
                case 283258965:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (C2105.m6981("۟֡") ^ i3) * (-17);
                        i5 = ((m2566 ^ i4) * (-3119)) ^ 1299874388;
                        i6 = -1859390035;
                    } else {
                        m2566 = (C2105.m6981("֫᩺") + i3) * (-71);
                        i5 = ((m2566 ^ i4) * (-26221)) ^ 1309928765;
                        i6 = -936673718;
                    }
                case 276725844:
                case 528664454:
                    C0714.m2805();
                    break;
                case 363740325:
                case 913830434:
                    this.f4714.set(c6495.findFirstVisibleItemPosition());
                    m2566 = C2105.m6981("۟۠") ^ i4;
                    i5 = ((m2566 ^ i3) * 2805) ^ (-1264540086);
                    i6 = 1095076832;
                case 445994327:
                case 680713392:
                    this.f4716.set(z);
                    c6495 = this.f4715;
                    if (C4159.f13567) {
                        m2566 = C2105.m6981("۬᩸") ^ i3;
                        i5 = ((m2566 ^ i4) * 23375) ^ 485402406;
                        i6 = 1449399869;
                    } else {
                        m2566 = (i4 - C2105.m6981("۫᩸")) * (-121);
                        i5 = ((m2566 ^ i3) * 29163) ^ (-2135190670);
                        i6 = -615372199;
                    }
                case 529679655:
                case 2100949258:
                    if (C0714.f2697 >= 0) {
                        m2566 = (C2105.m6981("۬ۡ") + i4) * 15;
                        i5 = ((m2566 ^ i3) * (-14255)) ^ (-1560347638);
                        i6 = 971472636;
                    } else {
                        m2566 = (C2105.m6981("۟ۨ") + i4) * 5;
                        i5 = ((m2566 ^ i3) * 2179) ^ (-1522812759);
                        i6 = -1060142964;
                    }
                case 1121611987:
                case 1523255228:
                    if (z2) {
                        m2566 = C2105.m6981("۟۠") ^ i4;
                        i5 = ((m2566 ^ i3) * 2805) ^ (-1264540086);
                        i6 = 1095076832;
                    } else {
                        m2566 = (C0630.m2566("ۡۖ") ^ i4) * (-119);
                        i5 = ((m2566 ^ i3) * 1693) ^ (-2001565623);
                        i6 = 633087266;
                    }
                default:
                    if (C0798.m2998() != 0) {
                        m2566 = (C2105.m6981("ܺۡ") + i4) * 99;
                        i5 = ((m2566 ^ i3) * (-8375)) ^ (-1679220532);
                        i6 = -749661124;
                    } else {
                        m2566 = (C2105.m6981("۬ۡ") + i4) * 15;
                        i5 = ((m2566 ^ i3) * (-14255)) ^ (-1560347638);
                        i6 = 971472636;
                    }
            }
            return;
        }
    }

    public C1313(AtomicBoolean atomicBoolean, AtomicBoolean atomicBoolean2, AtomicInteger atomicInteger, C6495 c6495) {
        int i = 316509009;
        int i2 = C1294.f4556;
        int i3 = C0483.f2088;
        this.f4717 = atomicBoolean;
        this.f4716 = atomicBoolean2;
        this.f4714 = atomicInteger;
        this.f4715 = c6495;
        int m6981 = C2105.m6981("᩶֫") ^ i3;
        int i4 = ((m6981 ^ i2) * (-24267)) ^ (-598952209);
        int i5 = 802089553;
        while (true) {
            i = (m6981 ^ i5) ^ (i4 & (((i ^ i2) * 14133) >> 31));
            switch (i) {
                case -1869060113:
                case -794803596:
                    C0422.m1963();
                    if (C0714.f2697 < 0) {
                        m6981 = C0630.m2566("֫ۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * 5941) ^ 284846741;
                        i5 = -759032015;
                    } else {
                        m6981 = C2105.m6981("ᩳ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * 3761) ^ 175675608;
                        i5 = -1396894581;
                    }
                case -865684496:
                case 62319814:
                    ViewOnClickListenerC1958.m6429();
                    m6981 = C0630.m2566("֫ۗ") ^ i2;
                    i4 = ((m6981 ^ i3) * 5941) ^ 284846741;
                    i5 = -759032015;
                case -390660609:
                case 1602211257:
                    if (C0483.f2088 >= 0) {
                        m6981 = C0630.m2566("ᩳܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-17245)) ^ (-806659306);
                        i5 = 260058960;
                    } else {
                        m6981 = C2105.m6981("֫ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 24153) ^ (-141194814);
                        i5 = -1697585541;
                    }
                case -252803673:
                case 591275145:
                    if (C1916.f6442) {
                        m6981 = (C0630.m2566("ۙ۠") ^ i3) * 77;
                        i4 = ((m6981 ^ i2) * 30131) ^ (-973527179);
                        i5 = 1312656333;
                    } else {
                        m6981 = C2105.m6981("᩷ܽ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32321)) ^ (-564564812);
                        i5 = 932614234;
                    }
                case 438340026:
                case 903387768:
                    C4117.m12364();
                    if (C0714.f2697 >= 0) {
                        m6981 = C2105.m6981("ᩳ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * 3761) ^ 175675608;
                        i5 = -1396894581;
                    } else {
                        m6981 = C0630.m2566("ᩳܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-17245)) ^ (-806659306);
                        i5 = 260058960;
                    }
                case 1894897399:
                case 2110396310:
                    C5695.m16023();
                    RunnableC0588.m2441();
                    throw new RuntimeException();
                default:
                    return;
            }
        }
    }
}
