package l;

import android.content.SharedPreferences;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.ArrayList;
import java.util.Collections;
import java.util.Iterator;
import java.util.List;
import java.util.concurrent.atomic.AtomicBoolean;
import moe.shizuku.server.IShizukuService;

/* compiled from: Z43S */
/* renamed from: l.۬ܿ᩷, reason: contains not printable characters */
/* loaded from: classes.dex */
public final class C13265 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static final AbstractC15440 f39718;

    /* renamed from: ۗۨܳ, reason: not valid java name and contains not printable characters */
    private static final short[] f39719;

    /* renamed from: ۜ, reason: not valid java name and contains not printable characters */
    public static ArrayList f39720;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static final AtomicBoolean f39721;

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public static int f39722;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public static boolean f39723;

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public static C2727 f39724;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public static ArrayList f39725;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public static C5242 f39726;

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static native List m32202();

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static native C16709 m32204(C16709 c16709, boolean z);

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static native void m32210(C18090 c18090, AbstractC15440 abstractC15440, AbstractC15440 abstractC154402, boolean z, boolean z2, InterfaceC3388 interfaceC3388);

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static native List m32213();

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public static native synchronized void m32221();

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public static native synchronized void m32224();

    /* JADX WARN: Code restructure failed: missing block: B:29:0x01b9, code lost:
    
        r1 = l.C0630.m2566("ۢۛ") ^ r12;
        r14 = ((r1 ^ r11) * (-12723)) ^ 2011462202;
        r15 = 1876442074;
     */
    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static l.AbstractC15440 m32223(java.lang.String r19) {
        /*
            Method dump skipped, instructions count: 694
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32223(java.lang.String):l.ܶ᩵ܿ");
    }

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public static void m32216() {
        boolean z = false;
        AtomicBoolean atomicBoolean = null;
        boolean z2 = false;
        RuntimeException e = null;
        int i = 254587455;
        int i2 = C1294.f4556;
        int i3 = C3537.f11231;
        int m2566 = (C0630.m2566("ܶܰ") ^ i2) * (-33);
        int i4 = ((m2566 ^ i3) * (-28207)) ^ 1085753561;
        int i5 = 1318465848;
        while (true) {
            i = ((((i ^ i3) * (-337)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2068025522:
                case 485819300:
                    return;
                case -2032291648:
                case 655330087:
                    if (C1504.f5354) {
                        m2566 = C0630.m2566("ܽ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5205)) ^ (-447061900);
                        i5 = -692383631;
                    } else {
                        m2566 = (C0630.m2566("ᩴۢ") + i3) * (-15);
                        i4 = ((m2566 ^ i2) * (-15119)) ^ (-1478930568);
                        i5 = 707803045;
                    }
                case -1926245649:
                case 1027495462:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = (C2105.m6981("۟۬") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m2566 ^ i3) * (-8653)) ^ (-1154832682);
                        i5 = -1221783851;
                    } else {
                        m2566 = C2105.m6981("ۤۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * 8483) ^ (-1856590424);
                        i5 = -2012749432;
                    }
                case -1894962965:
                case 2041790545:
                    C0630.m2564();
                    m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                    i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                    i5 = 726814345;
                case -1768354999:
                case -1352224578:
                    ViewOnClickListenerC1958.m6429();
                    if (C4616.f14690 <= 0) {
                        m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                        i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                        i5 = 726814345;
                    } else {
                        m2566 = (C2105.m6981("۟۬") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m2566 ^ i3) * (-8653)) ^ (-1154832682);
                        i5 = -1221783851;
                    }
                case -1765823779:
                case -659191357:
                    try {
                        C1802.f6209.execute(new RunnableC0565());
                        m2566 = (i2 - C0630.m2566("ۗ᩵")) * (-73);
                        i4 = ((m2566 ^ i3) * (-11105)) ^ (-355479467);
                        i5 = 171772943;
                    } catch (RuntimeException e2) {
                        e = e2;
                        m2566 = (C2105.m6981("ۛۘ") + i3) * (-125);
                        i4 = ((m2566 ^ i2) * (-31715)) ^ 213118852;
                        i5 = 736063092;
                    }
                case -1614289891:
                case -1229029370:
                    if (C2272.f7362) {
                        m2566 = C0630.m2566("ۜۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-28797)) ^ (-50977898);
                        i5 = 1935427515;
                    } else {
                        m2566 = C0630.m2566("ۚۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-14859)) ^ (-1335299359);
                        i5 = 711660768;
                    }
                case -1490236196:
                case 2002808004:
                    if (C3537.m10746() <= 0) {
                        m2566 = C0630.m2566("ܰ۠") ^ i3;
                        i4 = ((m2566 ^ i2) * (-2489)) ^ 210555648;
                        i5 = 2128566596;
                    } else {
                        m2566 = C2105.m6981("ۘܳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-15921)) ^ (-1012241069);
                        i5 = -1819867057;
                    }
                case -1471906525:
                case -598463761:
                    C1504.m5179();
                    if (C1420.f5096 <= 0) {
                        m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                        i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                        i5 = 726814345;
                    } else {
                        m2566 = C0630.m2566("ܰ۠") ^ i3;
                        i4 = ((m2566 ^ i2) * (-2489)) ^ 210555648;
                        i5 = 2128566596;
                    }
                case -1394962078:
                case 2021695227:
                    z2 = false;
                    if (atomicBoolean.compareAndSet(false, z)) {
                        m2566 = (i3 - C0630.m2566("۬᩸")) * (-121);
                        i4 = ((m2566 ^ i2) * 9785) ^ 526866959;
                        i5 = 122590833;
                    } else {
                        m2566 = C0630.m2566("֡ܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-21193)) ^ 40694423;
                        i5 = -1161319138;
                    }
                case -1310274169:
                case -533684309:
                    C0237.m1481();
                    return;
                case -1276736255:
                case -462929629:
                    atomicBoolean.set(z2);
                    throw e;
                case -1238159231:
                case 2102921443:
                    C1504.m5179();
                    if (C1711.m5736() > 0) {
                        m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                        i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                        i5 = 726814345;
                    } else {
                        m2566 = C0630.m2566("ܽ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5205)) ^ (-447061900);
                        i5 = -692383631;
                    }
                case -748676240:
                case 676696308:
                    if (C0422.f1886 <= 0) {
                        m2566 = C0630.m2566("ۜۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-28797)) ^ (-50977898);
                        i5 = 1935427515;
                    } else {
                        m2566 = (i2 - C2105.m6981("᩺ۢ")) * (-77);
                        i4 = ((m2566 ^ i3) * 25543) ^ 75492508;
                        i5 = -142559237;
                    }
                case -666460827:
                case 365932169:
                    return;
                case -639246661:
                case 561753207:
                    z = true;
                    atomicBoolean = f39721;
                    if (C1005.f3721) {
                        m2566 = C2105.m6981("ۧۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 849) ^ (-99009812);
                        i5 = 136619554;
                    } else {
                        m2566 = (C2105.m6981("۟۬") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m2566 ^ i3) * (-8653)) ^ (-1154832682);
                        i5 = -1221783851;
                    }
                case -209405834:
                case 2064287208:
                    if (C3245.m9925() != 0) {
                        m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                        i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                        i5 = 726814345;
                    } else {
                        m2566 = C2105.m6981("۠᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-10921)) ^ (-188576892);
                        i5 = 1553346879;
                    }
                case 627724473:
                case 1184572018:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = (i3 - C0630.m2566("۟᩻")) * (-31);
                        i4 = ((m2566 ^ i2) * 5773) ^ (-1796464307);
                        i5 = 726814345;
                    } else {
                        m2566 = (C0630.m2566("᩵ۛ") + i2) * (-7);
                        i4 = ((m2566 ^ i3) * (-1013)) ^ 280111967;
                        i5 = -987176993;
                    }
                case 1111416670:
                case 1259660779:
                    if (C3663.f11553) {
                        m2566 = C0630.m2566("ܰ۠") ^ i3;
                        i4 = ((m2566 ^ i2) * (-2489)) ^ 210555648;
                        i5 = 2128566596;
                    } else {
                        m2566 = C0630.m2566("ᩴᩴ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-19633)) ^ 643864228;
                        i5 = -187690381;
                    }
                default:
                    if (C22628.f73083 <= 0) {
                        m2566 = C0630.m2566("ܽ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5205)) ^ (-447061900);
                        i5 = -692383631;
                    } else {
                        m2566 = (C0630.m2566("ۗۛ") + i3) * 101;
                        i4 = ((m2566 ^ i2) * (-6363)) ^ 1491279973;
                        i5 = -1777490478;
                    }
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static /* synthetic */ void m32208(EnumC13610 enumC13610) {
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = -1502633123;
        int i5 = ServiceConnectionC3453.f10921;
        int i6 = C1047.f3863;
        int m2566 = C0630.m2566("۠᩻") ^ i6;
        int i7 = ((m2566 ^ i5) * 7549) ^ 1526511886;
        int i8 = -648420857;
        while (true) {
            i4 = ((((i4 ^ i5) * 22173) >> 31) & i7) ^ (m2566 ^ i8);
            switch (i4) {
                case -1798104156:
                case 2107096417:
                    break;
                case -1786865080:
                case -424904551:
                    f39722 = i3;
                    if (C1294.f4556 >= 0) {
                        m2566 = C2105.m6981("۠᩷") ^ i6;
                        i7 = ((m2566 ^ i5) * (-22127)) ^ (-1305106312);
                        i8 = -370532786;
                    } else {
                        m2566 = (i5 - C2105.m6981("ۨ֨")) * 83;
                        i7 = ((m2566 ^ i6) * 17113) ^ (-735796264);
                        i8 = -1409408566;
                    }
                case -1729038051:
                case -170807467:
                    i = f39722;
                    i2 = 1;
                    if (C7811.f24123 >= 0) {
                        m2566 = (C0630.m2566("ۜ֫") ^ i5) * 87;
                        i7 = ((m2566 ^ i6) * (-32229)) ^ 1964954951;
                        i8 = -503307397;
                    } else {
                        m2566 = C2105.m6981("ۖۖ") ^ i5;
                        i7 = ((m2566 ^ i6) * (-6455)) ^ 1578612628;
                        i8 = 412499941;
                    }
                case -1670070529:
                case 633661746:
                    if (C3537.m10746() <= 0) {
                        m2566 = (C0630.m2566("ۜ֫") ^ i5) * 87;
                        i7 = ((m2566 ^ i6) * (-32229)) ^ 1964954951;
                        i8 = -503307397;
                    } else {
                        m2566 = (C2105.m6981("۟᩶") + i5) * 99;
                        i7 = ((m2566 ^ i6) * (-11197)) ^ 445960056;
                        i8 = 422969782;
                    }
                case -1518846560:
                case -194965419:
                    if (C3245.f10203 <= 0) {
                        m2566 = C2105.m6981("۠᩷") ^ i6;
                        i7 = ((m2566 ^ i5) * (-22127)) ^ (-1305106312);
                        i8 = -370532786;
                    } else {
                        m2566 = (C0630.m2566("ܶ᩸") ^ i6) * 9;
                        i7 = ((m2566 ^ i5) * (-10589)) ^ (-1981146878);
                        i8 = -722951494;
                    }
                case -1453046630:
                case 29328058:
                    C0630.m2564();
                    if (C1294.f4556 < 0) {
                        m2566 = C0630.m2566("᩶ۜ") ^ i6;
                        i7 = ((m2566 ^ i5) * (-21199)) ^ 2143456199;
                        i8 = 1138976972;
                    } else {
                        m2566 = (C0630.m2566("ۜ֫") ^ i5) * 87;
                        i7 = ((m2566 ^ i6) * (-32229)) ^ 1964954951;
                        i8 = -503307397;
                    }
                case -1395748001:
                case 791217472:
                    if (C2126.f7087) {
                        m2566 = (C0630.m2566("ۜ֫") ^ i5) * 87;
                        i7 = ((m2566 ^ i6) * (-32229)) ^ 1964954951;
                        i8 = -503307397;
                    } else {
                        m2566 = (C2105.m6981("᩸ۘ") + i6) * 35;
                        i7 = ((m2566 ^ i5) * (-8867)) ^ 127991519;
                        i8 = -21127199;
                    }
                case -1318760071:
                case -92872159:
                    if (C3245.f10203 <= 0) {
                        m2566 = (C0630.m2566("ۜ֫") ^ i5) * 87;
                        i7 = ((m2566 ^ i6) * (-32229)) ^ 1964954951;
                        i8 = -503307397;
                    } else {
                        m2566 = (C2105.m6981("۫ۙ") + i5) * (-39);
                        i7 = ((m2566 ^ i6) * 5633) ^ 1908066755;
                        i8 = 416520049;
                    }
                case -1268943825:
                case -1116306205:
                    i3 = i + i2;
                    if (C4075.f12947 >= 0) {
                        m2566 = (C2105.m6981("᩸ۘ") + i6) * 35;
                        i7 = ((m2566 ^ i5) * (-8867)) ^ 127991519;
                        i8 = -21127199;
                    } else {
                        m2566 = C0630.m2566("᩹۠") ^ i6;
                        i7 = ((m2566 ^ i5) * (-887)) ^ 1928895839;
                        i8 = 1809270391;
                    }
                case -1218992309:
                case -828877181:
                    C0382.m1848();
                    C2272.m7503();
                    break;
                case -676745855:
                case 1411451125:
                    if (enumC13610.m32728()) {
                        m2566 = C2105.m6981("ۧ᩺") ^ i5;
                        i7 = ((m2566 ^ i6) * 30277) ^ (-587243945);
                        i8 = -1855932318;
                    } else {
                        m2566 = C0630.m2566("۬ۗ") ^ i6;
                        i7 = ((m2566 ^ i5) * 13419) ^ (-1322094354);
                        i8 = 2024372055;
                    }
                case -591796595:
                case -19650195:
                    if (C1128.f4106 <= 0) {
                        m2566 = C2105.m6981("۠᩷") ^ i6;
                        i7 = ((m2566 ^ i5) * (-22127)) ^ (-1305106312);
                        i8 = -370532786;
                    } else {
                        m2566 = C2105.m6981("᩵ᩳ") ^ i6;
                        i7 = ((m2566 ^ i5) * 29379) ^ 1119709464;
                        i8 = -1463835963;
                    }
                case 509986760:
                case 1015168799:
                    if (C0714.f2697 >= 0) {
                        m2566 = C0630.m2566("᩶ۜ") ^ i6;
                        i7 = ((m2566 ^ i5) * (-21199)) ^ 2143456199;
                        i8 = 1138976972;
                    } else {
                        m2566 = (C2105.m6981("᩸᩹") ^ i5) * (-75);
                        i7 = ((m2566 ^ i6) * (-16329)) ^ 1510367820;
                        i8 = 623391132;
                    }
                case 524669269:
                case 1778461970:
                    RunnableC1937.m6387();
                    RunnableC0588.m2441();
                    m2566 = C0630.m2566("᩶ۜ") ^ i6;
                    i7 = ((m2566 ^ i5) * (-21199)) ^ 2143456199;
                    i8 = 1138976972;
                case 766007417:
                case 1857675650:
                    if (C1128.m3851() <= 0) {
                        m2566 = C2105.m6981("۠᩷") ^ i6;
                        i7 = ((m2566 ^ i5) * (-22127)) ^ (-1305106312);
                        i8 = -370532786;
                    } else {
                        m2566 = C0630.m2566("ۗۡ") ^ i6;
                        i7 = ((m2566 ^ i5) * (-5257)) ^ (-1176436958);
                        i8 = -1826809781;
                    }
                case 1223737766:
                case 1687352496:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = (C2105.m6981("᩸ۘ") + i6) * 35;
                        i7 = ((m2566 ^ i5) * (-8867)) ^ 127991519;
                        i8 = -21127199;
                    } else {
                        m2566 = (C0630.m2566("᩻ۚ") + i5) * (-43);
                        i7 = ((m2566 ^ i6) * 2213) ^ (-730863771);
                        i8 = -1660932540;
                    }
                case 1311020947:
                case 2145613274:
                    f39726.mo1664(C1420.m4916(i3));
                    m2566 = C2105.m6981("ۧ᩺") ^ i5;
                    i7 = ((m2566 ^ i6) * 30277) ^ (-587243945);
                    i8 = -1855932318;
                default:
                    if (C7106.m19120() <= 0) {
                        m2566 = C0630.m2566("᩶ۜ") ^ i6;
                        i7 = ((m2566 ^ i5) * (-21199)) ^ 2143456199;
                        i8 = 1138976972;
                    } else {
                        m2566 = (C0630.m2566("ۚ֫") ^ i6) * (-95);
                        i7 = ((m2566 ^ i5) * (-13537)) ^ (-1579639272);
                        i8 = 2129738517;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:37:0x0061, code lost:
    
        if (l.C3245.m9925() != 0) goto L34;
     */
    /* JADX WARN: Code restructure failed: missing block: B:42:0x0067, code lost:
    
        if (l.C2520.f8000 < 0) goto L16;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m32207(java.lang.String r23) {
        /*
            Method dump skipped, instructions count: 920
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32207(java.lang.String):void");
    }

    static {
        ApplicationC12518.m30701(IShizukuService.Stub.TRANSACTION_getFlagsForUid);
        f39719 = new short[]{5166, 18442, 18454, 18447, 18461, 18451, 18452, 18441, 4738, -8824, -8813, -8820, -8821, -8813, -8819, -8822, -8813, -8819, -8822, -8813, -8820, -8827, -8813, -8819, -8827, -8813, -8820, -8828, -8820, -8819, -8820, -8820, -8820, -8817, -8820, -8817, -8719, -8820, -8818, -8820, -8823, -8820, -8824, -8820, -8821, -16595, -20219, -18229, 17988, -30085, -28709, 6435, -29553, -29551, -21620, 22430, -20903, 19509, -20779, -29807, -29517, 18744, -19417, -18574, -17510, -29827, 23737, -10088, -9997, -10002, -9990, -10078, -10002, -10055, -10110, -10002, -10087, -10084, -10082, -10088, -9997, -10002, -9990, -10078, -10002, -10055, -10110, -10002, -10087, -10084, -10003, -10082, -10007, -10088, -9997, -10002, -9990, -10078, -10002, -10055, -10110, -10002, -10087, -10084, -10082, -29811, -20319, -23620, -27127, 21877, 16540, 6676, -3305, -3301, -3308, -3309, -3300, -3297, -3319, -3314, -3244, -3312, -3319, -3307, -3308, 27284, -26576, 30485, -3216, 1056, 25394, 25373, 25364, 25360, 25347, 25425, 25365, 25360, 25349, 25360, 25419, 25425, 25367, 25368, 25373, 25364, 25346, 1883, -526, -530, -521, -539, -533, -532, 7172, 13893, 13922, 13951, 13944, 13933, 13920, 13920, 13925, 13922, 13931, 13858, 13858, 13858, 13868, 13935, 13923, 13928, 13929, 13858, 13926, 13933, 13950, 13920, 13925, 13934, 13951, 13859, 13858, 13926, 13933, 13946, 13933, 13951, 13950, 13935, 13859, 13935, 13923, 13921, 13948, 13925, 13920, 13929, 13933, 13951, 13951, 13929, 13944, 13951, 13859, 13858, 13921, 13944, 13920, 13951, 13950, 13935, 13920, 13925, 13934, 13951, 13935, 13920, 13933, 13951, 13951, 13929, 13951, 13951, 13950, 13935, 13858, 13926, 13933, 13950, 13904, 13934, 13933, 13922, 13928, 13950, 13923, 13925, 13928, 13904, 13858, 13951, 13945, 13948, 13948, 13923, 13950, 13944, 13904, 13858, 13933, 13922, 13922, 13923, 13944, 13933, 13944, 13925, 13923, 13922, 13904, 13858, 13933, 13922, 13928, 13950, 13923, 13925, 13928, 13940, 13858, 13933, 13922, 13922, 13923, 13944, 13933, 13944, 13925, 13923, 13922, 13858, 13904, 13934, 13889, 13912, 13916, 13920, 13945, 13931, 13925, 13922, 13903, 13923, 13922, 13944, 13929, 13940, 13944, 13904, 13934, 13916, 13920, 13945, 13931, 13925, 13922, 13903, 13923, 13922, 13944, 13929, 13940, 13944, 13935, 13923, 13928, 13929, 13907, 13948, 13933, 13944, 13935, 13924, 13948, 13920, 13945, 13931, 13925, 13922, 13858, 13921, 13944, 13948, 13930, 13925, 13920, 13929, 13951, 13893, 13922, 13951, 13944, 13933, 13920, 13920, 13868, 13930, 13933, 13925, 13920, 13858, 13868, 13860, 13889, 13923, 13946, 13929, 13868, 13928, 13925, 13950, 13861, 13919, 13945, 13935, 13935, 13929, 13951, 13951, 13930, 13945, 13920, 13868, 13925, 13922, 13951, 13944, 13933, 13920, 13920, 13933, 13944, 13925, 13923, 13922, 13858, 1477, 3040, 9854, -7288, -7245, -7244, -7245, -7250, -7255, -7236, -7247, -7247, -7193, -7171, 8884, -27447, -27407, -27405, -27422, -27451, -27394, -27401, -27420, -27405, -27406, -27450, -27420, -27405, -27408, -27405, -27420, -27405, -27400, -27403, -27405, -27419, -27458, -27464, -27464, -27464, -27457, 2687, -21526, -21530, -21523, -21524, -21526, -21530, -21523, -21524, -21546, -21511, -21528, -21507, -21526, -21535, -21511, -21531, -21508, -21522, -21536, -21529, -21593, -21532, -21507, -21511, -21564, -21555, -21572, -21591, -21526, -21535, -21528, -21529, -21522, -21524, -21523, -21581, -21591, 4209, -32005, -32025, -32002, -32020, -32030, -32027, -32092};
        AbstractC15440 abstractC15440 = null;
        String str = null;
        ArrayList arrayList = null;
        C5242 c5242 = null;
        short s = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        short[] sArr = null;
        int i4 = 0;
        int i5 = -111291308;
        int i6 = C3537.f11231;
        int i7 = C3683.f11629;
        int m6981 = (i6 - C2105.m6981("۫ۨ")) * 39;
        int i8 = ((m6981 ^ i7) * 14077) ^ (-1082390138);
        int i9 = -2020132372;
        while (true) {
            i5 = ((((i5 ^ i7) * 2555) >> 31) & i8) ^ (m6981 ^ i9);
            switch (i5) {
                case -2112070002:
                case 63633804:
                    i3 = 65187;
                    m6981 = C0630.m2566("۬ۘ") ^ i7;
                    i8 = ((m6981 ^ i6) * 9777) ^ 121150642;
                    i9 = 937572700;
                case -1828527692:
                case -1016781347:
                    abstractC15440 = C16293.f50117;
                    sArr = f39719;
                    i4 = 1;
                    if (C2167.f7158 >= 0) {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    } else {
                        m6981 = C0630.m2566("᩻ᩴ") ^ i6;
                        i8 = ((m6981 ^ i7) * (-27259)) ^ 627416463;
                        i9 = -1276004;
                    }
                case -1810551866:
                case -645712622:
                    i2 = 182817441 + i;
                    if (C3683.f11629 >= 0) {
                        m6981 = (i6 - C0630.m2566("ܶܳ")) * (-89);
                        i8 = ((m6981 ^ i7) * (-25703)) ^ 1452846174;
                        i9 = 1211378824;
                    } else {
                        m6981 = (C0630.m2566("ܽ۠") + i7) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i8 = ((m6981 ^ i6) * (-15405)) ^ (-140207626);
                        i9 = 1717039620;
                    }
                case -1763678079:
                case 382928498:
                    i3 = 18554;
                    m6981 = C0630.m2566("۬ۘ") ^ i7;
                    i8 = ((m6981 ^ i6) * 9777) ^ 121150642;
                    i9 = 937572700;
                case -1755139636:
                case 1628875220:
                    int i10 = s + 13521;
                    if ((i2 + i2) - (i10 * i10) >= 0) {
                        m6981 = C0630.m2566("ۚܰ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-15493)) ^ (-1715891592);
                        i9 = -497804279;
                    } else {
                        m6981 = C2105.m6981("ۖܳ") ^ i6;
                        i8 = ((m6981 ^ i7) * 7689) ^ 336478088;
                        i9 = -764203301;
                    }
                case -1682717895:
                case 1567942490:
                    f39723 = true;
                    f39721 = new AtomicBoolean();
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    } else {
                        m6981 = C0630.m2566("֫᩻") ^ i7;
                        i8 = ((m6981 ^ i6) * (-28251)) ^ (-1230685200);
                        i9 = 172575071;
                    }
                case -1678261258:
                case -208433561:
                    c5242.m1665((InterfaceC1008) new C19617());
                    return;
                case -1520266622:
                case 1804100009:
                    if (C2520.f8000 >= 0) {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    } else {
                        m6981 = (i6 - C0630.m2566("ܶܳ")) * (-89);
                        i8 = ((m6981 ^ i7) * (-25703)) ^ 1452846174;
                        i9 = 1211378824;
                    }
                case -1475888394:
                case 777438351:
                    str = C1420.m4902(sArr, i4, 7, i3);
                    if (C0964.m3413()) {
                        m6981 = (C0630.m2566("ۛۨ") ^ i7) * 29;
                        i8 = ((m6981 ^ i6) * (-32617)) ^ (-554261643);
                        i9 = 1657905772;
                    } else {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    }
                case -1343681074:
                case 381764906:
                    f39725 = new ArrayList();
                    if (C2958.f9394 >= 0) {
                        m6981 = (i6 - C2105.m6981("ܳᩴ")) * (-111);
                        i8 = ((m6981 ^ i7) * 22125) ^ (-2003754001);
                        i9 = 2057799952;
                    } else {
                        m6981 = (i7 - C2105.m6981("ܺ֨")) * (-5);
                        i8 = ((m6981 ^ i6) * 3983) ^ (-1204291966);
                        i9 = 1680430495;
                    }
                case -809555732:
                case -371354839:
                    f39720 = arrayList;
                    f39724 = new C2727();
                    if (C3245.m9925() != 0) {
                        m6981 = C2105.m6981("᩻᩶") ^ i7;
                        i8 = ((m6981 ^ i6) * 237) ^ (-1244469447);
                        i9 = 7678311;
                    } else {
                        m6981 = (i6 - C0630.m2566("᩻ܰ")) * 37;
                        i8 = ((m6981 ^ i7) * 24775) ^ (-93829576);
                        i9 = 1501975171;
                    }
                case -778067220:
                case -700806465:
                    f39718 = C3663.m11176(abstractC15440, str);
                    arrayList = new ArrayList();
                    if (C3537.f11231 >= 0) {
                        m6981 = (C0630.m2566("ᩴۨ") + i7) * 11;
                        i8 = ((m6981 ^ i6) * 29841) ^ 1587130686;
                        i9 = -936372471;
                    } else {
                        m6981 = C2105.m6981("ۢۤ") ^ i6;
                        i8 = ((m6981 ^ i7) * 3075) ^ 2129807978;
                        i9 = 503773412;
                    }
                case -259031541:
                case 1590615411:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    } else {
                        m6981 = C2105.m6981("᩻᩶") ^ i7;
                        i8 = ((m6981 ^ i6) * 237) ^ (-1244469447);
                        i9 = 7678311;
                    }
                case -185489455:
                case 953222052:
                    C3019.m9255();
                    if (C0964.f3626 == 0) {
                        m6981 = C0630.m2566("ۧ۫") ^ i6;
                        i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                        i9 = -1714536531;
                    } else {
                        m6981 = (C0630.m2566("ᩴۨ") + i7) * 11;
                        i8 = ((m6981 ^ i6) * 29841) ^ 1587130686;
                        i9 = -936372471;
                    }
                case -20036990:
                case 1406865953:
                    f39722 = 0;
                    if (C0422.f1886 <= 0) {
                        m6981 = (i6 - C0630.m2566("ܶܳ")) * (-89);
                        i8 = ((m6981 ^ i7) * (-25703)) ^ 1452846174;
                        i9 = 1211378824;
                    } else {
                        f39726 = new C5242(C1420.m4916(0));
                        c5242 = C7261.f22281;
                        if (C3537.f11231 >= 0) {
                            m6981 = (i6 - C2105.m6981("ܳᩴ")) * (-111);
                            i8 = ((m6981 ^ i7) * 22125) ^ (-2003754001);
                            i9 = 2057799952;
                        } else {
                            m6981 = (C0630.m2566("۠ۧ") ^ i6) * (-93);
                            i8 = ((m6981 ^ i7) * (-32201)) ^ (-520403753);
                            i9 = 1022155360;
                        }
                    }
                case 1215819523:
                case 1701785252:
                    C3537.m10746();
                    throw new RuntimeException();
                case 1237895842:
                case 1597026285:
                    AbstractC2021.m6574();
                    m6981 = C0630.m2566("ۧ۫") ^ i6;
                    i8 = ((m6981 ^ i7) * (-2847)) ^ (-5847484);
                    i9 = -1714536531;
                default:
                    s = f39719[0];
                    i = s * s;
                    if (C4117.m12364() != 0) {
                        m6981 = (i6 - C2105.m6981("ܳᩴ")) * (-111);
                        i8 = ((m6981 ^ i7) * 22125) ^ (-2003754001);
                        i9 = 2057799952;
                    } else {
                        m6981 = C2105.m6981("ۗܺ") ^ i6;
                        i8 = ((m6981 ^ i7) * 9553) ^ (-1939723024);
                        i9 = 1168964815;
                    }
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static boolean m32212(ArrayList arrayList) {
        Iterator it = null;
        String str = null;
        C2727 c2727 = null;
        Object obj = null;
        Object obj2 = null;
        int i = 745206185;
        int i2 = C3432.f10845;
        int i3 = C11340.f33930;
        int m6981 = C2105.m6981("ۗ֡") ^ i2;
        int i4 = ((m6981 ^ i3) * (-23577)) ^ 476307736;
        int i5 = 1525309020;
        while (true) {
            i = ((((i ^ i3) * (-14899)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2092000608:
                case 1346209211:
                    if (C4075.m12263() <= 0) {
                        m6981 = C2105.m6981("ܺۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 833) ^ (-363917853);
                        i5 = 1145519408;
                    } else {
                        m6981 = (C2105.m6981("ܰ᩸") ^ i3) * 61;
                        i4 = ((m6981 ^ i2) * 32555) ^ 2078014312;
                        i5 = -1374019340;
                    }
                case -1830313122:
                case -324927084:
                    c2727 = f39724;
                    obj = null;
                    if (C3019.f9544 >= 0) {
                        m6981 = (C0630.m2566("۟᩸") + i3) * 15;
                        i4 = ((m6981 ^ i2) * (-3879)) ^ 13724234;
                        i5 = -594789625;
                    } else {
                        m6981 = (C0630.m2566("ᩴ᩸") ^ i2) * 97;
                        i4 = ((m6981 ^ i3) * (-7597)) ^ 253822437;
                        i5 = -327734816;
                    }
                case -1818866873:
                case 1680561396:
                    if (C0798.m3001()) {
                        m6981 = C0630.m2566("۠ᩴ") ^ i2;
                        i4 = ((m6981 ^ i3) * 12601) ^ (-277991478);
                        i5 = -1455186220;
                    } else {
                        m6981 = (C2105.m6981("֨ۜ") + i2) * 37;
                        i4 = ((m6981 ^ i3) * (-13563)) ^ 221703118;
                        i5 = -545327486;
                    }
                case -1776711243:
                case 1133031008:
                    str = (String) RunnableC1108.m3791(it);
                    if (RunnableC1937.m6386(arrayList, str)) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-93);
                        i4 = ((m6981 ^ i2) * (-693)) ^ (-4252885);
                        i5 = -389219132;
                    } else {
                        m6981 = (C0630.m2566("ۗ۫") + i3) * (-3);
                        i4 = ((m6981 ^ i2) * (-4261)) ^ 1029341058;
                        i5 = 1876752612;
                    }
                case -1741737751:
                case 88781149:
                    if (C0050.f910 >= 0) {
                        m6981 = (C0630.m2566("ۡۛ") ^ i3) * (-51);
                        i4 = ((m6981 ^ i2) * 1309) ^ 1779950895;
                        i5 = -968294131;
                    } else {
                        m6981 = C0630.m2566("ۙ۟") ^ i2;
                        i4 = ((m6981 ^ i3) * (-32447)) ^ 1216723625;
                        i5 = 911874734;
                    }
                case -1307938916:
                case 1326390125:
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("ܺۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 833) ^ (-363917853);
                        i5 = 1145519408;
                    } else {
                        m6981 = (C0630.m2566("ۡۛ") ^ i3) * (-51);
                        i4 = ((m6981 ^ i2) * 1309) ^ 1779950895;
                        i5 = -968294131;
                    }
                case -1144411243:
                case 796001365:
                    if (C4117.f13076 > 0) {
                        m6981 = (C0630.m2566("ۡۛ") ^ i3) * (-51);
                        i4 = ((m6981 ^ i2) * 1309) ^ 1779950895;
                        i5 = -968294131;
                    } else {
                        m6981 = C0630.m2566("ۘۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-297)) ^ 806852731;
                        i5 = -1288140684;
                    }
                case -1068202755:
                case -609313755:
                    C16709 c16709 = (C16709) obj2;
                    C3537.m10749(c16709);
                    if (c16709.m39309()) {
                        m6981 = (i3 - C0630.m2566("֡ܶ")) * (-93);
                        i4 = ((m6981 ^ i2) * (-693)) ^ (-4252885);
                        i5 = -389219132;
                    } else {
                        m6981 = C0630.m2566("᩹ۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15993) ^ (-829393830);
                        i5 = 1487359715;
                    }
                case -307220811:
                case -295553035:
                    return true;
                case -268509986:
                case 248296884:
                    m32221();
                    if (C3746.m11369() >= 0) {
                        m6981 = C0630.m2566("ۘۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-297)) ^ 806852731;
                        i5 = -1288140684;
                    } else {
                        m6981 = C0630.m2566("ۜܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-26719)) ^ (-1491996374);
                        i5 = -901137429;
                    }
                case -246185736:
                case 2007678703:
                    C0964.m3413();
                    return false;
                case -210406194:
                case 522949680:
                    return false;
                case -122383237:
                case 236360887:
                    if (C2958.f9394 >= 0) {
                        m6981 = C0630.m2566("ۘۖ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-297)) ^ 806852731;
                        i5 = -1288140684;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۛۤ")) * (-81);
                        i4 = ((m6981 ^ i2) * 27917) ^ 2067207766;
                        i5 = 587131430;
                    }
                case -65935333:
                case 127371612:
                    if (C5695.f17556 >= 0) {
                        m6981 = C2105.m6981("ܰᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25463) ^ (-182040592);
                        i5 = 1877177837;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩺᩺")) * (-113);
                        i4 = ((m6981 ^ i3) * (-5815)) ^ (-1548481417);
                        i5 = 2001922668;
                    }
                case 71122225:
                case 1592910245:
                    if (C0483.m2123(it)) {
                        m6981 = C2105.m6981("ۧ᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * (-6083)) ^ (-1691554978);
                        i5 = -1750959825;
                    } else {
                        m6981 = (C2105.m6981("֨ۜ") + i2) * 37;
                        i4 = ((m6981 ^ i3) * (-13563)) ^ 221703118;
                        i5 = -545327486;
                    }
                case 103549346:
                case 409717599:
                    if (C2272.f7362) {
                        m6981 = (C0630.m2566("ۡۛ") ^ i3) * (-51);
                        i4 = ((m6981 ^ i2) * 1309) ^ 1779950895;
                        i5 = -968294131;
                    } else {
                        m6981 = (C0630.m2566("۟᩸") + i3) * 15;
                        i4 = ((m6981 ^ i2) * (-3879)) ^ 13724234;
                        i5 = -594789625;
                    }
                case 153786941:
                case 1190892790:
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (C0630.m2566("۟᩸") + i3) * 15;
                        i4 = ((m6981 ^ i2) * (-3879)) ^ 13724234;
                        i5 = -594789625;
                    } else {
                        m6981 = (C0630.m2566("ۗܰ") + i2) * (-63);
                        i4 = ((m6981 ^ i3) * (-13231)) ^ (-633360671);
                        i5 = -1754068390;
                    }
                case 426701474:
                case 2099705443:
                    C3911.m11924();
                    m6981 = C2105.m6981("ܺۚ") ^ i2;
                    i4 = ((m6981 ^ i3) * 833) ^ (-363917853);
                    i5 = 1145519408;
                case 475474536:
                case 1376997922:
                    it = C2958.m9029(f39725);
                    m6981 = (i3 - C0630.m2566("֡ܶ")) * (-93);
                    i4 = ((m6981 ^ i2) * (-693)) ^ (-4252885);
                    i5 = -389219132;
                case 498971161:
                case 1908940748:
                    obj2 = c2727.getOrDefault(str, obj);
                    if (C1504.f5354) {
                        m6981 = C2105.m6981("ܰᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25463) ^ (-182040592);
                        i5 = 1877177837;
                    } else {
                        m6981 = C0630.m2566("ۢ᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * 4995) ^ 2080890300;
                        i5 = 343821337;
                    }
                case 539828560:
                case 590181308:
                    if (C22628.f73083 <= 0) {
                        m6981 = C2105.m6981("ܰᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25463) ^ (-182040592);
                        i5 = 1877177837;
                    } else {
                        m6981 = (C0630.m2566("֨ܿ") + i3) * 47;
                        i4 = ((m6981 ^ i2) * (-455)) ^ 1656113126;
                        i5 = -1255854773;
                    }
                default:
                    if (C3245.m9925() != 0) {
                        m6981 = C2105.m6981("ܰᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 25463) ^ (-182040592);
                        i5 = 1877177837;
                    } else {
                        m6981 = (C0630.m2566("ܳܺ") + i2) * (-13);
                        i4 = ((m6981 ^ i3) * (-29241)) ^ (-1909209869);
                        i5 = -928965920;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:45:0x005d, code lost:
    
        if (l.C0964.f3626 == 0) goto L14;
     */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m32215(java.lang.String r21) {
        /*
            Method dump skipped, instructions count: 896
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32215(java.lang.String):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:19:0x0052, code lost:
    
        if (l.C1047.f3863 < 0) goto L39;
     */
    /* JADX WARN: Code restructure failed: missing block: B:23:0x005a, code lost:
    
        if (l.C3663.m11168() < 0) goto L59;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m32206(int r10, int r11) {
        /*
            Method dump skipped, instructions count: 564
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32206(int, int):void");
    }

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public static int m32218() {
        m32221();
        return f39722;
    }

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public static C5242 m32222() {
        m32221();
        return f39726;
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static List m32214(ArrayList arrayList) {
        ArrayList arrayList2 = null;
        Iterator it = null;
        String str = null;
        C2727 c2727 = null;
        Object obj = null;
        Object obj2 = null;
        C16709 c16709 = null;
        int i = 1503218432;
        int i2 = C3746.f11829;
        int i3 = C4075.f12947;
        int m2566 = (i2 - C0630.m2566("ۙۡ")) * 49;
        int i4 = ((m2566 ^ i3) * (-18903)) ^ 1813359185;
        int i5 = -1323869114;
        while (true) {
            i = ((((i ^ i3) * 17289) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2143534262:
                case 1482996421:
                    c16709 = (C16709) obj2;
                    C3019.m9257(c16709);
                    if (c16709.m39309()) {
                        m2566 = (i2 - C0630.m2566("֫ܺ")) * (-33);
                        i4 = ((m2566 ^ i3) * (-16187)) ^ 902639442;
                        i5 = 1364673450;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۖ᩻")) * (-5);
                        i4 = ((m2566 ^ i2) * 14777) ^ (-474629488);
                        i5 = -1668014110;
                    }
                case -2136125082:
                case -591373277:
                    c2727 = f39724;
                    obj = null;
                    if (C1504.f5354) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = (C2105.m6981("ۜۗ") ^ i3) * (-5);
                        i4 = ((m2566 ^ i2) * (-32381)) ^ 1685136259;
                        i5 = 1410064730;
                    }
                case -2119177204:
                case -1876435688:
                    C1420.m4913();
                    return null;
                case -1946931086:
                case 444529998:
                    if (C22628.f73083 > 0) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = (i3 - C0630.m2566("۟ۖ")) * (-25);
                        i4 = ((m2566 ^ i2) * 19815) ^ (-966486699);
                        i5 = 492624082;
                    }
                case -1825740658:
                case 2117589006:
                    if (C0382.f1805) {
                        m2566 = C0630.m2566("ۧ֫") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5501)) ^ (-747615202);
                        i5 = -1524786784;
                    } else {
                        m2566 = (i3 - C0630.m2566("۟ۖ")) * (-25);
                        i4 = ((m2566 ^ i2) * 19815) ^ (-966486699);
                        i5 = 492624082;
                    }
                case -1744791059:
                case 1610032953:
                    C1916.m6308();
                    C2958.m9034();
                    m2566 = (C0630.m2566("ۚۢ") + i2) * 99;
                    i4 = ((m2566 ^ i3) * (-29221)) ^ 1106807665;
                    i5 = 1450975359;
                case -1726543983:
                case 947335682:
                    return arrayList2;
                case -1701448737:
                case -3903033:
                    str = (String) RunnableC1108.m3791(it);
                    if (arrayList.contains(str)) {
                        m2566 = (i2 - C0630.m2566("֫ܺ")) * (-33);
                        i4 = ((m2566 ^ i3) * (-16187)) ^ 902639442;
                        i5 = 1364673450;
                    } else {
                        m2566 = C2105.m6981("᩺᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * 3779) ^ (-404495055);
                        i5 = -428386622;
                    }
                case -1321535000:
                case 706163702:
                    arrayList2 = new ArrayList();
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (C0630.m2566("ۚۢ") + i2) * 99;
                        i4 = ((m2566 ^ i3) * (-29221)) ^ 1106807665;
                        i5 = 1450975359;
                    } else {
                        m2566 = C2105.m6981("۠ܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-24907)) ^ (-500231983);
                        i5 = -1790359646;
                    }
                case -1304306540:
                case 37677963:
                    obj2 = c2727.getOrDefault(str, obj);
                    if (C4075.f12947 >= 0) {
                        m2566 = C0630.m2566("ۗܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * 27151) ^ (-1842979319);
                        i5 = 2091347693;
                    } else {
                        m2566 = (C2105.m6981("ۜ᩵") + i2) * 123;
                        i4 = ((m2566 ^ i3) * (-22595)) ^ (-2100900219);
                        i5 = 851205583;
                    }
                case -1301520075:
                case -292198994:
                    C3245.m9925();
                    if (C4159.m12565() >= 0) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = C2105.m6981("᩷ۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 3643) ^ 1665323978;
                        i5 = -1530150179;
                    }
                case -1280089449:
                case 816821351:
                    if (C0798.m3001()) {
                        m2566 = C2105.m6981("۠֡") ^ i3;
                        i4 = ((m2566 ^ i2) * 3383) ^ 1167322426;
                        i5 = 962671345;
                    } else {
                        m2566 = C2105.m6981("ۗۙ") ^ i3;
                        i4 = ((m2566 ^ i2) * 8907) ^ 2056573331;
                        i5 = -1679272561;
                    }
                case -1165320857:
                case -208612591:
                    it = C2958.m9029(f39725);
                    m2566 = (i2 - C0630.m2566("֫ܺ")) * (-33);
                    i4 = ((m2566 ^ i3) * (-16187)) ^ 902639442;
                    i5 = 1364673450;
                case -1010562335:
                case -985929548:
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("ۚۢ") + i2) * 99;
                        i4 = ((m2566 ^ i3) * (-29221)) ^ 1106807665;
                        i5 = 1450975359;
                    } else {
                        m2566 = C0630.m2566("ᩴ۫") ^ i3;
                        i4 = ((m2566 ^ i2) * (-23459)) ^ (-402747629);
                        i5 = 1956735506;
                    }
                case -894873309:
                case 859479991:
                    C7106.m19117(arrayList2, c16709);
                    m2566 = (i2 - C0630.m2566("֫ܺ")) * (-33);
                    i4 = ((m2566 ^ i3) * (-16187)) ^ 902639442;
                    i5 = 1364673450;
                case -544092073:
                case 1007813361:
                    if (C7106.m19120() <= 0) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = C0630.m2566("֫ᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-18273)) ^ (-2069773685);
                        i5 = -168498621;
                    }
                case -534845976:
                case -280859424:
                    if (C1773.m5910(it)) {
                        m2566 = C0630.m2566("ۨܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-28561)) ^ 905481198;
                        i5 = 315506512;
                    } else {
                        m2566 = (i3 - C2105.m6981("֫۠")) * 73;
                        i4 = ((m2566 ^ i2) * (-27689)) ^ 1603994817;
                        i5 = 2027094410;
                    }
                case -50773699:
                case 1042507340:
                    if (AbstractC2021.m6574()) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = C2105.m6981("۬۟") ^ i3;
                        i4 = ((m2566 ^ i2) * (-11419)) ^ 1397455237;
                        i5 = -1505824244;
                    }
                case 37138423:
                case 801839523:
                    if (C3683.f11629 >= 0) {
                        m2566 = C0630.m2566("ۗܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * 27151) ^ (-1842979319);
                        i5 = 2091347693;
                    } else {
                        m2566 = C0630.m2566("ۡܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-15109)) ^ (-1046026619);
                        i5 = -714410496;
                    }
                case 330538677:
                case 505766131:
                    return Collections.EMPTY_LIST;
                case 747890753:
                case 1155888232:
                    if (C3663.f11553) {
                        m2566 = C0630.m2566("۠ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19149)) ^ (-2130687968);
                        i5 = 959362013;
                    } else {
                        m2566 = (C0630.m2566("ۚۢ") + i2) * 99;
                        i4 = ((m2566 ^ i3) * (-29221)) ^ 1106807665;
                        i5 = 1450975359;
                    }
                case 778387111:
                case 1427258340:
                    if (C1128.f4106 <= 0) {
                        m2566 = C0630.m2566("ۗܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * 27151) ^ (-1842979319);
                        i5 = 2091347693;
                    } else {
                        m2566 = (C0630.m2566("ۨۜ") ^ i2) * 55;
                        i4 = ((m2566 ^ i3) * (-11123)) ^ 1637876135;
                        i5 = 930469380;
                    }
                default:
                    m32221();
                    if (C22628.f73083 <= 0) {
                        m2566 = (C0630.m2566("ۚۢ") + i2) * 99;
                        i4 = ((m2566 ^ i3) * (-29221)) ^ 1106807665;
                        i5 = 1450975359;
                    } else {
                        m2566 = C2105.m6981("۫֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 25935) ^ (-79145387);
                        i5 = -1270231287;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:16:0x01da, code lost:
    
        r4 = (r2 - l.C0630.m2566("֫ᩳ")) * 39;
        r5 = ((r4 ^ r3) * 21029) ^ 1103830078;
        r6 = -1864657713;
     */
    /* JADX WARN: Code restructure failed: missing block: B:26:0x01a7, code lost:
    
        r4 = (l.C2105.m6981("ܺܽ") + r3) * 127;
        r5 = ((r4 ^ r2) * (-3581)) ^ 1731324414;
        r6 = -877345259;
     */
    /* JADX WARN: Code restructure failed: missing block: B:44:0x012c, code lost:
    
        r4 = l.C0630.m2566("᩸ۧ") ^ r3;
        r5 = ((r4 ^ r2) * 22869) ^ (-837604050);
        r6 = -102457654;
     */
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static l.C16709 m32219(java.lang.String r8) {
        /*
            Method dump skipped, instructions count: 658
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32219(java.lang.String):l.ܽܳ᩷");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static C16709 m32203(AbstractC15440 abstractC15440) {
        return m32205(new C18090(abstractC15440));
    }

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public static SharedPreferences m32220(String str) {
        int m6981;
        int i;
        int i2;
        StringBuilder sb;
        int m69812;
        int i3;
        int i4;
        int i5 = C4075.f12947;
        int i6 = C22628.f73083;
        int m69813 = C2105.m6981("ܰۖ") ^ i6;
        int i7 = ((m69813 ^ i5) * (-3585)) ^ (-787466397);
        short[] sArr = null;
        short[] sArr2 = null;
        short[] sArr3 = null;
        int i8 = m69813 ^ (-1264539163);
        char c = 0;
        short s = 0;
        int i9 = 0;
        int i10 = 0;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 0;
        int i15 = 436122703;
        SharedPreferences sharedPreferences = null;
        String str2 = null;
        StringBuilder sb2 = null;
        while (true) {
            i15 = i8 ^ (i7 & (((i15 ^ i5) * 2429) >> 31));
            switch (i15) {
                case -2131565847:
                case 171196446:
                    sharedPreferences = C0382.m1842().getSharedPreferences(str2, 0);
                    if (C4616.f14690 <= 0) {
                        sb = sb2;
                        m69812 = C2105.m6981("᩶ۢ") ^ i5;
                        i3 = ((m69812 ^ i6) * 3105) ^ (-532247979);
                        i4 = 1247648089;
                        StringBuilder sb3 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb3;
                    } else {
                        m6981 = C0630.m2566("۠ܿ") ^ i6;
                        i = ((m6981 ^ i5) * (-24259)) ^ 674408599;
                        i2 = 1769525729;
                        i8 = m6981 ^ i2;
                        i7 = i;
                    }
                case -1849326558:
                case 1057350293:
                    sb2 = C7166.m19190(str, C1916.m6311(sArr2, i13, i14, i12));
                    if (C3019.f9544 < 0) {
                        m69812 = C0630.m2566("᩵ۛ") ^ i5;
                        sb = sb2;
                        i3 = ((m69812 ^ i6) * (-2275)) ^ (-1140940214);
                        i4 = -663864409;
                        StringBuilder sb32 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb32;
                    }
                    m69812 = C2105.m6981("ۖᩳ") ^ i6;
                    sb = sb2;
                    i3 = ((m69812 ^ i5) * 16363) ^ 1352105290;
                    i4 = -122602114;
                    StringBuilder sb322 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb322;
                case -1802097332:
                case 1685260824:
                    C4159.m12565();
                    C3746.m11369();
                    m6981 = C0630.m2566("۬᩷") ^ i6;
                    i = ((m6981 ^ i5) * 18079) ^ (-1658174817);
                    i2 = -2021337913;
                    i8 = m6981 ^ i2;
                    i7 = i;
                case -1301863633:
                case 1267037792:
                    C2958.m9034();
                    return null;
                case -1039813715:
                case 426965775:
                    C3019.m9255();
                    if (C1128.f4106 <= 0) {
                        sb = sb2;
                        m69812 = (C2105.m6981("ۗ᩸") ^ i5) * (-29);
                        i3 = ((m69812 ^ i6) * (-9747)) ^ (-1026382924);
                        i4 = -1684433593;
                        StringBuilder sb3222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb3222;
                    }
                    sb = sb2;
                    m69812 = (C2105.m6981("ܰۛ") ^ i6) * 9;
                    i3 = ((m69812 ^ i5) * (-15017)) ^ (-2130839452);
                    i4 = 1905578180;
                    StringBuilder sb32222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb32222;
                case -958085070:
                case 750004014:
                    C4159.m12575(sharedPreferences, C3019.m9250(sArr3, 403, 25, i12));
                    return sharedPreferences;
                case -850209344:
                case 870883880:
                    ServiceConnectionC3453.m10564();
                    if (C1128.f4106 > 0) {
                        m6981 = C0630.m2566("۬᩷") ^ i6;
                        i = ((m6981 ^ i5) * 18079) ^ (-1658174817);
                        i2 = -2021337913;
                        i8 = m6981 ^ i2;
                        i7 = i;
                    } else {
                        sb = sb2;
                        m69812 = C2105.m6981("᩶ۢ") ^ i5;
                        i3 = ((m69812 ^ i6) * 3105) ^ (-532247979);
                        i4 = 1247648089;
                        StringBuilder sb322222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb322222;
                    }
                case -835386234:
                case 2097688361:
                    sb = sb2;
                    if ((i11 + 1) - i10 > 0) {
                        m69812 = C2105.m6981("ܽ֨") ^ i6;
                        i3 = ((m69812 ^ i5) * 16829) ^ 1308020920;
                        i4 = 86682521;
                    } else {
                        m69812 = (C2105.m6981("ۧ᩸") ^ i6) * 51;
                        i3 = ((m69812 ^ i5) * 5383) ^ 765752084;
                        i4 = -1584123162;
                    }
                    StringBuilder sb3222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb3222222;
                case -718800610:
                case 1553664861:
                    sArr3 = f39719;
                    if (C1047.f3863 >= 0) {
                        sb = sb2;
                        m69812 = C2105.m6981("᩶ۢ") ^ i5;
                        i3 = ((m69812 ^ i6) * 3105) ^ (-532247979);
                        i4 = 1247648089;
                        StringBuilder sb32222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb32222222;
                    } else {
                        m6981 = C0630.m2566("ܳ۠") ^ i5;
                        i = ((m6981 ^ i6) * 28027) ^ 215944686;
                        i2 = 1321156583;
                        i8 = m6981 ^ i2;
                        i7 = i;
                    }
                case -685342193:
                case -679032184:
                    sb = sb2;
                    i9 = s + 1;
                    if (C4075.f12947 < 0) {
                        m69812 = C0630.m2566("ۘ᩺") ^ i5;
                        i3 = ((m69812 ^ i6) * 15025) ^ 131908354;
                        i4 = 2025074116;
                        StringBuilder sb322222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb322222222;
                    }
                    m69812 = (C2105.m6981("ܰۛ") ^ i6) * 9;
                    i3 = ((m69812 ^ i5) * (-15017)) ^ (-2130839452);
                    i4 = 1905578180;
                    StringBuilder sb3222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb3222222222;
                case -498979467:
                case -252718402:
                    sb = sb2;
                    i10 = i9 * i9;
                    i11 = s * 2;
                    if (C0382.f1805) {
                        m69812 = (C0630.m2566("᩺ܳ") + i5) * (-19);
                        i3 = ((m69812 ^ i6) * (-1611)) ^ (-19692775);
                        i4 = 792018427;
                        StringBuilder sb32222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb32222222222;
                    }
                    m69812 = C2105.m6981("᩶ۢ") ^ i5;
                    i3 = ((m69812 ^ i6) * 3105) ^ (-532247979);
                    i4 = 1247648089;
                    StringBuilder sb322222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb322222222222;
                case 40726234:
                case 1345720697:
                    C0050.m945(sb2, C0630.m2566(str));
                    str2 = C0050.m947(sb2);
                    if (C1047.f3863 >= 0) {
                        m69812 = C2105.m6981("ۖᩳ") ^ i6;
                        sb = sb2;
                        i3 = ((m69812 ^ i5) * 16363) ^ 1352105290;
                        i4 = -122602114;
                        StringBuilder sb3222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb3222222222222;
                    } else {
                        m6981 = (i5 - C2105.m6981("ۙ۫")) * (-81);
                        i = ((m6981 ^ i6) * (-9763)) ^ 1449074402;
                        i2 = -784272028;
                        i8 = m6981 ^ i2;
                        i7 = i;
                    }
                case 87374591:
                case 226483945:
                    sb = sb2;
                    c = 401;
                    if (C3683.f11629 >= 0) {
                        sb2 = sb;
                        m69812 = C2105.m6981("ۖᩳ") ^ i6;
                        sb = sb2;
                        i3 = ((m69812 ^ i5) * 16363) ^ 1352105290;
                        i4 = -122602114;
                        StringBuilder sb32222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb32222222222222;
                    } else {
                        m69812 = (C2105.m6981("᩶۠") ^ i5) * 115;
                        i3 = ((m69812 ^ i6) * (-28825)) ^ 2112873718;
                        i4 = 638741195;
                        StringBuilder sb322222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb322222222222222;
                    }
                case 369985452:
                case 1995405168:
                    if (C0630.f2410 > 0) {
                        m6981 = C0630.m2566("۬᩷") ^ i6;
                        i = ((m6981 ^ i5) * 18079) ^ (-1658174817);
                        i2 = -2021337913;
                        i8 = m6981 ^ i2;
                        i7 = i;
                    } else {
                        sb = sb2;
                        m69812 = (C2105.m6981("ܰۛ") ^ i6) * 9;
                        i3 = ((m69812 ^ i5) * (-15017)) ^ (-2130839452);
                        i4 = 1905578180;
                        StringBuilder sb3222222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb3222222222222222;
                    }
                case 428417149:
                case 2027156920:
                    sb = sb2;
                    s = sArr[c];
                    if (C3432.f10845 < 0) {
                        m69812 = C2105.m6981("֫᩶") ^ i6;
                        i3 = ((m69812 ^ i5) * 12977) ^ 1197322391;
                        i4 = -496695744;
                        StringBuilder sb32222222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb32222222222222222;
                    }
                    m69812 = C2105.m6981("᩶ۢ") ^ i5;
                    i3 = ((m69812 ^ i6) * 3105) ^ (-532247979);
                    i4 = 1247648089;
                    StringBuilder sb322222222222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb322222222222222222;
                case 503197168:
                case 1137972038:
                    i12 = 38038;
                    m69812 = (C2105.m6981("֡ۧ") ^ i5) * (-105);
                    sb = sb2;
                    i3 = ((m69812 ^ i6) * 3767) ^ (-341253473);
                    i4 = 1135349068;
                    StringBuilder sb3222222222222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb3222222222222222222;
                case 818498417:
                case 2079906745:
                    i12 = 65013;
                    m69812 = (C2105.m6981("֡ۧ") ^ i5) * (-105);
                    sb = sb2;
                    i3 = ((m69812 ^ i6) * 3767) ^ (-341253473);
                    i4 = 1135349068;
                    StringBuilder sb32222222222222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb32222222222222222222;
                case 1371890526:
                case 1875096454:
                    sArr2 = f39719;
                    i14 = 1;
                    if (C4616.f14690 <= 0) {
                        i13 = 402;
                        m69812 = C2105.m6981("ۖᩳ") ^ i6;
                        sb = sb2;
                        i3 = ((m69812 ^ i5) * 16363) ^ 1352105290;
                        i4 = -122602114;
                        StringBuilder sb322222222222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb322222222222222222222;
                    } else {
                        int m2566 = (C0630.m2566("֫ᩳ") ^ i6) * 85;
                        i8 = m2566 ^ 1969716037;
                        i7 = ((m2566 ^ i5) * (-29191)) ^ 370740336;
                        i13 = 402;
                    }
                default:
                    sb = sb2;
                    sArr = f39719;
                    if (ViewOnClickListenerC1958.m6429() < 0) {
                        m69812 = C0630.m2566("ۜܳ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-19457)) ^ 1832634114;
                        i4 = 819390411;
                        StringBuilder sb3222222222222222222222 = sb;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                        sb2 = sb3222222222222222222222;
                    }
                    m69812 = (C2105.m6981("ۗ᩸") ^ i5) * (-29);
                    i3 = ((m69812 ^ i6) * (-9747)) ^ (-1026382924);
                    i4 = -1684433593;
                    StringBuilder sb32222222222222222222222 = sb;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                    sb2 = sb32222222222222222222222;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:25:0x00da, code lost:
    
        if (l.C21923.f70183 != 0) goto L27;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static l.C16709 m32205(l.C18090 r26) {
        /*
            Method dump skipped, instructions count: 1144
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32205(l.ᩳܰۡ):l.ܽܳ᩷");
    }

    /* JADX WARN: Code restructure failed: missing block: B:23:0x00aa, code lost:
    
        if (l.C1005.f3721 != false) goto L14;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m32209(l.AbstractC15440 r27, boolean r28, boolean r29, l.InterfaceC3388 r30) {
        /*
            Method dump skipped, instructions count: 1254
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32209(l.ܶ᩵ܿ, boolean, boolean, l.ۗܿ᩷):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:80:0x00aa, code lost:
    
        if (l.C0964.m3413() != false) goto L24;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static java.lang.String m32201(int r29) {
        /*
            Method dump skipped, instructions count: 2012
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C13265.m32201(int):java.lang.String");
    }

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public static void m32217(String str) {
        C16709 c16709;
        ArrayList arrayList;
        int m6981;
        int i;
        int i2;
        ArrayList arrayList2;
        int m2566;
        int i3;
        int i4;
        int i5;
        ArrayList arrayList3;
        int m25662;
        int i6;
        int i7;
        ArrayList arrayList4 = null;
        C16709 c167092 = null;
        ArrayList arrayList5 = null;
        int i8 = 0;
        int i9 = 0;
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i10 = 0;
        int i11 = 0;
        short s2 = 0;
        int i12 = 0;
        int i13 = -566017045;
        int i14 = C0483.f2088;
        int i15 = AbstractC2021.f6743;
        int m69812 = C2105.m6981("ܶܺ") ^ i15;
        int i16 = ((m69812 ^ i14) * 5865) ^ 2123038307;
        int i17 = m69812 ^ (-698635387);
        StringBuilder sb = null;
        while (true) {
            i13 = i17 ^ (i16 & (((i13 ^ i14) * 28993) >> 31));
            switch (i13) {
                case -2131639614:
                case 119623749:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    sArr = f39719;
                    if (C0422.f1886 > 0) {
                        m2566 = (C0630.m2566("ܳᩳ") + i15) * (-29);
                        i3 = ((m2566 ^ i14) * (-20795)) ^ (-2145371470);
                        i4 = 270256934;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    m2566 = C2105.m6981("ܺ᩷") ^ i14;
                    i3 = ((m2566 ^ i15) * 16725) ^ 1084704019;
                    i4 = 7315319;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -2083597136:
                case 266097633:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    s = sArr[c];
                    i10 = s * s;
                    if (!C0630.m2564()) {
                        m2566 = C2105.m6981("ۢܿ") ^ i14;
                        i3 = ((m2566 ^ i15) * (-17403)) ^ 851816903;
                        i4 = 1910887646;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    m2566 = (i15 - C0630.m2566("۠۬")) * (-119);
                    i3 = ((m2566 ^ i14) * 17355) ^ (-190856861);
                    i4 = -1747412607;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -1508884836:
                case -1485288337:
                    C0630.m2564();
                    if (C3245.m9925() != 0) {
                        arrayList2 = arrayList4;
                        c16709 = c167092;
                        arrayList = arrayList5;
                        m2566 = C2105.m6981("ܺ᩷") ^ i14;
                        i3 = ((m2566 ^ i15) * 16725) ^ 1084704019;
                        i4 = 7315319;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    m2566 = (i15 - C0630.m2566("۠۬")) * (-119);
                    i3 = ((m2566 ^ i14) * 17355) ^ (-190856861);
                    i4 = -1747412607;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -1456279763:
                case 1890676099:
                    c16709 = c167092;
                    arrayList = arrayList5;
                    C15297.m36309(C0050.m947(sb));
                    m32215(str);
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        arrayList2 = arrayList4;
                        int m69813 = (C2105.m6981("۠ܳ") + i15) * (-81);
                        i3 = ((m69813 ^ i14) * (-14173)) ^ (-1829254776);
                        i5 = m69813 ^ 884649253;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        sb = null;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    } else {
                        m6981 = C2105.m6981("ܳ֫") ^ i15;
                        i = ((m6981 ^ i14) * (-10451)) ^ 1467293147;
                        i2 = 711574491;
                        int i18 = m6981 ^ i2;
                        arrayList5 = arrayList;
                        i17 = i18;
                        i16 = i;
                        c167092 = c16709;
                    }
                case -1452914178:
                case -152246952:
                    c16709 = c167092;
                    arrayList = arrayList5;
                    m32221();
                    short[] sArr2 = f39719;
                    if (C0964.f3626 == 0 && C2520.f8000 < 0) {
                        arrayList2 = arrayList4;
                        StringBuilder sb2 = new StringBuilder(C2958.m9031(sArr2, 390, 11, i12));
                        C1420.m4905(sb2, str);
                        if (C0382.f1805) {
                            int m25663 = (C0630.m2566("۬ᩴ") + i14) * (-15);
                            sb = sb2;
                            i16 = ((m25663 ^ i15) * 24817) ^ 1403590390;
                            arrayList5 = arrayList;
                            c167092 = c16709;
                            i17 = m25663 ^ (-1670464552);
                            arrayList4 = arrayList2;
                        }
                        int m698132 = (C2105.m6981("۠ܳ") + i15) * (-81);
                        i3 = ((m698132 ^ i14) * (-14173)) ^ (-1829254776);
                        i5 = m698132 ^ 884649253;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        sb = null;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    arrayList2 = arrayList4;
                    int m6981322 = (C2105.m6981("۠ܳ") + i15) * (-81);
                    i3 = ((m6981322 ^ i14) * (-14173)) ^ (-1829254776);
                    i5 = m6981322 ^ 884649253;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    sb = null;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                    break;
                case -1408444423:
                case 1674056013:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    if (i11 - (s * s2) >= 0) {
                        m2566 = C2105.m6981("ܶܰ") ^ i14;
                        i3 = ((m2566 ^ i15) * (-2559)) ^ (-576093856);
                        i4 = -693995502;
                    } else {
                        m2566 = (C0630.m2566("֡ۤ") ^ i15) * 57;
                        i3 = ((m2566 ^ i14) * 6847) ^ (-304108430);
                        i4 = 1222792563;
                    }
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -1362731456:
                case -699233770:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    i11 = i10 + 337971456;
                    s2 = 36768;
                    if (RunnableC1108.f4040) {
                        m2566 = C0630.m2566("ۛ۬") ^ i15;
                        i3 = ((m2566 ^ i14) * (-13199)) ^ 790994645;
                        i4 = -89750773;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    m2566 = C2105.m6981("ᩴܺ") ^ i15;
                    i3 = ((m2566 ^ i14) * (-8351)) ^ (-1924405801);
                    i4 = 344315369;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -1215590350:
                case 1352091546:
                    i9 = i8 - 1;
                    if (i9 >= 0) {
                        m25662 = C0630.m2566("᩹֫") ^ i14;
                        arrayList3 = arrayList5;
                        i6 = ((m25662 ^ i15) * (-13659)) ^ 841177958;
                        i7 = -785644167;
                    } else {
                        arrayList3 = arrayList5;
                        m25662 = C0630.m2566("۬ۚ") ^ i15;
                        i6 = ((m25662 ^ i14) * (-14103)) ^ 151869740;
                        i7 = 2007971846;
                    }
                    ArrayList arrayList6 = arrayList3;
                    i17 = m25662 ^ i7;
                    i16 = i6;
                    arrayList5 = arrayList6;
                case -1129873591:
                case 583550823:
                    ArrayList arrayList7 = f39720;
                    i8 = C3432.m10481(arrayList7);
                    arrayList5 = arrayList7;
                    int m25664 = (C0630.m2566("֨᩵") + i15) * (-121);
                    c16709 = c167092;
                    i = ((m25664 ^ i14) * 24881) ^ 1591549035;
                    i17 = m25664 ^ 1502973610;
                    i16 = i;
                    c167092 = c16709;
                case -1009252311:
                case 549784110:
                    C1047.m3599();
                    C2958.m9034();
                    c16709 = c167092;
                    arrayList = arrayList5;
                    m6981 = (C0630.m2566("ۙ۠") ^ i14) * (-109);
                    i = ((m6981 ^ i15) * 16867) ^ 102246546;
                    i2 = 282404509;
                    int i182 = m6981 ^ i2;
                    arrayList5 = arrayList;
                    i17 = i182;
                    i16 = i;
                    c167092 = c16709;
                case -650292248:
                case -479919245:
                    c16709 = c167092;
                    arrayList = arrayList5;
                    RunnableC3474.m10626(m32223(str));
                    m32224();
                    if (C2520.m8026()) {
                        arrayList2 = arrayList4;
                        m2566 = C2105.m6981("ᩴܺ") ^ i15;
                        i3 = ((m2566 ^ i14) * (-8351)) ^ (-1924405801);
                        i4 = 344315369;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    } else {
                        m6981 = C2105.m6981("ۨ۬") ^ i14;
                        i = ((m6981 ^ i15) * (-2677)) ^ 1415380866;
                        i2 = -34878368;
                        int i1822 = m6981 ^ i2;
                        arrayList5 = arrayList;
                        i17 = i1822;
                        i16 = i;
                        c167092 = c16709;
                    }
                case -548654327:
                case -481868261:
                    if (C1047.m3599() < 0) {
                        arrayList2 = arrayList4;
                        c16709 = c167092;
                        arrayList = arrayList5;
                        m2566 = C2105.m6981("ᩴܺ") ^ i15;
                        i3 = ((m2566 ^ i14) * (-8351)) ^ (-1924405801);
                        i4 = 344315369;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    m2566 = (i15 - C0630.m2566("۠۬")) * (-119);
                    i3 = ((m2566 ^ i14) * 17355) ^ (-190856861);
                    i4 = -1747412607;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case -309752788:
                case 740681166:
                    arrayList3 = arrayList5;
                    arrayList4.remove(str);
                    c167092 = (C16709) f39724.remove(str);
                    if (c167092 != null) {
                        m25662 = C0630.m2566("۬᩷") ^ i14;
                        i6 = ((m25662 ^ i15) * (-9431)) ^ (-1031637055);
                        i7 = -613381860;
                        ArrayList arrayList62 = arrayList3;
                        i17 = m25662 ^ i7;
                        i16 = i6;
                        arrayList5 = arrayList62;
                    }
                    m25662 = (C0630.m2566("ۘᩳ") ^ i15) * 85;
                    i6 = ((m25662 ^ i14) * (-7171)) ^ 1902123924;
                    i7 = 636960651;
                    ArrayList arrayList622 = arrayList3;
                    i17 = m25662 ^ i7;
                    i16 = i6;
                    arrayList5 = arrayList622;
                case -221626730:
                case 72560148:
                    arrayList3 = arrayList5;
                    c167092.m39293(false);
                    c167092.m39296();
                    m25662 = (C0630.m2566("ۘᩳ") ^ i15) * 85;
                    i6 = ((m25662 ^ i14) * (-7171)) ^ 1902123924;
                    i7 = 636960651;
                    ArrayList arrayList6222 = arrayList3;
                    i17 = m25662 ^ i7;
                    i16 = i6;
                    arrayList5 = arrayList6222;
                case -117185539:
                case 1110204716:
                    if (C3245.f10203 > 0) {
                        c16709 = c167092;
                        arrayList = arrayList5;
                        m6981 = (C0630.m2566("ۙ۠") ^ i14) * (-109);
                        i = ((m6981 ^ i15) * 16867) ^ 102246546;
                        i2 = 282404509;
                        int i18222 = m6981 ^ i2;
                        arrayList5 = arrayList;
                        i17 = i18222;
                        i16 = i;
                        c167092 = c16709;
                    } else {
                        arrayList2 = arrayList4;
                        c16709 = c167092;
                        arrayList = arrayList5;
                        m2566 = (i15 - C0630.m2566("۠۬")) * (-119);
                        i3 = ((m2566 ^ i14) * 17355) ^ (-190856861);
                        i4 = -1747412607;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                case -113724687:
                case 159500459:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    i12 = 58333;
                    m2566 = C0630.m2566("ۗۜ") ^ i15;
                    i3 = ((m2566 ^ i14) * (-29581)) ^ (-326603015);
                    i4 = -1605980098;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case 8767676:
                case 50679443:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    i12 = 35660;
                    m2566 = C0630.m2566("ۗۜ") ^ i15;
                    i3 = ((m2566 ^ i14) * (-29581)) ^ (-326603015);
                    i4 = -1605980098;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                case 235694376:
                case 1717155860:
                    ((InterfaceC23849) C3537.m10755(arrayList5, i9)).mo46484();
                    i8 = i9;
                    int m256642 = (C0630.m2566("֨᩵") + i15) * (-121);
                    c16709 = c167092;
                    i = ((m256642 ^ i14) * 24881) ^ 1591549035;
                    i17 = m256642 ^ 1502973610;
                    i16 = i;
                    c167092 = c16709;
                case 435815715:
                case 2093197440:
                    c16709 = c167092;
                    arrayList = arrayList5;
                    arrayList4 = f39725;
                    if (ServiceConnectionC3453.m10564() > 0) {
                        m6981 = C2105.m6981("᩵᩶") ^ i14;
                        i = ((m6981 ^ i15) * (-21561)) ^ 656534597;
                        i2 = -217711252;
                        int i182222 = m6981 ^ i2;
                        arrayList5 = arrayList;
                        i17 = i182222;
                        i16 = i;
                        c167092 = c16709;
                    }
                    m6981 = (C0630.m2566("ۙ۠") ^ i14) * (-109);
                    i = ((m6981 ^ i15) * 16867) ^ 102246546;
                    i2 = 282404509;
                    int i1822222 = m6981 ^ i2;
                    arrayList5 = arrayList;
                    i17 = i1822222;
                    i16 = i;
                    c167092 = c16709;
                case 480862041:
                case 554003179:
                    break;
                case 1049279535:
                case 1372896815:
                    arrayList2 = arrayList4;
                    c16709 = c167092;
                    arrayList = arrayList5;
                    c = 389;
                    if (AbstractC2021.f6743 > 0) {
                        m2566 = C2105.m6981("ۗ᩹") ^ i14;
                        i3 = ((m2566 ^ i15) * 5211) ^ 268448487;
                        i4 = 1559063601;
                        i5 = m2566 ^ i4;
                        arrayList5 = arrayList;
                        c167092 = c16709;
                        i17 = i5;
                        i16 = i3;
                        arrayList4 = arrayList2;
                    }
                    m2566 = (i15 - C0630.m2566("۠۬")) * (-119);
                    i3 = ((m2566 ^ i14) * 17355) ^ (-190856861);
                    i4 = -1747412607;
                    i5 = m2566 ^ i4;
                    arrayList5 = arrayList;
                    c167092 = c16709;
                    i17 = i5;
                    i16 = i3;
                    arrayList4 = arrayList2;
                default:
                    C0237.m1481();
                    break;
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m32211(InterfaceC23849 interfaceC23849) {
        C7106.m19117(f39720, interfaceC23849);
    }
}
