package l;

import moe.shizuku.server.IShizukuService;

/* compiled from: C2R7 */
/* renamed from: l.۬ᩴ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C13307 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final int f39834;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final String f39835;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final C19119 f39836;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public final C19119 f39837;

    public C13307(C19119 c19119, C19119 c191192, String str, int i) {
        int i2 = 1714693681;
        int i3 = RunnableC3474.f10992;
        int i4 = C22628.f73083;
        int m2566 = C0630.m2566("᩶᩷") ^ i3;
        int i5 = ((m2566 ^ i4) * (-22083)) ^ (-45496006);
        int i6 = 614964944;
        while (true) {
            i2 = ((((i2 ^ i4) * 31421) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -1972465231:
                case -849971434:
                    if (RunnableC3474.m10630()) {
                        m2566 = (C0630.m2566("᩻ܰ") + i4) * (-35);
                        i5 = ((m2566 ^ i3) * 5203) ^ 327835175;
                        i6 = -474826605;
                    } else {
                        m2566 = (i4 - C2105.m6981("ۧ᩹")) * (-9);
                        i5 = ((m2566 ^ i3) * (-18475)) ^ 1355863389;
                        i6 = -961002820;
                    }
                case -1729935642:
                case 278228229:
                    this.f39835 = str;
                    this.f39834 = i;
                    return;
                case -1394666749:
                case 1110859915:
                    if (C11340.f33930 >= 0) {
                        m2566 = C0630.m2566("ܽ᩺") ^ i3;
                        i5 = ((m2566 ^ i4) * 17099) ^ (-1496444354);
                        i6 = 950557684;
                    } else {
                        m2566 = C2105.m6981("ܳܰ") ^ i3;
                        i5 = ((m2566 ^ i4) * 23327) ^ (-874659760);
                        i6 = -1456968806;
                    }
                case -1219190716:
                case 1897120291:
                    if (C11340.f33930 >= 0) {
                        m2566 = C0630.m2566("ܺ֫") ^ i4;
                        i5 = ((m2566 ^ i3) * 22585) ^ 779495118;
                        i6 = -701518584;
                    } else {
                        m2566 = C0630.m2566("᩻ܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-16525)) ^ (-2053693901);
                        i6 = 2026384976;
                    }
                case -1067002603:
                case 1162747324:
                    this.f39836 = c19119;
                    this.f39837 = c191192;
                    if (C1005.f3721) {
                        m2566 = (C2105.m6981("ۘᩴ") ^ i3) * (-25);
                        i5 = ((m2566 ^ i4) * 17467) ^ (-2115441392);
                        i6 = -1174385934;
                    } else {
                        m2566 = (i4 - C2105.m6981("ۧ᩹")) * (-9);
                        i5 = ((m2566 ^ i3) * (-18475)) ^ 1355863389;
                        i6 = -961002820;
                    }
                case -926793622:
                case 1933424247:
                    if (RunnableC3474.m10630()) {
                        m2566 = (C0630.m2566("ۤۤ") ^ i4) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i5 = ((m2566 ^ i3) * 21215) ^ (-519956503);
                        i6 = -2103978883;
                    } else {
                        m2566 = C0630.m2566("ܺ֫") ^ i4;
                        i5 = ((m2566 ^ i3) * 22585) ^ 779495118;
                        i6 = -701518584;
                    }
                case -903685435:
                case 878978313:
                    if (C0630.f2410 <= 0) {
                        m2566 = C0630.m2566("᩷ܿ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22235)) ^ 621130725;
                        i6 = 552349909;
                    } else {
                        m2566 = C0630.m2566("᩹֨") ^ i4;
                        i5 = ((m2566 ^ i3) * 22831) ^ (-41092536);
                        i6 = 1156841103;
                    }
                case -572763117:
                case -267907840:
                    if (C1047.f3863 >= 0) {
                        m2566 = C0630.m2566("᩷ܿ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22235)) ^ 621130725;
                        i6 = 552349909;
                    } else {
                        m2566 = (C0630.m2566("۬ۙ") ^ i4) * 75;
                        i5 = ((m2566 ^ i3) * (-23637)) ^ (-201644471);
                        i6 = 823060461;
                    }
                case -473149862:
                case 327775827:
                    if (C2958.f9394 < 0) {
                        m2566 = C2105.m6981("᩺ᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8935)) ^ (-282270023);
                        i6 = 85483885;
                    } else {
                        m2566 = C0630.m2566("᩷ܿ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22235)) ^ 621130725;
                        i6 = 552349909;
                    }
                case -255293244:
                case -184519176:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = C2105.m6981("᩺ᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8935)) ^ (-282270023);
                        i6 = 85483885;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۨۜ")) * (-3);
                        i5 = ((m2566 ^ i4) * 5759) ^ (-40635027);
                        i6 = 387209923;
                    }
                case -120605321:
                case 2004405635:
                    if (C0422.f1886 <= 0) {
                        m2566 = C0630.m2566("᩷ܿ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-22235)) ^ 621130725;
                        i6 = 552349909;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۛۙ")) * 41;
                        i5 = ((m2566 ^ i4) * 27053) ^ 744998088;
                        i6 = 1589593699;
                    }
                case -39957717:
                case 1497525380:
                    C2126.m7040();
                    if (C0630.m2564()) {
                        m2566 = C2105.m6981("᩺ᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8935)) ^ (-282270023);
                        i6 = 85483885;
                    } else {
                        m2566 = (i4 - C2105.m6981("ۧ᩹")) * (-9);
                        i5 = ((m2566 ^ i3) * (-18475)) ^ 1355863389;
                        i6 = -961002820;
                    }
                case 353111454:
                case 1572804933:
                    if (C3019.f9544 < 0) {
                        m2566 = C2105.m6981("᩺ᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8935)) ^ (-282270023);
                        i6 = 85483885;
                    } else {
                        m2566 = C0630.m2566("ܽ᩺") ^ i3;
                        i5 = ((m2566 ^ i4) * 17099) ^ (-1496444354);
                        i6 = 950557684;
                    }
                case 815746874:
                case 1294472363:
                    if (C22628.f73083 <= 0) {
                        m2566 = C2105.m6981("᩺ᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-8935)) ^ (-282270023);
                        i6 = 85483885;
                    } else {
                        m2566 = (C2105.m6981("ۙܿ") + i3) * (-57);
                        i5 = ((m2566 ^ i4) * 31875) ^ 1282528193;
                        i6 = -279246922;
                    }
                case 1328944663:
                case 1693574138:
                    C3019.m9255();
                    ServiceConnectionC3453.m10564();
                    m2566 = (i4 - C2105.m6981("ۧ᩹")) * (-9);
                    i5 = ((m2566 ^ i3) * (-18475)) ^ 1355863389;
                    i6 = -961002820;
                default:
                    C0630.m2564();
                    ViewOnClickListenerC1958.m6429();
                    throw new RuntimeException();
            }
        }
    }
}
