package l;

/* compiled from: 12B7 */
/* renamed from: l.ܳ᩸᩷, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final class C14802 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public int f45192;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public boolean f45193;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public int f45194;

    /* renamed from: ܿ, reason: not valid java name and contains not printable characters */
    public String f45195;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public String f45196;

    public C14802(String str, int i, int i2, String str2, boolean z) {
        int i3 = 477928255;
        int i4 = AbstractC2021.f6743;
        int i5 = C4075.f12947;
        int m6981 = C2105.m6981("᩹۬") ^ i5;
        int i6 = ((m6981 ^ i4) * (-1095)) ^ 1832385354;
        int i7 = -1994900814;
        while (true) {
            i3 = ((((i3 ^ i4) * 8963) >> 31) & i6) ^ (m6981 ^ i7);
            switch (i3) {
                case -1710336937:
                case 173139189:
                    if (C3683.m11222()) {
                        m6981 = C2105.m6981("ۤܽ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-18059)) ^ (-336515694);
                        i7 = 1417281295;
                    } else {
                        m6981 = C0630.m2566("᩺֡") ^ i4;
                        i6 = ((m6981 ^ i5) * 19375) ^ 525895932;
                        i7 = -319868672;
                    }
                case -1630352962:
                case 1573223632:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = C2105.m6981("ۤܽ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-18059)) ^ (-336515694);
                        i7 = 1417281295;
                    } else {
                        m6981 = (i5 - C0630.m2566("᩺ۘ")) * 11;
                        i6 = ((m6981 ^ i4) * (-13759)) ^ 1437729501;
                        i7 = -1377826755;
                    }
                case -1443429515:
                case 1985303248:
                    if (C0964.f3626 != 0) {
                        m6981 = C2105.m6981("۬᩹") ^ i4;
                        i6 = ((m6981 ^ i5) * 20443) ^ (-916816203);
                        i7 = -54708556;
                    } else {
                        m6981 = C0630.m2566("ۙۧ") ^ i4;
                        i6 = ((m6981 ^ i5) * (-24321)) ^ 135790377;
                        i7 = -861667078;
                    }
                case -1441314758:
                case 1521024541:
                    C11340.m28031();
                    C0050.m940();
                    throw new RuntimeException();
                case -1328209062:
                case -84422167:
                    if (RunnableC1937.m6387() != 0) {
                        m6981 = C0630.m2566("ᩳۨ") ^ i4;
                        i6 = ((m6981 ^ i5) * (-14453)) ^ (-443467493);
                        i7 = -1104192690;
                    } else {
                        m6981 = (i5 - C0630.m2566("ۤۛ")) * (-81);
                        i6 = ((m6981 ^ i4) * (-16439)) ^ 1662224962;
                        i7 = -2035261281;
                    }
                case -1204620390:
                case -79679974:
                    if (C1128.m3851() <= 0) {
                        m6981 = C0630.m2566("᩺֨") ^ i5;
                        i6 = ((m6981 ^ i4) * 14245) ^ (-731467617);
                        i7 = 1304168655;
                    } else {
                        m6981 = C2105.m6981("ۗ֡") ^ i5;
                        i6 = ((m6981 ^ i4) * (-17987)) ^ 1921782856;
                        i7 = 564972295;
                    }
                case -1169783580:
                case -656026340:
                    this.f45195 = str;
                    if (C1128.f4106 <= 0) {
                        m6981 = C2105.m6981("ۤܽ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-18059)) ^ (-336515694);
                        i7 = 1417281295;
                    } else {
                        m6981 = (C0630.m2566("ܽ֫") ^ i5) * (-97);
                        i6 = ((m6981 ^ i4) * (-597)) ^ (-1998159371);
                        i7 = 1690309182;
                    }
                case -1037456689:
                case -974904455:
                    if (C1294.f4556 < 0) {
                        m6981 = C2105.m6981("۬᩹") ^ i4;
                        i6 = ((m6981 ^ i5) * 20443) ^ (-916816203);
                        i7 = -54708556;
                    } else {
                        m6981 = (C2105.m6981("ۨۨ") ^ i5) * (-105);
                        i6 = ((m6981 ^ i4) * 14063) ^ 1963449700;
                        i7 = -394921365;
                    }
                case -614440029:
                case 1982217283:
                    if (C0422.m1963()) {
                        m6981 = C0630.m2566("ۚۖ") ^ i4;
                        i6 = ((m6981 ^ i5) * 24155) ^ (-1806852067);
                        i7 = -1377142107;
                    } else {
                        m6981 = C0630.m2566("ᩳۨ") ^ i4;
                        i6 = ((m6981 ^ i5) * (-14453)) ^ (-443467493);
                        i7 = -1104192690;
                    }
                case -455313179:
                case 1817871098:
                    if (C2167.m7155()) {
                        m6981 = (C2105.m6981("ۨۨ") ^ i5) * (-105);
                        i6 = ((m6981 ^ i4) * 14063) ^ 1963449700;
                        i7 = -394921365;
                    } else {
                        m6981 = C2105.m6981("ۘۨ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-32609)) ^ (-727794545);
                        i7 = -869875264;
                    }
                case -393810408:
                case 168586265:
                    C11340.m28031();
                    if (C1711.f5919) {
                        m6981 = C2105.m6981("۬᩹") ^ i4;
                        i6 = ((m6981 ^ i5) * 20443) ^ (-916816203);
                        i7 = -54708556;
                    } else {
                        m6981 = C0630.m2566("᩺֨") ^ i5;
                        i6 = ((m6981 ^ i4) * 14245) ^ (-731467617);
                        i7 = 1304168655;
                    }
                case -97713917:
                case 204367106:
                    ServiceConnectionC3453.m10564();
                    m6981 = C2105.m6981("۬᩹") ^ i4;
                    i6 = ((m6981 ^ i5) * 20443) ^ (-916816203);
                    i7 = -54708556;
                case 20975865:
                case 208342587:
                    this.f45192 = i;
                    this.f45194 = i2;
                    if (C21923.m49329()) {
                        m6981 = C0630.m2566("᩺֨") ^ i5;
                        i6 = ((m6981 ^ i4) * 14245) ^ (-731467617);
                        i7 = 1304168655;
                    } else {
                        m6981 = C0630.m2566("᩹ܽ") ^ i4;
                        i6 = ((m6981 ^ i5) * 5553) ^ (-2049196528);
                        i7 = 989017757;
                    }
                case 264902402:
                case 837223892:
                    this.f45196 = str2;
                    this.f45193 = z;
                    return;
                case 1149045512:
                case 1171734034:
                    if (C3746.m11369() >= 0) {
                        m6981 = (C2105.m6981("ۨۨ") ^ i5) * (-105);
                        i6 = ((m6981 ^ i4) * 14063) ^ 1963449700;
                        i7 = -394921365;
                    } else {
                        m6981 = C0630.m2566("ܰۛ") ^ i4;
                        i6 = ((m6981 ^ i5) * 32099) ^ 1791356771;
                        i7 = -427865742;
                    }
                default:
                    C1294.m4372();
                    if (C7811.f24123 >= 0) {
                        m6981 = C2105.m6981("۬᩹") ^ i4;
                        i6 = ((m6981 ^ i5) * 20443) ^ (-916816203);
                        i7 = -54708556;
                    } else {
                        m6981 = C0630.m2566("ᩳۨ") ^ i4;
                        i6 = ((m6981 ^ i5) * (-14453)) ^ (-443467493);
                        i7 = -1104192690;
                    }
            }
        }
    }
}
