package l;

import android.content.Context;
import android.os.Bundle;
import android.os.SystemClock;
import android.view.LayoutInflater;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;
import com.alipay.sdk.m.y.q;
import com.umeng.analytics.pro.o;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.List;
import java.util.concurrent.atomic.AtomicBoolean;
import moe.shizuku.server.IShizukuService;

/* compiled from: 51KR */
/* renamed from: l.ܽۜۢ, reason: contains not printable characters */
/* loaded from: classes.dex */
public class C16475 extends AbstractC14346 implements InterfaceC0440, InterfaceC20834, InterfaceC3900 {

    /* renamed from: ᩵᩷᩺, reason: not valid java name and contains not printable characters */
    private static final short[] f50637;

    /* renamed from: ֫֫, reason: not valid java name and contains not printable characters */
    public volatile boolean f50638;

    /* renamed from: ۗ, reason: not valid java name and contains not printable characters */
    public String f50639;

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public int f50640;

    /* renamed from: ۛ, reason: not valid java name and contains not printable characters */
    public int f50641;

    /* renamed from: ۜ֫, reason: not valid java name and contains not printable characters */
    public TextView f50642;

    /* renamed from: ۟, reason: not valid java name and contains not printable characters */
    public TextView f50643;

    /* renamed from: ۡ֫, reason: not valid java name and contains not printable characters */
    public boolean f50644;

    /* renamed from: ۢ֫, reason: not valid java name and contains not printable characters */
    public String f50645;

    /* renamed from: ۤ, reason: not valid java name and contains not printable characters */
    public C15545 f50646;

    /* renamed from: ۧ֫, reason: not valid java name and contains not printable characters */
    public boolean f50647;

    /* renamed from: ۨ, reason: not valid java name and contains not printable characters */
    public boolean f50648;

    /* renamed from: ۫, reason: not valid java name and contains not printable characters */
    public C12392 f50649;

    /* renamed from: ۬, reason: not valid java name and contains not printable characters */
    public C12366 f50650;

    /* renamed from: ܰ, reason: not valid java name and contains not printable characters */
    public C15893 f50651;

    /* renamed from: ܳ֫, reason: not valid java name and contains not printable characters */
    public boolean f50652;

    /* renamed from: ܺ֫, reason: not valid java name and contains not printable characters */
    public C3764 f50653;

    /* renamed from: ܽ֫, reason: not valid java name and contains not printable characters */
    public AbstractC7548 f50654;

    /* renamed from: ܿ֫, reason: not valid java name and contains not printable characters */
    public ViewOnClickListenerC20313 f50655;

    /* renamed from: ᩳ֫, reason: not valid java name and contains not printable characters */
    public View f50656;

    /* renamed from: ᩷֫, reason: not valid java name and contains not printable characters */
    public C12230 f50657;

    /* renamed from: ᩺, reason: not valid java name and contains not printable characters */
    public C18786 f50658;

    /* renamed from: ᩻֫, reason: not valid java name and contains not printable characters */
    public int f50659;

    static {
        ApplicationC12518.m30701(123);
        f50637 = new short[]{165, -18540, -27298, -27999, 6217, 24192, 2205, 3320, 4274, 24311, 5962, -18094, -18093, -18098, -18071, -18094, -18093, -18091, -18087, -18085, -18106, -18081, -18086, -18093, -18071, -18093, -18088, -18095, -18081, -18088, -18093, -18154, -18149, -18154, -18170, -18085, -18107, -18116, -18151, -18151, -18116, -18116, -18151, -18148, -18154, -18154, -18148, -18151, -18116, -18151, -18151, -18116, -18151, -18151, -18154, -18062, -18093, -18091, -18087, -18085, -18106, -18081, -18086, -18093, -18094, -18154, -18092, -18097, -18154, 3295, 28367, 28366, 28371, 28404, 28367, 28366, 28360, 28356, 28358, 28379, 28354, 28359, 28366, 28404, 28366, 28357, 28364, 28354, 28357, 28366, 6393, 26811, 26810, 26791, 26752, 26811, 26810, 26812, 26800, 26802, 26799, 26806, 26803, 26810, 26752, 26810, 26801, 26808, 26806, 26801, 26810, 26802, 26810, 26795, 26807, 26800, 26811, 26762, 26801, 26804, 26801, 26800, 26792, 26801, 26879, 26810, 26797, 26797, 26800, 26797, -466, 4138, -256, 26780, 26814, 26801, 26879, 26801, 26800, 26795, 26879, 26809, 26806, 26801, 26811, 26879, 26802, 26810, 26795, 26807, 26800, 26811, 26853, 26879, 26864, 26864, 26837, 26864, 26864, 26879, 26779, 26810, 26812, 26800, 26802, 26799, 26806, 26803, 26810, 26811, 26879, 26813, 26790, 26879, 26879, 26866, 26879, 26802, 26796, 26837, 26864, 26864, 26837, 26837, 26864, 26869, 26879, 26879, 26869, 26864, 26837, 1364, -13184, -5726, -13184, -13170, -13170, -13170, -13184, -13176, -13175, 44, -16531, -22428, 22164, -32554, -29613, -19142, 454, -6461, 15374, -10469, 9893, 24744, 24865, -27544, 32735, -18143, -19839, -7726, -7718, -7733, -7721, -7728, -7717, -24946, -18329, -28968, 26843, -31624, -17232, 27322, -31195, -17832, -29206, -17926, 28749, 28999, -32467, -28397, -7791, -7723, -7714, -7735, -7714, 31959, 28811, -20256, -17435, 25578, 31134, -19110, -26619, -30577, -19251, 29767, 29870, 26666, -28595, -30441, 1289, 32241, 30476, 17406, 24285, -21010, -20290, -22574, 21606, 20030, 31300, 20877, 20435, 20099, 29653, 22502, 8483, 8482, 8495, 8498, 8473, 8497, 8489, 8500, 8482, 8473, 8497, 8500, 8487, 8502, 8473, 8492, 8487, 8496, 8487, 9931, 31345, 31358, 31347, 31329, 31329, 31330, 31347, 31334, 31354, 9293, -30008, -30026, -29961, -30029, -30018, -30029, -30026, -29961, -30002, -30029, -30039, -30029, -30026, -29984, 3128, -23753, -23752, -23755, -23769, -23769, -23772, -23755, -23776, -23748, -23751, -23759, -23776, -23748, -23749, -23760, -23769, -23759, -23752, -23759, -23753, -23776, -23759, -23760, -23779, -23750, -23750, -23759, -23770, -23785, -23752, -23755, -23769, -23769, -23759, -23769, 9606, -11820, -11838, -11829, -11838, -11836, -11821, -11838, -11837, -11794, -11831, -11831, -11838, -11819, -11804, -11829, -11834, -11820, -11820, -11838, -11820, 7621, 3328, 3350, 3359, 3350, 3344, 3335, 3350, 3351, 3386, 3357, 3357, 3350, 3329, 3376, 3359, 3346, 3328, 3328, 3350, 3328, 4225, 13307, 13258, 13271, 13275, 13199, 13276, 13275, 13248, 13277, 13262, 13256, 13258, 13199, 13254, 13276, 13199, 13276, 13275, 13254, 13251, 13251, 13199, 13251, 13248, 13262, 13259, 13254, 13249, 13256, 5049, 25664, -24133, 21756, 5334, -18383, -18375, -18392, -18380, -18381, -18376, -18318, -18378, -18371, -18390, -18371, -18318};
    }

    /* JADX INFO: Access modifiers changed from: private */
    /* renamed from: ܶ, reason: not valid java name and contains not printable characters */
    public native String m38807();

    @Override // l.AbstractC14346
    /* renamed from: ֡ */
    public final boolean mo14418() {
        return true;
    }

    @Override // l.AbstractC14346
    /* renamed from: ᩵ */
    public final boolean mo17432() {
        return true;
    }

    @Override // l.AbstractC14346
    /* renamed from: ܳ */
    public final int mo14420() {
        String str = null;
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i = 0;
        int i2 = 0;
        short s2 = 0;
        int i3 = 0;
        short[] sArr2 = null;
        int i4 = 0;
        int i5 = 0;
        int i6 = 814506763;
        int i7 = C3911.f12484;
        int i8 = ServiceConnectionC3453.f10921;
        int m2566 = C0630.m2566("ۗ۟") ^ i8;
        int i9 = ((m2566 ^ i7) * (-24221)) ^ (-613580610);
        int i10 = -2068701957;
        while (true) {
            i6 = ((((i6 ^ i7) * (-23319)) >> 31) & i9) ^ (m2566 ^ i10);
            switch (i6) {
                case -2083063855:
                case 415915706:
                    c = 428;
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C2105.m6981("ۛ֫") ^ i8;
                        i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                        i10 = 1184672937;
                    } else {
                        m2566 = (i8 - C0630.m2566("۠ۛ")) * 33;
                        i9 = ((m2566 ^ i7) * 5955) ^ 1401059904;
                        i10 = -402145477;
                    }
                case -1900656786:
                case 1675491118:
                    s = sArr[c];
                    if (C1504.f5354) {
                        m2566 = C2105.m6981("ۛ֫") ^ i8;
                        i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                        i10 = 1184672937;
                    } else {
                        m2566 = (C2105.m6981("᩷ܰ") ^ i7) * (-127);
                        i9 = ((m2566 ^ i8) * 23313) ^ 894137608;
                        i10 = 90448466;
                    }
                case -1668662723:
                case 2060293129:
                    int i11 = s + s2;
                    if (i2 - (i11 * i11) <= 0) {
                        m2566 = (i8 - C0630.m2566("ۗ᩺")) * 85;
                        i9 = ((m2566 ^ i7) * (-18409)) ^ (-1351802881);
                        i10 = -1620585753;
                    } else {
                        m2566 = (C2105.m6981("᩸᩺") ^ i8) * (-111);
                        i9 = ((m2566 ^ i7) * (-3111)) ^ 744147404;
                        i10 = 76668718;
                    }
                case -1487573642:
                case -182929006:
                    if (C0050.f910 >= 0) {
                        m2566 = (C0630.m2566("᩻۠") + i7) * 25;
                        i9 = ((m2566 ^ i8) * (-31889)) ^ (-875061589);
                        i10 = 1771417776;
                    } else {
                        m2566 = C0630.m2566("᩸ᩳ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-4201)) ^ (-430862765);
                        i10 = -1486030522;
                    }
                case -1435794455:
                case 819516177:
                    C0964.m3413();
                    C22628.m50615();
                    return 0;
                case -1159584581:
                case 1778973777:
                    if (C0382.m1848()) {
                        m2566 = (C0630.m2566("᩻۠") + i7) * 25;
                        i9 = ((m2566 ^ i8) * (-31889)) ^ (-875061589);
                        i10 = 1771417776;
                    } else {
                        m2566 = C2105.m6981("ۛ֫") ^ i8;
                        i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                        i10 = 1184672937;
                    }
                case -1099012502:
                case 1941272030:
                    i = s * 2;
                    if (C3537.f11231 >= 0) {
                        m2566 = (i7 - C2105.m6981("ۗۢ")) * (-53);
                        i9 = ((m2566 ^ i8) * 9015) ^ (-378089802);
                        i10 = -968963620;
                    } else {
                        m2566 = (C2105.m6981("ۘ᩸") + i7) * 31;
                        i9 = ((m2566 ^ i8) * 2103) ^ (-1822137457);
                        i10 = -162323268;
                    }
                case -1035670621:
                case -744945098:
                    return C0630.m2566(str) ^ 2120465126;
                case -1025114053:
                case 1412176459:
                    s2 = 1;
                    if (C1916.f6442) {
                        m2566 = C0630.m2566("۬᩵") ^ i7;
                        i9 = ((m2566 ^ i8) * 26219) ^ (-630799088);
                        i10 = -1674689771;
                    } else {
                        m2566 = C0630.m2566("᩸ᩳ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-4201)) ^ (-430862765);
                        i10 = -1486030522;
                    }
                case -987959974:
                case 1749365603:
                    sArr = f50637;
                    if (C1420.f5096 <= 0) {
                        m2566 = (C0630.m2566("᩻۠") + i7) * 25;
                        i9 = ((m2566 ^ i8) * (-31889)) ^ (-875061589);
                        i10 = 1771417776;
                    } else {
                        m2566 = C0630.m2566("ܰ᩻") ^ i8;
                        i9 = ((m2566 ^ i7) * (-437)) ^ 355268133;
                        i10 = -926778098;
                    }
                case -809519444:
                case 1268269773:
                    if (C11340.m28031()) {
                        m2566 = (C0630.m2566("᩻۠") + i7) * 25;
                        i9 = ((m2566 ^ i8) * (-31889)) ^ (-875061589);
                        i10 = 1771417776;
                    } else {
                        m2566 = C0630.m2566("ܰ۫") ^ i8;
                        i9 = ((m2566 ^ i7) * (-7195)) ^ 1765226108;
                        i10 = -2030048102;
                    }
                case -437633286:
                case 423607415:
                    C0483.m2121();
                    C0382.m1848();
                    m2566 = C2105.m6981("ۛ֫") ^ i8;
                    i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                    i10 = 1184672937;
                case -412660961:
                case 1165162428:
                    i3 = 1877;
                    m2566 = C2105.m6981("ܿܶ") ^ i7;
                    i9 = ((m2566 ^ i8) * (-31089)) ^ 456921912;
                    i10 = -20245390;
                case -91588502:
                case 607482165:
                    if (C0237.f1507 != 0) {
                        m2566 = C0630.m2566("᩸ᩳ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-4201)) ^ (-430862765);
                        i10 = -1486030522;
                    } else {
                        m2566 = (i7 - C2105.m6981("֫ۡ")) * (-57);
                        i9 = ((m2566 ^ i8) * (-5873)) ^ (-1037755732);
                        i10 = -1889570301;
                    }
                case 54025702:
                case 405329328:
                    sArr2 = f50637;
                    i4 = 429;
                    if (C2105.m6982() != 0) {
                        m2566 = (C0630.m2566("᩻۠") + i7) * 25;
                        i9 = ((m2566 ^ i8) * (-31889)) ^ (-875061589);
                        i10 = 1771417776;
                    } else {
                        m2566 = C2105.m6981("ܽܶ") ^ i8;
                        i9 = ((m2566 ^ i7) * 20019) ^ 233644604;
                        i10 = -1435655823;
                    }
                case 63808855:
                case 1373971349:
                    i2 = i + 1;
                    if (C5695.f17556 >= 0) {
                        m2566 = C0630.m2566("᩸ᩳ") ^ i8;
                        i9 = ((m2566 ^ i7) * (-4201)) ^ (-430862765);
                        i10 = -1486030522;
                    } else {
                        m2566 = C2105.m6981("᩷᩺") ^ i8;
                        i9 = ((m2566 ^ i7) * 22059) ^ 908616690;
                        i10 = 772979624;
                    }
                case 549123349:
                case 828546646:
                    i3 = 16364;
                    m2566 = C2105.m6981("ܿܶ") ^ i7;
                    i9 = ((m2566 ^ i8) * (-31089)) ^ 456921912;
                    i10 = -20245390;
                case 1184543640:
                case 1633470352:
                    i5 = 3;
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = C2105.m6981("ۛ֫") ^ i8;
                        i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                        i10 = 1184672937;
                    } else {
                        m2566 = C0630.m2566("᩻ᩳ") ^ i7;
                        i9 = ((m2566 ^ i8) * 29639) ^ 2060183971;
                        i10 = -2097061801;
                    }
                default:
                    str = C21923.m49334(sArr2, i4, i5, i3);
                    if (C7811.f24123 >= 0) {
                        m2566 = C2105.m6981("ۛ֫") ^ i8;
                        i9 = ((m2566 ^ i7) * 8535) ^ (-1733267429);
                        i10 = 1184672937;
                    } else {
                        m2566 = C0630.m2566("ۘܰ") ^ i7;
                        i9 = ((m2566 ^ i8) * 19733) ^ (-876419180);
                        i10 = 897251195;
                    }
            }
        }
    }

    /* renamed from: ֨, reason: not valid java name and contains not printable characters */
    public final String m38819() {
        Bundle bundle = null;
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i = 0;
        int i2 = 0;
        short s2 = 0;
        int i3 = 0;
        short[] sArr2 = null;
        int i4 = 0;
        int i5 = 0;
        int i6 = 131036358;
        int i7 = C0714.f2697;
        int i8 = C5695.f17556;
        int m2566 = C0630.m2566("᩹֨") ^ i7;
        int i9 = ((m2566 ^ i8) * 26157) ^ 2094749739;
        int i10 = -485013894;
        while (true) {
            i6 = ((((i6 ^ i8) * 23409) >> 31) & i9) ^ (m2566 ^ i10);
            switch (i6) {
                case -2092028779:
                case 1505519718:
                    i2 = 30536676 + i;
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = (C0630.m2566("ۖۤ") + i8) * (-107);
                        i9 = ((m2566 ^ i7) * 6869) ^ 875059556;
                        i10 = -1056427081;
                    } else {
                        m2566 = (C2105.m6981("ۡᩳ") ^ i8) * (-3);
                        i9 = ((m2566 ^ i7) * 21563) ^ 1385750765;
                        i10 = 1218981424;
                    }
                case -1895309808:
                case -1131126965:
                    C3746.m11369();
                    return null;
                case -1834643192:
                case 1894825569:
                    s2 = 11052;
                    if (C3537.f11231 >= 0) {
                        m2566 = C2105.m6981("ܽ۟") ^ i7;
                        i9 = ((m2566 ^ i8) * (-23985)) ^ 1982590829;
                        i10 = 1146771355;
                    } else {
                        m2566 = (C0630.m2566("ۜܶ") + i7) * (-9);
                        i9 = ((m2566 ^ i8) * 25779) ^ 861794966;
                        i10 = 1193476214;
                    }
                case -1779906178:
                case 412234814:
                    C1294.m4372();
                    m2566 = (i8 - C0630.m2566("ᩴ᩷")) * 17;
                    i9 = ((m2566 ^ i7) * (-3635)) ^ (-632803218);
                    i10 = 1333211396;
                case -1752251775:
                case 1709723883:
                    c = 295;
                    if (C1047.f3863 >= 0) {
                        m2566 = (i8 - C0630.m2566("ᩴ᩷")) * 17;
                        i9 = ((m2566 ^ i7) * (-3635)) ^ (-632803218);
                        i10 = 1333211396;
                    } else {
                        m2566 = (C0630.m2566("ᩴܿ") + i8) * (-125);
                        i9 = ((m2566 ^ i7) * (-16091)) ^ (-1023869836);
                        i10 = 158858706;
                    }
                case -1206691289:
                case 229245571:
                    if ((s * s2) - i2 > 0) {
                        m2566 = C0630.m2566("ܳ᩹") ^ i8;
                        i9 = ((m2566 ^ i7) * (-9933)) ^ 1684343870;
                        i10 = 680771699;
                    } else {
                        m2566 = C0630.m2566("᩺᩶") ^ i8;
                        i9 = ((m2566 ^ i7) * 18227) ^ (-349163384);
                        i10 = 1382841323;
                    }
                case -1142990893:
                case -591641744:
                    i5 = 9;
                    if (C1504.f5354) {
                        m2566 = (C0630.m2566("ۖۤ") + i8) * (-107);
                        i9 = ((m2566 ^ i7) * 6869) ^ 875059556;
                        i10 = -1056427081;
                    } else {
                        m2566 = (C2105.m6981("ᩳᩴ") + i7) * 87;
                        i9 = ((m2566 ^ i8) * 5603) ^ 262919080;
                        i10 = 703006189;
                    }
                case -1084746624:
                case 1531184266:
                    i3 = 31250;
                    m2566 = C0630.m2566("۟ۧ") ^ i7;
                    i9 = ((m2566 ^ i8) * (-9069)) ^ 367681515;
                    i10 = -2041754665;
                case -1062356796:
                case -486662287:
                    AbstractC2021.m6574();
                    if (C2958.m9034() > 0) {
                        m2566 = (C0630.m2566("ۖۤ") + i8) * (-107);
                        i9 = ((m2566 ^ i7) * 6869) ^ 875059556;
                        i10 = -1056427081;
                    } else {
                        m2566 = C0630.m2566("᩵ۧ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-2767)) ^ (-166261594);
                        i10 = -474938683;
                    }
                case -904549692:
                case -316866351:
                    if (C2105.m6982() != 0) {
                        m2566 = C0630.m2566("᩵ۧ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-2767)) ^ (-166261594);
                        i10 = -474938683;
                    } else {
                        m2566 = (C0630.m2566("᩵ۢ") ^ i8) * 43;
                        i9 = ((m2566 ^ i7) * 3415) ^ (-1693650512);
                        i10 = 893290351;
                    }
                case -781825692:
                case 1947482154:
                    i4 = 296;
                    if (C2167.f7158 >= 0) {
                        m2566 = (i8 - C0630.m2566("ᩴ᩷")) * 17;
                        i9 = ((m2566 ^ i7) * (-3635)) ^ (-632803218);
                        i10 = 1333211396;
                    } else {
                        m2566 = C0630.m2566("᩵᩶") ^ i8;
                        i9 = ((m2566 ^ i7) * (-17461)) ^ (-83801094);
                        i10 = 1458256165;
                    }
                case -648989967:
                case 176344071:
                    if (C3245.m9925() != 0) {
                        m2566 = (C0630.m2566("ۖۤ") + i8) * (-107);
                        i9 = ((m2566 ^ i7) * 6869) ^ 875059556;
                        i10 = -1056427081;
                    } else {
                        m2566 = C0630.m2566("᩸᩸") ^ i8;
                        i9 = ((m2566 ^ i7) * (-1599)) ^ 1987737854;
                        i10 = -454272013;
                    }
                case -528733552:
                case 165164196:
                    if (C11340.f33930 >= 0) {
                        m2566 = (C0630.m2566("᩵ۢ") ^ i8) * 43;
                        i9 = ((m2566 ^ i7) * 3415) ^ (-1693650512);
                        i10 = 893290351;
                    } else {
                        m2566 = (C2105.m6981("ۛ᩸") + i7) * 51;
                        i9 = ((m2566 ^ i8) * (-17603)) ^ (-2031075905);
                        i10 = -830532945;
                    }
                case -398539257:
                case 603372596:
                    s = sArr[c];
                    i = s * s;
                    if (C1128.f4106 <= 0) {
                        m2566 = C2105.m6981("ܽ۟") ^ i7;
                        i9 = ((m2566 ^ i8) * (-23985)) ^ 1982590829;
                        i10 = 1146771355;
                    } else {
                        m2566 = (C0630.m2566("ܶ᩺") ^ i7) * 13;
                        i9 = ((m2566 ^ i8) * (-19435)) ^ 1922218633;
                        i10 = -1186968112;
                    }
                case 54926799:
                case 134384162:
                    bundle = C3019.m9254(this);
                    sArr2 = f50637;
                    if (C7811.f24123 >= 0) {
                        m2566 = (i8 - C0630.m2566("ᩴ᩷")) * 17;
                        i9 = ((m2566 ^ i7) * (-3635)) ^ (-632803218);
                        i10 = 1333211396;
                    } else {
                        m2566 = (C2105.m6981("ۧۡ") + i7) * (-101);
                        i9 = ((m2566 ^ i8) * 14813) ^ (-1528871044);
                        i10 = -1368938329;
                    }
                case 478826616:
                case 2011596607:
                    String m19112 = C7106.m19112(bundle, C2167.m7159(sArr2, i4, i5, i3));
                    C3537.m10749(m19112);
                    return m19112;
                case 1519802036:
                case 1845306314:
                    C0382.m1848();
                    if (C0964.f3626 == 0) {
                        m2566 = (i8 - C0630.m2566("ᩴ᩷")) * 17;
                        i9 = ((m2566 ^ i7) * (-3635)) ^ (-632803218);
                        i10 = 1333211396;
                    } else {
                        m2566 = (C0630.m2566("ۖۤ") + i8) * (-107);
                        i9 = ((m2566 ^ i7) * 6869) ^ 875059556;
                        i10 = -1056427081;
                    }
                case 1834706472:
                case 1864417506:
                    sArr = f50637;
                    if (C7811.m20844() != 0) {
                        m2566 = C0630.m2566("᩵ۧ") ^ i7;
                        i9 = ((m2566 ^ i8) * (-2767)) ^ (-166261594);
                        i10 = -474938683;
                    } else {
                        m2566 = (C2105.m6981("ۡ᩸") ^ i7) * (-19);
                        i9 = ((m2566 ^ i8) * 7527) ^ 1815424165;
                        i10 = -1455294829;
                    }
                default:
                    i3 = 26232;
                    m2566 = C0630.m2566("۟ۧ") ^ i7;
                    i9 = ((m2566 ^ i8) * (-9069)) ^ 367681515;
                    i10 = -2041754665;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:27:0x0075, code lost:
    
        if (l.C11340.f33930 < 0) goto L18;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void m38820(java.lang.String r21, java.lang.String r22, java.util.List r23) {
        /*
            Method dump skipped, instructions count: 898
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38820(java.lang.String, java.lang.String, java.util.List):void");
    }

    @Override // l.AbstractC14346, l.ComponentCallbacksC9205
    public final void onResume() {
        ActivityC0737 activityC0737 = null;
        ActivityC17169 activityC17169 = null;
        CharSequence charSequence = null;
        C15545 c15545 = null;
        int i = -413185852;
        int i2 = C3746.f11829;
        int i3 = C4075.f12947;
        int m6981 = C2105.m6981("֫۟") ^ i3;
        int i4 = ((m6981 ^ i2) * (-17223)) ^ 714273455;
        int i5 = -475727473;
        while (true) {
            i = ((((i ^ i2) * 32135) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2071784356:
                case -3301904:
                    activityC17169.m40340(charSequence);
                    c15545 = this.f50646;
                    if (c15545 != null) {
                        m6981 = C2105.m6981("۬۟") ^ i2;
                        i4 = ((m6981 ^ i3) * (-30525)) ^ 1010829072;
                        i5 = -1226395997;
                    } else {
                        m6981 = (C2105.m6981("ۤܽ") ^ i3) * 11;
                        i4 = ((m6981 ^ i2) * 23549) ^ (-2011948780);
                        i5 = -1272711430;
                    }
                case -2034939196:
                case 1040330037:
                    activityC0737.setTitle(mo14422());
                    if (C3432.f10845 >= 0) {
                        m6981 = (i3 - C0630.m2566("ۘ֡")) * 97;
                        i4 = ((m6981 ^ i2) * 28817) ^ (-615664098);
                        i5 = 1689585413;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩶᩵")) * (-43);
                        i4 = ((m6981 ^ i3) * (-31037)) ^ (-1085337940);
                        i5 = 744063807;
                    }
                case -1827075249:
                case -801162443:
                    c15545.m36684();
                    m6981 = (C2105.m6981("ۤܽ") ^ i3) * 11;
                    i4 = ((m6981 ^ i2) * 23549) ^ (-2011948780);
                    i5 = -1272711430;
                case -1772652383:
                case 1288986975:
                    activityC17169 = (ActivityC17169) RunnableC0588.m2429(this);
                    if (C11340.f33930 >= 0) {
                        m6981 = (i2 - C2105.m6981("ۛܿ")) * 29;
                        i4 = ((m6981 ^ i3) * (-2101)) ^ (-1472559999);
                        i5 = 1628054447;
                    } else {
                        m6981 = C0630.m2566("ܶۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-22411)) ^ (-1669586940);
                        i5 = 2034853811;
                    }
                case -1598156545:
                case 332956887:
                    if (C0237.m1481() >= 0) {
                        m6981 = (i3 - C0630.m2566("ۘ֡")) * 97;
                        i4 = ((m6981 ^ i2) * 28817) ^ (-615664098);
                        i5 = 1689585413;
                    } else {
                        m6981 = (C0630.m2566("᩷֨") + i3) * 45;
                        i4 = ((m6981 ^ i2) * (-6041)) ^ (-855684607);
                        i5 = 595461302;
                    }
                case -1409620430:
                case -605203645:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (i3 - C0630.m2566("ۘ֡")) * 97;
                        i4 = ((m6981 ^ i2) * 28817) ^ (-615664098);
                        i5 = 1689585413;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۢᩳ")) * (-29);
                        i4 = ((m6981 ^ i3) * (-30125)) ^ (-232688222);
                        i5 = 1884223599;
                    }
                case -1097215789:
                case 1876048369:
                    break;
                case -1002991855:
                case 45880906:
                    C1128.m3851();
                    if (C0714.f2697 >= 0) {
                        m6981 = C0630.m2566("᩸ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23673)) ^ 639292646;
                        i5 = -1984130444;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܽۙ")) * 57;
                        i4 = ((m6981 ^ i2) * (-10833)) ^ (-1935918672);
                        i5 = 856709212;
                    }
                case -948310836:
                case 1570920628:
                    if (C3911.f12484 >= 0) {
                        m6981 = C0630.m2566("᩸ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23673)) ^ 639292646;
                        i5 = -1984130444;
                    } else {
                        m6981 = C0630.m2566("۠ܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 11185) ^ 946803952;
                        i5 = -1696542425;
                    }
                case -946962670:
                case 1055730052:
                    C1128.m3851();
                    break;
                case -711204531:
                case 1811898051:
                    super.onResume();
                    if (C2105.f7037 != 0) {
                        m6981 = (i3 - C2105.m6981("ܽۙ")) * 57;
                        i4 = ((m6981 ^ i2) * (-10833)) ^ (-1935918672);
                        i5 = 856709212;
                    } else {
                        m6981 = C0630.m2566("ܽ֫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-20173)) ^ (-1737634303);
                        i5 = -966279660;
                    }
                case -621688697:
                case 1862477024:
                    if (C3432.f10845 >= 0) {
                        m6981 = (i2 - C2105.m6981("ۛܿ")) * 29;
                        i4 = ((m6981 ^ i3) * (-2101)) ^ (-1472559999);
                        i5 = 1628054447;
                    } else {
                        m6981 = C0630.m2566("᩸ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23673)) ^ 639292646;
                        i5 = -1984130444;
                    }
                case -494915279:
                case 31766734:
                    C2272.m7503();
                    C4263.m12819();
                    m6981 = (i2 - C2105.m6981("ۛܿ")) * 29;
                    i4 = ((m6981 ^ i3) * (-2101)) ^ (-1472559999);
                    i5 = 1628054447;
                case -250441718:
                case 1654088962:
                    charSequence = null;
                    if (C4263.f13799 <= 0) {
                        m6981 = C0630.m2566("֫᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 13471) ^ 1853034411;
                        i5 = -1561457191;
                    } else {
                        m6981 = C0630.m2566("ۨۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 3613) ^ 1397414213;
                        i5 = -497385031;
                    }
                case -26001502:
                case 314252457:
                    if (C1128.f4106 <= 0) {
                        m6981 = (i2 - C2105.m6981("ۛܿ")) * 29;
                        i4 = ((m6981 ^ i3) * (-2101)) ^ (-1472559999);
                        i5 = 1628054447;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۧ᩵")) * (-121);
                        i4 = ((m6981 ^ i3) * (-7261)) ^ 1718697663;
                        i5 = 1840170890;
                    }
                case 62694941:
                case 691212499:
                    if (C0714.f2697 >= 0) {
                        m6981 = C0630.m2566("᩸ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23673)) ^ 639292646;
                        i5 = -1984130444;
                    } else {
                        m6981 = (C0630.m2566("֡ۡ") + i3) * (-3);
                        i4 = ((m6981 ^ i2) * 10331) ^ (-464612009);
                        i5 = 995029740;
                    }
                case 235989067:
                case 1384931871:
                    activityC0737 = C3683.m11214(this);
                    if (C1916.f6442) {
                        m6981 = (i3 - C2105.m6981("ᩳۙ")) * 115;
                        i4 = ((m6981 ^ i2) * (-26663)) ^ (-1485322230);
                        i5 = -1178544174;
                    } else {
                        m6981 = C0630.m2566("᩸ۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23673)) ^ 639292646;
                        i5 = -1984130444;
                    }
                default:
                    if (C3019.m9255() > 0) {
                        m6981 = (i2 - C2105.m6981("ۛܿ")) * 29;
                        i4 = ((m6981 ^ i3) * (-2101)) ^ (-1472559999);
                        i5 = 1628054447;
                    } else {
                        m6981 = C0630.m2566("֫᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 13471) ^ 1853034411;
                        i5 = -1561457191;
                    }
            }
            return;
        }
    }

    @Override // l.InterfaceC3900
    /* renamed from: ֫ */
    public final boolean mo11876(C12366 c12366) {
        String str = null;
        int i = 557205538;
        int i2 = C1773.f6144;
        int i3 = C0050.f910;
        int m6981 = (C2105.m6981("᩻ۧ") + i2) * (-75);
        int i4 = ((m6981 ^ i3) * (-31175)) ^ (-1787903447);
        int i5 = -1631360781;
        while (true) {
            i = ((((i ^ i3) * 20663) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2105919622:
                case 906509557:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    } else {
                        m6981 = (C0630.m2566("᩻ۙ") ^ i2) * (-43);
                        i4 = ((m6981 ^ i3) * 4863) ^ 1173700354;
                        i5 = 918581331;
                    }
                case -1981011989:
                case 1767455398:
                    if (C2167.m7155()) {
                        m6981 = C0630.m2566("ܶۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * 32257) ^ (-492218138);
                        i5 = 1664054043;
                    } else {
                        m6981 = C2105.m6981("ۨ᩹") ^ i3;
                        i4 = ((m6981 ^ i2) * (-4893)) ^ (-727527285);
                        i5 = 2128599712;
                    }
                case -1872052935:
                case 394966356:
                    if (C3663.m11168() >= 0) {
                        m6981 = (C2105.m6981("ܿܽ") + i3) * 5;
                        i4 = ((m6981 ^ i2) * 8909) ^ 309589052;
                        i5 = 1199629214;
                    } else {
                        m6981 = C2105.m6981("ۗ۬") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32157)) ^ 1090663608;
                        i5 = 1454015964;
                    }
                case -1829335940:
                case 734236344:
                    C0483.m2121();
                    m6981 = C0630.m2566("ܶۢ") ^ i3;
                    i4 = ((m6981 ^ i2) * 32257) ^ (-492218138);
                    i5 = 1664054043;
                case -1821857781:
                case -1618311108:
                    C0630.m2564();
                    C3432.m10477();
                    return false;
                case -1812950645:
                case 54466112:
                    str = m38819();
                    if (C2520.f8000 >= 0) {
                        m6981 = (C0630.m2566("ᩴۚ") ^ i3) * 31;
                        i4 = ((m6981 ^ i2) * (-28817)) ^ 1427331180;
                        i5 = 558576959;
                    } else {
                        m6981 = C0630.m2566("᩹ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-22643)) ^ 730160233;
                        i5 = 1843000419;
                    }
                case -1489943353:
                case -1307060396:
                    if (C2272.f7362) {
                        m6981 = C2105.m6981("ܺ᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * (-5263)) ^ (-1064074088);
                        i5 = -122185032;
                    } else {
                        m6981 = C0630.m2566("ۨܿ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-1965)) ^ (-1743871127);
                        i5 = -2012610055;
                    }
                case -1463879085:
                case -688778416:
                    if (C1916.f6442) {
                        m6981 = C0630.m2566("ܶۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * 32257) ^ (-492218138);
                        i5 = 1664054043;
                    } else {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    }
                case -1441840542:
                case -155342078:
                    if (C2105.f7037 != 0) {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    } else {
                        m6981 = C2105.m6981("᩵᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 26307) ^ 1891528119;
                        i5 = 2037790269;
                    }
                case -1352916069:
                case -703987406:
                    if (C22628.f73083 > 0) {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    } else {
                        m6981 = (C2105.m6981("ܿܽ") + i3) * 5;
                        i4 = ((m6981 ^ i2) * 8909) ^ 309589052;
                        i5 = 1199629214;
                    }
                case -1270068142:
                case 1957675493:
                    if (C7811.m20844() != 0) {
                        m6981 = (C2105.m6981("ܿܽ") + i3) * 5;
                        i4 = ((m6981 ^ i2) * 8909) ^ 309589052;
                        i5 = 1199629214;
                    } else {
                        m6981 = C0630.m2566("᩹ᩴ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-21367)) ^ 1663645339;
                        i5 = 1206326347;
                    }
                case -1185548084:
                case 508543371:
                    C0714.m2805();
                    if (C22628.f73083 <= 0) {
                        m6981 = (C2105.m6981("ܿܽ") + i3) * 5;
                        i4 = ((m6981 ^ i2) * 8909) ^ 309589052;
                        i5 = 1199629214;
                    } else {
                        m6981 = C2105.m6981("ܺ᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * (-5263)) ^ (-1064074088);
                        i5 = -122185032;
                    }
                case -941962095:
                case 1472731502:
                    if (C7811.f24123 >= 0) {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    } else {
                        m6981 = C0630.m2566("۬᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * 30139) ^ 545079735;
                        i5 = -6620670;
                    }
                case 281454011:
                case 410241764:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("ۤ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 13341) ^ 1952509014;
                        i5 = 92156873;
                    } else {
                        m6981 = C0630.m2566("֫ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-8623)) ^ (-1457999224);
                        i5 = -349233417;
                    }
                case 1130868339:
                case 1440045061:
                    return !c12366.m30058(str);
                default:
                    if (C1773.f6144 <= 0) {
                        m6981 = C2105.m6981("ܺ᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * (-5263)) ^ (-1064074088);
                        i5 = -122185032;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۨ᩸")) * 97;
                        i4 = ((m6981 ^ i3) * 11643) ^ (-196404404);
                        i5 = 307737441;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:18:0x005e, code lost:
    
        if (l.RunnableC0588.f2309 < 0) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:19:0x0060, code lost:
    
        r16 = r1;
     */
    /* JADX WARN: Code restructure failed: missing block: B:23:0x0068, code lost:
    
        if (l.C0237.m1481() >= 0) goto L65;
     */
    /* renamed from: ۠, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.util.ArrayList m38822() {
        /*
            Method dump skipped, instructions count: 876
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38822():java.util.ArrayList");
    }

    /* JADX WARN: Code restructure failed: missing block: B:6:0x0091, code lost:
    
        if (l.RunnableC1108.f4040 == false) goto L35;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m38787(l.C16475 r32, final java.lang.Exception r33) {
        /*
            Method dump skipped, instructions count: 1174
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38787(l.ܽۜۢ, java.lang.Exception):void");
    }

    /* JADX WARN: Illegal instructions before constructor call */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public C16475() {
        /*
            Method dump skipped, instructions count: 624
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.<init>():void");
    }

    @Override // l.AbstractC14346
    /* renamed from: ܺ */
    public final String mo14421() {
        return mo14422();
    }

    @Override // l.AbstractC14346
    /* renamed from: ᩴ */
    public final void mo34241() {
        C1659 c1659 = null;
        int i = 1492688802;
        int i2 = ServiceConnectionC3453.f10921;
        int i3 = C2167.f7158;
        int m6981 = C2105.m6981("ۨ᩵") ^ i2;
        int i4 = ((m6981 ^ i3) * (-16269)) ^ 1169954450;
        int i5 = 1314088264;
        while (true) {
            i = ((((i ^ i3) * (-1235)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2028704994:
                case 1862034693:
                    if (C2272.f7362) {
                        m6981 = (i2 - C0630.m2566("᩶᩻")) * 5;
                        i4 = ((m6981 ^ i3) * 7209) ^ 1236943879;
                        i5 = -698263759;
                    } else {
                        m6981 = (C2105.m6981("ۖ۠") ^ i3) * 35;
                        i4 = ((m6981 ^ i2) * (-24913)) ^ (-669195851);
                        i5 = -1816632460;
                    }
                case -2018632696:
                case -1016116379:
                    c1659 = new C1659(this);
                    if (C0422.m1963()) {
                        m6981 = (C0630.m2566("᩵֡") ^ i3) * 79;
                        i4 = ((m6981 ^ i2) * (-32263)) ^ (-1899162244);
                        i5 = -2078458959;
                    } else {
                        m6981 = C0630.m2566("᩸᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1763)) ^ (-1199706192);
                        i5 = -2026570316;
                    }
                case -1934582332:
                case -1737546012:
                    break;
                case -1917152247:
                case 628457776:
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("᩸᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1763)) ^ (-1199706192);
                        i5 = -2026570316;
                    } else {
                        m6981 = C0630.m2566("ۡۙ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-10119)) ^ (-1902832904);
                        i5 = -1839492550;
                    }
                case -1787946873:
                case -1270563347:
                    if (C4159.m12565() >= 0) {
                        m6981 = C0630.m2566("᩸᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1763)) ^ (-1199706192);
                        i5 = -2026570316;
                    } else {
                        m6981 = (C2105.m6981("ᩴۜ") + i2) * 127;
                        i4 = ((m6981 ^ i3) * 28173) ^ 1883417018;
                        i5 = 2092013231;
                    }
                case -1676265038:
                case 1408462892:
                    C1773.m5908();
                    if (C3746.f11829 > 0) {
                        m6981 = (i2 - C0630.m2566("᩶᩻")) * 5;
                        i4 = ((m6981 ^ i3) * 7209) ^ 1236943879;
                        i5 = -698263759;
                    } else {
                        m6981 = C2105.m6981("ܿ֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23225)) ^ (-1517398450);
                        i5 = 1011554434;
                    }
                case -1566285643:
                case 1375886150:
                    if (this.f50652) {
                        m6981 = (C2105.m6981("ܿܶ") ^ i2) * (-81);
                        i4 = ((m6981 ^ i3) * 7541) ^ (-1139809356);
                        i5 = 1361649134;
                    } else {
                        m6981 = C2105.m6981("᩷᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * 15155) ^ 116895842;
                        i5 = 1094378530;
                    }
                case -769549780:
                case 181024192:
                    if (this.f50644) {
                        m6981 = C0630.m2566("ܽۜ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32353)) ^ 1695161178;
                        i5 = 1593341713;
                    } else {
                        m6981 = C2105.m6981("᩷᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * 15155) ^ 116895842;
                        i5 = 1094378530;
                    }
                case -693980960:
                case 1809882596:
                    C4263.m12821(c1659);
                    m6981 = C2105.m6981("᩷᩷") ^ i3;
                    i4 = ((m6981 ^ i2) * 15155) ^ 116895842;
                    i5 = 1094378530;
                case -682933728:
                case 1840490348:
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ۢܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18467)) ^ 1778305294;
                        i5 = -846562112;
                    } else {
                        m6981 = (C2105.m6981("۟᩹") + i3) * 25;
                        i4 = ((m6981 ^ i2) * 21009) ^ 140706842;
                        i5 = -994301820;
                    }
                case -623363346:
                case -46712284:
                    C4616.m13552();
                    if (C22628.m50615() == 0) {
                        m6981 = (i2 - C0630.m2566("᩶᩻")) * 5;
                        i4 = ((m6981 ^ i3) * 7209) ^ 1236943879;
                        i5 = -698263759;
                    } else {
                        m6981 = C0630.m2566("᩸᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1763)) ^ (-1199706192);
                        i5 = -2026570316;
                    }
                case -451054874:
                case 752100900:
                    C0964.m3413();
                    RunnableC1108.m3790();
                    m6981 = (i2 - C0630.m2566("᩶᩻")) * 5;
                    i4 = ((m6981 ^ i3) * 7209) ^ 1236943879;
                    i5 = -698263759;
                case -408201100:
                case 2125249362:
                    if (C2105.f7037 != 0) {
                        m6981 = (C2105.m6981("۟᩹") + i3) * 25;
                        i4 = ((m6981 ^ i2) * 21009) ^ 140706842;
                        i5 = -994301820;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۗۢ")) * 91;
                        i4 = ((m6981 ^ i2) * (-26579)) ^ 231145634;
                        i5 = 204800146;
                    }
                case -351023652:
                case 1296105323:
                    if (C2958.f9394 >= 0) {
                        m6981 = C2105.m6981("ܿ֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23225)) ^ (-1517398450);
                        i5 = 1011554434;
                    } else {
                        m6981 = C2105.m6981("ܰۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1145)) ^ (-1697630530);
                        i5 = 1002197752;
                    }
                case -332567289:
                case 583586443:
                    if (C0964.m3413()) {
                        m6981 = C2105.m6981("ۧ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 21545) ^ (-1352014782);
                        i5 = -1589312978;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩶᩻")) * 5;
                        i4 = ((m6981 ^ i3) * 7209) ^ 1236943879;
                        i5 = -698263759;
                    }
                case 35272104:
                case 1425671367:
                    if (this.f50647) {
                        m6981 = C2105.m6981("᩷᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * 15155) ^ 116895842;
                        i5 = 1094378530;
                    } else {
                        m6981 = C2105.m6981("۬ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 17123) ^ (-343183809);
                        i5 = 1054252635;
                    }
                case 1439568248:
                case 1990596198:
                    C0798.m2998();
                    C3432.m10477();
                    break;
                case 1807763398:
                case 1885238258:
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("ܿ֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23225)) ^ (-1517398450);
                        i5 = 1011554434;
                    } else {
                        m6981 = (C0630.m2566("ᩳ۬") ^ i3) * (-31);
                        i4 = ((m6981 ^ i2) * (-1735)) ^ 647161897;
                        i5 = 847834797;
                    }
                case 1984747892:
                case 2014532305:
                    if (C2126.m7040()) {
                        m6981 = (C2105.m6981("۟᩹") + i3) * 25;
                        i4 = ((m6981 ^ i2) * 21009) ^ 140706842;
                        i5 = -994301820;
                    } else {
                        m6981 = C0630.m2566("ܽ᩻") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1899)) ^ (-1022541773);
                        i5 = 1810064560;
                    }
                default:
                    if (C1711.f5919) {
                        m6981 = (C2105.m6981("۟᩹") + i3) * 25;
                        i4 = ((m6981 ^ i2) * 21009) ^ 140706842;
                        i5 = -994301820;
                    } else {
                        m6981 = (i3 - C0630.m2566("۬ۖ")) * 63;
                        i4 = ((m6981 ^ i2) * (-1297)) ^ 1249287816;
                        i5 = 402038176;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC14346
    /* renamed from: ۜ */
    public final String mo14419() {
        return C6554.m18061(150, m38819());
    }

    @Override // l.AbstractC14346
    /* renamed from: ֫ */
    public final void mo17423(C3764 c3764) {
        c3764.m11383(m38819());
    }

    /* JADX WARN: Code restructure failed: missing block: B:16:0x00af, code lost:
    
        if (l.C4117.f13076 > 0) goto L24;
     */
    /* JADX WARN: Code restructure failed: missing block: B:6:0x00a5, code lost:
    
        if (l.C3911.f12484 >= 0) goto L10;
     */
    @Override // l.AbstractC14346
    /* renamed from: ᩷ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.lang.String mo14422() {
        /*
            Method dump skipped, instructions count: 1328
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.mo14422():java.lang.String");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static /* synthetic */ void m38789(C16475 c16475, List list, List list2, List list3, List list4) {
        int i = -2035967329;
        int i2 = C7811.f24123;
        int i3 = AbstractC2021.f6743;
        int m2566 = C0630.m2566("ۧ᩺") ^ i3;
        int i4 = ((m2566 ^ i2) * 32011) ^ 766458590;
        int i5 = 379193850;
        while (true) {
            i = ((((i ^ i2) * (-17729)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1981448636:
                case 934002069:
                    if (C4263.f13799 > 0) {
                        m2566 = (i3 - C0630.m2566("۬ܿ")) * (-5);
                        i4 = ((m2566 ^ i2) * 9845) ^ (-9316856);
                        i5 = -421480162;
                    } else {
                        m2566 = C0630.m2566("ܳ᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-16399)) ^ (-201170487);
                        i5 = -834365519;
                    }
                case -1924423995:
                case -1471201650:
                    C2105.m6982();
                    if (C11340.m28031()) {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    } else {
                        m2566 = (C2105.m6981("ۤۘ") ^ i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-11663)) ^ (-563843303);
                        i5 = 1636837459;
                    }
                case -1811170890:
                case 911422386:
                    c16475.f50655.m46590(list, list3, list2, list4);
                    m2566 = C0630.m2566("ܶ᩻") ^ i2;
                    i4 = ((m2566 ^ i3) * 5413) ^ (-1092688447);
                    i5 = -870668837;
                case -1663942500:
                case 900255921:
                    if (RunnableC3474.m10630()) {
                        m2566 = (C0630.m2566("᩸ۡ") ^ i3) * (-127);
                        i4 = ((m2566 ^ i2) * 27567) ^ (-1413390610);
                        i5 = 1281202000;
                    } else {
                        m2566 = C0630.m2566("ۧ᩹") ^ i2;
                        i4 = ((m2566 ^ i3) * (-5951)) ^ 1470853351;
                        i5 = 940919665;
                    }
                case -1618152755:
                case -255070984:
                    RunnableC1108.m3790();
                    break;
                case -1134514016:
                case 1949523492:
                    if (C1916.f6442) {
                        m2566 = C2105.m6981("ܽܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * 25651) ^ 1452943956;
                        i5 = 1665329746;
                    } else {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    }
                case -1134421363:
                case -439811693:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = (i3 - C0630.m2566("۬ܿ")) * (-5);
                        i4 = ((m2566 ^ i2) * 9845) ^ (-9316856);
                        i5 = -421480162;
                    } else {
                        m2566 = C0630.m2566("᩷᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 32371) ^ 526120632;
                        i5 = -1749877030;
                    }
                case -1055178824:
                case 1665653663:
                    if (C0382.f1805) {
                        m2566 = (i2 - C0630.m2566("۬᩻")) * 43;
                        i4 = ((m2566 ^ i3) * 21887) ^ (-100023880);
                        i5 = -689932839;
                    } else {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    }
                case -760035147:
                case 115570701:
                    if (C3683.f11629 >= 0) {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    } else {
                        m2566 = (C2105.m6981("᩺ۗ") ^ i3) * 57;
                        i4 = ((m2566 ^ i2) * 11367) ^ (-1878677748);
                        i5 = 379574751;
                    }
                case -539927273:
                case 1301457082:
                    if (c16475.f50644) {
                        m2566 = C0630.m2566("᩷ۖ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-9457)) ^ 43838641;
                        i5 = 1627031310;
                    } else {
                        m2566 = C0630.m2566("ܶ᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * 5413) ^ (-1092688447);
                        i5 = -870668837;
                    }
                case -514071537:
                case 1852686556:
                    if (C2105.f7037 != 0) {
                        m2566 = (i3 - C0630.m2566("۬ܿ")) * (-5);
                        i4 = ((m2566 ^ i2) * 9845) ^ (-9316856);
                        i5 = -421480162;
                    } else {
                        m2566 = (C2105.m6981("ܰ۬") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-29629)) ^ 1265135116;
                        i5 = -1569971269;
                    }
                case -342752263:
                case 599983707:
                    if (C21923.f70183 != 0) {
                        m2566 = (i3 - C0630.m2566("۬ܿ")) * (-5);
                        i4 = ((m2566 ^ i2) * 9845) ^ (-9316856);
                        i5 = -421480162;
                    } else {
                        m2566 = C0630.m2566("ۢܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17859)) ^ (-733096509);
                        i5 = 1353448924;
                    }
                case 598679485:
                case 2112527001:
                    break;
                case 928903769:
                case 1213280110:
                    C3245.m9925();
                    m2566 = (C2105.m6981("ۤۘ") ^ i3) * (-19);
                    i4 = ((m2566 ^ i2) * (-11663)) ^ (-563843303);
                    i5 = 1636837459;
                case 1076917770:
                case 1401826313:
                    if (C3432.m10477() <= 0) {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    } else {
                        m2566 = C0630.m2566("ۧܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * 1965) ^ (-316408079);
                        i5 = 340216001;
                    }
                case 1122835060:
                case 2108598287:
                    if (C1128.m3851() <= 0) {
                        m2566 = (C2105.m6981("ۤۘ") ^ i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-11663)) ^ (-563843303);
                        i5 = 1636837459;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۜܶ")) * 19;
                        i4 = ((m2566 ^ i3) * (-10875)) ^ (-452413114);
                        i5 = 386749772;
                    }
                case 1331869243:
                case 2142546782:
                    if (C7106.f21815 != 0) {
                        m2566 = (C2105.m6981("۬ۧ") ^ i2) * (-89);
                        i4 = ((m2566 ^ i3) * (-547)) ^ (-543745508);
                        i5 = 1809235018;
                    } else {
                        m2566 = (i3 - C0630.m2566("۬ܿ")) * (-5);
                        i4 = ((m2566 ^ i2) * 9845) ^ (-9316856);
                        i5 = -421480162;
                    }
                default:
                    if (C3746.f11829 <= 0) {
                        m2566 = (C2105.m6981("ۤۘ") ^ i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-11663)) ^ (-563843303);
                        i5 = 1636837459;
                    } else {
                        m2566 = C2105.m6981("۬ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-20547)) ^ 2051663795;
                        i5 = 1413028257;
                    }
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m38790(C16475 c16475, AtomicBoolean atomicBoolean, EnumC13610 enumC13610) {
        int i = 501705783;
        int i2 = RunnableC3474.f10992;
        int i3 = C4616.f14690;
        int m6981 = (C2105.m6981("᩵۟") + i3) * (-33);
        int i4 = ((m6981 ^ i2) * (-6115)) ^ 1126662068;
        int i5 = 31108811;
        while (true) {
            i = ((((i ^ i2) * (-22669)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2147155258:
                case 8847933:
                    if (C4263.f13799 <= 0) {
                        m6981 = C0630.m2566("ܶ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-31533)) ^ 129186550;
                        i5 = 818218000;
                    } else {
                        m6981 = C2105.m6981("ۨۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15097) ^ 1359369311;
                        i5 = 555015464;
                    }
                case -2036558829:
                case -927852110:
                    if (enumC13610.m32728()) {
                        m6981 = C2105.m6981("۬ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * 19199) ^ 747856625;
                        i5 = 283359031;
                    } else {
                        m6981 = C2105.m6981("᩻۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14993)) ^ 1767919112;
                        i5 = 237019453;
                    }
                case -1803572835:
                case 675608265:
                    if (C1420.f5096 <= 0) {
                        m6981 = C0630.m2566("ܶ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-31533)) ^ 129186550;
                        i5 = 818218000;
                    } else {
                        m6981 = (C0630.m2566("ۛۜ") ^ i2) * (-103);
                        i4 = ((m6981 ^ i3) * 8925) ^ (-886602806);
                        i5 = -837911800;
                    }
                case -1713017387:
                case -414183027:
                    C11340.m28031();
                    C4263.m12819();
                    m6981 = C0630.m2566("֡᩷") ^ i2;
                    i4 = ((m6981 ^ i3) * 19329) ^ (-23976172);
                    i5 = -1743741135;
                case -1687368813:
                case 457991000:
                    C0964.m3402(new C1659(c16475));
                    m6981 = C2105.m6981("᩻۬") ^ i2;
                    i4 = ((m6981 ^ i3) * (-14993)) ^ 1767919112;
                    i5 = 237019453;
                case -1633792212:
                case 1341933296:
                    if (C5695.f17556 >= 0) {
                        m6981 = C0630.m2566("֡᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 19329) ^ (-23976172);
                        i5 = -1743741135;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩵֡")) * (-7);
                        i4 = ((m6981 ^ i3) * 10447) ^ (-2132664644);
                        i5 = -315577389;
                    }
                case -1627999613:
                case -803984076:
                    C4263.m12819();
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = C2105.m6981("ۡۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18167) ^ 1344063881;
                        i5 = -1084330225;
                    } else {
                        m6981 = C0630.m2566("ܶ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-31533)) ^ 129186550;
                        i5 = 818218000;
                    }
                case -1570374781:
                case -931125062:
                    if (C22628.m50615() != 0) {
                        m6981 = (C2105.m6981("᩺۠") ^ i3) * (-115);
                        i4 = ((m6981 ^ i2) * (-5265)) ^ (-140327814);
                        i5 = 1256513050;
                    } else {
                        m6981 = (C0630.m2566("ۤ᩵") ^ i2) * (-83);
                        i4 = ((m6981 ^ i3) * (-1145)) ^ 1927754162;
                        i5 = -283607636;
                    }
                case -1374322272:
                case -22221434:
                    if (atomicBoolean.compareAndSet(true, false)) {
                        m6981 = C2105.m6981("᩻۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14993)) ^ 1767919112;
                        i5 = 237019453;
                    } else {
                        m6981 = C2105.m6981("᩶۟") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25577)) ^ 512328637;
                        i5 = -1608224262;
                    }
                case -1223904383:
                case -1080402166:
                    if (C4159.f13567) {
                        m6981 = C2105.m6981("ܺۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * 2421) ^ 493824281;
                        i5 = 1211104863;
                    } else {
                        m6981 = (C2105.m6981("᩺۠") ^ i3) * (-115);
                        i4 = ((m6981 ^ i2) * (-5265)) ^ (-140327814);
                        i5 = 1256513050;
                    }
                case -589302658:
                case 1658059112:
                    C0382.m1848();
                    if (C21923.f70183 == 0) {
                        m6981 = C0630.m2566("֡᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 19329) ^ (-23976172);
                        i5 = -1743741135;
                    } else {
                        m6981 = C2105.m6981("ۡۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18167) ^ 1344063881;
                        i5 = -1084330225;
                    }
                case -318853275:
                case -101016982:
                    C1504.m5179();
                    C1916.m6308();
                    break;
                case -307945734:
                case 1896458057:
                    if (c16475.f50648) {
                        m6981 = C0630.m2566("ۜ᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * 3169) ^ 577348606;
                        i5 = -699834226;
                    } else {
                        m6981 = C2105.m6981("᩻۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14993)) ^ 1767919112;
                        i5 = 237019453;
                    }
                case -252554921:
                case 259908957:
                    if (c16475.f50644) {
                        m6981 = C0630.m2566("᩻ۜ") ^ i3;
                        i4 = ((m6981 ^ i2) * 16667) ^ (-505585937);
                        i5 = -1110167918;
                    } else {
                        m6981 = C2105.m6981("᩻۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14993)) ^ 1767919112;
                        i5 = 237019453;
                    }
                case -74101555:
                case 1875466049:
                    break;
                case 166510871:
                case 1855243903:
                    if (C3537.f11231 >= 0) {
                        m6981 = C2105.m6981("ۡۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18167) ^ 1344063881;
                        i5 = -1084330225;
                    } else {
                        m6981 = (C0630.m2566("۫ۛ") ^ i3) * 127;
                        i4 = ((m6981 ^ i2) * (-12043)) ^ 1101648824;
                        i5 = -28906294;
                    }
                case 562817639:
                case 921433528:
                    if (C2272.m7503()) {
                        m6981 = C0630.m2566("֡᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 19329) ^ (-23976172);
                        i5 = -1743741135;
                    } else {
                        m6981 = (i3 - C0630.m2566("᩺᩺")) * 77;
                        i4 = ((m6981 ^ i2) * (-6059)) ^ (-167783003);
                        i5 = -1916281015;
                    }
                case 933407487:
                case 1289029155:
                    if (RunnableC1937.m6387() != 0) {
                        m6981 = C0630.m2566("֡᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 19329) ^ (-23976172);
                        i5 = -1743741135;
                    } else {
                        m6981 = (C0630.m2566("ۛ᩻") ^ i2) * (-13);
                        i4 = ((m6981 ^ i3) * (-14505)) ^ 422340142;
                        i5 = 838322319;
                    }
                case 1128888310:
                case 1362046920:
                    ServiceConnectionC3453.m10564();
                    if (C2105.f7037 == 0) {
                        m6981 = C2105.m6981("ۡۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18167) ^ 1344063881;
                        i5 = -1084330225;
                    } else {
                        m6981 = (C0630.m2566("ܽ֫") ^ i2) * (-95);
                        i4 = ((m6981 ^ i3) * (-16301)) ^ (-1435072337);
                        i5 = -926271509;
                    }
                case 1423878372:
                case 2144542162:
                    if (C3911.m11924() <= 0) {
                        m6981 = (C2105.m6981("᩺۠") ^ i3) * (-115);
                        i4 = ((m6981 ^ i2) * (-5265)) ^ (-140327814);
                        i5 = 1256513050;
                    } else {
                        m6981 = C0630.m2566("ܽۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * 29153) ^ 179055414;
                        i5 = -1205504341;
                    }
                default:
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("ܶ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-31533)) ^ 129186550;
                        i5 = 818218000;
                    } else {
                        m6981 = C0630.m2566("ۘ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-9911)) ^ (-1547296546);
                        i5 = 286890656;
                    }
            }
            return;
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m38786(C16475 c16475, View view) {
        int m6981;
        int i;
        int m2566;
        int i2;
        int i3;
        short[] sArr;
        int m25662;
        int i4;
        int i5;
        String m38819;
        final C16475 c164752 = c16475;
        boolean z = false;
        String str = null;
        final C23155 c23155 = null;
        String str2 = null;
        C3060 c3060 = null;
        int i6 = 0;
        int i7 = 0;
        int i8 = -2018943975;
        int i9 = C3432.f10845;
        int i10 = C7811.f24123;
        int m25663 = (C0630.m2566("ᩳܺ") ^ i10) * q.h;
        int i11 = ((m25663 ^ i9) * 7173) ^ 1046768088;
        int i12 = m25663 ^ 1882362210;
        short[] sArr2 = null;
        int i13 = 0;
        int i14 = 0;
        int i15 = 0;
        C21282 c21282 = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i16 = 0;
        int i17 = 0;
        int i18 = 0;
        short[] sArr3 = null;
        short[] sArr4 = null;
        while (true) {
            short[] sArr5 = sArr3;
            while (true) {
                i8 = i12 ^ (i11 & (((i8 ^ i9) * 8795) >> 31));
                switch (i8) {
                    case -2044717814:
                    case 92057934:
                        i16 = s * s2;
                        i17 = s * s;
                        i18 = 316590849;
                        if (C0422.f1886 > 0) {
                            m6981 = (C2105.m6981("ۡۤ") + i9) * 83;
                            i11 = ((m6981 ^ i10) * 23767) ^ (-389870883);
                            i = 2061161197;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                        m6981 = C2105.m6981("ᩴۜ") ^ i9;
                        i11 = ((m6981 ^ i10) * (-15917)) ^ 497866353;
                        i = 1007686001;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -2027392931:
                    case -1615802624:
                        s = sArr4[c];
                        s2 = 35586;
                        if (C1128.m3851() > 0) {
                            m6981 = (C0630.m2566("۫ۤ") + i10) * (-99);
                            i11 = ((m6981 ^ i9) * 11047) ^ (-197947780);
                            i = -1448212182;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                        m6981 = C0630.m2566("ۧۜ") ^ i10;
                        i11 = ((m6981 ^ i9) * 23493) ^ (-60632485);
                        i = -827448960;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -2021189876:
                    case 904996351:
                        sArr = sArr5;
                        int i19 = 2119978475 ^ i6;
                        C0630.m2573(c3060, z ? 1 : 0, i19, z ? 1 : 0, i19);
                        if (C2958.f9394 < 0) {
                            c21282.m48302(new InterfaceC14930() { // from class: l.ۙ᩻ۢ
                                @Override // l.InterfaceC14930
                                public final boolean onMenuItemClick(MenuItem menuItem) {
                                    C16475.m38794(C16475.this, c23155, menuItem);
                                    return true;
                                }
                            });
                            c21282.m48305();
                            break;
                        }
                        sArr5 = sArr;
                        m6981 = C0630.m2566("ۧۜ") ^ i10;
                        i11 = ((m6981 ^ i9) * 23493) ^ (-60632485);
                        i = -827448960;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -1983305630:
                    case 926331885:
                        Context requireContext = c16475.requireContext();
                        z = false;
                        if (AbstractC2021.f6743 <= 0) {
                            int m25664 = (i10 - C0630.m2566("ۛۘ")) * 99;
                            i12 = m25664 ^ 539530376;
                            i11 = ((m25664 ^ i9) * 8507) ^ (-1978903884);
                            c21282 = null;
                        } else {
                            c21282 = new C21282(requireContext, view, 0);
                            str = c164752.f50655.m46589();
                            if (str != null) {
                                int m69812 = C2105.m6981("ۛۨ") ^ i9;
                                i12 = m69812 ^ (-1643287656);
                                i11 = ((m69812 ^ i10) * (-31311)) ^ (-1769655719);
                                z = false;
                            } else {
                                z = false;
                                int m25665 = (C0630.m2566("۬ۡ") ^ i9) * 73;
                                i12 = m25665 ^ 1224462808;
                                i11 = ((m25665 ^ i10) * (-8843)) ^ 1247677104;
                                c164752 = c16475;
                            }
                        }
                    case -1942090290:
                    case -1851712347:
                        m38819 = C15472.m36561(1, 1, str);
                        str2 = m38819;
                        m2566 = (i10 - C0630.m2566("۬ۤ")) * 97;
                        i2 = ((m2566 ^ i9) * (-32119)) ^ 1149230292;
                        i3 = -228337141;
                        i12 = m2566 ^ i3;
                        i11 = i2;
                    case -1901096428:
                    case 833267872:
                        c = 4;
                        if (C2105.f7037 == 0) {
                            m6981 = C2105.m6981("ܺ᩶") ^ i10;
                            i11 = ((m6981 ^ i9) * 17591) ^ 826288840;
                            i = 920145766;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                        m6981 = C2105.m6981("ᩴۜ") ^ i9;
                        i11 = ((m6981 ^ i10) * (-15917)) ^ 497866353;
                        i = 1007686001;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -1884200400:
                    case -151288486:
                        if (C0714.f2697 >= 0) {
                            int m256642 = (i10 - C0630.m2566("ۛۘ")) * 99;
                            i12 = m256642 ^ 539530376;
                            i11 = ((m256642 ^ i9) * 8507) ^ (-1978903884);
                            c21282 = null;
                        } else {
                            m2566 = C0630.m2566("᩻ܿ") ^ i9;
                            i2 = ((m2566 ^ i10) * (-25813)) ^ 1061086161;
                            i3 = -1999555646;
                            i12 = m2566 ^ i3;
                            i11 = i2;
                        }
                    case -1810782846:
                    case 205177522:
                        sArr4 = f50637;
                        if (C3911.f12484 < 0) {
                            m6981 = (C2105.m6981("֡᩺") + i9) * 33;
                            i11 = ((m6981 ^ i10) * (-6201)) ^ 1751847710;
                            i = -652854699;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                        m6981 = C2105.m6981("۬֫") ^ i10;
                        i11 = ((m6981 ^ i9) * (-7271)) ^ 1772254906;
                        i = 1191943202;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -1794551220:
                    case -66073855:
                        sArr = sArr5;
                        if (C3746.m11370(str, C3911.m11919(f50637, 9, 1, i7))) {
                            m25662 = (i9 - C2105.m6981("ܶۘ")) * 87;
                            i4 = ((m25662 ^ i10) * 7697) ^ 1849655734;
                            i5 = 406696943;
                            break;
                        } else {
                            sArr5 = sArr;
                            int m256652 = (C0630.m2566("۬ۡ") ^ i9) * 73;
                            i12 = m256652 ^ 1224462808;
                            i11 = ((m256652 ^ i10) * (-8843)) ^ 1247677104;
                            c164752 = c16475;
                        }
                    case -1789192600:
                    case -1030473736:
                        if (C4616.m13554(str, C2520.m8030(sArr5, i13, i14, i7))) {
                            m2566 = C0630.m2566("۫ۙ") ^ i10;
                            i2 = ((m2566 ^ i9) * (-1705)) ^ 45772922;
                            i3 = 620317253;
                            i12 = m2566 ^ i3;
                            i11 = i2;
                        } else {
                            int m2566522 = (C0630.m2566("۬ۡ") ^ i9) * 73;
                            i12 = m2566522 ^ 1224462808;
                            i11 = ((m2566522 ^ i10) * (-8843)) ^ 1247677104;
                            c164752 = c16475;
                        }
                    case -1719333020:
                    case 809361999:
                        sArr = sArr5;
                        c23155 = new C23155(c21282, str2, z);
                        c3060 = c21282.m48304();
                        if (C3019.f9544 < 0) {
                            m25662 = (C0630.m2566("ۤۤ") ^ i9) * 3;
                            i4 = ((m25662 ^ i10) * 14709) ^ (-1447809961);
                            i5 = 1662795856;
                            break;
                        } else {
                            sArr5 = sArr;
                            m6981 = C2105.m6981("ᩴۜ") ^ i9;
                            i11 = ((m6981 ^ i10) * (-15917)) ^ 497866353;
                            i = 1007686001;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                    case -1397690286:
                    case 1071851284:
                        sArr = sArr5;
                        i6 = C0630.m2566(C1294.m4373(sArr2, i15, 3, i7));
                        if (C4159.f13567) {
                            m25662 = C0630.m2566("ۖۡ") ^ i9;
                            i4 = ((m25662 ^ i10) * 18873) ^ 318663799;
                            i5 = 848533231;
                            break;
                        }
                        sArr5 = sArr;
                        m6981 = C0630.m2566("ۧۜ") ^ i10;
                        i11 = ((m6981 ^ i9) * 23493) ^ (-60632485);
                        i = -827448960;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -1053255579:
                    case 888778908:
                        i7 = 24268;
                        m6981 = (C2105.m6981("ۗۛ") ^ i10) * 25;
                        i11 = ((m6981 ^ i9) * (-11613)) ^ (-298655066);
                        i = 1464182022;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -818266180:
                    case 268478235:
                        if (i16 - (i17 + i18) > 0) {
                            m6981 = (i9 - C2105.m6981("֫ܺ")) * 39;
                            i11 = ((m6981 ^ i10) * (-12869)) ^ 1329989271;
                            i = -897143963;
                        } else {
                            m6981 = (C2105.m6981("֨ۜ") ^ i10) * q.h;
                            i11 = ((m6981 ^ i9) * (-31431)) ^ 292068014;
                            i = 592496450;
                        }
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -498634608:
                    case -269491722:
                        C3245.m9925();
                        C5695.m16023();
                        m6981 = C2105.m6981("ᩴۜ") ^ i9;
                        i11 = ((m6981 ^ i10) * (-15917)) ^ 497866353;
                        i = 1007686001;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case -366902947:
                    case 1334009927:
                        m38819 = c16475.m38819();
                        str2 = m38819;
                        m2566 = (i10 - C0630.m2566("۬ۤ")) * 97;
                        i2 = ((m2566 ^ i9) * (-32119)) ^ 1149230292;
                        i3 = -228337141;
                        i12 = m2566 ^ i3;
                        i11 = i2;
                    case 154606054:
                    case 723119069:
                        sArr5 = f50637;
                        i13 = 5;
                        i14 = 1;
                        if (C0483.f2088 >= 0) {
                            int m2566422 = (i10 - C0630.m2566("ۛۘ")) * 99;
                            i12 = m2566422 ^ 539530376;
                            i11 = ((m2566422 ^ i9) * 8507) ^ (-1978903884);
                            c21282 = null;
                        } else {
                            m2566 = (C0630.m2566("֨ᩳ") ^ i10) * 77;
                            i2 = ((m2566 ^ i9) * (-10997)) ^ 1032004780;
                            i3 = 1202188772;
                            i12 = m2566 ^ i3;
                            i11 = i2;
                        }
                    case 1036408014:
                    case 1830296710:
                        C1711.m5736();
                        if (C1005.m3501()) {
                            int m25664222 = (i10 - C0630.m2566("ۛۘ")) * 99;
                            i12 = m25664222 ^ 539530376;
                            i11 = ((m25664222 ^ i9) * 8507) ^ (-1978903884);
                            c21282 = null;
                        } else {
                            m6981 = C2105.m6981("ᩴۜ") ^ i9;
                            i11 = ((m6981 ^ i10) * (-15917)) ^ 497866353;
                            i = 1007686001;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                    case 1323906996:
                    case 2082592424:
                        sArr = sArr5;
                        sArr2 = f50637;
                        i15 = 6;
                        if (C1916.m6308() < 0) {
                            m25662 = C0630.m2566("۟۟") ^ i10;
                            i4 = ((m25662 ^ i9) * 11311) ^ (-1299280377);
                            i5 = -1911342669;
                            break;
                        } else {
                            sArr5 = sArr;
                            m6981 = C2105.m6981("۬֫") ^ i10;
                            i11 = ((m6981 ^ i9) * (-7271)) ^ 1772254906;
                            i = 1191943202;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        }
                    case 1601744842:
                    case 1981334821:
                        i7 = 2809;
                        m6981 = (C2105.m6981("ۗۛ") ^ i10) * 25;
                        i11 = ((m6981 ^ i9) * (-11613)) ^ (-298655066);
                        i = 1464182022;
                        i12 = m6981 ^ i;
                        c164752 = c16475;
                    case 1684249963:
                    case 2136881170:
                        if (C1504.f5354) {
                            m6981 = C2105.m6981("۬֫") ^ i10;
                            i11 = ((m6981 ^ i9) * (-7271)) ^ 1772254906;
                            i = 1191943202;
                            i12 = m6981 ^ i;
                            c164752 = c16475;
                        } else {
                            int m256642222 = (i10 - C0630.m2566("ۛۘ")) * 99;
                            i12 = m256642222 ^ 539530376;
                            i11 = ((m256642222 ^ i9) * 8507) ^ (-1978903884);
                            c21282 = null;
                        }
                    default:
                        C2272.m7503();
                        C1128.m3851();
                        break;
                }
                return;
            }
            sArr3 = sArr;
            i12 = m25662 ^ i5;
            i11 = i4;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:42:0x0039, code lost:
    
        if (l.C7811.f24123 < 0) goto L44;
     */
    /* JADX WARN: Code restructure failed: missing block: B:45:0x0041, code lost:
    
        if (l.C0483.m2121() == false) goto L44;
     */
    @Override // l.AbstractC14346, l.ComponentCallbacksC9205
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onCreate(android.os.Bundle r15) {
        /*
            Method dump skipped, instructions count: 568
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.onCreate(android.os.Bundle):void");
    }

    @Override // l.AbstractC14346, l.ComponentCallbacksC9205
    public final void onSaveInstanceState(Bundle bundle) {
        InterfaceC18581 interfaceC18581 = null;
        int i = 2052675248;
        int i2 = C4616.f14690;
        int i3 = C3746.f11829;
        int m2566 = C0630.m2566("ۘ᩷") ^ i3;
        int i4 = ((m2566 ^ i2) * 10515) ^ (-1226446582);
        int i5 = -2109095806;
        while (true) {
            i = ((((i ^ i2) * (-13093)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1917452126:
                case 566898917:
                    break;
                case -1761873310:
                case 1634785537:
                    C10832 c10832 = (C10832) interfaceC18581;
                    c10832.mo9498();
                    c10832.mo9497();
                    m2566 = (i2 - C0630.m2566("ۛܳ")) * 15;
                    i4 = ((m2566 ^ i3) * 6577) ^ 1524803274;
                    i5 = -918344230;
                case -1727063746:
                case 994821326:
                    if (C4616.f14690 <= 0) {
                        m2566 = C0630.m2566("᩵ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32631) ^ 445120315;
                        i5 = 1759381837;
                    } else {
                        m2566 = (i2 - C0630.m2566("ܰۖ")) * (-29);
                        i4 = ((m2566 ^ i3) * (-17071)) ^ (-294613898);
                        i5 = -1611319440;
                    }
                case -1615143651:
                case -144054081:
                    if (RunnableC1108.f4040) {
                        m2566 = C2105.m6981("᩸ۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-12517)) ^ (-692763978);
                        i5 = 909594639;
                    } else {
                        m2566 = (i3 - C2105.m6981("۫۬")) * (-51);
                        i4 = ((m2566 ^ i2) * (-23573)) ^ (-567462822);
                        i5 = -18419867;
                    }
                case -1224483485:
                case 1507384535:
                    if (C3432.f10845 >= 0) {
                        m2566 = (i3 - C2105.m6981("ۜ۟")) * 59;
                        i4 = ((m2566 ^ i2) * (-1989)) ^ 81289336;
                        i5 = -1621003318;
                    } else {
                        m2566 = (C0630.m2566("᩹ۖ") + i2) * (-15);
                        i4 = ((m2566 ^ i3) * (-11461)) ^ 1827705001;
                        i5 = -300757102;
                    }
                case -1128158474:
                case 746604124:
                    C1294.m4372();
                    ViewOnClickListenerC1958.m6429();
                    m2566 = C0630.m2566("ܺܶ") ^ i2;
                    i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                    i5 = -579637611;
                case -1052205972:
                case 1149482804:
                    RunnableC0588.m2441();
                    if (C7811.m20844() == 0) {
                        m2566 = C0630.m2566("ܺܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                        i5 = -579637611;
                    } else {
                        m2566 = C0630.m2566("᩵ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32631) ^ 445120315;
                        i5 = 1759381837;
                    }
                case -809337865:
                case 2080668625:
                    if (C22628.f73083 <= 0) {
                        m2566 = C0630.m2566("ܺܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                        i5 = -579637611;
                    } else {
                        m2566 = C0630.m2566("۠᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * 17031) ^ (-761658262);
                        i5 = -403460809;
                    }
                case -568636396:
                case 277853606:
                    super.onSaveInstanceState(bundle);
                    interfaceC18581 = mo17431();
                    if (interfaceC18581 != null) {
                        m2566 = (i3 - C0630.m2566("ۡۗ")) * (-51);
                        i4 = ((m2566 ^ i2) * (-17743)) ^ (-768878736);
                        i5 = -476935230;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۛܳ")) * 15;
                        i4 = ((m2566 ^ i3) * 6577) ^ 1524803274;
                        i5 = -918344230;
                    }
                case -556715972:
                case -460298504:
                    if (RunnableC0588.m2441() >= 0) {
                        m2566 = (i3 - C2105.m6981("ۜ۟")) * 59;
                        i4 = ((m2566 ^ i2) * (-1989)) ^ 81289336;
                        i5 = -1621003318;
                    } else {
                        m2566 = C0630.m2566("ܺۡ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-6325)) ^ 710087988;
                        i5 = 1465119425;
                    }
                case -101416826:
                case 1808622079:
                    if (C1128.m3851() <= 0) {
                        m2566 = (i3 - C2105.m6981("۫۬")) * (-51);
                        i4 = ((m2566 ^ i2) * (-23573)) ^ (-567462822);
                        i5 = -18419867;
                    } else {
                        m2566 = (i3 - C2105.m6981("ܿۖ")) * 101;
                        i4 = ((m2566 ^ i2) * 8227) ^ (-51866352);
                        i5 = 216313211;
                    }
                case -70756503:
                case -3890128:
                    C1420.m4913();
                    break;
                case 52756350:
                case 262617683:
                    if (C1711.m5736() <= 0) {
                        m2566 = C0630.m2566("᩵ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32631) ^ 445120315;
                        i5 = 1759381837;
                    } else {
                        m2566 = C2105.m6981("۟ܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 15) ^ 1476115090;
                        i5 = -1624435677;
                    }
                case 173721352:
                case 1665918117:
                    if (RunnableC1108.f4040) {
                        m2566 = C0630.m2566("ܳᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * 16283) ^ (-1756390025);
                        i5 = -1078706594;
                    } else {
                        m2566 = C0630.m2566("᩵ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32631) ^ 445120315;
                        i5 = 1759381837;
                    }
                case 235174571:
                case 1993265978:
                    C3746.m11369();
                    if (RunnableC0588.m2441() >= 0) {
                        m2566 = C0630.m2566("ܺܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                        i5 = -579637611;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۜ۟")) * 59;
                        i4 = ((m2566 ^ i2) * (-1989)) ^ 81289336;
                        i5 = -1621003318;
                    }
                case 786999354:
                case 1483914559:
                    if (C2958.f9394 >= 0) {
                        m2566 = C0630.m2566("᩵ۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32631) ^ 445120315;
                        i5 = 1759381837;
                    } else {
                        m2566 = C0630.m2566("᩺ۙ") ^ i3;
                        i4 = ((m2566 ^ i2) * 1205) ^ 1658298159;
                        i5 = 1820374130;
                    }
                case 1685047556:
                case 1911081702:
                    if (AbstractC2021.f6743 <= 0) {
                        m2566 = C0630.m2566("ܺܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                        i5 = -579637611;
                    } else {
                        m2566 = C2105.m6981("᩸ۧ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-9903)) ^ (-1822781474);
                        i5 = 1057140573;
                    }
                default:
                    if (C1047.f3863 >= 0) {
                        m2566 = C0630.m2566("ܺܶ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-11279)) ^ 1254613200;
                        i5 = -579637611;
                    } else {
                        m2566 = C2105.m6981("ᩴ۫") ^ i3;
                        i4 = ((m2566 ^ i2) * 7371) ^ (-893315197);
                        i5 = 1051250477;
                    }
            }
            return;
        }
    }

    @Override // l.ComponentCallbacksC9205
    public final View onCreateView(LayoutInflater layoutInflater, ViewGroup viewGroup, Bundle bundle) {
        int m6981;
        int i;
        int i2;
        View m40367;
        short s;
        int m69812;
        int i3;
        int m69813;
        int i4;
        short s2;
        int i5;
        final C16475 c16475 = this;
        int i6 = C3537.f11231;
        int i7 = C5695.f17556;
        int m2566 = (i6 - C0630.m2566("ۖᩴ")) * (-49);
        int i8 = ((m2566 ^ i7) * (-8115)) ^ 1559758390;
        View view = null;
        short[] sArr = null;
        int i9 = m2566 ^ 85298813;
        int i10 = 0;
        final AtomicBoolean atomicBoolean = null;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 882797369;
        short s3 = 0;
        int i15 = 0;
        InterfaceC23586 interfaceC23586 = null;
        RunnableC14240 runnableC14240 = null;
        C5242 c5242 = null;
        ActivityC17169 activityC17169 = null;
        long j = 0;
        while (true) {
            i14 = i9 ^ (i8 & (((i14 ^ i7) * 19181) >> 31));
            switch (i14) {
                case -1959728419:
                case -700497463:
                    runnableC14240 = new RunnableC14240(2, c16475);
                    j = 600;
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        s = s3;
                        int m25662 = (i7 - C0630.m2566("ܿۤ")) * 73;
                        i8 = ((m25662 ^ i6) * 11699) ^ (-1346518131);
                        i5 = m25662 ^ (-736257941);
                        atomicBoolean = null;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    } else {
                        m6981 = C0630.m2566("᩹ܰ") ^ i7;
                        i = ((m6981 ^ i6) * (-22203)) ^ 2048533737;
                        i2 = 503670679;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    }
                case -1700439660:
                case 1703319381:
                    activityC17169 = (ActivityC17169) C3683.m11214(this);
                    sArr = f50637;
                    if (C3019.m9255() <= 0) {
                        m69813 = C2105.m6981("ۡۚ") ^ i6;
                        i8 = ((m69813 ^ i7) * 1893) ^ 572616574;
                        i4 = 1852263719;
                        i9 = m69813 ^ i4;
                        c16475 = this;
                    } else {
                        m6981 = (i7 - C2105.m6981("ۤܳ")) * (-63);
                        i = ((m6981 ^ i6) * (-27311)) ^ (-271268230);
                        i2 = -350093307;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    }
                case -1604849143:
                case 1300175806:
                    s3 = f50637[208];
                    if (RunnableC1937.m6387() == 0) {
                        m69813 = (C2105.m6981("ᩳܺ") + i6) * (-101);
                        i8 = ((m69813 ^ i7) * (-28283)) ^ (-2005017927);
                        i4 = 1512096553;
                        i9 = m69813 ^ i4;
                        c16475 = this;
                    }
                    m69813 = C2105.m6981("ۡۚ") ^ i6;
                    i8 = ((m69813 ^ i7) * 1893) ^ 572616574;
                    i4 = 1852263719;
                    i9 = m69813 ^ i4;
                    c16475 = this;
                case -1529503267:
                case -961800260:
                    i12 = 47574;
                    m6981 = C0630.m2566("ܺۛ") ^ i6;
                    i = ((m6981 ^ i7) * 6603) ^ 137256725;
                    i2 = 1260172095;
                    i9 = m6981 ^ i2;
                    i8 = i;
                case -1495157275:
                case 1204042681:
                    i12 = 53338;
                    m6981 = C0630.m2566("ܺۛ") ^ i6;
                    i = ((m6981 ^ i7) * 6603) ^ 137256725;
                    i2 = 1260172095;
                    i9 = m6981 ^ i2;
                    i8 = i;
                case -1455947049:
                case 446108482:
                    s2 = s3;
                    int i16 = s2 * 30928;
                    i11 = s2 * s2;
                    if (C2126.f7087) {
                        i15 = i16;
                        int m25663 = C0630.m2566("᩸ۜ") ^ i7;
                        i9 = m25663 ^ 428498702;
                        s3 = s2;
                        i8 = ((m25663 ^ i6) * 17701) ^ (-2114088866);
                        c16475 = this;
                    } else {
                        int m69814 = (i7 - C2105.m6981("۬֫")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        s = s2;
                        i8 = ((m69814 ^ i6) * (-17209)) ^ 1284625408;
                        i5 = m69814 ^ (-634110732);
                        i15 = i16;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                case -1428072100:
                case 1230425074:
                    if ((239135296 + i11) - i15 < 0) {
                        m6981 = C0630.m2566("᩸ۢ") ^ i7;
                        i = ((m6981 ^ i6) * 25595) ^ 256674033;
                        i2 = -1427103612;
                    } else {
                        m6981 = C2105.m6981("۬᩹") ^ i6;
                        i = ((m6981 ^ i7) * 30995) ^ 1735347793;
                        i2 = 1970035866;
                    }
                    i9 = m6981 ^ i2;
                    i8 = i;
                case -1292118754:
                case -188857283:
                    C2272.m7503();
                    C3911.m11924();
                    m6981 = C0630.m2566("ۙۢ") ^ i6;
                    i = ((m6981 ^ i7) * (-2525)) ^ (-1448197710);
                    i2 = -516866932;
                    i9 = m6981 ^ i2;
                    i8 = i;
                case -1090834304:
                case 630690758:
                    ServiceConnectionC3453.m10564();
                    if (C3432.f10845 >= 0) {
                        m6981 = C0630.m2566("ۙۢ") ^ i6;
                        i = ((m6981 ^ i7) * (-2525)) ^ (-1448197710);
                        i2 = -516866932;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    } else {
                        s = s3;
                        int m256622 = (i7 - C0630.m2566("ܿۤ")) * 73;
                        i8 = ((m256622 ^ i6) * 11699) ^ (-1346518131);
                        i5 = m256622 ^ (-736257941);
                        atomicBoolean = null;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                case -1075929740:
                case 1359691678:
                    C3245.m9925();
                    if (!C2126.f7087) {
                        s = s3;
                        m69812 = (C0630.m2566("᩸ᩳ") ^ i6) * 97;
                        i8 = ((m69812 ^ i7) * 21465) ^ (-113039088);
                        i3 = -915901039;
                        i5 = m69812 ^ i3;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                    s2 = s3;
                    int m256632 = C0630.m2566("᩸ۜ") ^ i7;
                    i9 = m256632 ^ 428498702;
                    s3 = s2;
                    i8 = ((m256632 ^ i6) * 17701) ^ (-2114088866);
                    c16475 = this;
                case -1049222600:
                case 1172990679:
                    s = s3;
                    if (C21923.f70183 == 0) {
                        m69812 = (C0630.m2566("ܶ᩻") + i6) * 57;
                        i8 = ((m69812 ^ i7) * 19183) ^ 1221734601;
                        i3 = -1606956599;
                        i5 = m69812 ^ i3;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                    m69812 = (C0630.m2566("᩸ᩳ") ^ i6) * 97;
                    i8 = ((m69812 ^ i7) * 21465) ^ (-113039088);
                    i3 = -915901039;
                    i5 = m69812 ^ i3;
                    s3 = s;
                    i9 = i5;
                    c16475 = this;
                case -673539188:
                case -214860777:
                    C1294.m4383(runnableC14240, j);
                    if (C4159.f13567) {
                        atomicBoolean = new AtomicBoolean(true);
                        c5242 = C7261.f22281;
                        interfaceC23586 = getViewLifecycleOwner();
                        if (ServiceConnectionC3453.f10921 >= 0) {
                            m69813 = C2105.m6981("ۡۚ") ^ i6;
                            i8 = ((m69813 ^ i7) * 1893) ^ 572616574;
                            i4 = 1852263719;
                            i9 = m69813 ^ i4;
                            c16475 = this;
                        } else {
                            m6981 = C0630.m2566("ܽܶ") ^ i6;
                            i = ((m6981 ^ i7) * 5765) ^ 651549849;
                            i2 = -1789275248;
                            i9 = m6981 ^ i2;
                            i8 = i;
                        }
                    } else {
                        s = s3;
                        int m2566222 = (i7 - C0630.m2566("ܿۤ")) * 73;
                        i8 = ((m2566222 ^ i6) * 11699) ^ (-1346518131);
                        i5 = m2566222 ^ (-736257941);
                        atomicBoolean = null;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                case -644286642:
                case 1155545155:
                    RunnableC1108.m3788(c5242, interfaceC23586, new InterfaceC1008() { // from class: l.᩹᩻ۢ
                        @Override // l.InterfaceC1008
                        /* renamed from: ֫ */
                        public final void mo1617(Object obj) {
                            C16475.m38790(C16475.this, atomicBoolean, (EnumC13610) obj);
                        }
                    });
                    return view;
                case -556282967:
                case 1496376824:
                    s = s3;
                    if (C4075.f12947 < 0) {
                        m69812 = C2105.m6981("۬֡") ^ i7;
                        i8 = ((m69812 ^ i6) * 10331) ^ 1489622743;
                        i3 = 742514266;
                        i5 = m69812 ^ i3;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                    m69812 = (C0630.m2566("᩸ᩳ") ^ i6) * 97;
                    i8 = ((m69812 ^ i7) * 21465) ^ (-113039088);
                    i3 = -915901039;
                    i5 = m69812 ^ i3;
                    s3 = s;
                    i9 = i5;
                    c16475 = this;
                case -378871081:
                case 308063838:
                    s = s3;
                    if (C0050.f910 < 0) {
                        m69812 = (i7 - C2105.m6981("᩷ۧ")) * 71;
                        i8 = ((m69812 ^ i6) * (-27605)) ^ 1521482462;
                        i3 = 1764980472;
                        i5 = m69812 ^ i3;
                        s3 = s;
                        i9 = i5;
                        c16475 = this;
                    }
                    int m25662222 = (i7 - C0630.m2566("ܿۤ")) * 73;
                    i8 = ((m25662222 ^ i6) * 11699) ^ (-1346518131);
                    i5 = m25662222 ^ (-736257941);
                    atomicBoolean = null;
                    s3 = s;
                    i9 = i5;
                    c16475 = this;
                case -202974114:
                case 709010661:
                    m40367 = activityC17169.m40367(C2105.m6981(ViewOnClickListenerC1958.m6435(sArr, i13, i10, i12)) ^ 2121830786);
                    if (m40367 == null) {
                        m6981 = C0630.m2566("ᩴۧ") ^ i7;
                        i = ((m6981 ^ i6) * 3889) ^ 1103801588;
                        i2 = -1174924801;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    }
                    view = m40367;
                    m6981 = (C2105.m6981("ᩳ᩵") + i6) * (-71);
                    i = ((m6981 ^ i7) * (-26863)) ^ (-1462819873);
                    i2 = 1609707665;
                    i9 = m6981 ^ i2;
                    i8 = i;
                case 298607228:
                case 1886104457:
                    C3019.m9255();
                    if (C1711.m5736() <= 0) {
                        m6981 = C0630.m2566("ۙۢ") ^ i6;
                        i = ((m6981 ^ i7) * (-2525)) ^ (-1448197710);
                        i2 = -516866932;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    } else {
                        s2 = s3;
                        int m2566322 = C0630.m2566("᩸ۜ") ^ i7;
                        i9 = m2566322 ^ 428498702;
                        s3 = s2;
                        i8 = ((m2566322 ^ i6) * 17701) ^ (-2114088866);
                        c16475 = this;
                    }
                case 684027457:
                case 814279663:
                    C1711.m5736();
                    return null;
                case 1313670037:
                case 1955029389:
                    i13 = 209;
                    i10 = 3;
                    if (C0798.f2919) {
                        s2 = s3;
                        int m25663222 = C0630.m2566("᩸ۜ") ^ i7;
                        i9 = m25663222 ^ 428498702;
                        s3 = s2;
                        i8 = ((m25663222 ^ i6) * 17701) ^ (-2114088866);
                        c16475 = this;
                    } else {
                        m6981 = C0630.m2566("۬ۤ") ^ i6;
                        i = ((m6981 ^ i7) * (-21735)) ^ (-1435799194);
                        i2 = 576654700;
                        i9 = m6981 ^ i2;
                        i8 = i;
                    }
                default:
                    m40367 = super.onCreateView(layoutInflater, viewGroup, bundle);
                    C3537.m10749(m40367);
                    view = m40367;
                    m6981 = (C2105.m6981("ᩳ᩵") + i6) * (-71);
                    i = ((m6981 ^ i7) * (-26863)) ^ (-1462819873);
                    i2 = 1609707665;
                    i9 = m6981 ^ i2;
                    i8 = i;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:6:0x00bb, code lost:
    
        if (l.C3537.f11231 < 0) goto L8;
     */
    @Override // l.ComponentCallbacksC9205
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onViewCreated(android.view.View r49, android.os.Bundle r50) {
        /*
            Method dump skipped, instructions count: 2176
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.onViewCreated(android.view.View, android.os.Bundle):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:34:0x0063, code lost:
    
        if (l.C3245.m9925() != 0) goto L14;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static /* synthetic */ void m38788(l.C16475 r17, java.lang.Exception r18, l.ActivityC17169 r19) {
        /*
            Method dump skipped, instructions count: 962
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38788(l.ܽۜۢ, java.lang.Exception, l.ܿۛ᩷):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static /* synthetic */ void m38785(C16475 c16475, int i, int i2) {
        C15893 c15893 = null;
        int i3 = 789082495;
        int i4 = RunnableC3474.f10992;
        int i5 = C3911.f12484;
        int m6981 = (C2105.m6981("᩶۟") ^ i5) * (-41);
        int i6 = ((m6981 ^ i4) * 1155) ^ 1869719278;
        int i7 = 110065916;
        while (true) {
            i3 = ((((i3 ^ i4) * (-12429)) >> 31) & i6) ^ (m6981 ^ i7);
            switch (i3) {
                case -2129739760:
                case -1245228026:
                    if (C2520.m8026()) {
                        m6981 = C0630.m2566("᩵ܰ") ^ i4;
                        i6 = ((m6981 ^ i5) * 29397) ^ (-434024060);
                        i7 = -1143351678;
                    } else {
                        m6981 = C2105.m6981("᩵ܶ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-9571)) ^ (-1851156516);
                        i7 = 558461201;
                    }
                case -1970530708:
                case 548083405:
                    if (C1504.m5179()) {
                        m6981 = C0630.m2566("ۢ᩹") ^ i5;
                        i6 = ((m6981 ^ i4) * (-16071)) ^ 738269093;
                        i7 = -811408501;
                    } else {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    }
                case -1728851539:
                case 9709976:
                    if (C2958.f9394 >= 0) {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    } else {
                        m6981 = (C2105.m6981("᩶֨") + i4) * (-7);
                        i6 = ((m6981 ^ i5) * (-5321)) ^ 1855799455;
                        i7 = 1926683754;
                    }
                case -1507706149:
                case -783321882:
                    if (C0422.m1963()) {
                        m6981 = (i4 - C2105.m6981("ۙۘ")) * 15;
                        i6 = ((m6981 ^ i5) * 5803) ^ (-157273858);
                        i7 = -127471739;
                    } else {
                        m6981 = C2105.m6981("۬ܽ") ^ i4;
                        i6 = ((m6981 ^ i5) * (-17079)) ^ 749378791;
                        i7 = -521875348;
                    }
                case -1342626103:
                case 1179571333:
                    break;
                case -1261062701:
                case 1169463219:
                    C1294.m4372();
                    C2167.m7155();
                    m6981 = C2105.m6981("᩺ܳ") ^ i5;
                    i6 = ((m6981 ^ i4) * (-12275)) ^ (-27749705);
                    i7 = 1952290442;
                case -1160520450:
                case -717700207:
                    if (C3432.f10845 >= 0) {
                        m6981 = C2105.m6981("᩵ܶ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-9571)) ^ (-1851156516);
                        i7 = 558461201;
                    } else {
                        m6981 = C2105.m6981("᩹ܶ") ^ i5;
                        i6 = ((m6981 ^ i4) * 28375) ^ (-1916491881);
                        i7 = -1133252736;
                    }
                case -945197979:
                case 1621173420:
                    C4159.m12565();
                    if (C7106.f21815 != 0) {
                        m6981 = C2105.m6981("᩺ܳ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-12275)) ^ (-27749705);
                        i7 = 1952290442;
                    } else {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    }
                case -822607431:
                case 1562408782:
                    if (C0422.m1963()) {
                        m6981 = (i5 - C0630.m2566("ۡ۬")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i6 = ((m6981 ^ i4) * (-5705)) ^ 871155436;
                        i7 = 1831216986;
                    } else {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    }
                case -654885108:
                case 1519645256:
                    if (C1294.f4556 >= 0) {
                        m6981 = C2105.m6981("᩵ܶ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-9571)) ^ (-1851156516);
                        i7 = 558461201;
                    } else {
                        m6981 = (C0630.m2566("ܺۜ") ^ i4) * 51;
                        i6 = ((m6981 ^ i5) * 21127) ^ 1222830377;
                        i7 = -1923559731;
                    }
                case -634380172:
                case 286626607:
                    if (C1773.f6144 > 0) {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    } else {
                        m6981 = C2105.m6981("᩵ܶ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-9571)) ^ (-1851156516);
                        i7 = 558461201;
                    }
                case -576022949:
                case 692136521:
                    if (C1420.f5096 <= 0) {
                        m6981 = C0630.m2566("᩵ܰ") ^ i4;
                        i6 = ((m6981 ^ i5) * 29397) ^ (-434024060);
                        i7 = -1143351678;
                    } else {
                        m6981 = C2105.m6981("ܽܿ") ^ i4;
                        i6 = ((m6981 ^ i5) * 29111) ^ 370628193;
                        i7 = 1019895105;
                    }
                case -19442239:
                case 218001008:
                    if (C2520.f8000 >= 0) {
                        m6981 = C2105.m6981("᩺ܳ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-12275)) ^ (-27749705);
                        i7 = 1952290442;
                    } else {
                        m6981 = (C2105.m6981("֫ܺ") + i5) * 115;
                        i6 = ((m6981 ^ i4) * 5059) ^ 377521630;
                        i7 = 1762868266;
                    }
                case 244387908:
                case 1154734551:
                    c15893 = c16475.f50651;
                    if (c15893 != null) {
                        m6981 = (i5 - C0630.m2566("᩻ܽ")) * 91;
                        i6 = ((m6981 ^ i4) * (-16159)) ^ 444153;
                        i7 = 835728878;
                    } else {
                        m6981 = (C0630.m2566("ܺ֡") + i4) * 57;
                        i6 = ((m6981 ^ i5) * (-17995)) ^ (-973823079);
                        i7 = -1959511759;
                    }
                case 322185941:
                case 365613507:
                    if (C1128.f4106 <= 0) {
                        m6981 = C2105.m6981("᩺ܳ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-12275)) ^ (-27749705);
                        i7 = 1952290442;
                    } else {
                        m6981 = (C0630.m2566("ۖܽ") + i4) * (-13);
                        i6 = ((m6981 ^ i5) * (-22213)) ^ 1967422492;
                        i7 = -768561491;
                    }
                case 541596815:
                case 998690106:
                    c15893.mo7980(i, i2, c16475);
                    m6981 = (C0630.m2566("ܺ֡") + i4) * 57;
                    i6 = ((m6981 ^ i5) * (-17995)) ^ (-973823079);
                    i7 = -1959511759;
                case 1314851661:
                case 1899506476:
                    if (C5695.m16023() >= 0) {
                        m6981 = (i4 - C0630.m2566("᩵᩶")) * 59;
                        i6 = ((m6981 ^ i5) * (-22931)) ^ (-1846933091);
                        i7 = 613413399;
                    } else {
                        m6981 = (C2105.m6981("ۧ᩸") ^ i5) * 67;
                        i6 = ((m6981 ^ i4) * 973) ^ (-1160397733);
                        i7 = 2123708153;
                    }
                default:
                    C0630.m2564();
                    break;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:44:0x0134, code lost:
    
        if (l.C3019.m9255() > 0) goto L22;
     */
    @Override // l.ComponentCallbacksC9205
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean onOptionsItemSelected(android.view.MenuItem r39) {
        /*
            Method dump skipped, instructions count: 2336
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.onOptionsItemSelected(android.view.MenuItem):boolean");
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x0076, code lost:
    
        r4 = (l.C0630.m2566("֡᩹") ^ r20) * 59;
        r14 = ((r4 ^ r21) * (-28225)) ^ (-1940322704);
        r23 = -1199795873;
     */
    /* JADX WARN: Code restructure failed: missing block: B:15:0x0072, code lost:
    
        if (l.C4263.m12819() < 0) goto L81;
     */
    /* JADX WARN: Code restructure failed: missing block: B:19:0x0090, code lost:
    
        if (l.C3537.f11231 >= 0) goto L45;
     */
    /* JADX WARN: Code restructure failed: missing block: B:9:0x006b, code lost:
    
        if (l.C11340.f33930 >= 0) goto L12;
     */
    @Override // l.InterfaceC20834
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo17422(int r26, int r27, java.lang.String r28) {
        /*
            Method dump skipped, instructions count: 1140
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.mo17422(int, int, java.lang.String):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static /* synthetic */ void m38794(C16475 c16475, C23155 c23155, MenuItem menuItem) {
        int i = -1420998186;
        int i2 = C5695.f17556;
        int i3 = C1047.f3863;
        int m6981 = (i2 - C2105.m6981("᩺ۗ")) * 69;
        int i4 = ((m6981 ^ i3) * (-151)) ^ 613032470;
        int i5 = -1122672444;
        while (true) {
            i = ((((i ^ i3) * 2803) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2016943755:
                case -1626988848:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    } else {
                        m6981 = C0630.m2566("ܶۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * 10655) ^ 873585272;
                        i5 = 603417517;
                    }
                case -1941158390:
                case -1273730275:
                    RunnableC0588.m2441();
                    C4117.m12364();
                    m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                    i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                    i5 = 1344556133;
                case -1798680820:
                case 705681781:
                    if (C3746.f11829 <= 0) {
                        m6981 = C2105.m6981("᩷ۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 11449) ^ (-1924945634);
                        i5 = -31033428;
                    } else {
                        m6981 = C2105.m6981("ۡۚ") ^ i3;
                        i4 = ((m6981 ^ i2) * 4659) ^ (-442193232);
                        i5 = -864621912;
                    }
                case -1698317298:
                case -893203368:
                    break;
                case -1530271895:
                case 2076266299:
                    if (C0382.f1805) {
                        m6981 = C0630.m2566("֫ᩴ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13723)) ^ (-1442878997);
                        i5 = -1543128221;
                    } else {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    }
                case -1323191499:
                case 1495535943:
                    ViewOnClickListenerC1958.m6429();
                    break;
                case -1265704752:
                case -1049790565:
                    if (C0422.f1886 <= 0) {
                        m6981 = C2105.m6981("᩷ۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 11449) ^ (-1924945634);
                        i5 = -31033428;
                    } else {
                        m6981 = C2105.m6981("ܿܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-22423)) ^ 2020749039;
                        i5 = -1231698683;
                    }
                case -1029931701:
                case 199826659:
                    if (C2105.f7037 != 0) {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    } else {
                        m6981 = (C2105.m6981("᩷֡") + i3) * 55;
                        i4 = ((m6981 ^ i2) * 30257) ^ (-387177131);
                        i5 = -781268312;
                    }
                case -1009302811:
                case 1228034333:
                    if (C5695.f17556 >= 0) {
                        m6981 = C2105.m6981("۬ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-11973)) ^ (-1935614462);
                        i5 = -944920639;
                    } else {
                        m6981 = (C0630.m2566("ۡᩴ") + i3) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m6981 ^ i2) * 20975) ^ 506502112;
                        i5 = -312332404;
                    }
                case -976456558:
                case -563884561:
                    if (C4117.f13076 <= 0) {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    } else {
                        m6981 = C2105.m6981("۫֡") ^ i2;
                        i4 = ((m6981 ^ i3) * 23419) ^ 221804609;
                        i5 = 2046669645;
                    }
                case -826233455:
                case 1828952354:
                    if (C11340.m28031()) {
                        m6981 = (C0630.m2566("᩵ۨ") + i2) * 93;
                        i4 = ((m6981 ^ i3) * 31337) ^ (-1161520856);
                        i5 = -1698835118;
                    } else {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    }
                case -268036501:
                case 932628237:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = C2105.m6981("᩷ۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 11449) ^ (-1924945634);
                        i5 = -31033428;
                    } else {
                        m6981 = C2105.m6981("ۧܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16017) ^ (-252696868);
                        i5 = 861155479;
                    }
                case 319974571:
                case 846012619:
                    if (C1128.m3851() <= 0) {
                        m6981 = C2105.m6981("֨᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-8553)) ^ (-119955057);
                        i5 = -2037264315;
                    } else {
                        m6981 = C2105.m6981("۬ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-11973)) ^ (-1935614462);
                        i5 = -944920639;
                    }
                case 636292746:
                case 714758904:
                    if (C0630.f2410 > 0) {
                        m6981 = (C2105.m6981("ܰ᩵") ^ i2) * (-55);
                        i4 = ((m6981 ^ i3) * 24567) ^ (-1864063185);
                        i5 = 1344556133;
                    } else {
                        m6981 = C2105.m6981("֨᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-8553)) ^ (-119955057);
                        i5 = -2037264315;
                    }
                case 1000360499:
                case 1407829734:
                    if (C1047.f3863 >= 0) {
                        m6981 = (C2105.m6981("᩷֡") + i3) * 55;
                        i4 = ((m6981 ^ i2) * 30257) ^ (-387177131);
                        i5 = -781268312;
                    } else {
                        m6981 = (C2105.m6981("᩹ۤ") + i3) * (-101);
                        i4 = ((m6981 ^ i2) * (-4497)) ^ (-1497357949);
                        i5 = 432642225;
                    }
                case 1005397943:
                case 1445412533:
                    if (c23155.m51333(menuItem)) {
                        m6981 = C0630.m2566("ۨܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * 21857) ^ 1540328634;
                        i5 = 1203377251;
                    } else {
                        m6981 = C0630.m2566("ܺۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-361)) ^ (-1338912676);
                        i5 = -1037002574;
                    }
                case 1091449816:
                case 1809447341:
                    if (C3537.m10746() <= 0) {
                        m6981 = (C2105.m6981("᩷֡") + i3) * 55;
                        i4 = ((m6981 ^ i2) * 30257) ^ (-387177131);
                        i5 = -781268312;
                    } else {
                        m6981 = C0630.m2566("֨֡") ^ i3;
                        i4 = ((m6981 ^ i2) * 28591) ^ (-1986963365);
                        i5 = 699487993;
                    }
                default:
                    c16475.f50653.m11383(c16475.m38819());
                    m6981 = C0630.m2566("ۨܺ") ^ i3;
                    i4 = ((m6981 ^ i2) * 21857) ^ 1540328634;
                    i5 = 1203377251;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:49:0x0072, code lost:
    
        if (l.C0630.f2410 <= 0) goto L17;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final boolean m38821(java.util.List r23, boolean r24) {
        /*
            Method dump skipped, instructions count: 964
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38821(java.util.List, boolean):boolean");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m38793(C16475 c16475, C12366 c12366) {
        int i = 154566185;
        int i2 = RunnableC1937.f6483;
        int i3 = C3245.f10203;
        int m6981 = C2105.m6981("᩺ۗ") ^ i3;
        int i4 = ((m6981 ^ i2) * 3643) ^ (-178511406);
        int i5 = 2146318643;
        while (true) {
            i = ((((i ^ i2) * (-31895)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2136794202:
                case 854003635:
                    C22628.m50615();
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = C0630.m2566("ۢ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                        i5 = 596613858;
                    } else {
                        m6981 = C0630.m2566("᩸۬") ^ i3;
                        i4 = ((m6981 ^ i2) * 8937) ^ 937246295;
                        i5 = 1600099249;
                    }
                case -2038980187:
                case 77849844:
                    C0964.m3402(new C7800(c16475));
                    break;
                case -1811565546:
                case 182558553:
                    if (C0422.f1886 <= 0) {
                        m6981 = C0630.m2566("᩸۬") ^ i3;
                        i4 = ((m6981 ^ i2) * 8937) ^ 937246295;
                        i5 = 1600099249;
                    } else {
                        m6981 = C2105.m6981("ۚܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-19703)) ^ 1345936871;
                        i5 = 278826107;
                    }
                case -1583434514:
                case 1871638949:
                    if (C0964.m3413()) {
                        m6981 = C0630.m2566("۬֨") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25429)) ^ 1607424864;
                        i5 = 1839727037;
                    } else {
                        m6981 = C0630.m2566("ۢ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                        i5 = 596613858;
                    }
                case -1563459074:
                case -622621602:
                    if (C2167.f7158 >= 0) {
                        m6981 = (C2105.m6981("ܺۨ") + i2) * 99;
                        i4 = ((m6981 ^ i3) * 21635) ^ 1896444463;
                        i5 = 1637418001;
                    } else {
                        m6981 = C2105.m6981("ᩳۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * 19753) ^ 1968731152;
                        i5 = 1316614671;
                    }
                case -1543985655:
                case -640724241:
                    c16475.f50650 = c12366;
                    if (c16475.f50644) {
                        m6981 = (C0630.m2566("ۡۖ") ^ i3) * 91;
                        i4 = ((m6981 ^ i2) * 26011) ^ (-1334469994);
                        i5 = 1167195291;
                    } else {
                        m6981 = C0630.m2566("֡ۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4861)) ^ (-1375379640);
                        i5 = 660080610;
                    }
                case -1440803886:
                case 1196782759:
                    if (C1420.m4913()) {
                        m6981 = C0630.m2566("ۢ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                        i5 = 596613858;
                    } else {
                        m6981 = C0630.m2566("᩻֡") ^ i2;
                        i4 = ((m6981 ^ i3) * 18607) ^ 288932829;
                        i5 = 1138949391;
                    }
                case -1424771108:
                case 2099638445:
                    C3537.m10746();
                    m6981 = C0630.m2566("ۢ᩹") ^ i2;
                    i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                    i5 = 596613858;
                case -1421931448:
                case 1769251617:
                    if (C1504.m5179()) {
                        m6981 = C0630.m2566("ۧۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 733) ^ (-1897367243);
                        i5 = -26348965;
                    } else {
                        m6981 = (C2105.m6981("ܺۨ") + i2) * 99;
                        i4 = ((m6981 ^ i3) * 21635) ^ 1896444463;
                        i5 = 1637418001;
                    }
                case -1314381178:
                case -1229230680:
                    c16475.f50638 = true;
                    break;
                case -1301501409:
                case 701255438:
                    C0237.m1481();
                    break;
                case -1158153635:
                case 1682225221:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("᩸۬") ^ i3;
                        i4 = ((m6981 ^ i2) * 8937) ^ 937246295;
                        i5 = 1600099249;
                    } else {
                        m6981 = C0630.m2566("ۗܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * 17757) ^ (-1580323838);
                        i5 = 858555804;
                    }
                case -1136444509:
                case 1339131369:
                    if (C3683.m11222()) {
                        m6981 = C2105.m6981("ۚܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-19703)) ^ 1345936871;
                        i5 = 278826107;
                    } else {
                        m6981 = (C2105.m6981("ۚۤ") + i2) * 87;
                        i4 = ((m6981 ^ i3) * 28477) ^ 1442682586;
                        i5 = 1093525933;
                    }
                case -711541567:
                case 739035119:
                    if (C4263.f13799 <= 0) {
                        m6981 = C0630.m2566("᩸۬") ^ i3;
                        i4 = ((m6981 ^ i2) * 8937) ^ 937246295;
                        i5 = 1600099249;
                    } else {
                        m6981 = (C2105.m6981("᩸ۖ") + i3) * (-9);
                        i4 = ((m6981 ^ i2) * 20943) ^ (-1053246728);
                        i5 = 1936274519;
                    }
                case -563498322:
                case 845950791:
                    ViewOnClickListenerC1958.m6429();
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ۚܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-19703)) ^ 1345936871;
                        i5 = 278826107;
                    } else {
                        m6981 = (C2105.m6981("ܺۨ") + i2) * 99;
                        i4 = ((m6981 ^ i3) * 21635) ^ 1896444463;
                        i5 = 1637418001;
                    }
                case 418979885:
                case 1812172968:
                    if (C0422.f1886 <= 0) {
                        m6981 = (C0630.m2566("ۗۖ") ^ i3) * 81;
                        i4 = ((m6981 ^ i2) * 21827) ^ (-836219058);
                        i5 = -635538272;
                    } else {
                        m6981 = C0630.m2566("ܶ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-145)) ^ 1069095743;
                        i5 = 840671062;
                    }
                case 1570003654:
                case 1678426737:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("ۢ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                        i5 = 596613858;
                    } else {
                        m6981 = (C2105.m6981("ܳᩳ") ^ i3) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m6981 ^ i2) * 2755) ^ 464103379;
                        i5 = 1894063599;
                    }
                default:
                    if (C1916.f6442) {
                        m6981 = C0630.m2566("ܿۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * 15663) ^ 2916576;
                        i5 = -1991855195;
                    } else {
                        m6981 = C0630.m2566("ۢ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4001)) ^ 1684249178;
                        i5 = 596613858;
                    }
            }
            return;
        }
    }

    @Override // l.InterfaceC0440
    /* renamed from: ֫ */
    public final boolean mo1996() {
        C15545 c15545 = null;
        int i = 652310495;
        int i2 = C1420.f5096;
        int i3 = C3683.f11629;
        int m6981 = (C2105.m6981("ܳۘ") ^ i2) * (-103);
        int i4 = ((m6981 ^ i3) * 10927) ^ 191359271;
        int i5 = -379924353;
        while (true) {
            i = ((((i ^ i3) * (-24809)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2109188058:
                case -392237708:
                    if (C1005.f3721) {
                        m6981 = C0630.m2566("ܰۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 22699) ^ (-411102138);
                        i5 = 274188318;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩷ۧ")) * 97;
                        i4 = ((m6981 ^ i3) * 15609) ^ (-2101157992);
                        i5 = 1333078914;
                    }
                case -2055763753:
                case -451657337:
                    if (C2167.f7158 < 0) {
                        m6981 = (C0630.m2566("᩺ۢ") + i3) * 61;
                        i4 = ((m6981 ^ i2) * (-28045)) ^ 378337813;
                        i5 = -856305307;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩷ۧ")) * 97;
                        i4 = ((m6981 ^ i3) * 15609) ^ (-2101157992);
                        i5 = 1333078914;
                    }
                case -2026505441:
                case 1230911236:
                    if (C0483.f2088 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩶ܰ")) * (-117);
                        i4 = ((m6981 ^ i3) * 9007) ^ (-85751347);
                        i5 = -2135663415;
                    } else {
                        m6981 = C0630.m2566("ۜܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 22601) ^ 1595701326;
                        i5 = 434096529;
                    }
                case -1981039132:
                case 897875870:
                    C3911.m11924();
                    m6981 = (C2105.m6981("ۗܰ") + i2) * (-37);
                    i4 = ((m6981 ^ i3) * 25593) ^ 1847065113;
                    i5 = -904642709;
                case -1903307169:
                case -906331187:
                    if (C2272.f7362) {
                        m6981 = (C0630.m2566("ۖܰ") + i3) * (-113);
                        i4 = ((m6981 ^ i2) * (-22907)) ^ (-507644498);
                        i5 = 2032490051;
                    } else {
                        m6981 = C2105.m6981("ܶ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * 18601) ^ 573055260;
                        i5 = 16545140;
                    }
                case -1881941218:
                case 1950009562:
                    this.f50646.m36693();
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = (C2105.m6981("ۗܰ") + i2) * (-37);
                        i4 = ((m6981 ^ i3) * 25593) ^ 1847065113;
                        i5 = -904642709;
                    } else {
                        m6981 = C2105.m6981("᩸ۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14885)) ^ (-1725754200);
                        i5 = -150343784;
                    }
                case -1870747363:
                case 1127630986:
                    if (RunnableC1108.f4040) {
                        m6981 = (i3 - C2105.m6981("ܽۡ")) * (-125);
                        i4 = ((m6981 ^ i2) * 21747) ^ (-2142479473);
                        i5 = 1924781583;
                    } else {
                        m6981 = (C0630.m2566("᩺ۢ") + i3) * 61;
                        i4 = ((m6981 ^ i2) * (-28045)) ^ 378337813;
                        i5 = -856305307;
                    }
                case -1868496198:
                case -991252900:
                    if (C2520.f8000 >= 0) {
                        m6981 = (C0630.m2566("᩺ۢ") + i3) * 61;
                        i4 = ((m6981 ^ i2) * (-28045)) ^ 378337813;
                        i5 = -856305307;
                    } else {
                        m6981 = (i3 - C0630.m2566("ܰۛ")) * (-121);
                        i4 = ((m6981 ^ i2) * (-31191)) ^ 107736312;
                        i5 = -489934191;
                    }
                case -1548394225:
                case -107304140:
                    C7811.m20844();
                    C3911.m11924();
                    return false;
                case -1262481581:
                case -472808839:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = (i2 - C2105.m6981("᩶ܰ")) * (-117);
                        i4 = ((m6981 ^ i3) * 9007) ^ (-85751347);
                        i5 = -2135663415;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۖᩴ")) * 59;
                        i4 = ((m6981 ^ i3) * 21675) ^ (-201938898);
                        i5 = 414994541;
                    }
                case -506031546:
                case 1521890879:
                    if (C2958.f9394 < 0) {
                        m6981 = (C2105.m6981("ۗܰ") + i2) * (-37);
                        i4 = ((m6981 ^ i3) * 25593) ^ 1847065113;
                        i5 = -904642709;
                    } else {
                        m6981 = (C0630.m2566("᩺ۢ") + i3) * 61;
                        i4 = ((m6981 ^ i2) * (-28045)) ^ 378337813;
                        i5 = -856305307;
                    }
                case -312945752:
                case 1308301747:
                    if (C0964.f3626 != 0) {
                        m6981 = (i2 - C2105.m6981("᩶ܰ")) * (-117);
                        i4 = ((m6981 ^ i3) * 9007) ^ (-85751347);
                        i5 = -2135663415;
                    } else {
                        m6981 = (C2105.m6981("۠ۡ") + i2) * (-25);
                        i4 = ((m6981 ^ i3) * (-25551)) ^ 873555416;
                        i5 = -239464247;
                    }
                case -158687499:
                case 1989671338:
                    if (C0630.f2410 <= 0) {
                        m6981 = (C2105.m6981("ۗܰ") + i2) * (-37);
                        i4 = ((m6981 ^ i3) * 25593) ^ 1847065113;
                        i5 = -904642709;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩶ܰ")) * (-117);
                        i4 = ((m6981 ^ i3) * 9007) ^ (-85751347);
                        i5 = -2135663415;
                    }
                case 40083640:
                case 1702910256:
                    if (c15545.m36691()) {
                        m6981 = C2105.m6981("ۨܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18149) ^ (-958059017);
                        i5 = -2135042951;
                    } else {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * (-17669)) ^ 764157461;
                        i5 = -1181283433;
                    }
                case 369648566:
                case 1292898451:
                    return false;
                case 538483458:
                case 1960823606:
                    if (C2126.f7087) {
                        m6981 = (C0630.m2566("ۖܰ") + i3) * (-113);
                        i4 = ((m6981 ^ i2) * (-22907)) ^ (-507644498);
                        i5 = 2032490051;
                    } else {
                        m6981 = C0630.m2566("ۧ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * 29495) ^ 389445277;
                        i5 = -856195198;
                    }
                case 946884123:
                case 1319577421:
                    return true;
                case 1358686934:
                case 2034428045:
                    c15545 = this.f50646;
                    if (c15545 != null) {
                        m6981 = C0630.m2566("ۖᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-32525)) ^ 1661945764;
                        i5 = 642411769;
                    } else {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * (-17669)) ^ 764157461;
                        i5 = -1181283433;
                    }
                default:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = (C2105.m6981("ۗܰ") + i2) * (-37);
                        i4 = ((m6981 ^ i3) * 25593) ^ 1847065113;
                        i5 = -904642709;
                    } else {
                        m6981 = C0630.m2566("ۢ᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * (-1437)) ^ 1537435511;
                        i5 = -2141657853;
                    }
            }
        }
    }

    @Override // l.AbstractC14346
    /* renamed from: ᩳ */
    public final InterfaceC18581 mo17431() {
        C12366 c12366 = null;
        C11005 c11005 = null;
        C12392 c12392 = null;
        C15545 c15545 = null;
        int i = -655707638;
        int i2 = C3432.f10845;
        int i3 = ViewOnClickListenerC1958.f6529;
        int m2566 = (C0630.m2566("ۡܳ") ^ i2) * 35;
        int i4 = ((m2566 ^ i3) * (-10649)) ^ (-1730317437);
        int i5 = 930339316;
        while (true) {
            i = ((((i ^ i3) * (-497)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2134656243:
                case 1858035228:
                    if (C0422.f1886 <= 0) {
                        m2566 = C0630.m2566("᩵᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-16921)) ^ 635713074;
                        i5 = 482544946;
                    } else {
                        m2566 = (C2105.m6981("֨ۛ") + i2) * 21;
                        i4 = ((m2566 ^ i3) * (-4979)) ^ (-1377383531);
                        i5 = 542322539;
                    }
                case -2036321755:
                case 2003232547:
                    if (RunnableC1937.f6483 < 0) {
                        m2566 = C0630.m2566("᩵᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-16921)) ^ 635713074;
                        i5 = 482544946;
                    } else {
                        m2566 = C2105.m6981("᩵ᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * 6253) ^ (-1218774131);
                        i5 = -816612381;
                    }
                case -1939128824:
                case -475160729:
                    if (C0798.f2919) {
                        m2566 = C2105.m6981("ۢۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13219)) ^ (-577414927);
                        i5 = -1824434610;
                    } else {
                        m2566 = (C2105.m6981("ܳۨ") + i2) * (-39);
                        i4 = ((m2566 ^ i3) * (-17055)) ^ 1262555987;
                        i5 = 125587881;
                    }
                case -1705620584:
                case 806156980:
                    if (C1773.f6144 <= 0) {
                        m2566 = C0630.m2566("᩵᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-16921)) ^ 635713074;
                        i5 = 482544946;
                    } else {
                        m2566 = C0630.m2566("ۛܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * 14609) ^ (-463433071);
                        i5 = 386814069;
                    }
                case -1575300891:
                case 2108218467:
                    if (C3663.f11553) {
                        m2566 = C2105.m6981("ۢܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-2821)) ^ (-1866735734);
                        i5 = -1246973296;
                    } else {
                        m2566 = C2105.m6981("ۨۜ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-14781)) ^ 2110812011;
                        i5 = 42136399;
                    }
                case -1521888848:
                case 1075015438:
                    if (C2167.m7155()) {
                        m2566 = C2105.m6981("ۢۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13219)) ^ (-577414927);
                        i5 = -1824434610;
                    } else {
                        m2566 = (C2105.m6981("֨֨") ^ i3) * 23;
                        i4 = ((m2566 ^ i2) * 9751) ^ (-1437181936);
                        i5 = 55424505;
                    }
                case -1419321703:
                case 12072233:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C0630.m2566("᩵᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-16921)) ^ 635713074;
                        i5 = 482544946;
                    } else {
                        m2566 = (C0630.m2566("᩸᩺") ^ i3) * 15;
                        i4 = ((m2566 ^ i2) * (-12467)) ^ 203576913;
                        i5 = -1702154440;
                    }
                case -1414298854:
                case 1899191998:
                    c11005 = m34233(c12366.m36268());
                    if (C22628.m50615() != 0) {
                        m2566 = (C0630.m2566("᩸᩺") ^ i3) * 15;
                        i4 = ((m2566 ^ i2) * (-12467)) ^ 203576913;
                        i5 = -1702154440;
                    } else {
                        m2566 = C0630.m2566("۬ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * 27121) ^ 1056835892;
                        i5 = 1600677062;
                    }
                case -1224159613:
                case 387495851:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (C0630.m2566("᩸᩺") ^ i3) * 15;
                        i4 = ((m2566 ^ i2) * (-12467)) ^ 203576913;
                        i5 = -1702154440;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۢۗ")) * (-101);
                        i4 = ((m2566 ^ i2) * 19561) ^ (-936511579);
                        i5 = -245834716;
                    }
                case -1192157959:
                case 1059048210:
                    if (C0483.f2088 >= 0) {
                        m2566 = C2105.m6981("ۢܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-2821)) ^ (-1866735734);
                        i5 = -1246973296;
                    } else {
                        m2566 = (i2 - C2105.m6981("ܿۗ")) * 27;
                        i4 = ((m2566 ^ i3) * 24399) ^ (-1308789595);
                        i5 = 687982884;
                    }
                case -805190711:
                case -85376228:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = C2105.m6981("᩵ᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * 6253) ^ (-1218774131);
                        i5 = -816612381;
                    } else {
                        m2566 = C0630.m2566("֫ۗ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17255)) ^ 1248826867;
                        i5 = 1127982352;
                    }
                case -749375078:
                case -646463986:
                    if (this.f50647) {
                        m2566 = (i2 - C0630.m2566("ۖۧ")) * (-115);
                        i4 = ((m2566 ^ i3) * 32257) ^ (-2072859068);
                        i5 = -824875056;
                    } else {
                        m2566 = (C0630.m2566("۟֫") + i2) * (-105);
                        i4 = ((m2566 ^ i3) * (-30755)) ^ (-1651072526);
                        i5 = 1257615849;
                    }
                case -569780829:
                case 1726496571:
                    return null;
                case -360914301:
                case 1988805861:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = C2105.m6981("᩵ᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * 6253) ^ (-1218774131);
                        i5 = -816612381;
                    } else {
                        m2566 = C0630.m2566("ܺ۫") ^ i3;
                        i4 = ((m2566 ^ i2) * (-24467)) ^ (-538544920);
                        i5 = 338701768;
                    }
                case -256287259:
                case 1371704312:
                    if (this.f50644) {
                        m2566 = C0630.m2566("᩻ۙ") ^ i3;
                        i4 = ((m2566 ^ i2) * 21339) ^ (-217922145);
                        i5 = 622051639;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۖۧ")) * (-115);
                        i4 = ((m2566 ^ i3) * 32257) ^ (-2072859068);
                        i5 = -824875056;
                    }
                case -165123448:
                case 1631065940:
                    return new C10832(this, c12392, c15545, c11005);
                case -155363142:
                case 69472918:
                    c12366 = this.f50650;
                    if (c12366 != null) {
                        m2566 = (i3 - C2105.m6981("ܽܺ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m2566 ^ i2) * (-2933)) ^ (-1897584238);
                        i5 = -268415392;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۖۧ")) * (-115);
                        i4 = ((m2566 ^ i3) * 32257) ^ (-2072859068);
                        i5 = -824875056;
                    }
                case 17785156:
                case 1222895520:
                    C3432.m10477();
                    m2566 = C2105.m6981("ۢۨ") ^ i2;
                    i4 = ((m2566 ^ i3) * (-13219)) ^ (-577414927);
                    i5 = -1824434610;
                case 420283993:
                case 2051305044:
                    C0714.m2805();
                    if (C4159.f13567) {
                        m2566 = C2105.m6981("ۢۨ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13219)) ^ (-577414927);
                        i5 = -1824434610;
                    } else {
                        m2566 = C0630.m2566("᩵᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-16921)) ^ 635713074;
                        i5 = 482544946;
                    }
                case 643158304:
                case 1712933508:
                    C1504.m5179();
                    return null;
                case 1231749138:
                case 1262118608:
                    throw new RuntimeException();
                case 1453427596:
                case 1480248422:
                    c12392 = this.f50649;
                    c15545 = this.f50646;
                    if (c12392 != null) {
                        m2566 = (i3 - C0630.m2566("ۡ۬")) * (-91);
                        i4 = ((m2566 ^ i2) * 2119) ^ 122928764;
                        i5 = -1759807022;
                    } else {
                        m2566 = C0630.m2566("۠ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-21249)) ^ 1007164281;
                        i5 = -30482014;
                    }
                default:
                    if (c15545 != null) {
                        m2566 = C2105.m6981("᩹᩹") ^ i3;
                        i4 = ((m2566 ^ i2) * (-14817)) ^ (-1033671555);
                        i5 = 890829891;
                    } else {
                        m2566 = C0630.m2566("۠ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-21249)) ^ 1007164281;
                        i5 = -30482014;
                    }
            }
        }
    }

    @Override // l.ComponentCallbacksC9205
    public final void onCreateOptionsMenu(Menu menu, MenuInflater menuInflater) {
        InterfaceMenuC23000 interfaceMenuC23000;
        short s;
        int m6981;
        int i;
        int i2;
        int m2566;
        int i3;
        int m69812;
        int i4;
        int m25662;
        int i5;
        int i6;
        Menu menu2 = menu;
        int i7 = C2520.f8000;
        int i8 = C3911.f12484;
        int m69813 = C2105.m6981("᩺ۚ") ^ i7;
        int i9 = ((m69813 ^ i8) * 20553) ^ 289838864;
        String str = null;
        short[] sArr = null;
        short[] sArr2 = null;
        short[] sArr3 = null;
        int i10 = m69813 ^ (-403689772);
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 0;
        int i15 = 0;
        int i16 = 0;
        int i17 = 0;
        int i18 = 0;
        int i19 = 0;
        int i20 = 790249932;
        short s2 = 0;
        C15545 c15545 = null;
        InterfaceMenuC23000 interfaceMenuC230002 = null;
        while (true) {
            i20 = i10 ^ (i9 & (((i20 ^ i8) * 10315) >> 31));
            switch (i20) {
                case -2046870879:
                case -1075787043:
                    sArr2 = f50637;
                    i17 = 202;
                    i18 = 3;
                    if (C1005.f3721) {
                        m2566 = C0630.m2566("ۨۜ") ^ i8;
                        i9 = ((m2566 ^ i7) * o.a.g) ^ (-229155079);
                        i3 = 764858112;
                        i10 = m2566 ^ i3;
                        menu2 = menu;
                    } else {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        s = s2;
                        m6981 = C2105.m6981("֫ۚ") ^ i8;
                        i = ((m6981 ^ i7) * 9631) ^ (-1983271641);
                        i2 = 2070091451;
                        int i21 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC230003 = interfaceMenuC23000;
                        i10 = i21;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC230003;
                    }
                case -1926870336:
                case -660632334:
                    if (C0798.f2919) {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        s = s2;
                        m6981 = (i7 - C2105.m6981("ܳۜ")) * (-31);
                        i = ((m6981 ^ i8) * (-7137)) ^ (-2094005256);
                        i2 = 1322104229;
                        int i212 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC2300032 = interfaceMenuC23000;
                        i10 = i212;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC2300032;
                    } else {
                        m25662 = C0630.m2566("ᩴۢ") ^ i8;
                        i5 = ((m25662 ^ i7) * (-1639)) ^ 877510120;
                        i6 = -1111440891;
                        i10 = m25662 ^ i6;
                        i9 = i5;
                    }
                case -1847658195:
                case -1343896783:
                    interfaceMenuC23000 = interfaceMenuC230002;
                    s = s2;
                    sArr = f50637;
                    if (C1711.f5919) {
                        s2 = s;
                        m69812 = (i7 - C2105.m6981("ۧۘ")) * 119;
                        i9 = ((m69812 ^ i8) * 17925) ^ (-622085758);
                        i4 = 833484055;
                        int i22 = m69812 ^ i4;
                        interfaceMenuC230002 = interfaceMenuC23000;
                        i10 = i22;
                        menu2 = menu;
                    } else {
                        m6981 = (C2105.m6981("ۤۡ") ^ i8) * (-69);
                        i = ((m6981 ^ i7) * 18733) ^ (-1576545164);
                        i2 = -1407367705;
                        int i2122 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC23000322 = interfaceMenuC23000;
                        i10 = i2122;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC23000322;
                    }
                case -1775512301:
                case 318825396:
                    i13 = C0630.m2566(C3245.m9934(sArr3, i14, i15, i16));
                    if (C3432.f10845 < 0) {
                        m25662 = (C0630.m2566("ᩴ᩵") + i8) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i5 = ((m25662 ^ i7) * 30983) ^ (-1943174674);
                        i6 = -912350376;
                        i10 = m25662 ^ i6;
                        i9 = i5;
                    }
                    m25662 = C0630.m2566("ᩴۢ") ^ i8;
                    i5 = ((m25662 ^ i7) * (-1639)) ^ 877510120;
                    i6 = -1111440891;
                    i10 = m25662 ^ i6;
                    i9 = i5;
                case -1685523452:
                case 1219230368:
                    interfaceMenuC23000 = interfaceMenuC230002;
                    s = s2;
                    i19 = (s * s) + 198669025;
                    if (RunnableC3474.f10992 > 0) {
                        m6981 = (i7 - C0630.m2566("ۛۧ")) * 115;
                        i = ((m6981 ^ i8) * (-30153)) ^ (-216772643);
                        i2 = 2125313438;
                        int i21222 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC230003222 = interfaceMenuC23000;
                        i10 = i21222;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC230003222;
                    }
                    m6981 = C2105.m6981("֫ۚ") ^ i8;
                    i = ((m6981 ^ i7) * 9631) ^ (-1983271641);
                    i2 = 2070091451;
                    int i212222 = m6981 ^ i2;
                    s2 = s;
                    menu2 = menu;
                    InterfaceMenuC23000 interfaceMenuC2300032222 = interfaceMenuC23000;
                    i10 = i212222;
                    i9 = i;
                    interfaceMenuC230002 = interfaceMenuC2300032222;
                case -1652521439:
                case 996984564:
                    if (C4616.f14690 <= 0) {
                        m25662 = C0630.m2566("ᩴۢ") ^ i8;
                        i5 = ((m25662 ^ i7) * (-1639)) ^ 877510120;
                        i6 = -1111440891;
                        i10 = m25662 ^ i6;
                        i9 = i5;
                    } else {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        m69812 = (i7 - C2105.m6981("ۧۘ")) * 119;
                        i9 = ((m69812 ^ i8) * 17925) ^ (-622085758);
                        i4 = 833484055;
                        int i222 = m69812 ^ i4;
                        interfaceMenuC230002 = interfaceMenuC23000;
                        i10 = i222;
                        menu2 = menu;
                    }
                case -1372781170:
                case 2098950878:
                    c15545.m36675(C7106.m19118(interfaceMenuC230002, 2117414805 ^ i13));
                    break;
                case -1342405328:
                case -237308105:
                    i16 = 41165;
                    m2566 = C2105.m6981("ۗۙ") ^ i7;
                    i9 = ((m2566 ^ i8) * 9009) ^ (-1664308145);
                    i3 = 876927083;
                    i10 = m2566 ^ i3;
                    menu2 = menu;
                case -1325882716:
                case -278312102:
                    i11 = C2105.m6981(str);
                    i12 = 2124570427;
                    if (RunnableC1937.f6483 >= 0) {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        s = s2;
                        m6981 = C2105.m6981("֫ۚ") ^ i8;
                        i = ((m6981 ^ i7) * 9631) ^ (-1983271641);
                        i2 = 2070091451;
                        int i2122222 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC23000322222 = interfaceMenuC23000;
                        i10 = i2122222;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC23000322222;
                    } else {
                        m2566 = (C2105.m6981("۫֨") + i7) * 57;
                        i9 = ((m2566 ^ i8) * (-19065)) ^ (-156794130);
                        i3 = -853684091;
                        i10 = m2566 ^ i3;
                        menu2 = menu;
                    }
                case -1005659738:
                case 411412432:
                    s = s2;
                    if ((s * 28190) - i19 <= 0) {
                        m6981 = (C2105.m6981("ۗ۫") ^ i7) * 13;
                        interfaceMenuC23000 = interfaceMenuC230002;
                        i = ((m6981 ^ i8) * 5189) ^ (-982469280);
                        i2 = 643958058;
                    } else {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        m6981 = C0630.m2566("ᩴۚ") ^ i8;
                        i = ((m6981 ^ i7) * (-10205)) ^ 1896384722;
                        i2 = 1226611139;
                    }
                    int i21222222 = m6981 ^ i2;
                    s2 = s;
                    menu2 = menu;
                    InterfaceMenuC23000 interfaceMenuC230003222222 = interfaceMenuC23000;
                    i10 = i21222222;
                    i9 = i;
                    interfaceMenuC230002 = interfaceMenuC230003222222;
                case -881510943:
                case 1228921323:
                    str = C3911.m11919(sArr2, i17, i18, i16);
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        s = s2;
                        m6981 = (i7 - C2105.m6981("ܳۜ")) * (-31);
                        i = ((m6981 ^ i8) * (-7137)) ^ (-2094005256);
                        i2 = 1322104229;
                        int i212222222 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC2300032222222 = interfaceMenuC23000;
                        i10 = i212222222;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC2300032222222;
                    } else {
                        m2566 = C2105.m6981("᩻۫") ^ i8;
                        i9 = ((m2566 ^ i7) * (-20263)) ^ 1124752919;
                        i3 = 1444462433;
                        i10 = m2566 ^ i3;
                        menu2 = menu;
                    }
                case -875557639:
                case -85093488:
                    sArr3 = f50637;
                    i14 = 205;
                    i15 = 3;
                    if (C0483.f2088 < 0) {
                        m25662 = (C0630.m2566("᩹᩵") ^ i8) * 29;
                        i5 = ((m25662 ^ i7) * (-22215)) ^ (-1807155282);
                        i6 = -1321192682;
                        i10 = m25662 ^ i6;
                        i9 = i5;
                    }
                    m25662 = C0630.m2566("ᩴۢ") ^ i8;
                    i5 = ((m25662 ^ i7) * (-1639)) ^ 877510120;
                    i6 = -1111440891;
                    i10 = m25662 ^ i6;
                    i9 = i5;
                case -697956583:
                case 1817697568:
                    interfaceMenuC23000 = interfaceMenuC230002;
                    s = s2;
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = (i7 - C2105.m6981("֡ۚ")) * 25;
                        i = ((m6981 ^ i8) * 24835) ^ 1767043550;
                        i2 = 216013234;
                        int i2122222222 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC23000322222222 = interfaceMenuC23000;
                        i10 = i2122222222;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC23000322222222;
                    }
                    m6981 = (i7 - C2105.m6981("ܳۜ")) * (-31);
                    i = ((m6981 ^ i8) * (-7137)) ^ (-2094005256);
                    i2 = 1322104229;
                    int i21222222222 = m6981 ^ i2;
                    s2 = s;
                    menu2 = menu;
                    InterfaceMenuC23000 interfaceMenuC230003222222222 = interfaceMenuC23000;
                    i10 = i21222222222;
                    i9 = i;
                    interfaceMenuC230002 = interfaceMenuC230003222222222;
                case -620999252:
                case 1741547494:
                    menuInflater.inflate(i11 ^ i12, menu2);
                    interfaceMenuC230002 = (InterfaceMenuC23000) menu2;
                    c15545 = this.f50646;
                    if (C7106.f21815 != 0) {
                        int m69814 = C2105.m6981("ܽۤ") ^ i7;
                        int i23 = ((m69814 ^ i8) * 8509) ^ 585880017;
                        i10 = m69814 ^ (-1817948403);
                        i9 = i23;
                        menu2 = menu;
                    } else {
                        m2566 = (i7 - C2105.m6981("ܰۘ")) * (-101);
                        i9 = ((m2566 ^ i8) * (-31467)) ^ 1392681580;
                        i3 = 596090589;
                        i10 = m2566 ^ i3;
                        menu2 = menu;
                    }
                case 54472833:
                case 1528880894:
                    C1916.m6308();
                    C4263.m12819();
                    interfaceMenuC23000 = interfaceMenuC230002;
                    s = s2;
                    m6981 = (i7 - C2105.m6981("ܳۜ")) * (-31);
                    i = ((m6981 ^ i8) * (-7137)) ^ (-2094005256);
                    i2 = 1322104229;
                    int i212222222222 = m6981 ^ i2;
                    s2 = s;
                    menu2 = menu;
                    InterfaceMenuC23000 interfaceMenuC2300032222222222 = interfaceMenuC23000;
                    i10 = i212222222222;
                    i9 = i;
                    interfaceMenuC230002 = interfaceMenuC2300032222222222;
                case 150822305:
                case 402677790:
                    if (C1711.f5919) {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        m69812 = (i7 - C2105.m6981("ۧۘ")) * 119;
                        i9 = ((m69812 ^ i8) * 17925) ^ (-622085758);
                        i4 = 833484055;
                        int i2222 = m69812 ^ i4;
                        interfaceMenuC230002 = interfaceMenuC23000;
                        i10 = i2222;
                        menu2 = menu;
                    } else {
                        interfaceMenuC23000 = interfaceMenuC230002;
                        s = s2;
                        m6981 = C2105.m6981("֫ۚ") ^ i8;
                        i = ((m6981 ^ i7) * 9631) ^ (-1983271641);
                        i2 = 2070091451;
                        int i2122222222222 = m6981 ^ i2;
                        s2 = s;
                        menu2 = menu;
                        InterfaceMenuC23000 interfaceMenuC23000322222222222 = interfaceMenuC23000;
                        i10 = i2122222222222;
                        i9 = i;
                        interfaceMenuC230002 = interfaceMenuC23000322222222222;
                    }
                case 825685770:
                case 2003178531:
                    i16 = 53566;
                    m2566 = C2105.m6981("ۗۙ") ^ i7;
                    i9 = ((m2566 ^ i8) * 9009) ^ (-1664308145);
                    i3 = 876927083;
                    i10 = m2566 ^ i3;
                    menu2 = menu;
                case 1754317855:
                case 2060775255:
                    interfaceMenuC23000 = interfaceMenuC230002;
                    s2 = sArr[201];
                    if (!C3663.f11553) {
                        m69812 = C2105.m6981("ܶۘ") ^ i8;
                        i9 = ((m69812 ^ i7) * 25709) ^ (-1789973437);
                        i4 = -1370998057;
                        int i22222 = m69812 ^ i4;
                        interfaceMenuC230002 = interfaceMenuC23000;
                        i10 = i22222;
                        menu2 = menu;
                    }
                    m69812 = (i7 - C2105.m6981("ۧۘ")) * 119;
                    i9 = ((m69812 ^ i8) * 17925) ^ (-622085758);
                    i4 = 833484055;
                    int i222222 = m69812 ^ i4;
                    interfaceMenuC230002 = interfaceMenuC23000;
                    i10 = i222222;
                    menu2 = menu;
                default:
                    RunnableC1937.m6387();
                    C2958.m9034();
                    break;
            }
            return;
        }
    }

    @Override // l.AbstractC14346
    /* renamed from: ۡ */
    public final C12392 mo17427() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        short s2 = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = -568252524;
        int i6 = C0714.f2697;
        int i7 = C4117.f13076;
        int m6981 = (i6 - C2105.m6981("ᩳܳ")) * (-17);
        int i8 = ((m6981 ^ i7) * (-28597)) ^ 192420378;
        int i9 = 589431156;
        while (true) {
            i5 = ((((i5 ^ i7) * 6929) >> 31) & i8) ^ (m6981 ^ i9);
            switch (i5) {
                case -2027755298:
                case 289603273:
                    short[] sArr2 = f50637;
                    if (C0050.f910 < 0 && C11340.f33930 < 0) {
                        throw new IllegalStateException(C21923.m49334(sArr2, 399, 29, i4));
                    }
                    m6981 = C0630.m2566("ۧܰ") ^ i7;
                    i8 = ((m6981 ^ i6) * (-20121)) ^ 564169715;
                    i9 = -544622550;
                    break;
                case -1992228956:
                case 265239922:
                    if (C0964.f3626 != 0) {
                        m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                        i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                        i9 = -497464146;
                    } else {
                        m6981 = (C2105.m6981("᩸᩻") + i6) * (-41);
                        i8 = ((m6981 ^ i7) * 20983) ^ 322372741;
                        i9 = -2030538352;
                    }
                case -1873732532:
                case -305429605:
                    if (C11340.f33930 >= 0) {
                        m6981 = C0630.m2566("ۧܰ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-20121)) ^ 564169715;
                        i9 = -544622550;
                    } else {
                        m6981 = (i7 - C2105.m6981("۬֫")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i8 = ((m6981 ^ i6) * (-23659)) ^ (-1850772221);
                        i9 = -1065523482;
                    }
                case -1763304051:
                case 386166570:
                    s = sArr[c];
                    s2 = 30250;
                    if (C5695.f17556 >= 0) {
                        m6981 = C2105.m6981("ۢ۬") ^ i6;
                        i8 = ((m6981 ^ i7) * (-32379)) ^ (-430370666);
                        i9 = 2100565329;
                    } else {
                        m6981 = (C0630.m2566("ۚۧ") ^ i6) * (-13);
                        i8 = ((m6981 ^ i7) * (-6539)) ^ (-1244007940);
                        i9 = 718482828;
                    }
                case -1649075207:
                case 653005439:
                    return this.f50649;
                case -1589622186:
                case 931216136:
                    i4 = 13231;
                    m6981 = (i6 - C2105.m6981("᩺۬")) * (-45);
                    i8 = ((m6981 ^ i7) * (-3625)) ^ (-79082875);
                    i9 = 1243796670;
                case -1566688602:
                case 144257890:
                    C0964.m3413();
                    return null;
                case -1371526028:
                case -1305126800:
                    RunnableC1937.m6387();
                    C3432.m10477();
                    m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                    i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                    i9 = -497464146;
                case -1345048505:
                case -1321554431:
                    sArr = f50637;
                    if (C0630.f2410 <= 0) {
                        m6981 = C2105.m6981("ۢ۬") ^ i6;
                        i8 = ((m6981 ^ i7) * (-32379)) ^ (-430370666);
                        i9 = 2100565329;
                    } else {
                        m6981 = C2105.m6981("ۜ᩺") ^ i7;
                        i8 = ((m6981 ^ i6) * 18617) ^ (-1475981514);
                        i9 = 176798071;
                    }
                case -1248485992:
                case -618514651:
                    if ((i2 + i3) - i < 0) {
                        m6981 = C2105.m6981("᩹ܿ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-3169)) ^ 1043062193;
                        i9 = 939931166;
                    } else {
                        m6981 = (i6 - C2105.m6981("۟᩵")) * 53;
                        i8 = ((m6981 ^ i7) * (-25309)) ^ (-1700731838);
                        i9 = -680616251;
                    }
                case -1232391281:
                case 577755120:
                    if (this.f50647) {
                        m6981 = C2105.m6981("᩸ۖ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-24695)) ^ (-1526710509);
                        i9 = 1200119600;
                    } else {
                        m6981 = (C2105.m6981("֨ۖ") ^ i6) * (-115);
                        i8 = ((m6981 ^ i7) * 29179) ^ (-101146436);
                        i9 = -682650538;
                    }
                case -1127592324:
                case 1547750606:
                    if (C7106.f21815 != 0) {
                        m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                        i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                        i9 = -497464146;
                    } else {
                        m6981 = C0630.m2566("ܰۙ") ^ i6;
                        i8 = ((m6981 ^ i7) * (-27725)) ^ 1366624926;
                        i9 = 1669626927;
                    }
                case -1064174816:
                case -209988858:
                    if (C1005.f3721) {
                        m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                        i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                        i9 = -497464146;
                    } else {
                        m6981 = (i6 - C2105.m6981("᩹۫")) * 71;
                        i8 = ((m6981 ^ i7) * (-25151)) ^ (-842087862);
                        i9 = 70767946;
                    }
                case -996369970:
                case 2075445780:
                    if (C1128.m3851() <= 0) {
                        m6981 = (i6 - C2105.m6981("᩹۫")) * 71;
                        i8 = ((m6981 ^ i7) * (-25151)) ^ (-842087862);
                        i9 = 70767946;
                    } else {
                        m6981 = C0630.m2566("ۛܺ") ^ i6;
                        i8 = ((m6981 ^ i7) * 31389) ^ (-528801236);
                        i9 = 1154840414;
                    }
                case -895830276:
                case -81289023:
                    c = 398;
                    if (C3432.f10845 >= 0) {
                        m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                        i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                        i9 = -497464146;
                    } else {
                        m6981 = C0630.m2566("ۤᩳ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-21915)) ^ (-1026565170);
                        i9 = -1070631131;
                    }
                case -529729334:
                case 1858901855:
                    i4 = 13631;
                    m6981 = (i6 - C2105.m6981("᩺۬")) * (-45);
                    i8 = ((m6981 ^ i7) * (-3625)) ^ (-79082875);
                    i9 = 1243796670;
                case -461734969:
                case -230780680:
                    i3 = 228765625;
                    if (C1128.f4106 <= 0) {
                        m6981 = (C2105.m6981("᩸᩻") + i6) * (-41);
                        i8 = ((m6981 ^ i7) * 20983) ^ 322372741;
                        i9 = -2030538352;
                    } else {
                        m6981 = (i7 - C2105.m6981("ᩴܶ")) * 33;
                        i8 = ((m6981 ^ i6) * (-5113)) ^ 1290063893;
                        i9 = -1710763619;
                    }
                case -348366357:
                case 509423969:
                    if (this.f50644) {
                        m6981 = C0630.m2566("ܰܳ") ^ i7;
                        i8 = ((m6981 ^ i6) * 19709) ^ 1477146963;
                        i9 = 1881501403;
                    } else {
                        m6981 = (C2105.m6981("֨ܳ") ^ i6) * 47;
                        i8 = ((m6981 ^ i7) * 20195) ^ 72629500;
                        i9 = 1882693675;
                    }
                case -283114628:
                case 159016771:
                    i = s * s2;
                    i2 = s * s;
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = (C2105.m6981("᩸᩻") + i6) * (-41);
                        i8 = ((m6981 ^ i7) * 20983) ^ 322372741;
                        i9 = -2030538352;
                    } else {
                        m6981 = (i6 - C2105.m6981("ۛۚ")) * 11;
                        i8 = ((m6981 ^ i7) * (-29273)) ^ 1532164036;
                        i9 = -114898451;
                    }
                case 1125461031:
                case 1933405639:
                    if (C1128.f4106 > 0) {
                        m6981 = (i7 - C0630.m2566("ۧ᩶")) * (-73);
                        i8 = ((m6981 ^ i6) * (-23277)) ^ 2142472011;
                        i9 = -497464146;
                    } else {
                        m6981 = C0630.m2566("ۧܰ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-20121)) ^ 564169715;
                        i9 = -544622550;
                    }
                case 1352077217:
                case 1505685434:
                    return null;
                default:
                    if (this.f50640 == 0) {
                        m6981 = (C2105.m6981("ۚۜ") ^ i7) * 91;
                        i8 = ((m6981 ^ i6) * 22669) ^ (-853714504);
                        i9 = 850802060;
                    } else {
                        m6981 = C2105.m6981("᩸ۖ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-24695)) ^ (-1526710509);
                        i9 = 1200119600;
                    }
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static C6928 m38781(C16475 c16475, C12951 c12951, C12392 c12392, C15545 c15545) {
        int i = 0;
        Throwable th = null;
        boolean z = false;
        boolean z2 = false;
        C6928 c6928 = null;
        int i2 = -1853945104;
        int i3 = C3911.f12484;
        int i4 = C3537.f11231;
        int m2566 = C0630.m2566("ۤۛ") ^ i4;
        int i5 = ((m2566 ^ i3) * (-1919)) ^ (-874931586);
        int i6 = -1633209420;
        while (true) {
            i2 = ((((i2 ^ i3) * (-12553)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2069814356:
                case -1767607196:
                    C1128.m3851();
                    return null;
                case -1981565985:
                case 1327424393:
                    if (C2105.f7037 != 0) {
                        m2566 = (i3 - C2105.m6981("ۜ᩵")) * 31;
                        i5 = ((m2566 ^ i4) * (-16385)) ^ 1302565482;
                        i6 = -130576727;
                    } else {
                        m2566 = (C0630.m2566("ܳᩳ") + i4) * (-61);
                        i5 = ((m2566 ^ i3) * (-32703)) ^ 1321106763;
                        i6 = -308249566;
                    }
                case -1877315521:
                case 1760785950:
                    z2 = C1005.m3497(c12392).mo1607();
                    m2566 = C2105.m6981("ۜ᩷") ^ i4;
                    i5 = ((m2566 ^ i3) * (-1429)) ^ (-408720178);
                    i6 = -1993336852;
                case -1707428346:
                case 190748438:
                    c6928 = new C6928(AbstractC5206.m14983(c12951.m31504()));
                    m2566 = C0630.m2566("ܽۚ") ^ i3;
                    i5 = ((m2566 ^ i4) * (-17029)) ^ 738790967;
                    i6 = -1911507146;
                case -1698855604:
                case -667426892:
                    if (C0630.f2410 <= 0) {
                        m2566 = (C0630.m2566("᩷ۜ") ^ i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-22495)) ^ 421564405;
                        i6 = -43172691;
                    } else {
                        m2566 = C0630.m2566("ۡܺ") ^ i4;
                        i5 = ((m2566 ^ i3) * 17385) ^ (-1515714927);
                        i6 = -1436426766;
                    }
                case -1697195004:
                case 861237462:
                    if (C21923.f70183 != 0) {
                        m2566 = (C0630.m2566("᩷ۜ") ^ i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-22495)) ^ 421564405;
                        i6 = -43172691;
                    } else {
                        m2566 = (C0630.m2566("֡᩷") + i3) * (-95);
                        i5 = ((m2566 ^ i4) * (-12959)) ^ 1095484064;
                        i6 = 513649891;
                    }
                case -1680416090:
                case 840875370:
                    c12392.m30435();
                    return c6928;
                case -1619763786:
                case -578555607:
                    RunnableC3474.m10630();
                    if (C22628.f73083 > 0) {
                        m2566 = C0630.m2566("ᩳ۬") ^ i4;
                        i5 = ((m2566 ^ i3) * 26595) ^ 2030905318;
                        i6 = -1747839602;
                    } else {
                        m2566 = C2105.m6981("ۜ۠") ^ i4;
                        i5 = ((m2566 ^ i3) * (-25147)) ^ 1308402774;
                        i6 = -1249206817;
                    }
                case -1586203076:
                case 1440282887:
                    try {
                        c12392.m30336(c16475.m34236(c16475.f50650.m36268()).m27340());
                        m2566 = C0630.m2566("ۗᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12173) ^ (-1899488394);
                        i6 = 2100636366;
                    } catch (Throwable th2) {
                        th = th2;
                        m2566 = C2105.m6981("᩻ۛ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-10569)) ^ 1965246605;
                        i6 = 474727595;
                    }
                case -1535300939:
                case -314137528:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = (i3 - C2105.m6981("ۜ᩵")) * 31;
                        i5 = ((m2566 ^ i4) * (-16385)) ^ 1302565482;
                        i6 = -130576727;
                    } else {
                        m2566 = (C0630.m2566("᩵ۨ") + i3) * 85;
                        i5 = ((m2566 ^ i4) * (-29043)) ^ (-1388276524);
                        i6 = -863041128;
                    }
                case -1494960149:
                case -482965528:
                    C0483.m2121();
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = (i4 - C0630.m2566("ܽܿ")) * 87;
                        i5 = ((m2566 ^ i3) * 20837) ^ (-1792555859);
                        i6 = 1354511635;
                    } else {
                        m2566 = (C0630.m2566("ۙ۠") ^ i4) * 29;
                        i5 = ((m2566 ^ i3) * (-17331)) ^ (-1868112061);
                        i6 = 529438320;
                    }
                case -1481061346:
                case 1727089616:
                    c12392.m30412(true);
                    i = 1382253410;
                    m2566 = C2105.m6981("ۜ֫") ^ i4;
                    i5 = ((m2566 ^ i3) * (-32475)) ^ (-142911522);
                    i6 = 1837083876;
                case -1464733841:
                case -1127843103:
                    C22124.m49722((InterfaceC20008) c12951, i);
                    c16475.f50641 = C1916.m6304(c12951);
                    c16475.f50648 = C0964.m3406(c12951);
                    C22124.m49722((InterfaceC20008) c12951, i);
                    c12392.mo25896(c12951);
                    C22124.m49722((InterfaceC20008) c12951, i);
                    c15545.m36689(c12951);
                    C22124.m49722((InterfaceC20008) c12951, i);
                    c15545.m36682(c12951);
                    z = c12951.m31490(1382256833);
                    m2566 = (C2105.m6981("᩵᩵") ^ i3) * 23;
                    i5 = ((m2566 ^ i4) * (-13981)) ^ (-1218267107);
                    i6 = -597452141;
                case -1309011537:
                case 431663091:
                    C3537.m10746();
                    if (C0630.f2410 <= 0) {
                        m2566 = (i4 - C0630.m2566("ܽܿ")) * 87;
                        i5 = ((m2566 ^ i3) * 20837) ^ (-1792555859);
                        i6 = 1354511635;
                    } else {
                        m2566 = (C2105.m6981("ۘ֨") + i3) * (-121);
                        i5 = ((m2566 ^ i4) * (-24949)) ^ 2061954487;
                        i6 = 515834769;
                    }
                case -1270879811:
                case 246379218:
                    if (C3683.f11629 < 0) {
                        m2566 = (C0630.m2566("۟᩵") ^ i4) * (-123);
                        i5 = ((m2566 ^ i3) * 4661) ^ 673170949;
                        i6 = -1089539712;
                    } else {
                        m2566 = C0630.m2566("ᩳ۬") ^ i4;
                        i5 = ((m2566 ^ i3) * 26595) ^ 2030905318;
                        i6 = -1747839602;
                    }
                case -1236822871:
                case 1341646344:
                    if (C1916.f6442) {
                        m2566 = C2105.m6981("ܿۤ") ^ i3;
                        i5 = ((m2566 ^ i4) * 17997) ^ 940825706;
                        i6 = 1054088740;
                    } else {
                        m2566 = (C2105.m6981("ۘ֨") + i3) * (-121);
                        i5 = ((m2566 ^ i4) * (-24949)) ^ 2061954487;
                        i6 = 515834769;
                    }
                case -1196321762:
                case 591730869:
                    c6928 = null;
                    m2566 = C0630.m2566("ܽۚ") ^ i3;
                    i5 = ((m2566 ^ i4) * (-17029)) ^ 738790967;
                    i6 = -1911507146;
                case -1171224463:
                case -477669211:
                    if (C3746.f11829 <= 0) {
                        m2566 = C0630.m2566("ۗ᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-14947)) ^ 1117679948;
                        i6 = 1074233210;
                    } else {
                        m2566 = (C2105.m6981("۫᩺") ^ i3) * (-87);
                        i5 = ((m2566 ^ i4) * (-26185)) ^ 1131049536;
                        i6 = -1433301859;
                    }
                case -1116060897:
                case 1485436093:
                    if (z2) {
                        m2566 = C0630.m2566("ۗᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12173) ^ (-1899488394);
                        i6 = 2100636366;
                    } else {
                        m2566 = C2105.m6981("ۢܽ") ^ i3;
                        i5 = ((m2566 ^ i4) * 32287) ^ (-1915431289);
                        i6 = -1287978103;
                    }
                case -1105924676:
                case -351474916:
                    if (C1047.m3599() >= 0) {
                        m2566 = C0630.m2566("ᩳ۬") ^ i4;
                        i5 = ((m2566 ^ i3) * 26595) ^ 2030905318;
                        i6 = -1747839602;
                    } else {
                        m2566 = (i3 - C2105.m6981("֫ۜ")) * 3;
                        i5 = ((m2566 ^ i4) * 30133) ^ (-1156806089);
                        i6 = -1275081771;
                    }
                case -1084922489:
                case 354959371:
                    C1504.m5179();
                    if (C3245.f10203 > 0) {
                        m2566 = C0630.m2566("ᩳ۬") ^ i4;
                        i5 = ((m2566 ^ i3) * 26595) ^ 2030905318;
                        i6 = -1747839602;
                    } else {
                        m2566 = (C0630.m2566("᩷ۜ") ^ i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-22495)) ^ 421564405;
                        i6 = -43172691;
                    }
                case -1065152686:
                case 963066502:
                    if (RunnableC1108.f4040) {
                        m2566 = C0630.m2566("ᩳ۬") ^ i4;
                        i5 = ((m2566 ^ i3) * 26595) ^ 2030905318;
                        i6 = -1747839602;
                    } else {
                        m2566 = (i4 - C0630.m2566("ܽܿ")) * 87;
                        i5 = ((m2566 ^ i3) * 20837) ^ (-1792555859);
                        i6 = 1354511635;
                    }
                case -688221143:
                case 1181229853:
                    RunnableC0588.m2441();
                    m2566 = (C0630.m2566("۟᩵") ^ i4) * (-123);
                    i5 = ((m2566 ^ i3) * 4661) ^ 673170949;
                    i6 = -1089539712;
                case -297406010:
                case 2077756865:
                    if (C1005.f3721) {
                        m2566 = C2105.m6981("֫ۘ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-9417)) ^ (-1837463606);
                        i6 = 1804153526;
                    } else {
                        m2566 = (C0630.m2566("۟᩵") ^ i4) * (-123);
                        i5 = ((m2566 ^ i3) * 4661) ^ 673170949;
                        i6 = -1089539712;
                    }
                case -289555312:
                case 123241817:
                    if (C4117.f13076 <= 0) {
                        m2566 = C2105.m6981("ۜ۠") ^ i4;
                        i5 = ((m2566 ^ i3) * (-25147)) ^ 1308402774;
                        i6 = -1249206817;
                    } else {
                        m2566 = (C0630.m2566("ۤۚ") + i4) * (-127);
                        i5 = ((m2566 ^ i3) * 1439) ^ (-1359801447);
                        i6 = 1846760644;
                    }
                case -89400962:
                case 2085557082:
                    c12392.m30412(false);
                    throw th;
                case 223553069:
                case 824078197:
                    if (C5695.f17556 >= 0) {
                        m2566 = C0630.m2566("ܽᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 20483) ^ (-1350830137);
                        i6 = -10912976;
                    } else {
                        m2566 = C0630.m2566("ۗ᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-14947)) ^ 1117679948;
                        i6 = 1074233210;
                    }
                case 570457495:
                case 1593984791:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (C2105.m6981("ۘ֨") + i3) * (-121);
                        i5 = ((m2566 ^ i4) * (-24949)) ^ 2061954487;
                        i6 = 515834769;
                    } else {
                        m2566 = (C0630.m2566("ܿܿ") ^ i4) * (-35);
                        i5 = ((m2566 ^ i3) * 24585) ^ 484187762;
                        i6 = -1093508214;
                    }
                case 1153139392:
                case 1681082897:
                    if (C2272.f7362) {
                        m2566 = (C0630.m2566("۟᩵") ^ i4) * (-123);
                        i5 = ((m2566 ^ i3) * 4661) ^ 673170949;
                        i6 = -1089539712;
                    } else {
                        m2566 = C0630.m2566("ܽᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 20483) ^ (-1350830137);
                        i6 = -10912976;
                    }
                default:
                    if (z) {
                        m2566 = (C0630.m2566("ۧ᩸") + i4) * 9;
                        i5 = ((m2566 ^ i3) * (-13475)) ^ (-797079618);
                        i6 = 1423406469;
                    } else {
                        m2566 = (i4 - C0630.m2566("֫ۖ")) * (-99);
                        i5 = ((m2566 ^ i3) * (-11917)) ^ 598146537;
                        i6 = 1560757053;
                    }
            }
        }
    }

    /* JADX WARN: Type inference failed for: r5v0 */
    /* JADX WARN: Type inference failed for: r5v1, types: [android.view.View, android.widget.TextView, l.۫ۨᩳ, l.ܶ᩺ᩳ, l.ܺۧۢ, l.᩶ܿۢ] */
    /* JADX WARN: Type inference failed for: r5v2 */
    /* JADX WARN: Type inference failed for: r5v3 */
    /* JADX WARN: Type inference failed for: r5v4 */
    /* JADX WARN: Type inference failed for: r5v5 */
    @Override // l.ComponentCallbacksC9205
    public final void onDestroyView() {
        boolean z = false;
        C15893 c15893 = null;
        C12392 c12392 = null;
        C15545 c15545 = null;
        ActivityC17169 activityC17169 = null;
        ?? r5 = 0;
        int i = 1193368632;
        int i2 = C1294.f4556;
        int i3 = C0630.f2410;
        int m2566 = (i2 - C0630.m2566("۠ۜ")) * 83;
        int i4 = ((m2566 ^ i3) * (-20981)) ^ 2137999156;
        int i5 = 1246117532;
        while (true) {
            i = ((((i ^ i3) * (-27787)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2129036815:
                case -992016649:
                    c12392 = this.f50649;
                    if (c12392 != null) {
                        m2566 = (i2 - C2105.m6981("᩵ۧ")) * (-117);
                        i4 = ((m2566 ^ i3) * 10681) ^ 433631137;
                        i5 = 1020902961;
                    } else {
                        m2566 = (C0630.m2566("ۙ֨") ^ i3) * (-51);
                        i4 = ((m2566 ^ i2) * 6851) ^ 949948526;
                        i5 = -219948286;
                    }
                case -2120026390:
                case 1085740400:
                    if (C3911.m11924() <= 0) {
                        m2566 = C0630.m2566("ۚ֡") ^ i3;
                        i4 = ((m2566 ^ i2) * 28811) ^ 9371696;
                        i5 = -213432793;
                    } else {
                        m2566 = (C0630.m2566("ۤ۟") ^ i3) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m2566 ^ i2) * (-319)) ^ (-375324149);
                        i5 = 1499468078;
                    }
                case -2077743365:
                case -870899570:
                    z = false;
                    if (C3432.f10845 >= 0) {
                        m2566 = (C2105.m6981("֡ۧ") + i2) * (-15);
                        i4 = ((m2566 ^ i3) * 32501) ^ (-742254588);
                        i5 = -917785390;
                    } else {
                        m2566 = (C0630.m2566("ۛۡ") + i2) * (-51);
                        i4 = ((m2566 ^ i3) * (-10427)) ^ 1478493924;
                        i5 = 1362909679;
                    }
                case -2041509372:
                case 1836504092:
                    this.f50651 = r5;
                    if (C3746.f11829 <= 0) {
                        m2566 = (i3 - C0630.m2566("ܶᩴ")) * (-111);
                        i4 = ((m2566 ^ i2) * 16451) ^ 1401176432;
                        i5 = -1629132093;
                    } else {
                        m2566 = (C0630.m2566("᩸ۛ") ^ i2) * 33;
                        i4 = ((m2566 ^ i3) * 19591) ^ (-1344298719);
                        i5 = -704801735;
                    }
                case -1915369000:
                case -1443400858:
                    C3911.m11924();
                    break;
                case -1638361349:
                case -163978246:
                    c15893.close();
                    m2566 = (C2105.m6981("ۚ᩺") ^ i2) * (-13);
                    i4 = ((m2566 ^ i3) * (-19079)) ^ (-16488775);
                    i5 = -1651899328;
                case -1438219535:
                case 1655278959:
                    C0237.m1481();
                    if (C2272.m7503()) {
                        m2566 = C0630.m2566("᩻ۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 10115) ^ (-1499729562);
                        i5 = -386356936;
                    } else {
                        m2566 = (C2105.m6981("֡ۧ") + i2) * (-15);
                        i4 = ((m2566 ^ i3) * 32501) ^ (-742254588);
                        i5 = -917785390;
                    }
                case -1417451600:
                case 1207117010:
                    C3537.m10746();
                    C3537.m10746();
                    m2566 = C0630.m2566("ۚ֡") ^ i3;
                    i4 = ((m2566 ^ i2) * 28811) ^ 9371696;
                    i5 = -213432793;
                case -948642176:
                case -90014777:
                    activityC17169 = (ActivityC17169) C3683.m11214(this);
                    if (C3537.f11231 >= 0) {
                        m2566 = (i3 - C0630.m2566("ܶᩴ")) * (-111);
                        i4 = ((m2566 ^ i2) * 16451) ^ 1401176432;
                        i5 = -1629132093;
                    } else {
                        m2566 = (i3 - C0630.m2566("᩺ۗ")) * (-41);
                        i4 = ((m2566 ^ i2) * (-12871)) ^ 1164087735;
                        i5 = 634426748;
                    }
                case -589006318:
                case 860999435:
                    C3537.m10746();
                    if (C22628.f73083 > 0) {
                        m2566 = C0630.m2566("ۚ֡") ^ i3;
                        i4 = ((m2566 ^ i2) * 28811) ^ 9371696;
                        i5 = -213432793;
                    } else {
                        m2566 = (C0630.m2566("֨֨") ^ i3) * 95;
                        i4 = ((m2566 ^ i2) * 4181) ^ (-1511907845);
                        i5 = -975637867;
                    }
                case -173915247:
                case 1697100905:
                    this.f50646 = r5;
                    this.f50655 = r5;
                    if (C1773.m5908() <= 0) {
                        m2566 = C0630.m2566("᩻ۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 10115) ^ (-1499729562);
                        i5 = -386356936;
                    } else {
                        m2566 = C0630.m2566("֡۠") ^ i3;
                        i4 = ((m2566 ^ i2) * 9331) ^ (-2005992338);
                        i5 = -589213667;
                    }
                case -171080799:
                case 1401151964:
                    super.onDestroyView();
                    if (C3663.m11168() >= 0) {
                        m2566 = (C2105.m6981("֡ۧ") + i2) * (-15);
                        i4 = ((m2566 ^ i3) * 32501) ^ (-742254588);
                        i5 = -917785390;
                    } else {
                        m2566 = (C2105.m6981("ۢۙ") ^ i3) * 21;
                        i4 = ((m2566 ^ i2) * 9663) ^ 381265173;
                        i5 = 545023256;
                    }
                case -130690470:
                case 1342725469:
                    if (RunnableC0588.m2441() >= 0) {
                        m2566 = (C2105.m6981("֡ۧ") + i2) * (-15);
                        i4 = ((m2566 ^ i3) * 32501) ^ (-742254588);
                        i5 = -917785390;
                    } else {
                        m2566 = (C2105.m6981("᩶۬") ^ i2) * (-61);
                        i4 = ((m2566 ^ i3) * 25139) ^ (-2140967751);
                        i5 = -878864643;
                    }
                case 103712618:
                case 469931004:
                    c15545.m36695();
                    m2566 = (i2 - C2105.m6981("۟᩺")) * (-63);
                    i4 = ((m2566 ^ i3) * 10111) ^ (-1231365555);
                    i5 = 711115824;
                case 470206295:
                case 2143321795:
                    c15545 = this.f50646;
                    if (c15545 != null) {
                        m2566 = C2105.m6981("᩸᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 5481) ^ 952055587;
                        i5 = 1553803052;
                    } else {
                        m2566 = (i2 - C2105.m6981("۟᩺")) * (-63);
                        i4 = ((m2566 ^ i3) * 10111) ^ (-1231365555);
                        i5 = 711115824;
                    }
                case 522343662:
                case 1051132834:
                    c12392.m30386();
                    m2566 = (C0630.m2566("ۙ֨") ^ i3) * (-51);
                    i4 = ((m2566 ^ i2) * 6851) ^ 949948526;
                    i5 = -219948286;
                case 739370508:
                case 769635315:
                    r5 = 0;
                    r5 = 0;
                    if (C0422.f1886 <= 0) {
                        m2566 = C0630.m2566("᩻ۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 10115) ^ (-1499729562);
                        i5 = -386356936;
                    } else {
                        m2566 = (C2105.m6981("ܿܰ") ^ i2) * 73;
                        i4 = ((m2566 ^ i3) * 5845) ^ 1627467265;
                        i5 = -1798982041;
                    }
                case 1020309284:
                case 2000225875:
                    C1128.m3851();
                    if (C0237.f1507 != 0) {
                        m2566 = C0630.m2566("ۚ֡") ^ i3;
                        i4 = ((m2566 ^ i2) * 28811) ^ 9371696;
                        i5 = -213432793;
                    } else {
                        m2566 = C0630.m2566("᩻ۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 10115) ^ (-1499729562);
                        i5 = -386356936;
                    }
                case 1084614016:
                case 1610525843:
                    activityC17169.m10234();
                    if (C1128.f4106 <= 0) {
                        m2566 = (C0630.m2566("֨֨") ^ i3) * 95;
                        i4 = ((m2566 ^ i2) * 4181) ^ (-1511907845);
                        i5 = -975637867;
                    } else {
                        m2566 = (C0630.m2566("֨᩸") + i3) * 85;
                        i4 = ((m2566 ^ i2) * (-11421)) ^ (-197969424);
                        i5 = 819840957;
                    }
                case 1342633168:
                case 2107299373:
                    this.f50656 = r5;
                    this.f50649 = r5;
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = (i3 - C0630.m2566("ܶᩴ")) * (-111);
                        i4 = ((m2566 ^ i2) * 16451) ^ 1401176432;
                        i5 = -1629132093;
                    } else {
                        m2566 = (C2105.m6981("᩵ۖ") + i2) * (-47);
                        i4 = ((m2566 ^ i3) * (-6441)) ^ (-1884181442);
                        i5 = 695008125;
                    }
                case 1849077649:
                case 1881430514:
                    this.f50644 = z;
                    c15893 = this.f50651;
                    if (c15893 != null) {
                        m2566 = C0630.m2566("᩸᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * 29129) ^ (-315792111);
                        i5 = -1400225215;
                    } else {
                        m2566 = (C2105.m6981("ۚ᩺") ^ i2) * (-13);
                        i4 = ((m2566 ^ i3) * (-19079)) ^ (-16488775);
                        i5 = -1651899328;
                    }
                default:
                    this.f50643 = r5;
                    this.f50642 = r5;
                    break;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:16:0x007a, code lost:
    
        if (l.C2272.f7362 != false) goto L38;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x0082, code lost:
    
        if (l.C7106.m19120() > 0) goto L38;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m38791(l.C16475 r21, l.DialogInterfaceC0206 r22) {
        /*
            Method dump skipped, instructions count: 892
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38791(l.ܽۜۢ, l.֡ۚۢ):void");
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static String m38802(C16475 c16475) {
        C12366 c12366 = null;
        C12230 c12230 = null;
        C11005 c11005 = null;
        C11005 c110052 = null;
        byte[] bArr = null;
        C12951 c12951 = null;
        int i = 0;
        C11005 c110053 = null;
        int i2 = 0;
        int i3 = 1688917208;
        int i4 = C2520.f8000;
        int i5 = C7811.f24123;
        int m2566 = (C0630.m2566("ۢ᩶") + i5) * (-27);
        int i6 = ((m2566 ^ i4) * (-8047)) ^ (-874447301);
        int i7 = 1943313902;
        while (true) {
            i3 = ((((i3 ^ i4) * (-2697)) >> 31) & i6) ^ (m2566 ^ i7);
            switch (i3) {
                case -2049299893:
                case -622393334:
                    C0382.m1848();
                    return null;
                case -2022591009:
                case -944569951:
                    i2 = 0;
                    m2566 = C2105.m6981("ᩳۤ") ^ i5;
                    i6 = ((m2566 ^ i4) * (-16013)) ^ (-71505979);
                    i7 = 251216540;
                case -1939832969:
                case 1875424078:
                    C4616.m13552();
                    if (C1916.f6442) {
                        m2566 = C2105.m6981("۬ۙ") ^ i4;
                        i6 = ((m2566 ^ i5) * 20615) ^ (-1985272928);
                        i7 = 349588031;
                    } else {
                        m2566 = C2105.m6981("ۧۛ") ^ i4;
                        i6 = ((m2566 ^ i5) * 6667) ^ (-1825501005);
                        i7 = -90972124;
                    }
                case -1683824972:
                case 1151524416:
                    c12951.skipBytes(2);
                    if (C4616.f14690 <= 0) {
                        m2566 = C2105.m6981("ᩳۘ") ^ i5;
                        i6 = ((m2566 ^ i4) * 7845) ^ 829086935;
                        i7 = -566539060;
                    } else {
                        m2566 = (C0630.m2566("ۜܽ") + i5) * (-127);
                        i6 = ((m2566 ^ i4) * 15605) ^ (-259523452);
                        i7 = -818524583;
                    }
                case -1661637935:
                case 1213561801:
                    c12366 = c16475.f50650;
                    if (C3663.f11553) {
                        m2566 = C2105.m6981("᩷֫") ^ i5;
                        i6 = ((m2566 ^ i4) * 29523) ^ 1220795908;
                        i7 = 1796536153;
                    } else {
                        m2566 = C2105.m6981("ۙۢ") ^ i5;
                        i6 = ((m2566 ^ i4) * (-25489)) ^ 1477313563;
                        i7 = -906251285;
                    }
                case -1619894522:
                case 1429745364:
                    C7106.m19120();
                    if (C3663.f11553) {
                        m2566 = C2105.m6981("᩷֫") ^ i5;
                        i6 = ((m2566 ^ i4) * 29523) ^ 1220795908;
                        i7 = 1796536153;
                    } else {
                        m2566 = C2105.m6981("ۧۛ") ^ i4;
                        i6 = ((m2566 ^ i5) * 6667) ^ (-1825501005);
                        i7 = -90972124;
                    }
                case -1438545636:
                case 408274481:
                    c12230.m29734();
                    c11005 = c12366.m36268();
                    if (C2958.f9394 >= 0) {
                        m2566 = C2105.m6981("ᩳۘ") ^ i5;
                        i6 = ((m2566 ^ i4) * 7845) ^ 829086935;
                        i7 = -566539060;
                    } else {
                        m2566 = C0630.m2566("۟ۚ") ^ i4;
                        i6 = ((m2566 ^ i5) * 9027) ^ 650184481;
                        i7 = -2008632887;
                    }
                case -1250343255:
                case -530686790:
                    C0714.m2805();
                    if (C22628.f73083 > 0) {
                        m2566 = C2105.m6981("ۧۛ") ^ i4;
                        i6 = ((m2566 ^ i5) * 6667) ^ (-1825501005);
                        i7 = -90972124;
                    } else {
                        m2566 = C2105.m6981("ᩳۘ") ^ i5;
                        i6 = ((m2566 ^ i4) * 7845) ^ 829086935;
                        i7 = -566539060;
                    }
                case -1131223220:
                case -386561850:
                    c110053 = c12366.m36268();
                    if (C3019.f9544 >= 0) {
                        m2566 = C2105.m6981("᩷֫") ^ i5;
                        i6 = ((m2566 ^ i4) * 29523) ^ 1220795908;
                        i7 = 1796536153;
                    } else {
                        m2566 = C0630.m2566("᩸᩺") ^ i5;
                        i6 = ((m2566 ^ i4) * 25191) ^ (-941841085);
                        i7 = 1657043412;
                    }
                case -1119087465:
                case 1334768330:
                    SystemClock.sleep(100L);
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = C2105.m6981("۬ۙ") ^ i4;
                        i6 = ((m2566 ^ i5) * 20615) ^ (-1985272928);
                        i7 = 349588031;
                    } else {
                        m2566 = C0630.m2566("۟᩹") ^ i5;
                        i6 = ((m2566 ^ i4) * 11287) ^ 459307495;
                        i7 = 1753873549;
                    }
                case -1089815286:
                case -87878423:
                    if (i2 < 50) {
                        m2566 = (C0630.m2566("֫ۤ") + i4) * 37;
                        i6 = ((m2566 ^ i5) * 3037) ^ (-159253840);
                        i7 = 1590195158;
                    } else {
                        m2566 = (i4 - C2105.m6981("ܺۤ")) * (-117);
                        i6 = ((m2566 ^ i5) * (-23631)) ^ 1586294433;
                        i7 = -341651639;
                    }
                case -1066961633:
                case -190238570:
                    RunnableC0588.m2441();
                    if (C1047.f3863 >= 0) {
                        m2566 = C2105.m6981("ۧۛ") ^ i4;
                        i6 = ((m2566 ^ i5) * 6667) ^ (-1825501005);
                        i7 = -90972124;
                    } else {
                        m2566 = C2105.m6981("ۢܺ") ^ i4;
                        i6 = ((m2566 ^ i5) * (-32313)) ^ 383644702;
                        i7 = 1054691941;
                    }
                case -977586745:
                case 1328467871:
                    if (c16475.f50644) {
                        m2566 = C0630.m2566("֫᩺") ^ i5;
                        i6 = ((m2566 ^ i4) * (-17039)) ^ 1945419360;
                        i7 = 1540147119;
                    } else {
                        m2566 = C2105.m6981("᩻ۨ") ^ i5;
                        i6 = ((m2566 ^ i4) * (-13225)) ^ (-1368735137);
                        i7 = -1448724293;
                    }
                case -751307887:
                case -192069627:
                    return C6748.m18370(c12951, c16475.m34236(c110053).m27340());
                case -646326608:
                case 378784824:
                    i2++;
                    m2566 = C2105.m6981("ᩳۤ") ^ i5;
                    i6 = ((m2566 ^ i4) * (-16013)) ^ (-71505979);
                    i7 = 251216540;
                case -626325368:
                case 538060264:
                    return C0050.m947(C11340.m28030(c16475.f50649));
                case -365115193:
                case 378489819:
                    if (c16475.f50638) {
                        m2566 = (C0630.m2566("ۘᩳ") + i4) * (-33);
                        i6 = ((m2566 ^ i5) * 5557) ^ (-993842674);
                        i7 = -542028071;
                    } else {
                        m2566 = C2105.m6981("᩻ۨ") ^ i5;
                        i6 = ((m2566 ^ i4) * (-13225)) ^ (-1368735137);
                        i7 = -1448724293;
                    }
                case -122541249:
                case 65184326:
                    c110052 = c16475.m34233(c11005);
                    if (C0964.f3626 != 0) {
                        m2566 = C2105.m6981("ᩳۘ") ^ i5;
                        i6 = ((m2566 ^ i4) * 7845) ^ 829086935;
                        i7 = -566539060;
                    } else {
                        m2566 = C0630.m2566("᩶ۨ") ^ i5;
                        i6 = ((m2566 ^ i4) * 19921) ^ (-1352116572);
                        i7 = -1368823429;
                    }
                case -50995814:
                case 1899492516:
                    C7811.m20844();
                    m2566 = C2105.m6981("᩷֫") ^ i5;
                    i6 = ((m2566 ^ i4) * 29523) ^ 1220795908;
                    i7 = 1796536153;
                case 119509688:
                case 2014031237:
                    c12230 = c16475.f50657;
                    if (c16475.f50644) {
                        m2566 = (C2105.m6981("᩻ۧ") ^ i4) * (-105);
                        i6 = ((m2566 ^ i5) * (-8199)) ^ 921096449;
                        i7 = -930273258;
                    } else {
                        m2566 = (i4 - C2105.m6981("ܺۤ")) * (-117);
                        i6 = ((m2566 ^ i5) * (-23631)) ^ 1586294433;
                        i7 = -341651639;
                    }
                case 204931337:
                case 1881353111:
                    if (c16475.f50638) {
                        m2566 = (i4 - C2105.m6981("ܺۤ")) * (-117);
                        i6 = ((m2566 ^ i5) * (-23631)) ^ 1586294433;
                        i7 = -341651639;
                    } else {
                        m2566 = C0630.m2566("۠᩹") ^ i4;
                        i6 = ((m2566 ^ i5) * 1263) ^ 973815947;
                        i7 = -1003825913;
                    }
                case 530224910:
                case 1820974171:
                    bArr = c110052.m27337();
                    if (C2126.m7040()) {
                        m2566 = (C2105.m6981("ۤۚ") ^ i5) * (-59);
                        i6 = ((m2566 ^ i4) * (-18827)) ^ (-1806472100);
                        i7 = 151191843;
                    } else {
                        m2566 = C0630.m2566("ۜۢ") ^ i5;
                        i6 = ((m2566 ^ i4) * (-6959)) ^ (-9871816);
                        i7 = 1929847576;
                    }
                case 756099376:
                case 1752738550:
                    C22124.m49722((InterfaceC20008) c12951, i);
                    if (C22628.f73083 <= 0) {
                        m2566 = (C2105.m6981("ۤۚ") ^ i5) * (-59);
                        i6 = ((m2566 ^ i4) * (-18827)) ^ (-1806472100);
                        i7 = 151191843;
                    } else {
                        m2566 = (C2105.m6981("ᩴۚ") ^ i4) * 119;
                        i6 = ((m2566 ^ i5) * (-15055)) ^ 1510265181;
                        i7 = -1347219714;
                    }
                case 759039680:
                case 1804500926:
                    if (C10975.m27285()) {
                        m2566 = (i4 - C2105.m6981("ܺۤ")) * (-117);
                        i6 = ((m2566 ^ i5) * (-23631)) ^ 1586294433;
                        i7 = -341651639;
                    } else {
                        m2566 = C0630.m2566("᩷۬") ^ i5;
                        i6 = ((m2566 ^ i4) * 24499) ^ 1759271052;
                        i7 = 1983971251;
                    }
                case 853520473:
                case 1981236081:
                    C22124.m49722((InterfaceC20008) c12951, i);
                    if (C4616.m13552() != 0) {
                        m2566 = (C2105.m6981("ۤۚ") ^ i5) * (-59);
                        i6 = ((m2566 ^ i4) * (-18827)) ^ (-1806472100);
                        i7 = 151191843;
                    } else {
                        m2566 = C2105.m6981("ܺ֨") ^ i4;
                        i6 = ((m2566 ^ i5) * (-9565)) ^ (-572305955);
                        i7 = 1666295100;
                    }
                case 1182251976:
                case 1888501438:
                    if (c16475.f50638) {
                        m2566 = (i4 - C2105.m6981("ܺۤ")) * (-117);
                        i6 = ((m2566 ^ i5) * (-23631)) ^ 1586294433;
                        i7 = -341651639;
                    } else {
                        m2566 = (C0630.m2566("۟ۙ") ^ i4) * 47;
                        i6 = ((m2566 ^ i5) * (-2739)) ^ 801269231;
                        i7 = -1910402606;
                    }
                default:
                    c12951 = C12951.m31485(bArr);
                    i = 1382253410;
                    if (C0382.f1805) {
                        m2566 = C2105.m6981("᩹ۜ") ^ i4;
                        i6 = ((m2566 ^ i5) * 21797) ^ 651243798;
                        i7 = -471901919;
                    } else {
                        m2566 = (C2105.m6981("ۤۚ") ^ i5) * (-59);
                        i6 = ((m2566 ^ i4) * (-18827)) ^ (-1806472100);
                        i7 = 151191843;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:17:0x00a1, code lost:
    
        if (l.C2520.m8026() != false) goto L25;
     */
    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    private void m38817() {
        /*
            Method dump skipped, instructions count: 1226
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16475.m38817():void");
    }
}
