package l;

import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: 12B7 */
/* renamed from: l.ܽ᩸᩷, reason: contains not printable characters */
/* loaded from: classes5.dex */
public final class C16919 extends C20500 {
    /* JADX WARN: Code restructure failed: missing block: B:13:0x0057, code lost:
    
        if (l.RunnableC3474.f10992 <= 0) goto L69;
     */
    /* JADX WARN: Code restructure failed: missing block: B:35:0x0185, code lost:
    
        r10 = (l.C2105.m6981("ۛ᩸") + r9) * 73;
        r11 = ((r10 ^ r8) * (-22929)) ^ 239120533;
        r12 = 1846010842;
     */
    @Override // l.AbstractC23919, l.InterfaceC5575
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo15333(l.InterfaceC3458 r15) {
        /*
            Method dump skipped, instructions count: 728
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C16919.mo15333(l.ۗ᩶ۘ):void");
    }

    @Override // l.C20500, l.AbstractC23919, l.InterfaceC5575
    /* renamed from: ֫ */
    public final void mo15841(C3004 c3004) {
        float f = 0.0f;
        int i = 892330634;
        int i2 = C3019.f9544;
        int i3 = C3245.f10203;
        int m6981 = C2105.m6981("᩵ۜ") ^ i2;
        int i4 = ((m6981 ^ i3) * (-7187)) ^ (-1870448409);
        int i5 = -696352069;
        while (true) {
            i = ((((i ^ i3) * 22993) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2094881124:
                case -582676527:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = (C2105.m6981("ܳ᩹") + i3) * (-117);
                        i4 = ((m6981 ^ i2) * 9887) ^ 1898081298;
                        i5 = 1490544925;
                    }
                case -2026730831:
                case -257914081:
                    if (C0050.m940() <= 0) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = C2105.m6981("ܰܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * 453) ^ 91997235;
                        i5 = -1751989977;
                    }
                case -1818221952:
                case -637256955:
                    if (C3432.f10845 >= 0) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = (C0630.m2566("᩸۟") ^ i2) * 123;
                        i4 = ((m6981 ^ i3) * 24719) ^ (-362257272);
                        i5 = -1896584546;
                    }
                case -1809497640:
                case 1021959320:
                    C21923.m49329();
                    break;
                case -1700147403:
                case -810235168:
                    c3004.m9159(C1294.m4384(f));
                    c3004.m9162();
                    break;
                case -1545624557:
                case -837818000:
                    if (C7106.f21815 != 0) {
                        m6981 = C0630.m2566("᩸֨") ^ i2;
                        i4 = ((m6981 ^ i3) * (-15783)) ^ (-1464950744);
                        i5 = 2038952472;
                    } else {
                        m6981 = (C0630.m2566("ۧ᩵") ^ i2) * (-105);
                        i4 = ((m6981 ^ i3) * (-25925)) ^ (-317182221);
                        i5 = 199735470;
                    }
                case -1307584332:
                case 1686007662:
                    C0483.m2121();
                    m6981 = C0630.m2566("᩸֨") ^ i2;
                    i4 = ((m6981 ^ i3) * (-15783)) ^ (-1464950744);
                    i5 = 2038952472;
                case -1227739072:
                case 2050207450:
                    if (C0798.f2919) {
                        m6981 = C0630.m2566("ۛ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14801)) ^ 47696751;
                        i5 = -382728907;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۗۚ")) * (-29);
                        i4 = ((m6981 ^ i2) * 18673) ^ 1783033187;
                        i5 = 648987127;
                    }
                case -714372993:
                case -166399353:
                    if (C1047.f3863 < 0) {
                        m6981 = C0630.m2566("᩸֨") ^ i2;
                        i4 = ((m6981 ^ i3) * (-15783)) ^ (-1464950744);
                        i5 = 2038952472;
                    } else {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    }
                case 76634036:
                case 813148700:
                    C11340.m28031();
                    if (C1504.f5354) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = (i3 - C2105.m6981("᩸ۢ")) * (-35);
                        i4 = ((m6981 ^ i2) * (-10353)) ^ 975226194;
                        i5 = -1076954175;
                    }
                case 155620674:
                case 1258531031:
                    if (C4263.f13799 > 0) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = C0630.m2566("ۛ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14801)) ^ 47696751;
                        i5 = -382728907;
                    }
                case 217988419:
                case 1724880519:
                    super.mo15841(c3004);
                    if (C0714.f2697 >= 0) {
                        m6981 = (C2105.m6981("ۨܶ") ^ i2) * (-27);
                        i4 = ((m6981 ^ i3) * (-28019)) ^ (-1534172269);
                        i5 = -423978316;
                    } else {
                        m6981 = C0630.m2566("ۢۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 979) ^ 324283095;
                        i5 = 1195115102;
                    }
                case 777730712:
                case 1004286028:
                    if (C1420.f5096 <= 0) {
                        m6981 = (C2105.m6981("᩵۫") + i3) * 79;
                        i4 = ((m6981 ^ i2) * (-28041)) ^ 1024542084;
                        i5 = -1072698228;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۛۙ")) * (-61);
                        i4 = ((m6981 ^ i3) * (-22161)) ^ (-1438118716);
                        i5 = 725168587;
                    }
                case 806070356:
                case 1056376344:
                    if (C1773.f6144 <= 0) {
                        m6981 = (C2105.m6981("ۨܶ") ^ i2) * (-27);
                        i4 = ((m6981 ^ i3) * (-28019)) ^ (-1534172269);
                        i5 = -423978316;
                    } else {
                        m6981 = C0630.m2566("֨ۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16175)) ^ (-602743075);
                        i5 = -1311126360;
                    }
                case 1267685117:
                case 1754586619:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = (C2105.m6981("ۨܶ") ^ i2) * (-27);
                        i4 = ((m6981 ^ i3) * (-28019)) ^ (-1534172269);
                        i5 = -423978316;
                    } else {
                        m6981 = (i3 - C2105.m6981("۬ۢ")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m6981 ^ i2) * (-4231)) ^ (-260891008);
                        i5 = 43894257;
                    }
                default:
                    f = 18.0f;
                    if (C1420.f5096 <= 0) {
                        m6981 = (C2105.m6981("ۨܶ") ^ i2) * (-27);
                        i4 = ((m6981 ^ i3) * (-28019)) ^ (-1534172269);
                        i5 = -423978316;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۨ֫")) * (-103);
                        i4 = ((m6981 ^ i2) * (-26947)) ^ (-123782228);
                        i5 = -1154738520;
                    }
            }
            return;
        }
    }
}
