package l;

/* compiled from: J2SS */
/* renamed from: l.֫ܳ᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class C1893 implements Comparable {

    /* renamed from: ܿ᩻ۚ, reason: not valid java name and contains not printable characters */
    private static final short[] f6402 = {4171, 25362, 25365, 7043, 15006, 2963, 25362, 25375};

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final String f6403;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final String f6404;

    @Override // java.lang.Comparable
    /* renamed from: ֫, reason: not valid java name and contains not printable characters and merged with bridge method [inline-methods] */
    public final int compareTo(C1893 c1893) {
        String str = null;
        int i = 58666664;
        int i2 = C2520.f8000;
        int i3 = C7811.f24123;
        int m2566 = C0630.m2566("ۤۛ") ^ i2;
        int i4 = ((m2566 ^ i3) * 24111) ^ (-1476867261);
        int i5 = 504246304;
        while (true) {
            i = ((((i ^ i3) * 10623) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1784011773:
                case -400046564:
                    if (C1294.f4556 >= 0) {
                        m2566 = (i3 - C0630.m2566("᩵֡")) * (-31);
                        i4 = ((m2566 ^ i2) * (-5435)) ^ 1911610403;
                        i5 = 2080880614;
                    } else {
                        m2566 = C2105.m6981("ۗ᩷") ^ i2;
                        i4 = ((m2566 ^ i3) * 2933) ^ 354573768;
                        i5 = -353126356;
                    }
                case -1675094207:
                case 1044378246:
                    if (C0964.f3626 != 0) {
                        m2566 = C0630.m2566("ۨܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31155)) ^ 975995588;
                        i5 = -1893871038;
                    } else {
                        m2566 = (C2105.m6981("ۤ۠") + i2) * 33;
                        i4 = ((m2566 ^ i3) * 4851) ^ 1902024678;
                        i5 = 559571765;
                    }
                case -1479235668:
                case 412798187:
                    C0630.m2564();
                    m2566 = C0630.m2566("ᩴܺ") ^ i2;
                    i4 = ((m2566 ^ i3) * 20739) ^ (-1913567165);
                    i5 = 668613436;
                case -1401042898:
                case 1723467666:
                    C2958.m9034();
                    C4263.m12819();
                    return 0;
                case -1106723620:
                case 1513741525:
                    if (C4075.f12947 < 0) {
                        m2566 = C0630.m2566("ᩴܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 20739) ^ (-1913567165);
                        i5 = 668613436;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۘܰ")) * 65;
                        i4 = ((m2566 ^ i2) * (-8919)) ^ 1604249460;
                        i5 = 896575812;
                    }
                case -840870306:
                case 1411532007:
                    if (C3019.m9255() <= 0) {
                        m2566 = C0630.m2566("ۨܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31155)) ^ 975995588;
                        i5 = -1893871038;
                    } else {
                        m2566 = C0630.m2566("ܺ᩻") ^ i3;
                        i4 = ((m2566 ^ i2) * (-21691)) ^ 547661213;
                        i5 = -1882206912;
                    }
                case -788867850:
                case 1921216086:
                    str = this.f6403;
                    if (C0714.m2805()) {
                        m2566 = C0630.m2566("ۜۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * 23061) ^ (-981612988);
                        i5 = -938223871;
                    } else {
                        m2566 = C0630.m2566("ۨܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31155)) ^ 975995588;
                        i5 = -1893871038;
                    }
                case -662829226:
                case 1411530933:
                    if (C1711.f5919) {
                        m2566 = (i3 - C0630.m2566("᩵֡")) * (-31);
                        i4 = ((m2566 ^ i2) * (-5435)) ^ 1911610403;
                        i5 = 2080880614;
                    } else {
                        m2566 = C2105.m6981("۟ᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-3577)) ^ 898485969;
                        i5 = 1979907031;
                    }
                case -652932771:
                case 139233720:
                    if (C3019.f9544 >= 0) {
                        m2566 = (i3 - C0630.m2566("᩵֡")) * (-31);
                        i4 = ((m2566 ^ i2) * (-5435)) ^ 1911610403;
                        i5 = 2080880614;
                    } else {
                        m2566 = C0630.m2566("۫᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * 6081) ^ 86486337;
                        i5 = 1178955489;
                    }
                case -141041387:
                case 138128381:
                    if (C1047.f3863 < 0) {
                        m2566 = (i3 - C0630.m2566("ۘܰ")) * 65;
                        i4 = ((m2566 ^ i2) * (-8919)) ^ 1604249460;
                        i5 = 896575812;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۨۘ")) * (-103);
                        i4 = ((m2566 ^ i3) * 20639) ^ (-846761388);
                        i5 = -1959422447;
                    }
                case -89938858:
                case 553672165:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = C0630.m2566("ۨܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31155)) ^ 975995588;
                        i5 = -1893871038;
                    } else {
                        m2566 = (C0630.m2566("۟᩶") ^ i3) * (-63);
                        i4 = ((m2566 ^ i2) * (-4175)) ^ 1127711608;
                        i5 = 674523727;
                    }
                case -39396106:
                case 1004244717:
                    if (C3019.f9544 >= 0) {
                        m2566 = (i3 - C0630.m2566("ۘܰ")) * 65;
                        i4 = ((m2566 ^ i2) * (-8919)) ^ 1604249460;
                        i5 = 896575812;
                    } else {
                        m2566 = C0630.m2566("᩻ᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8143)) ^ (-1825320770);
                        i5 = 1759937346;
                    }
                case 447741614:
                case 1136116947:
                    return str.compareTo(c1893.f6403);
                case 500298879:
                case 1788239907:
                    if (C7811.m20844() != 0) {
                        m2566 = C0630.m2566("ᩴܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 20739) ^ (-1913567165);
                        i5 = 668613436;
                    } else {
                        m2566 = (C0630.m2566("ۤܿ") ^ i3) * (-43);
                        i4 = ((m2566 ^ i2) * 4033) ^ 1755573816;
                        i5 = -867080646;
                    }
                case 988188703:
                case 1633132280:
                    if (C1504.f5354) {
                        m2566 = (i3 - C0630.m2566("᩵֡")) * (-31);
                        i4 = ((m2566 ^ i2) * (-5435)) ^ 1911610403;
                        i5 = 2080880614;
                    } else {
                        m2566 = C2105.m6981("ۙܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-1711)) ^ (-1364763065);
                        i5 = -439198075;
                    }
                default:
                    if (C7811.m20844() == 0) {
                        m2566 = (i3 - C0630.m2566("ۘܰ")) * 65;
                        i4 = ((m2566 ^ i2) * (-8919)) ^ 1604249460;
                        i5 = 896575812;
                    } else {
                        m2566 = (i3 - C0630.m2566("᩵֡")) * (-31);
                        i4 = ((m2566 ^ i2) * (-5435)) ^ 1911610403;
                        i5 = 2080880614;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:26:0x005a, code lost:
    
        if (l.C4159.f13567 != false) goto L73;
     */
    /* JADX WARN: Code restructure failed: missing block: B:35:0x0080, code lost:
    
        if (l.C4117.f13076 > 0) goto L77;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.lang.String m6236() {
        /*
            Method dump skipped, instructions count: 968
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C1893.m6236():java.lang.String");
    }

    public C1893(String str, String str2) {
        int i = 2043010725;
        int i2 = C3537.f11231;
        int i3 = C1294.f4556;
        int m2566 = C0630.m2566("᩵᩶") ^ i2;
        int i4 = ((m2566 ^ i3) * 9473) ^ 1739967984;
        int i5 = 1658273289;
        while (true) {
            i = ((((i ^ i3) * (-7395)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2061008196:
                case 1471439043:
                    if (C0422.m1963()) {
                        m2566 = C2105.m6981("ۛۖ") ^ i3;
                        i4 = ((m2566 ^ i2) * 7397) ^ (-260064613);
                        i5 = 2081615336;
                    } else {
                        m2566 = C0630.m2566("᩺֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 15571) ^ 1386526826;
                        i5 = -1785668949;
                    }
                case -2058205908:
                case -1609644400:
                    if (C1773.f6144 <= 0) {
                        m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                        i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                        i5 = -491727299;
                    } else {
                        m2566 = (i2 - C2105.m6981("ܿۚ")) * 99;
                        i4 = ((m2566 ^ i3) * (-10927)) ^ 84326009;
                        i5 = 1300389070;
                    }
                case -2000026158:
                case -1284670238:
                    this.f6403 = str;
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (i2 - C2105.m6981("۠ᩴ")) * (-87);
                        i4 = ((m2566 ^ i3) * 15661) ^ 972849321;
                        i5 = 41741328;
                    } else {
                        m2566 = (C0630.m2566("۬ۤ") + i3) * 61;
                        i4 = ((m2566 ^ i2) * 5427) ^ (-963178245);
                        i5 = 807037179;
                    }
                case -1813859856:
                case 1757617067:
                    this.f6404 = str2;
                    return;
                case -1741985055:
                case -753237864:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                        i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                        i5 = -491727299;
                    } else {
                        m2566 = (C0630.m2566("ᩳ֨") + i2) * (-87);
                        i4 = ((m2566 ^ i3) * (-13953)) ^ (-630076688);
                        i5 = -1545664246;
                    }
                case -1331736106:
                case -1206726090:
                    if (C3245.f10203 > 0) {
                        m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                        i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                        i5 = -491727299;
                    } else {
                        m2566 = C0630.m2566("᩸ܳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 2753) ^ 218867576;
                        i5 = -39441507;
                    }
                case -1253368835:
                case -175967506:
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = C0630.m2566("᩺֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 15571) ^ 1386526826;
                        i5 = -1785668949;
                    } else {
                        m2566 = C2105.m6981("ᩴܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * 8785) ^ 813926387;
                        i5 = -943155511;
                    }
                case -734340223:
                case 833103856:
                    if (C5695.f17556 >= 0) {
                        m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                        i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                        i5 = -491727299;
                    } else {
                        m2566 = (i2 - C2105.m6981("۠ᩴ")) * (-87);
                        i4 = ((m2566 ^ i3) * 15661) ^ 972849321;
                        i5 = 41741328;
                    }
                case -402845655:
                case 450578493:
                    if (C1916.m6308() >= 0) {
                        m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                        i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                        i5 = -491727299;
                    } else {
                        m2566 = C0630.m2566("۠ۘ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-27123)) ^ (-941810796);
                        i5 = -929622371;
                    }
                case 180841524:
                case 808309731:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = C0630.m2566("᩺֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 15571) ^ 1386526826;
                        i5 = -1785668949;
                    } else {
                        m2566 = C2105.m6981("ܳۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * 4991) ^ 782699588;
                        i5 = -371772106;
                    }
                case 422494511:
                case 577454206:
                    if (C5695.f17556 >= 0) {
                        m2566 = C0630.m2566("᩺֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 15571) ^ 1386526826;
                        i5 = -1785668949;
                    } else {
                        m2566 = C0630.m2566("ܰ᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * (-28673)) ^ (-1691132908);
                        i5 = -344906243;
                    }
                case 570452015:
                case 1387111949:
                    C2167.m7155();
                    m2566 = (C0630.m2566("ᩳۙ") + i2) * (-43);
                    i4 = ((m2566 ^ i3) * (-17459)) ^ 186640414;
                    i5 = -491727299;
                case 667993709:
                case 740361996:
                    C2272.m7503();
                    throw new RuntimeException();
                case 723297195:
                case 983258865:
                    if (C1504.m5179()) {
                        m2566 = (i2 - C2105.m6981("۠ᩴ")) * (-87);
                        i4 = ((m2566 ^ i3) * 15661) ^ 972849321;
                        i5 = 41741328;
                    } else {
                        m2566 = C0630.m2566("ۙۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-23361)) ^ 586252428;
                        i5 = -1633662215;
                    }
                case 749140573:
                case 1148807838:
                    if (RunnableC1937.m6387() != 0) {
                        m2566 = C0630.m2566("᩺֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 15571) ^ 1386526826;
                        i5 = -1785668949;
                    } else {
                        m2566 = (C2105.m6981("᩷᩹") ^ i3) * 95;
                        i4 = ((m2566 ^ i2) * 16491) ^ 1302092168;
                        i5 = -4833629;
                    }
                default:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m2566 = (i2 - C2105.m6981("۠ᩴ")) * (-87);
                        i4 = ((m2566 ^ i3) * 15661) ^ 972849321;
                        i5 = 41741328;
                    } else {
                        m2566 = (i2 - C2105.m6981("ܽۖ")) * (-3);
                        i4 = ((m2566 ^ i3) * (-26139)) ^ 1463724205;
                        i5 = 1067223856;
                    }
            }
        }
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final String m6237() {
        return this.f6403;
    }

    public final String getValue() {
        return this.f6404;
    }
}
