package l;

import com.google.android.material.slider.BaseSlider;
import java.util.Collections;
import java.util.List;

/* compiled from: Q1PE */
/* renamed from: l.֫ܺۢ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class C1926 {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f6460 = 0;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public static boolean f6462;

    /* renamed from: ᩴܶۙ, reason: not valid java name and contains not printable characters */
    private static final short[] f6463 = {3930, -2133, 598, 10912, 8680, 3251, 2617, 7370, 5350, -14267, -12801, -13504, 3111, -30483, 18525, 27499, 1658, 1635, 1639, 1594, 1636, 1635, 1656, 1637, 1650, 1593, 1658, 1635, 1573, 1593, 1652, 1657, 1658, 1635, 1594, 1639, 1637, 1656, 1635, 1650, 1652, 1635, 1593, 1656, 1636, 1636, 1594, 1654, 1652, 1652, 1650, 1659, 1650, 1637, 1654, 1635, 1650, 1593, 1654, 1659, 1662, 1646, 1634, 1657, 1652, 1636, 1593, 1652, 1656, 1658, 609, -19315, 29462, 19552, 15654, 15679, 15675, 15718, 15672, 15679, 15652, 15673, 15662, 15717, 15654, 15679, 15737, 15717, 15656, 15653, 15654, 15679, 15718, 15675, 15673, 15652, 15679, 15662, 15656, 15679, 15717, 15652, 15672, 15672, 15718, 15658, 15656, 15656, 15662, 15655, 15662, 15673, 15658, 15679, 15662, 15717, 15658, 15655, 15650, 15666, 15678, 15653, 15656, 15672, 15717, 15656, 15652, 15654, 8869, -19238, -17217, -21182};

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static List f6461 = Collections.EMPTY_LIST;

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static int m6338(String str, C9688 c9688) {
        boolean z;
        int i;
        int m2566;
        int i2;
        int i3;
        int m25662;
        int i4;
        int i5;
        int i6;
        int i7;
        int i8;
        int i9;
        int m6981;
        int i10;
        int i11;
        int i12 = C0050.f910;
        int i13 = C1128.f4106;
        int m69812 = (i12 - C2105.m6981("ܽ᩻")) * 119;
        int i14 = ((m69812 ^ i13) * 13269) ^ (-55459938);
        short[] sArr = null;
        int i15 = m69812 ^ (-685993650);
        boolean z2 = false;
        short s = 0;
        int i16 = 0;
        int i17 = 0;
        short s2 = 0;
        int i18 = 0;
        int i19 = 1414060853;
        C23881 c23881 = null;
        C11099 c11099 = null;
        String str2 = null;
        String str3 = null;
        C18237 c18237 = null;
        while (true) {
            i19 = i15 ^ (i14 & (((i19 ^ i13) * 15047) >> 31));
            switch (i19) {
                case -2015410628:
                case -1815142359:
                    z = z2;
                    i = i16;
                    C1773.m5907(c18237, str2);
                    C1773.m5907(c18237, c9688.f29295);
                    c11099 = c9688.f29299;
                    if (C0237.f1507 != 0) {
                        m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                        i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                        i5 = -163809067;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    } else {
                        m2566 = (C2105.m6981("۬᩸") ^ i12) * (-99);
                        i2 = ((m2566 ^ i13) * (-3105)) ^ 71864492;
                        i3 = 123528988;
                        int i20 = m2566 ^ i3;
                        z2 = z;
                        i16 = i;
                        i15 = i20;
                        i14 = i2;
                    }
                case -2011085496:
                case -1334965273:
                    z = z2;
                    i = i16;
                    C0483.m2120(c18237, str);
                    str3 = c9688.f29296;
                    if (C3432.f10845 < 0) {
                        m25662 = (C0630.m2566("ܽ᩹") + i12) * (-37);
                        i4 = ((m25662 ^ i13) * (-14641)) ^ 313755200;
                        i5 = -1299370203;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    }
                    m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                    i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                    i5 = -163809067;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case -1487891995:
                case 201846820:
                    z = z2;
                    i = i16;
                    sArr = f6463;
                    if (C0382.f1805) {
                        m25662 = C0630.m2566("ܰۙ") ^ i12;
                        i4 = ((m25662 ^ i13) * 2445) ^ (-1536545667);
                        i5 = 301405085;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    } else {
                        z2 = z;
                        m6981 = C2105.m6981("ܳ᩶") ^ i13;
                        i10 = ((m6981 ^ i12) * (-1327)) ^ 861592625;
                        i11 = 1800774857;
                        i15 = m6981 ^ i11;
                        i14 = i10;
                        i16 = i;
                    }
                case -1350774222:
                case -1040149514:
                    short[] sArr2 = f6463;
                    z = z2;
                    if (RunnableC1108.f4040) {
                        i = i16;
                        String m16034 = C5695.m16034(sArr2, 1, 3, i18);
                        if (C4159.f13567) {
                            throw new C1637(RunnableC3474.m10631(c23881, C0630.m2566(m16034) ^ 2097750397));
                        }
                    } else {
                        i = i16;
                    }
                    z2 = z;
                    m6981 = C2105.m6981("ܳ᩶") ^ i13;
                    i10 = ((m6981 ^ i12) * (-1327)) ^ 861592625;
                    i11 = 1800774857;
                    i15 = m6981 ^ i11;
                    i14 = i10;
                    i16 = i;
                case -1144581202:
                case 2107032277:
                    if (C4263.m12819() < 0) {
                        z = z2;
                        i = i16;
                        m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                        i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                        i5 = -163809067;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    } else {
                        int m69813 = (C2105.m6981("᩹۟") ^ i12) * (-123);
                        i2 = ((m69813 ^ i13) * (-30073)) ^ 690931046;
                        i15 = m69813 ^ 1286745597;
                        i14 = i2;
                    }
                case -915165832:
                case 1175349827:
                    z = z2;
                    i = i16;
                    C1773.m5907(c18237, str3);
                    C0483.m2120(c18237, c9688.f29298);
                    str2 = c9688.f29297;
                    if (C2105.m6982() != 0) {
                        i16 = i;
                        i8 = C2105.m6981("ۧۨ") ^ i12;
                        i7 = ((i8 ^ i13) * 27705) ^ 1809722399;
                        i6 = -797422960;
                        i9 = i8 ^ i6;
                        i14 = i7;
                        z2 = z;
                        i15 = i9;
                    } else {
                        m2566 = (i13 - C0630.m2566("ۧۖ")) * 55;
                        i2 = ((m2566 ^ i12) * 30133) ^ 1455923409;
                        i3 = 1205934934;
                        int i202 = m2566 ^ i3;
                        z2 = z;
                        i16 = i;
                        i15 = i202;
                        i14 = i2;
                    }
                case -795249028:
                case 1783084901:
                    if (C3245.f10203 > 0) {
                        z = z2;
                        i = i16;
                        m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                        i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                        i5 = -163809067;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    } else {
                        i = i16;
                        m6981 = C2105.m6981("ܳ᩶") ^ i13;
                        i10 = ((m6981 ^ i12) * (-1327)) ^ 861592625;
                        i11 = 1800774857;
                        i15 = m6981 ^ i11;
                        i14 = i10;
                        i16 = i;
                    }
                case -795174936:
                case 1060071903:
                    z = z2;
                    i = i16;
                    m6339();
                    c18237 = C2272.m7511(4166);
                    if (C11340.f33930 < 0) {
                        m25662 = C0630.m2566("ᩴۜ") ^ i12;
                        i4 = ((m25662 ^ i13) * 31793) ^ 2054375124;
                        i5 = 1288186948;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    }
                    m25662 = (i13 - C2105.m6981("ۡۡ")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                    i4 = ((m25662 ^ i12) * (-15279)) ^ (-2001071608);
                    i5 = 1479925862;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case -753219583:
                case 1531640040:
                    z = z2;
                    i = i16;
                    if ((s * s2) - i17 <= 0) {
                        m25662 = (C0630.m2566("᩵ۖ") ^ i12) * 95;
                        i4 = ((m25662 ^ i13) * 1129) ^ 1611220562;
                        i5 = -1088955371;
                    } else {
                        m25662 = (i13 - C0630.m2566("ۜܺ")) * 63;
                        i4 = ((m25662 ^ i12) * (-14883)) ^ 692933762;
                        i5 = -1287964958;
                    }
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case -742362493:
                case 1915462597:
                    C15972.m37763(c23881.m52613());
                    return c23881.m52605();
                case -723768397:
                case 1674664610:
                    C2126.m7040();
                    z = z2;
                    i = i16;
                    m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                    i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                    i5 = -163809067;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case -600496905:
                case 752716602:
                    if (C0964.f3626 == 0) {
                        int m698132 = (C2105.m6981("᩹۟") ^ i12) * (-123);
                        i2 = ((m698132 ^ i13) * (-30073)) ^ 690931046;
                        i15 = m698132 ^ 1286745597;
                        i14 = i2;
                    } else {
                        z = z2;
                        i = i16;
                        m25662 = (i13 - C2105.m6981("ۡۡ")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m25662 ^ i12) * (-15279)) ^ (-2001071608);
                        i5 = 1479925862;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    }
                case -510999776:
                case -313332865:
                    i = i16;
                    z2 = false;
                    if (C3019.f9544 < 0) {
                        m6981 = (C2105.m6981("᩺ܳ") ^ i13) * 49;
                        i10 = ((m6981 ^ i12) * 16379) ^ 1579112952;
                        i11 = -1999447102;
                        i15 = m6981 ^ i11;
                        i14 = i10;
                        i16 = i;
                    }
                    m6981 = C2105.m6981("ܳ᩶") ^ i13;
                    i10 = ((m6981 ^ i12) * (-1327)) ^ 861592625;
                    i11 = 1800774857;
                    i15 = m6981 ^ i11;
                    i14 = i10;
                    i16 = i;
                case -255996381:
                case 16927180:
                    z = z2;
                    i = i16;
                    i17 = i + 130370724;
                    s2 = 22836;
                    if (C0422.f1886 > 0) {
                        m25662 = (i12 - C2105.m6981("ۖ᩶")) * (-107);
                        i4 = ((m25662 ^ i13) * (-26011)) ^ (-1385345278);
                        i5 = -1267029050;
                        i9 = m25662 ^ i5;
                        i14 = i4;
                        z2 = z;
                        i16 = i;
                        i15 = i9;
                    }
                    m25662 = (C2105.m6981("᩹᩵") + i12) * (-53);
                    i4 = ((m25662 ^ i13) * (-6753)) ^ (-1886423001);
                    i5 = -163809067;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case 281026788:
                case 1193145976:
                    C4616.m13552();
                    C2105.m6982();
                    return 0;
                case 691035811:
                case 1686863989:
                    z = z2;
                    s = sArr[z ? 1 : 0];
                    i16 = s * s;
                    if (C0714.f2697 < 0) {
                        i8 = (C0630.m2566("ۢۨ") + i13) * (-39);
                        i7 = ((i8 ^ i12) * 25493) ^ (-192412074);
                        i6 = 1132236797;
                        i9 = i8 ^ i6;
                        i14 = i7;
                        z2 = z;
                        i15 = i9;
                    }
                    i8 = C2105.m6981("ۧۨ") ^ i12;
                    i7 = ((i8 ^ i13) * 27705) ^ 1809722399;
                    i6 = -797422960;
                    i9 = i8 ^ i6;
                    i14 = i7;
                    z2 = z;
                    i15 = i9;
                case 761096415:
                case 2126506339:
                    z = z2;
                    i = i16;
                    i18 = 31960;
                    m25662 = C0630.m2566("ۡۘ") ^ i13;
                    i4 = ((m25662 ^ i12) * 4361) ^ 1021980931;
                    i5 = -669103049;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
                case 912497510:
                case 1284065175:
                    z = z2;
                    i = i16;
                    C1773.m5907(c18237, c11099.m27532());
                    c23881 = RunnableC0588.m2437(c18237);
                    if (C0483.m2131(c23881)) {
                        m2566 = (C0630.m2566("۠᩻") ^ i13) * (-63);
                        i2 = ((m2566 ^ i12) * (-13019)) ^ (-493351810);
                        i3 = 881500432;
                    } else {
                        m2566 = C0630.m2566("ۡ۫") ^ i13;
                        i2 = ((m2566 ^ i12) * (-3947)) ^ (-1774038631);
                        i3 = -1476916784;
                    }
                    int i2022 = m2566 ^ i3;
                    z2 = z;
                    i16 = i;
                    i15 = i2022;
                    i14 = i2;
                default:
                    z = z2;
                    i = i16;
                    i18 = 34561;
                    m25662 = C0630.m2566("ۡۘ") ^ i13;
                    i4 = ((m25662 ^ i12) * 4361) ^ 1021980931;
                    i5 = -669103049;
                    i9 = m25662 ^ i5;
                    i14 = i4;
                    z2 = z;
                    i16 = i;
                    i15 = i9;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:26:0x009a, code lost:
    
        if (l.RunnableC1937.m6387() != 0) goto L9;
     */
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m6344() {
        /*
            Method dump skipped, instructions count: 1262
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C1926.m6344():void");
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static List m6343() {
        return f6461;
    }

    /* JADX WARN: Code restructure failed: missing block: B:45:0x0063, code lost:
    
        if (l.C21923.f70183 == 0) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:50:0x0071, code lost:
    
        if (l.C0714.f2697 >= 0) goto L14;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static java.lang.String[] m6341(l.AbstractC15440 r26, java.lang.String r27) {
        /*
            Method dump skipped, instructions count: 1040
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C1926.m6341(l.ܶ᩵ܿ, java.lang.String):java.lang.String[]");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static String[] m6342(C16742 c16742) {
        C18237 c18237;
        int i;
        int i2;
        short[] sArr;
        int i3;
        int m2566;
        int i4;
        int i5;
        C18237 c182372;
        C18237 c182373;
        int m6981;
        int i6;
        int i7;
        int m69812;
        int i8;
        int i9;
        short[] sArr2;
        int i10;
        int i11;
        int i12 = 0;
        int i13 = 0;
        C18237 c182374 = null;
        int i14 = 0;
        C23881 c23881 = null;
        String[] strArr = null;
        char c = 0;
        String str = null;
        String str2 = null;
        int i15 = -469793566;
        int i16 = RunnableC3474.f10992;
        int i17 = RunnableC0588.f2309;
        int m69813 = (i16 - C2105.m6981("᩻ۤ")) * 59;
        int i18 = ((m69813 ^ i17) * (-27409)) ^ (-666550677);
        int i19 = m69813 ^ (-1554646890);
        short[] sArr3 = null;
        short[] sArr4 = null;
        short[] sArr5 = null;
        short[] sArr6 = null;
        int i20 = 0;
        int i21 = 0;
        int i22 = 0;
        char c2 = 0;
        int i23 = 0;
        int i24 = 0;
        short s = 0;
        short s2 = 0;
        int i25 = 0;
        boolean z = false;
        int i26 = 0;
        while (true) {
            i15 = i19 ^ (i18 & (((i15 ^ i17) * (-22757)) >> 31));
            switch (i15) {
                case -1987436487:
                case 764408495:
                    C18237 c182375 = c182374;
                    sArr2 = sArr4;
                    i10 = i12;
                    i11 = 71;
                    i26 = 3;
                    if (C0382.f1805) {
                        int m69814 = C2105.m6981("ۡܶ") ^ i17;
                        i18 = ((m69814 ^ i16) * 30891) ^ 1867227819;
                        c182374 = c182375;
                        i19 = m69814 ^ 1570874789;
                        i12 = i10;
                        sArr4 = sArr2;
                        i25 = 71;
                    } else {
                        c182374 = c182375;
                        int m25662 = C0630.m2566("ܰۘ") ^ i16;
                        i8 = ((m25662 ^ i17) * (-21069)) ^ 1610772459;
                        i19 = m25662 ^ (-1514402990);
                        i12 = i10;
                        sArr4 = sArr2;
                        i25 = i11;
                        i18 = i8;
                    }
                case -1978733950:
                case 1986577768:
                    c182374 = C2272.m7511(4169);
                    i14 = c16742.f51388;
                    if (C3746.m11369() >= 0) {
                        i11 = i25;
                        sArr2 = sArr4;
                        i10 = i12;
                        int m256622 = C0630.m2566("ܰۘ") ^ i16;
                        i8 = ((m256622 ^ i17) * (-21069)) ^ 1610772459;
                        i19 = m256622 ^ (-1514402990);
                        i12 = i10;
                        sArr4 = sArr2;
                        i25 = i11;
                        i18 = i8;
                    } else {
                        int m69815 = C2105.m6981("ܳۛ") ^ i16;
                        i18 = ((m69815 ^ i17) * (-29491)) ^ (-1733130123);
                        i19 = m69815 ^ 1474895009;
                    }
                case -1973345364:
                case 1248486346:
                    strArr[c] = C3683.m11219(str, str2, C7106.m19110(sArr6, 90, 38, i20));
                    m69812 = C0630.m2566("۫ܺ") ^ i17;
                    i8 = ((m69812 ^ i16) * 14349) ^ 1694286674;
                    i9 = 1165569755;
                    i19 = m69812 ^ i9;
                    i18 = i8;
                case -1966227964:
                case -1686634987:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    if (i24 - (s * s2) < 0) {
                        m2566 = C0630.m2566("ܳܺ") ^ i16;
                        i4 = ((m2566 ^ i17) * (-10975)) ^ 97333339;
                        i5 = -908581975;
                    } else {
                        m2566 = C0630.m2566("ۘ֫") ^ i17;
                        i4 = ((m2566 ^ i16) * 25877) ^ (-453351689);
                        i5 = -968237309;
                    }
                    int i27 = m2566 ^ i5;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = i27;
                    i18 = i4;
                    i12 = i3;
                    sArr4 = sArr;
                    i25 = i;
                    c182374 = c182372;
                case -1957547512:
                case -1876526218:
                    throw new C1637(AbstractC2021.m6563(new C23881(i12), i13));
                case -1518319923:
                case -276592213:
                    str = strArr[c];
                    sArr5 = f6463;
                    i22 = 74;
                    i21 = 16;
                    if (C5695.m16023() < 0) {
                        m69812 = (i17 - C2105.m6981("۠ۙ")) * (-87);
                        i8 = ((m69812 ^ i16) * (-25969)) ^ (-1898315353);
                        i9 = 1776146300;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                    m69812 = C0630.m2566("ۢ֫") ^ i17;
                    i8 = ((m69812 ^ i16) * 5569) ^ 358839142;
                    i9 = 593646069;
                    i19 = m69812 ^ i9;
                    i18 = i8;
                case -1481280601:
                case -1366044904:
                    C3683.m11222();
                    AbstractC2021.m6574();
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    int m25663 = C0630.m2566("᩶ۨ") ^ i17;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = m25663 ^ 1440157352;
                    i18 = ((m25663 ^ i16) * 22059) ^ (-1822570692);
                    i12 = i12;
                    i25 = i;
                    c182374 = c182372;
                case -1473116061:
                case 1449153085:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    i20 = 2364;
                    m2566 = (C0630.m2566("ܿܽ") + i17) * (-121);
                    i4 = ((m2566 ^ i16) * 16601) ^ (-487030842);
                    i5 = 469847603;
                    int i272 = m2566 ^ i5;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = i272;
                    i18 = i4;
                    i12 = i3;
                    sArr4 = sArr;
                    i25 = i;
                    c182374 = c182372;
                case -1328335447:
                case -1000700289:
                    c18237 = c182374;
                    short[] sArr7 = sArr4;
                    i = i25;
                    i2 = i26;
                    i13 = C0630.m2566(C3746.m11357(sArr7, i, i2, i20)) ^ 2099059604;
                    if (z) {
                        sArr = sArr7;
                        m2566 = (C2105.m6981("ۡۢ") + i16) * 47;
                        i3 = i12;
                        i4 = ((m2566 ^ i17) * (-31197)) ^ 587469161;
                        i5 = 1897275098;
                        int i2722 = m2566 ^ i5;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = i2722;
                        i18 = i4;
                        i12 = i3;
                        sArr4 = sArr;
                        i25 = i;
                        c182374 = c182372;
                    } else {
                        int m69816 = C2105.m6981("ۤ᩵") ^ i17;
                        i18 = ((m69816 ^ i16) * 26403) ^ (-313495755);
                        i26 = i2;
                        i25 = i;
                        c182374 = c18237;
                        i19 = m69816 ^ 1916974871;
                        sArr4 = sArr7;
                    }
                case -1164348077:
                case -765157762:
                    if (RunnableC1937.f6483 < 0) {
                        c182373 = c182374;
                        m6981 = C2105.m6981("ܺܺ") ^ i16;
                        i6 = ((m6981 ^ i17) * 28859) ^ 192224137;
                        i7 = -814094859;
                        c182372 = c182373;
                        i19 = m6981 ^ i7;
                        i18 = i6;
                        c182374 = c182372;
                    }
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    int m256632 = C0630.m2566("᩶ۨ") ^ i17;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = m256632 ^ 1440157352;
                    i18 = ((m256632 ^ i16) * 22059) ^ (-1822570692);
                    i12 = i12;
                    i25 = i;
                    c182374 = c182372;
                case -1032123814:
                case -45821864:
                    str2 = C4117.m12355(sArr5, i22, i21, i20);
                    sArr6 = f6463;
                    if (!C3683.m11222()) {
                        m69812 = C2105.m6981("ۗۛ") ^ i16;
                        i8 = ((m69812 ^ i17) * 2331) ^ 186181156;
                        i9 = 729838723;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                    i11 = i25;
                    sArr2 = sArr4;
                    i10 = i12;
                    int m2566222 = C0630.m2566("ܰۘ") ^ i16;
                    i8 = ((m2566222 ^ i17) * (-21069)) ^ 1610772459;
                    i19 = m2566222 ^ (-1514402990);
                    i12 = i10;
                    sArr4 = sArr2;
                    i25 = i11;
                    i18 = i8;
                case -1000987817:
                case 265937250:
                    C2167.m7155();
                    if (C0237.f1507 != 0) {
                        c18237 = c182374;
                        i = i25;
                        i2 = i26;
                        int m2566322 = C0630.m2566("᩶ۨ") ^ i17;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = m2566322 ^ 1440157352;
                        i18 = ((m2566322 ^ i16) * 22059) ^ (-1822570692);
                        i12 = i12;
                        i25 = i;
                        c182374 = c182372;
                    } else {
                        m69812 = C2105.m6981("ܺۤ") ^ i16;
                        i8 = ((m69812 ^ i17) * (-21819)) ^ (-1604375766);
                        i9 = 132385466;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                case -941202888:
                case 171617541:
                    throw new C1637(RunnableC3474.m10631(c23881, i13));
                case -869283275:
                case -445667815:
                    C4075.m12263();
                    C1047.m3599();
                    return null;
                case -792112467:
                case 1605564799:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    i20 = 15691;
                    m2566 = (C0630.m2566("ܿܽ") + i17) * (-121);
                    i4 = ((m2566 ^ i16) * 16601) ^ (-487030842);
                    i5 = 469847603;
                    int i27222 = m2566 ^ i5;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = i27222;
                    i18 = i4;
                    i12 = i3;
                    sArr4 = sArr;
                    i25 = i;
                    c182374 = c182372;
                case -677665316:
                case 856385306:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    sArr3 = f6463;
                    c2 = 'F';
                    if (C4117.f13076 > 0) {
                        m2566 = C0630.m2566("ۨ۬") ^ i16;
                        i4 = ((m2566 ^ i17) * 5347) ^ (-437718280);
                        i5 = -1981634145;
                        int i272222 = m2566 ^ i5;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = i272222;
                        i18 = i4;
                        i12 = i3;
                        sArr4 = sArr;
                        i25 = i;
                        c182374 = c182372;
                    }
                    i12 = i3;
                    sArr4 = sArr;
                    int m25663222 = C0630.m2566("᩶ۨ") ^ i17;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = m25663222 ^ 1440157352;
                    i18 = ((m25663222 ^ i16) * 22059) ^ (-1822570692);
                    i12 = i12;
                    i25 = i;
                    c182374 = c182372;
                case -595456805:
                case 1026149440:
                    return strArr;
                case -402081482:
                case 1400054172:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    s = sArr3[c2];
                    i23 = s * s;
                    if (ServiceConnectionC3453.f10921 < 0) {
                        m2566 = C2105.m6981("᩵۬") ^ i17;
                        i4 = ((m2566 ^ i16) * 23831) ^ (-1235508453);
                        i5 = -808220988;
                        int i2722222 = m2566 ^ i5;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = i2722222;
                        i18 = i4;
                        i12 = i3;
                        sArr4 = sArr;
                        i25 = i;
                        c182374 = c182372;
                    }
                    i12 = i3;
                    sArr4 = sArr;
                    int m256632222 = C0630.m2566("᩶ۨ") ^ i17;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = m256632222 ^ 1440157352;
                    i18 = ((m256632222 ^ i16) * 22059) ^ (-1822570692);
                    i12 = i12;
                    i25 = i;
                    c182374 = c182372;
                case -340150103:
                case 158005765:
                    c182373 = c182374;
                    if (C15972.m37767()) {
                        m6981 = (i17 - C2105.m6981("ܽ۫")) * 43;
                        i6 = ((m6981 ^ i16) * (-21747)) ^ (-111937600);
                        i7 = 770937141;
                    } else {
                        m6981 = (C0630.m2566("۬᩸") ^ i16) * (-105);
                        i6 = ((m6981 ^ i17) * 17359) ^ 331939522;
                        i7 = -1601837921;
                    }
                    c182372 = c182373;
                    i19 = m6981 ^ i7;
                    i18 = i6;
                    c182374 = c182372;
                case -253851266:
                case 900530192:
                    c182373 = c182374;
                    if (C2105.f7037 == 0) {
                        throw new C1637(AbstractC2021.m6563(new C23881(1702), i13));
                    }
                    m6981 = C2105.m6981("ܺܺ") ^ i16;
                    i6 = ((m6981 ^ i17) * 28859) ^ 192224137;
                    i7 = -814094859;
                    c182372 = c182373;
                    i19 = m6981 ^ i7;
                    i18 = i6;
                    c182374 = c182372;
                case 100778749:
                case 350723076:
                    strArr[1] = C1294.m4378(c23881);
                    if (f6462) {
                        m69812 = C0630.m2566("֫ᩳ") ^ i16;
                        i8 = ((m69812 ^ i17) * 25645) ^ (-367343612);
                        i9 = -999669432;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                    m69812 = C0630.m2566("۫ܺ") ^ i17;
                    i8 = ((m69812 ^ i16) * 14349) ^ 1694286674;
                    i9 = 1165569755;
                    i19 = m69812 ^ i9;
                    i18 = i8;
                case 778300511:
                case 1712202237:
                    RunnableC1108.m3790();
                    if (C2958.f9394 < 0) {
                        c18237 = c182374;
                        i = i25;
                        i2 = i26;
                        int m2566322222 = C0630.m2566("᩶ۨ") ^ i17;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = m2566322222 ^ 1440157352;
                        i18 = ((m2566322222 ^ i16) * 22059) ^ (-1822570692);
                        i12 = i12;
                        i25 = i;
                        c182374 = c182372;
                    } else {
                        m69812 = C0630.m2566("ۢ֫") ^ i17;
                        i8 = ((m69812 ^ i16) * 5569) ^ 358839142;
                        i9 = 593646069;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                case 906180356:
                case 1015282547:
                    c182374.m42490(i14);
                    c23881 = C3683.m11224(c182374);
                    if (C1773.m5916(c23881)) {
                        m69812 = C0630.m2566("ܶܳ") ^ i16;
                        i8 = ((m69812 ^ i17) * 3169) ^ (-599933417);
                        i9 = 189700219;
                    } else {
                        m69812 = (C0630.m2566("᩵֡") ^ i17) * 81;
                        i8 = ((m69812 ^ i16) * 30539) ^ 1492679511;
                        i9 = -1114871722;
                    }
                    i19 = m69812 ^ i9;
                    i18 = i8;
                case 916164740:
                case 1445675644:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    sArr = sArr4;
                    i3 = i12;
                    i24 = i23 + 10949481;
                    s2 = 6618;
                    if (C0964.f3626 == 0) {
                        m2566 = (i16 - C0630.m2566("᩹ۧ")) * (-81);
                        i4 = ((m2566 ^ i17) * (-21365)) ^ 2120337115;
                        i5 = -1630717404;
                        int i27222222 = m2566 ^ i5;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = i27222222;
                        i18 = i4;
                        i12 = i3;
                        sArr4 = sArr;
                        i25 = i;
                        c182374 = c182372;
                    }
                    i12 = i3;
                    sArr4 = sArr;
                    int m25663222222 = C0630.m2566("᩶ۨ") ^ i17;
                    i26 = i2;
                    c182372 = c18237;
                    i19 = m25663222222 ^ 1440157352;
                    i18 = ((m25663222222 ^ i16) * 22059) ^ (-1822570692);
                    i12 = i12;
                    i25 = i;
                    c182374 = c182372;
                case 1646501155:
                case 1789178731:
                    strArr = new String[i12];
                    c = 0;
                    strArr[0] = C1294.m4378(c23881);
                    if (C1005.f3721) {
                        m69812 = C2105.m6981("ᩳ᩸") ^ i17;
                        i8 = ((m69812 ^ i16) * 30153) ^ 733536550;
                        i9 = -1927336498;
                        i19 = m69812 ^ i9;
                        i18 = i8;
                    }
                    i11 = i25;
                    sArr2 = sArr4;
                    i10 = i12;
                    int m25662222 = C0630.m2566("ܰۘ") ^ i16;
                    i8 = ((m25662222 ^ i17) * (-21069)) ^ 1610772459;
                    i19 = m25662222 ^ (-1514402990);
                    i12 = i10;
                    sArr4 = sArr2;
                    i25 = i11;
                    i18 = i8;
                default:
                    c18237 = c182374;
                    i = i25;
                    i2 = i26;
                    z = C15972.m37751();
                    sArr4 = f6463;
                    if (C1005.f3721) {
                        int m25664 = C0630.m2566("ܿܿ") ^ i16;
                        i25 = i;
                        i26 = i2;
                        c182374 = c18237;
                        i19 = m25664 ^ (-396359052);
                        i18 = ((m25664 ^ i17) * 30681) ^ 898598916;
                        i12 = 2;
                    } else {
                        i12 = 2;
                        int m256632222222 = C0630.m2566("᩶ۨ") ^ i17;
                        i26 = i2;
                        c182372 = c18237;
                        i19 = m256632222222 ^ 1440157352;
                        i18 = ((m256632222222 ^ i16) * 22059) ^ (-1822570692);
                        i12 = i12;
                        i25 = i;
                        c182374 = c182372;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:59:0x0061, code lost:
    
        if (l.RunnableC0588.m2441() >= 0) goto L92;
     */
    /* JADX WARN: Code restructure failed: missing block: B:63:0x006d, code lost:
    
        if (l.C2520.f8000 < 0) goto L92;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static int[] m6340(int[] r30) {
        /*
            Method dump skipped, instructions count: 1188
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C1926.m6340(int[]):int[]");
    }

    /* JADX WARN: Code restructure failed: missing block: B:26:0x0065, code lost:
    
        if (l.C3746.f11829 <= 0) goto L14;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m6339() {
        /*
            Method dump skipped, instructions count: 986
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C1926.m6339():void");
    }
}
