package l;

import android.content.Context;
import android.content.DialogInterface;
import android.content.pm.PackageManager;
import android.os.SystemClock;
import com.alipay.sdk.m.y.q;
import com.umeng.analytics.pro.o;
import java.util.ArrayList;
import java.util.concurrent.ExecutorService;
import moe.shizuku.server.IShizukuService;

/* compiled from: C2R7 */
/* renamed from: l.᩵ᩴ᩷, reason: contains not printable characters */
/* loaded from: classes.dex */
public final class C19659 extends AbstractC7548 {

    /* renamed from: ۧ۠֫, reason: not valid java name and contains not printable characters */
    private static final short[] f63473;

    /* renamed from: ۜ, reason: not valid java name and contains not printable characters */
    public final PackageManager f63474;

    /* renamed from: ۡ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f63475;

    /* renamed from: ۢ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewOnClickListenerC2040 f63476;

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public C19697 f63477;

    /* renamed from: ᩷, reason: not valid java name and contains not printable characters */
    public boolean f63478;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public ArrayList f63479;

    static {
        ApplicationC12518.m30701(143);
        f63473 = new short[]{4332, -15769, -15767, -15769, -15761, -15746, -15763, -15775, -15773, -15840, -15761, -15776, -15766, -15748, -15775, -15769, -15766, -15840, -15746, -15765, -15748, -15773, -15769, -15747, -15747, -15769, -15775, -15776, -15840, -15799, -15797, -15782, -15791, -15801, -15808, -15779, -15782, -15793, -15806, -15806, -15797, -15798, -15791, -15793, -15778, -15778, -15779, -16833, 21001, 22331, 23052, 17350, -18438, -29328, 23081, -23680, 20562, -25641, -19299, -22492, 19750, 24458};
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public native void mo1007(Exception exc);

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        ViewOnClickListenerC2040 viewOnClickListenerC2040 = null;
        C3430 c3430 = null;
        C12346 c12346 = null;
        boolean z = false;
        C3430 c34302 = null;
        C12346 c123462 = null;
        C19697 c19697 = null;
        int i = 1128880764;
        int i2 = C1128.f4106;
        int i3 = C3432.f10845;
        int m6981 = C2105.m6981("ܺ֨") ^ i3;
        int i4 = ((m6981 ^ i2) * (-665)) ^ 1750268122;
        int i5 = -516923952;
        while (true) {
            i = ((((i ^ i2) * (-3105)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1979097687:
                case 1251968308:
                    C1773.m5908();
                    C4075.m12263();
                    m6981 = C2105.m6981("ۚ᩹") ^ i2;
                    i4 = ((m6981 ^ i3) * 23237) ^ (-1615602942);
                    i5 = 1183767115;
                case -1968612981:
                case 1899212482:
                    C0422.m1963();
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = C0630.m2566("ᩴۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27113)) ^ 1993860537;
                        i5 = -628930523;
                    } else {
                        m6981 = C2105.m6981("۠֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-12909)) ^ (-1206981579);
                        i5 = -1549234835;
                    }
                case -1839433636:
                case 1936084431:
                    C1047.m3593(c19697);
                    m6981 = (i3 - C2105.m6981("ܿۗ")) * (-15);
                    i4 = ((m6981 ^ i2) * (-19447)) ^ 1412258030;
                    i5 = 1703063312;
                case -1713527339:
                case 1339174717:
                    c123462.m29958(z);
                    c19697 = this.f63477;
                    if (c19697 != null) {
                        m6981 = (C2105.m6981("ܰۤ") ^ i2) * (-23);
                        i4 = ((m6981 ^ i3) * 9651) ^ 192733199;
                        i5 = -1370235264;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܿۗ")) * (-15);
                        i4 = ((m6981 ^ i2) * (-19447)) ^ 1412258030;
                        i5 = 1703063312;
                    }
                case -1577676478:
                case 381422724:
                    C3245.m9925();
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    } else {
                        m6981 = C0630.m2566("ᩴۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27113)) ^ 1993860537;
                        i5 = -628930523;
                    }
                case -1446595520:
                case -1116016787:
                    c12346.m29958(z);
                    c34302 = viewOnClickListenerC2040.f6815;
                    if (C1773.f6144 <= 0) {
                        m6981 = C2105.m6981("۠֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-12909)) ^ (-1206981579);
                        i5 = -1549234835;
                    } else {
                        m6981 = C2105.m6981("֫ۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-9177)) ^ 618121685;
                        i5 = 1859616075;
                    }
                case -1351041042:
                case 1411703638:
                    viewOnClickListenerC2040 = this.f63476;
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C0630.m2566("ᩴۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27113)) ^ 1993860537;
                        i5 = -628930523;
                    } else {
                        m6981 = C0630.m2566("᩹۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-6707)) ^ 296470079;
                        i5 = 1333348386;
                    }
                case -1111899240:
                case -137677995:
                    c12346 = c3430.f10840;
                    z = false;
                    if (C22628.m50615() != 0) {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i2) * 27;
                        i4 = ((m6981 ^ i3) * (-14513)) ^ 1211073049;
                        i5 = -1753803686;
                    } else {
                        m6981 = C0630.m2566("᩸ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 7605) ^ (-1353722883);
                        i5 = -1241656363;
                    }
                case -1053731722:
                case 106862496:
                    viewOnClickListenerC2040.f6812 = false;
                    viewOnClickListenerC2040.m6697();
                    break;
                case -1039165244:
                case 1902592445:
                    if (C0798.f2919) {
                        m6981 = C2105.m6981("۠֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-12909)) ^ (-1206981579);
                        i5 = -1549234835;
                    } else {
                        m6981 = C2105.m6981("֨ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-8543)) ^ 901675409;
                        i5 = 1018322267;
                    }
                case -876439082:
                case -693534783:
                    if (C4263.f13799 <= 0) {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    } else {
                        m6981 = (C0630.m2566("ܺ᩺") + i3) * (-67);
                        i4 = ((m6981 ^ i2) * (-15921)) ^ 881680800;
                        i5 = -1301339065;
                    }
                case -771459835:
                case 1529694724:
                    C1005.m3501();
                    if (C3537.f11231 < 0) {
                        m6981 = C2105.m6981("ۚ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * 23237) ^ (-1615602942);
                        i5 = 1183767115;
                    } else {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    }
                case -607940369:
                case 2131287886:
                    c123462 = c34302.f10840;
                    if (C2958.f9394 >= 0) {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩹") + i2) * 115;
                        i4 = ((m6981 ^ i3) * (-19395)) ^ (-1569050575);
                        i5 = -1676530984;
                    }
                case -96224849:
                case 688238927:
                    c3430 = viewOnClickListenerC2040.f6822;
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    } else {
                        m6981 = (C0630.m2566("ۢ֨") + i3) * (-115);
                        i4 = ((m6981 ^ i2) * 8173) ^ (-866108789);
                        i5 = 1353947651;
                    }
                case 347773011:
                case 684084225:
                    if (C1005.f3721) {
                        m6981 = (C0630.m2566("᩸۟") + i2) * (-49);
                        i4 = ((m6981 ^ i3) * (-11267)) ^ 2053353468;
                        i5 = 796616124;
                    } else {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i2) * 27;
                        i4 = ((m6981 ^ i3) * (-14513)) ^ 1211073049;
                        i5 = -1753803686;
                    }
                case 360014349:
                case 1207858296:
                    if (C22628.f73083 <= 0) {
                        m6981 = (C0630.m2566("ᩴᩴ") ^ i2) * 27;
                        i4 = ((m6981 ^ i3) * (-14513)) ^ 1211073049;
                        i5 = -1753803686;
                    } else {
                        m6981 = C0630.m2566("۟᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * 15613) ^ 2120584807;
                        i5 = -1582420990;
                    }
                case 1309291356:
                case 1857730597:
                    C0382.m1848();
                    break;
                default:
                    if (C3911.f12484 >= 0) {
                        m6981 = C2105.m6981("ۗ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 27133) ^ 1582890872;
                        i5 = -7666443;
                    } else {
                        m6981 = C0630.m2566("ۡۙ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27781) ^ 1863337679;
                        i5 = -1018805754;
                    }
            }
            return;
        }
    }

    public C19659(ViewOnClickListenerC2040 viewOnClickListenerC2040, int i) {
        int i2 = 1346903155;
        int i3 = C1294.f4556;
        int i4 = C3245.f10203;
        this.f63476 = viewOnClickListenerC2040;
        this.f63475 = i;
        int m2566 = (C0630.m2566("֫۬") + i4) * (-41);
        int i5 = ((m2566 ^ i3) * (-6327)) ^ (-1537630671);
        int i6 = -857165150;
        while (true) {
            i2 = ((((i2 ^ i3) * 14179) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -1829848862:
                case -405774423:
                    this.f63478 = true;
                    return;
                case -1560995358:
                case 1273170394:
                    if (C2958.f9394 >= 0) {
                        m2566 = C2105.m6981("᩻ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-27137)) ^ (-834329129);
                        i6 = 1904937407;
                    } else {
                        m2566 = C2105.m6981("֡ۧ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-20505)) ^ 1216891373;
                        i6 = 1549669579;
                    }
                case -1452577329:
                case -1350261140:
                    if (C0630.f2410 <= 0) {
                        m2566 = (C0630.m2566("ᩴۛ") ^ i4) * 93;
                        i5 = ((m2566 ^ i3) * (-11791)) ^ (-1823879764);
                        i6 = -710305797;
                    } else {
                        m2566 = (i3 - C2105.m6981("᩺۠")) * 75;
                        i5 = ((m2566 ^ i4) * (-17179)) ^ 2021259703;
                        i6 = -151203876;
                    }
                case -1335481557:
                case 159558823:
                    C0382.m1848();
                    if (C0798.f2919) {
                        m2566 = (C0630.m2566("ᩴۛ") ^ i4) * 93;
                        i5 = ((m2566 ^ i3) * (-11791)) ^ (-1823879764);
                        i6 = -710305797;
                    } else {
                        m2566 = C2105.m6981("᩻ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-27137)) ^ (-834329129);
                        i6 = 1904937407;
                    }
                case -974030340:
                case 1406949896:
                    C3245.m9925();
                    m2566 = C2105.m6981("᩻ᩳ") ^ i3;
                    i5 = ((m2566 ^ i4) * (-27137)) ^ (-834329129);
                    i6 = 1904937407;
                case -609093363:
                case 1142909351:
                    if (C0630.f2410 <= 0) {
                        m2566 = (C0630.m2566("ᩴۛ") ^ i4) * 93;
                        i5 = ((m2566 ^ i3) * (-11791)) ^ (-1823879764);
                        i6 = -710305797;
                    } else {
                        m2566 = C2105.m6981("ۜܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * 21441) ^ 1595772772;
                        i6 = 1055048053;
                    }
                case -561975092:
                case -350362114:
                    C0630.m2564();
                    throw new RuntimeException();
                case -212461690:
                case 2024593160:
                    if (C2272.f7362) {
                        m2566 = C0630.m2566("᩵ܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * 9481) ^ 1699384414;
                        i6 = 1461635939;
                    } else {
                        m2566 = (C0630.m2566("ܽܰ") ^ i4) * (-119);
                        i5 = ((m2566 ^ i3) * 29593) ^ (-858757901);
                        i6 = 1804171953;
                    }
                case -132823511:
                case 210281029:
                    C0798.m2998();
                    if (RunnableC1937.f6483 >= 0) {
                        m2566 = (i3 - C2105.m6981("᩺۠")) * 75;
                        i5 = ((m2566 ^ i4) * (-17179)) ^ 2021259703;
                        i6 = -151203876;
                    } else {
                        m2566 = C2105.m6981("᩸ۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-13391)) ^ 11094015;
                        i6 = -1912683173;
                    }
                case -106663078:
                case 1489400574:
                    if (C1504.f5354) {
                        m2566 = C0630.m2566("᩵ܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * 9481) ^ 1699384414;
                        i6 = 1461635939;
                    } else {
                        m2566 = C0630.m2566("۠ܿ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-237)) ^ 230920407;
                        i6 = -1333784151;
                    }
                case 356429114:
                case 479937226:
                    if (C2520.m8026()) {
                        m2566 = C2105.m6981("᩸ۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-13391)) ^ 11094015;
                        i6 = -1912683173;
                    } else {
                        m2566 = C0630.m2566("ۡۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * 15681) ^ 195782691;
                        i6 = 234714065;
                    }
                case 478115614:
                case 529038301:
                    if (RunnableC1108.f4040) {
                        m2566 = (C2105.m6981("ۤ۫") ^ i4) * (-67);
                        i5 = ((m2566 ^ i3) * 11209) ^ 548305074;
                        i6 = -1104323372;
                    } else {
                        m2566 = C2105.m6981("᩸ۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-13391)) ^ 11094015;
                        i6 = -1912683173;
                    }
                case 584008652:
                case 1037840499:
                    if (C1128.f4106 <= 0) {
                        m2566 = C2105.m6981("᩻ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-27137)) ^ (-834329129);
                        i6 = 1904937407;
                    } else {
                        m2566 = (i3 - C2105.m6981("᩵ܳ")) * (-117);
                        i5 = ((m2566 ^ i4) * (-2015)) ^ (-1619422980);
                        i6 = 767831626;
                    }
                case 750236363:
                case 1867424034:
                    if (C0050.f910 >= 0) {
                        m2566 = (C0630.m2566("ᩴۛ") ^ i4) * 93;
                        i5 = ((m2566 ^ i3) * (-11791)) ^ (-1823879764);
                        i6 = -710305797;
                    } else {
                        m2566 = C0630.m2566("᩻ܳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-31023)) ^ (-580047372);
                        i6 = -1916483073;
                    }
                case 800771589:
                case 1409211390:
                    if (C21923.f70183 != 0) {
                        m2566 = C2105.m6981("᩻ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-27137)) ^ (-834329129);
                        i6 = 1904937407;
                    } else {
                        m2566 = (C0630.m2566("ۡ֫") + i4) * (-63);
                        i5 = ((m2566 ^ i3) * 5729) ^ 1681960445;
                        i6 = -617927636;
                    }
                default:
                    this.f63474 = viewOnClickListenerC2040.getPackageManager();
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (C0630.m2566("ᩴۛ") ^ i4) * 93;
                        i5 = ((m2566 ^ i3) * (-11791)) ^ (-1823879764);
                        i6 = -710305797;
                    } else {
                        m2566 = C0630.m2566("ۧ᩻") ^ i4;
                        i5 = ((m2566 ^ i3) * (-25141)) ^ 704291700;
                        i6 = 248388311;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    public final void mo1008() {
        ViewOnClickListenerC2040 viewOnClickListenerC2040 = null;
        C3430 c3430 = null;
        C12346 c12346 = null;
        boolean z = false;
        C3430 c34302 = null;
        int i = -191841447;
        int i2 = C0483.f2088;
        int i3 = C3911.f12484;
        int m2566 = (i2 - C0630.m2566("ۢۜ")) * 11;
        int i4 = ((m2566 ^ i3) * (-2203)) ^ 161909860;
        int i5 = -1180053335;
        while (true) {
            i = ((((i ^ i3) * 11531) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1628312107:
                case -943184226:
                    if (C4075.f12947 >= 0) {
                        m2566 = C2105.m6981("ۘ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30207)) ^ 1702325422;
                        i5 = -805774693;
                    } else {
                        m2566 = C0630.m2566("ۡ᩹") ^ i3;
                        i4 = ((m2566 ^ i2) * 31799) ^ (-200070023);
                        i5 = -256602211;
                    }
                case -1463095532:
                case 1669013735:
                    c12346.m29958(z);
                    c34302 = viewOnClickListenerC2040.f6815;
                    if (C0237.f1507 != 0) {
                        m2566 = (C0630.m2566("ۨۖ") + i3) * 123;
                        i4 = ((m2566 ^ i2) * (-24185)) ^ (-1533925665);
                        i5 = 642371781;
                    } else {
                        m2566 = (i2 - C0630.m2566("ۤۛ")) * (-53);
                        i4 = ((m2566 ^ i3) * 23347) ^ (-1249269857);
                        i5 = -1187611829;
                    }
                case -1391293537:
                case 1355220837:
                    c3430 = viewOnClickListenerC2040.f6822;
                    if (C7811.f24123 >= 0) {
                        m2566 = C2105.m6981("ۘ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30207)) ^ 1702325422;
                        i5 = -805774693;
                    } else {
                        m2566 = C2105.m6981("᩹ۚ") ^ i3;
                        i4 = ((m2566 ^ i2) * 16879) ^ (-1727381681);
                        i5 = -1230583862;
                    }
                case -1025460891:
                case -1007486794:
                    if (C1773.f6144 <= 0) {
                        m2566 = (C0630.m2566("ۨ᩻") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-31739)) ^ (-730184737);
                        i5 = -1783154135;
                    } else {
                        m2566 = (C2105.m6981("ۚۜ") ^ i2) * 79;
                        i4 = ((m2566 ^ i3) * 9301) ^ 1981857513;
                        i5 = 1158249178;
                    }
                case -993241906:
                case 723330592:
                    C1504.m5179();
                    m2566 = C2105.m6981("ۘ֨") ^ i2;
                    i4 = ((m2566 ^ i3) * (-30207)) ^ 1702325422;
                    i5 = -805774693;
                case -991122047:
                case 1511660041:
                    if (C4159.m12565() >= 0) {
                        m2566 = (C0630.m2566("ۨۖ") + i3) * 123;
                        i4 = ((m2566 ^ i2) * (-24185)) ^ (-1533925665);
                        i5 = 642371781;
                    } else {
                        m2566 = C2105.m6981("ܰܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-23205)) ^ 1935272318;
                        i5 = -1400628428;
                    }
                case -909860172:
                case 1628991093:
                    if (C4263.f13799 <= 0) {
                        m2566 = C2105.m6981("ۘ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30207)) ^ 1702325422;
                        i5 = -805774693;
                    } else {
                        m2566 = C2105.m6981("ۧܿ") ^ i3;
                        i4 = ((m2566 ^ i2) * 8911) ^ (-1508026660);
                        i5 = -838935283;
                    }
                case -408768657:
                case 1825421771:
                    if (C1294.m4372() <= 0) {
                        m2566 = (C0630.m2566("ۨ᩻") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-31739)) ^ (-730184737);
                        i5 = -1783154135;
                    } else {
                        m2566 = (C2105.m6981("۟᩵") + i2) * (-49);
                        i4 = ((m2566 ^ i3) * 25837) ^ (-413064887);
                        i5 = -1997666638;
                    }
                case -569194:
                case 171096442:
                    if (C1773.m5908() <= 0) {
                        m2566 = (C0630.m2566("ۨ᩻") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-31739)) ^ (-730184737);
                        i5 = -1783154135;
                    } else {
                        m2566 = (C2105.m6981("ܰۛ") ^ i2) * 81;
                        i4 = ((m2566 ^ i3) * (-8465)) ^ 232049673;
                        i5 = -896737459;
                    }
                case 282809672:
                case 517168160:
                    C0237.m1481();
                    break;
                case 317048219:
                case 1940368183:
                    C1916.m6308();
                    if (AbstractC2021.f6743 <= 0) {
                        m2566 = C2105.m6981("ۘ֨") ^ i2;
                        i4 = ((m2566 ^ i3) * (-30207)) ^ 1702325422;
                        i5 = -805774693;
                    } else {
                        m2566 = (C0630.m2566("ۨۖ") + i3) * 123;
                        i4 = ((m2566 ^ i2) * (-24185)) ^ (-1533925665);
                        i5 = 642371781;
                    }
                case 328886804:
                case 1127138420:
                    if (C0382.f1805) {
                        m2566 = (i3 - C0630.m2566("ۢ᩹")) * 13;
                        i4 = ((m2566 ^ i2) * (-16813)) ^ 2042863379;
                        i5 = -1286703012;
                    } else {
                        m2566 = (C0630.m2566("ۨ᩻") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-31739)) ^ (-730184737);
                        i5 = -1783154135;
                    }
                case 374818352:
                case 1476328491:
                    if (C5695.f17556 >= 0) {
                        m2566 = (C0630.m2566("ۨۖ") + i3) * 123;
                        i4 = ((m2566 ^ i2) * (-24185)) ^ (-1533925665);
                        i5 = 642371781;
                    } else {
                        m2566 = C0630.m2566("ᩳۧ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-21705)) ^ (-1047131186);
                        i5 = -860223805;
                    }
                case 802351882:
                case 881604000:
                    viewOnClickListenerC2040 = this.f63476;
                    if (C2520.f8000 >= 0) {
                        m2566 = (C0630.m2566("ۨۖ") + i3) * 123;
                        i4 = ((m2566 ^ i2) * (-24185)) ^ (-1533925665);
                        i5 = 642371781;
                    } else {
                        m2566 = (i3 - C2105.m6981("֡ۤ")) * 87;
                        i4 = ((m2566 ^ i2) * 28507) ^ 681413579;
                        i5 = -1856576751;
                    }
                case 1254624744:
                case 1346820702:
                    c12346 = c3430.f10840;
                    z = true;
                    if (C0050.f910 >= 0) {
                        m2566 = (C0630.m2566("ۨ᩻") + i3) * (-95);
                        i4 = ((m2566 ^ i2) * (-31739)) ^ (-730184737);
                        i5 = -1783154135;
                    } else {
                        m2566 = C2105.m6981("۬ܺ") ^ i3;
                        i4 = ((m2566 ^ i2) * 12841) ^ 711051371;
                        i5 = -2053579972;
                    }
                default:
                    c34302.f10840.m29958(z);
                    break;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:10:0x0037, code lost:
    
        if (l.C3245.f10203 <= 0) goto L57;
     */
    /* JADX WARN: Code restructure failed: missing block: B:16:0x0040, code lost:
    
        if (l.C3245.f10203 <= 0) goto L69;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x0049, code lost:
    
        if (l.AbstractC2021.f6743 > 0) goto L57;
     */
    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1009() {
        /*
            Method dump skipped, instructions count: 736
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C19659.mo1009():void");
    }

    /* JADX WARN: Type inference failed for: r6v1 */
    /* JADX WARN: Type inference failed for: r6v15 */
    /* JADX WARN: Type inference failed for: r6v16 */
    /* JADX WARN: Type inference failed for: r6v2, types: [boolean] */
    /* JADX WARN: Type inference failed for: r6v5 */
    /* JADX WARN: Type inference failed for: r6v7 */
    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1006() {
        String str;
        C19258 c19258;
        int m2566;
        int i;
        int i2;
        C3430 c3430;
        int m25662;
        int i3;
        C19119 c19119;
        C19119 c191192;
        int m25663;
        int i4;
        int i5;
        boolean z;
        int m6981;
        int i6;
        int i7;
        boolean z2;
        C3430 c34302;
        C3430 c34303;
        C19119 c191193;
        C19119 c191194;
        C3430 c34304;
        C3430 c34305;
        boolean z3;
        int i8;
        final C19659 c19659 = this;
        int i9 = C2167.f7158;
        int i10 = C4117.f13076;
        int m25664 = C0630.m2566("᩸᩸") ^ i9;
        int i11 = ((m25664 ^ i10) * (-7441)) ^ (-121749478);
        C19119 c191195 = null;
        C19119 c191196 = null;
        DialogInterfaceOnClickListenerC18953 dialogInterfaceOnClickListenerC18953 = null;
        String str2 = null;
        String str3 = null;
        int i12 = m25664 ^ (-157777168);
        ViewOnClickListenerC2040 viewOnClickListenerC2040 = null;
        int i13 = 0;
        boolean z4 = false;
        int i14 = 0;
        int i15 = 0;
        short s = 0;
        int i16 = 0;
        int i17 = -215442019;
        DialogInterface.OnClickListener onClickListener = null;
        String str4 = null;
        int i18 = 0;
        C19258 c192582 = null;
        String str5 = null;
        InterfaceC12344 interfaceC12344 = null;
        ExecutorService executorService = null;
        C20364 c20364 = null;
        String str6 = null;
        ?? r6 = 0;
        while (true) {
            i17 = i12 ^ (i11 & (((i17 ^ i10) * 28219) >> 31));
            switch (i17) {
                case -2120700344:
                case -1090225748:
                    str = str5;
                    c19258 = c192582;
                    viewOnClickListenerC2040 = c19659.f63476;
                    c34304 = viewOnClickListenerC2040.f6822;
                    c191195 = c34304.m10472(c19659.f63479);
                    c34305 = viewOnClickListenerC2040.f6815;
                    c191196 = c34305.m10472(c19659.f63479);
                    if (C3245.f10203 > 0) {
                        m2566 = C2105.m6981("ܰ᩹") ^ i10;
                        i = ((m2566 ^ i9) * 3963) ^ 772550440;
                        i2 = 1688410101;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    }
                    m2566 = C2105.m6981("֨ۤ") ^ i9;
                    i = ((m2566 ^ i10) * 10641) ^ (-108541020);
                    i2 = -289755804;
                    i8 = m2566 ^ i2;
                    str5 = str;
                    c192582 = c19258;
                    i12 = i8;
                    i11 = i;
                case -2091938178:
                case 1198166651:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    i13 = 128;
                    m25663 = (i10 - C2105.m6981("᩶ۖ")) * 83;
                    i4 = ((m25663 ^ i9) * 22523) ^ 1871800437;
                    i5 = -1547151731;
                    z2 = r6;
                    int i19 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i19;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
                case -1894658821:
                case 1793011195:
                    str = str5;
                    c19258 = c192582;
                    c3430 = viewOnClickListenerC2040.f6822;
                    if (c3430.f10837.f65737.size() <= r6) {
                        m2566 = (i9 - C0630.m2566("ۚ᩸")) * (-113);
                        i = ((m2566 ^ i10) * 10875) ^ 1693812996;
                        i2 = 679744649;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    } else {
                        str5 = str;
                        m6981 = C2105.m6981("᩶᩺") ^ i9;
                        i6 = ((m6981 ^ i10) * 19747) ^ 896104428;
                        i7 = -1731041595;
                        i12 = m6981 ^ i7;
                        i11 = i6;
                        r6 = r6;
                        c192582 = c19258;
                    }
                case -1797680951:
                case -518655597:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    i13 = 49678;
                    m25663 = (i10 - C2105.m6981("᩶ۖ")) * 83;
                    i4 = ((m25663 ^ i9) * 22523) ^ 1871800437;
                    i5 = -1547151731;
                    z2 = r6;
                    int i192 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i192;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
                case -1616018430:
                case -1024300193:
                    str = str5;
                    C2520.m8029(c192582, C2105.m6981(str4) ^ 2099429992, null);
                    if (C2167.f7158 < 0) {
                        m25662 = (C0630.m2566("ܺܰ") + i10) * q.h;
                        i = ((m25662 ^ i9) * 22677) ^ 1778130044;
                        i3 = 339652213;
                        i8 = m25662 ^ i3;
                        str5 = str;
                        i12 = i8;
                        i11 = i;
                    }
                    c19258 = c192582;
                    m2566 = (C2105.m6981("ۜۛ") ^ i10) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                    i = ((m2566 ^ i9) * (-16615)) ^ (-445579542);
                    i2 = 1127579538;
                    i8 = m2566 ^ i2;
                    str5 = str;
                    c192582 = c19258;
                    i12 = i8;
                    i11 = i;
                case -1446247814:
                case 326480782:
                    if (C1128.f4106 <= 0) {
                        str = str5;
                        c191193 = c191195;
                        c191194 = c191196;
                        int m25665 = (C0630.m2566("۠᩵") + i10) * (-49);
                        c191195 = c191193;
                        c191196 = c191194;
                        str5 = str;
                        i12 = m25665 ^ (-2045420647);
                        i11 = ((m25665 ^ i9) * 24103) ^ (-935814965);
                        c19659 = this;
                    } else {
                        str = str5;
                        c19258 = c192582;
                        c19119 = c191195;
                        c191192 = c191196;
                        z = r6;
                        m25663 = C2105.m6981("۫᩷") ^ i9;
                        i4 = ((m25663 ^ i10) * 3725) ^ 288021816;
                        i5 = -1385480026;
                        z2 = z;
                        int i1922 = m25663 ^ i5;
                        c191195 = c19119;
                        c191196 = c191192;
                        str5 = str;
                        i12 = i1922;
                        i11 = i4;
                        r6 = z2;
                        c192582 = c19258;
                    }
                case -1324332755:
                case 2000744107:
                    str = str5;
                    z3 = viewOnClickListenerC2040.f6810;
                    if (z3) {
                        m25662 = (C0630.m2566("᩶ܿ") ^ i9) * (-125);
                        i = ((m25662 ^ i10) * (-9589)) ^ 1462109674;
                        i3 = 702659554;
                    } else {
                        m25662 = (i10 - C2105.m6981("֫ܽ")) * 59;
                        i = ((m25662 ^ i9) * 16099) ^ (-1100509107);
                        i3 = -931629847;
                    }
                    i8 = m25662 ^ i3;
                    str5 = str;
                    i12 = i8;
                    i11 = i;
                case -1293370416:
                case 967935921:
                    Context applicationContext = viewOnClickListenerC2040.getApplicationContext();
                    c19258 = c192582;
                    str5 = C2167.m7159(f63473, 6, 41, i13);
                    if (C0881.m3229(applicationContext, str5) != 0) {
                        m6981 = C2105.m6981("֫ۨ") ^ i9;
                        i6 = ((m6981 ^ i10) * (-22815)) ^ (-615430374);
                        i7 = 1749447574;
                        i12 = m6981 ^ i7;
                        i11 = i6;
                        r6 = r6;
                        c192582 = c19258;
                    }
                    m6981 = C2105.m6981("᩶᩺") ^ i9;
                    i6 = ((m6981 ^ i10) * 19747) ^ 896104428;
                    i7 = -1731041595;
                    i12 = m6981 ^ i7;
                    i11 = i6;
                    r6 = r6;
                    c192582 = c19258;
                case -1273420321:
                case 1102389804:
                    C5695.m16017(c192582, C0630.m2566(str3) ^ 2125627235, dialogInterfaceOnClickListenerC18953);
                    C3683.m11213(c192582);
                    c19258 = c192582;
                    m6981 = C2105.m6981("᩶᩺") ^ i9;
                    i6 = ((m6981 ^ i10) * 19747) ^ 896104428;
                    i7 = -1731041595;
                    i12 = m6981 ^ i7;
                    i11 = i6;
                    r6 = r6;
                    c192582 = c19258;
                case -1247251634:
                case -672352069:
                    str = str5;
                    C1294.m4380(c192582, i18 ^ 2117022031, onClickListener);
                    str4 = C0630.m2575(f63473, 56, 3, i13);
                    if (C1005.f3721) {
                        m25662 = C0630.m2566("᩸ۗ") ^ i9;
                        i = ((m25662 ^ i10) * 477) ^ (-882992645);
                        i3 = 463985702;
                        i8 = m25662 ^ i3;
                        str5 = str;
                        i12 = i8;
                        i11 = i;
                    } else {
                        c19258 = c192582;
                        c19119 = c191195;
                        c191192 = c191196;
                        z = r6;
                        m25663 = C2105.m6981("۫᩷") ^ i9;
                        i4 = ((m25663 ^ i10) * 3725) ^ 288021816;
                        i5 = -1385480026;
                        z2 = z;
                        int i19222 = m25663 ^ i5;
                        c191195 = c19119;
                        c191196 = c191192;
                        str5 = str;
                        i12 = i19222;
                        i11 = i4;
                        r6 = z2;
                        c192582 = c19258;
                    }
                case -1128529571:
                case 1950170220:
                    C3537.m10746();
                    if (C1711.f5919) {
                        str = str5;
                        c19258 = c192582;
                        m2566 = C2105.m6981("֨ۤ") ^ i9;
                        i = ((m2566 ^ i10) * 10641) ^ (-108541020);
                        i2 = -289755804;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    } else {
                        str = str5;
                        c191193 = c191195;
                        c191194 = c191196;
                        int m256652 = (C0630.m2566("۠᩵") + i10) * (-49);
                        c191195 = c191193;
                        c191196 = c191194;
                        str5 = str;
                        i12 = m256652 ^ (-2045420647);
                        i11 = ((m256652 ^ i9) * 24103) ^ (-935814965);
                        c19659 = this;
                    }
                case -1111415028:
                case 1682395865:
                    str = str5;
                    C7106.m19114(c192582, C2105.m6981(str2) ^ 2102970073);
                    onClickListener = new DialogInterface.OnClickListener() { // from class: l.ۘᩴ᩷
                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i20) {
                            C19659 c196592 = null;
                            int i21 = -1076034565;
                            int i22 = C4616.f14690;
                            int i23 = ViewOnClickListenerC1958.f6529;
                            int m69812 = (C2105.m6981("۬᩶") + i22) * 99;
                            int i24 = ((m69812 ^ i23) * 17663) ^ 886046277;
                            int i25 = -956848787;
                            while (true) {
                                i21 = ((((i21 ^ i23) * 6645) >> 31) & i24) ^ (m69812 ^ i25);
                                switch (i21) {
                                    case -2035653643:
                                    case 2088015222:
                                        C0483.m2121();
                                        break;
                                    case -1985885255:
                                    case -565190395:
                                        RunnableC3474.m10630();
                                        if (C7106.f21815 != 0) {
                                            m69812 = C0630.m2566("ܳ۫") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                            i25 = -1609475283;
                                        } else {
                                            m69812 = C2105.m6981("ۖۚ") ^ i22;
                                            i24 = ((m69812 ^ i23) * 8445) ^ 284789788;
                                            i25 = 178503027;
                                        }
                                    case -1853927350:
                                    case 743179186:
                                        C0422.m1963();
                                        if (RunnableC1937.m6387() == 0) {
                                            m69812 = C2105.m6981("ۖۚ") ^ i22;
                                            i24 = ((m69812 ^ i23) * 8445) ^ 284789788;
                                            i25 = 178503027;
                                        } else {
                                            m69812 = (i23 - C0630.m2566("ܺᩴ")) * 123;
                                            i24 = ((m69812 ^ i22) * 2255) ^ (-1735292003);
                                            i25 = -1293390646;
                                        }
                                    case -1674706129:
                                    case 1297198949:
                                        if (C2167.f7158 >= 0) {
                                            m69812 = (i23 - C0630.m2566("ܺᩴ")) * 123;
                                            i24 = ((m69812 ^ i22) * 2255) ^ (-1735292003);
                                            i25 = -1293390646;
                                        } else {
                                            m69812 = C2105.m6981("ܰۤ") ^ i23;
                                            i24 = ((m69812 ^ i22) * (-29401)) ^ (-11949558);
                                            i25 = -2064416841;
                                        }
                                    case -1660223257:
                                    case -811684331:
                                        if (C3683.f11629 >= 0) {
                                            m69812 = C0630.m2566("ܳ۫") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                            i25 = -1609475283;
                                        } else {
                                            m69812 = C0630.m2566("ۤ᩷") ^ i23;
                                            i24 = ((m69812 ^ i22) * 29875) ^ 297682806;
                                            i25 = 1246877043;
                                        }
                                    case -1172011677:
                                    case 1757202720:
                                        c196592 = C19659.this;
                                        if (C2520.f8000 >= 0) {
                                            m69812 = C0630.m2566("᩹֫") ^ i22;
                                            i24 = ((m69812 ^ i23) * 10847) ^ (-1123328829);
                                            i25 = 183822112;
                                        } else {
                                            m69812 = (C0630.m2566("֫ۘ") + i22) * (-51);
                                            i24 = ((m69812 ^ i23) * 23931) ^ (-1436452609);
                                            i25 = 467812850;
                                        }
                                    case -903037429:
                                    case -791658956:
                                        if (C4117.f13076 <= 0) {
                                            m69812 = C2105.m6981("ۖۚ") ^ i22;
                                            i24 = ((m69812 ^ i23) * 8445) ^ 284789788;
                                            i25 = 178503027;
                                        } else {
                                            m69812 = (C2105.m6981("ۡᩴ") + i23) * 71;
                                            i24 = ((m69812 ^ i22) * 12037) ^ (-1882321411);
                                            i25 = 1050266822;
                                        }
                                    case -329753633:
                                    case -145061726:
                                        C3537.m10746();
                                        C3019.m9255();
                                        m69812 = C0630.m2566("ܳ۫") ^ i22;
                                        i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                        i25 = -1609475283;
                                    case 52860086:
                                    case 1787652440:
                                        if (C7106.f21815 != 0) {
                                            m69812 = C0630.m2566("ܳ۫") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                            i25 = -1609475283;
                                        } else {
                                            m69812 = (i23 - C0630.m2566("֡۟")) * 29;
                                            i24 = ((m69812 ^ i22) * (-7869)) ^ (-564866299);
                                            i25 = -2104637778;
                                        }
                                    case 91801659:
                                    case 2001346561:
                                        if (C21923.f70183 != 0) {
                                            m69812 = C2105.m6981("֡᩵") ^ i23;
                                            i24 = ((m69812 ^ i22) * (-49)) ^ 197606928;
                                            i25 = -1199884516;
                                        } else {
                                            m69812 = C0630.m2566("ۨ۟") ^ i23;
                                            i24 = ((m69812 ^ i22) * 13153) ^ (-350788350);
                                            i25 = 494613148;
                                        }
                                    case 295833057:
                                    case 1039400563:
                                        if (C0050.m940() <= 0) {
                                            m69812 = C2105.m6981("֡᩵") ^ i23;
                                            i24 = ((m69812 ^ i22) * (-49)) ^ 197606928;
                                            i25 = -1199884516;
                                        } else {
                                            m69812 = C2105.m6981("ۢۛ") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-32493)) ^ (-1811840584);
                                            i25 = -1146093026;
                                        }
                                    case 473612366:
                                    case 1401684059:
                                        ViewOnClickListenerC2040 viewOnClickListenerC20402 = c196592.f63476;
                                        viewOnClickListenerC20402.f6811 = true;
                                        C22474.m50422(viewOnClickListenerC20402, viewOnClickListenerC20402.getPackageName());
                                        break;
                                    case 510820695:
                                    case 810855245:
                                        if (C0630.f2410 <= 0) {
                                            m69812 = C0630.m2566("᩹֫") ^ i22;
                                            i24 = ((m69812 ^ i23) * 10847) ^ (-1123328829);
                                            i25 = 183822112;
                                        } else {
                                            m69812 = (i22 - C0630.m2566("֨ܺ")) * (-45);
                                            i24 = ((m69812 ^ i23) * (-29225)) ^ (-1169517963);
                                            i25 = 843021148;
                                        }
                                    case 1088124069:
                                    case 1566349083:
                                        if (ServiceConnectionC3453.f10921 >= 0) {
                                            m69812 = C0630.m2566("ܳ۫") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                            i25 = -1609475283;
                                        } else {
                                            m69812 = (C0630.m2566("ܿۤ") + i22) * 49;
                                            i24 = ((m69812 ^ i23) * (-15499)) ^ 422176160;
                                            i25 = 661675088;
                                        }
                                    case 1230522972:
                                    case 1990707550:
                                        if (C4616.f14690 <= 0) {
                                            m69812 = C2105.m6981("ۖۚ") ^ i22;
                                            i24 = ((m69812 ^ i23) * 8445) ^ 284789788;
                                            i25 = 178503027;
                                        } else {
                                            m69812 = C0630.m2566("ۗۤ") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-16003)) ^ 2023236876;
                                            i25 = 2078774070;
                                        }
                                    default:
                                        if (C7811.f24123 < 0) {
                                            m69812 = C0630.m2566("ܳ۫") ^ i22;
                                            i24 = ((m69812 ^ i23) * (-20047)) ^ (-641190212);
                                            i25 = -1609475283;
                                        } else {
                                            m69812 = C2105.m6981("֡᩵") ^ i23;
                                            i24 = ((m69812 ^ i22) * (-49)) ^ 197606928;
                                            i25 = -1199884516;
                                        }
                                }
                                return;
                            }
                        }
                    };
                    m25662 = (C2105.m6981("ܽ᩺") ^ i10) * 43;
                    i = ((m25662 ^ i9) * (-1557)) ^ 724946019;
                    i3 = -1815609718;
                    i8 = m25662 ^ i3;
                    str5 = str;
                    i12 = i8;
                    i11 = i;
                case -936112546:
                case 2093768320:
                    str = str5;
                    c192582 = C1773.m5912(viewOnClickListenerC2040);
                    i14 = C0630.m2566(C0798.m3005(f63473, 47, 3, i13));
                    i15 = 2130064265;
                    if (AbstractC2021.f6743 <= 0) {
                        c191193 = c191195;
                        c191194 = c191196;
                        int m2566522 = (C0630.m2566("۠᩵") + i10) * (-49);
                        c191195 = c191193;
                        c191196 = c191194;
                        str5 = str;
                        i12 = m2566522 ^ (-2045420647);
                        i11 = ((m2566522 ^ i9) * 24103) ^ (-935814965);
                        c19659 = this;
                    } else {
                        m25662 = (C2105.m6981("۟۫") + i10) * 57;
                        i = ((m25662 ^ i9) * (-2281)) ^ 1727962505;
                        i3 = 214447566;
                        i8 = m25662 ^ i3;
                        str5 = str;
                        i12 = i8;
                        i11 = i;
                    }
                case -926616465:
                case 705785931:
                    C19039.m43890(viewOnClickListenerC2040, new String[]{str5}, 23680);
                    break;
                case -751408090:
                case 73506150:
                    C0714.m2805();
                    if (C7811.f24123 >= 0) {
                        str = str5;
                        c19258 = c192582;
                        c19119 = c191195;
                        c191192 = c191196;
                        z = r6;
                        m25663 = C2105.m6981("۫᩷") ^ i9;
                        i4 = ((m25663 ^ i10) * 3725) ^ 288021816;
                        i5 = -1385480026;
                        z2 = z;
                        int i192222 = m25663 ^ i5;
                        c191195 = c19119;
                        c191196 = c191192;
                        str5 = str;
                        i12 = i192222;
                        i11 = i4;
                        r6 = z2;
                        c192582 = c19258;
                    } else {
                        str = str5;
                        c19258 = c192582;
                        m2566 = (C2105.m6981("ۜۛ") ^ i10) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i = ((m2566 ^ i9) * (-16615)) ^ (-445579542);
                        i2 = 1127579538;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    }
                case -603848284:
                case 1099408423:
                    break;
                case -479894889:
                case 1643491135:
                    str = str5;
                    c19258 = c192582;
                    C0630.m2560(executorService, new RunnableC2415(1, c19659));
                    final int i20 = c19659.f63475;
                    C1005.m3499(new Thread(new Runnable(c19659) { // from class: l.ܺᩴ᩷

                        /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
                        public final /* synthetic */ C19659 f49694;

                        {
                            int i21 = 1973461816;
                            int i22 = C5695.f17556;
                            int i23 = C3245.f10203;
                            int m25666 = C0630.m2566("ۨ᩹") ^ i22;
                            int i24 = ((m25666 ^ i23) * 30879) ^ (-1102132638);
                            int i25 = -617102331;
                            while (true) {
                                i21 = ((((i21 ^ i23) * 21095) >> 31) & i24) ^ (m25666 ^ i25);
                                switch (i21) {
                                    case -2094189802:
                                    case -1621134186:
                                        C1711.m5736();
                                        if (RunnableC0588.m2441() < 0) {
                                            m25666 = (C2105.m6981("᩷ۡ") + i22) * 15;
                                            i24 = ((m25666 ^ i23) * (-24451)) ^ (-1491784593);
                                            i25 = -854594041;
                                        } else {
                                            m25666 = C0630.m2566("ۤۤ") ^ i23;
                                            i24 = ((m25666 ^ i22) * 25231) ^ (-1858392120);
                                            i25 = 1930074191;
                                        }
                                    case -1846958462:
                                    case 675629455:
                                        if (C3019.m9255() <= 0) {
                                            m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                            i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                            i25 = -52087864;
                                        } else {
                                            m25666 = (i23 - C0630.m2566("۫᩸")) * 97;
                                            i24 = ((m25666 ^ i22) * (-23151)) ^ (-738019945);
                                            i25 = 689867260;
                                        }
                                    case -1731113537:
                                    case -272960877:
                                        if (ServiceConnectionC3453.f10921 >= 0) {
                                            m25666 = C0630.m2566("ۤۤ") ^ i23;
                                            i24 = ((m25666 ^ i22) * 25231) ^ (-1858392120);
                                            i25 = 1930074191;
                                        } else {
                                            m25666 = (i22 - C2105.m6981("ۢ᩻")) * 5;
                                            i24 = ((m25666 ^ i23) * (-30227)) ^ (-1885291300);
                                            i25 = 2016090168;
                                        }
                                    case -1418588246:
                                    case 301173267:
                                        if (C2520.m8026()) {
                                            m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                            i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                            i25 = -52087864;
                                        } else {
                                            m25666 = (C2105.m6981("᩷ۡ") + i22) * 15;
                                            i24 = ((m25666 ^ i23) * (-24451)) ^ (-1491784593);
                                            i25 = -854594041;
                                        }
                                    case -1230766632:
                                    case 933995536:
                                        C2272.m7503();
                                        C0798.m2998();
                                        throw new RuntimeException();
                                    case -1121679611:
                                    case -752445200:
                                        if (C0964.f3626 != 0) {
                                            m25666 = (C2105.m6981("᩷ۡ") + i22) * 15;
                                            i24 = ((m25666 ^ i23) * (-24451)) ^ (-1491784593);
                                            i25 = -854594041;
                                        } else {
                                            m25666 = C2105.m6981("ܿܽ") ^ i22;
                                            i24 = ((m25666 ^ i23) * (-3887)) ^ (-325150276);
                                            i25 = -982348282;
                                        }
                                    case -1056336434:
                                    case 69761230:
                                        if (C1504.m5179()) {
                                            m25666 = (i23 - C0630.m2566("֡ۙ")) * 97;
                                            i24 = ((m25666 ^ i22) * 22931) ^ (-483516951);
                                            i25 = -1755020113;
                                        } else {
                                            m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                            i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                            i25 = -52087864;
                                        }
                                    case -635049394:
                                    case 456252756:
                                        if (C3537.f11231 >= 0) {
                                            m25666 = C0630.m2566("ۤۤ") ^ i23;
                                            i24 = ((m25666 ^ i22) * 25231) ^ (-1858392120);
                                            i25 = 1930074191;
                                        } else {
                                            m25666 = (i23 - C0630.m2566("᩺ۛ")) * 37;
                                            i24 = ((m25666 ^ i22) * 28119) ^ 1554016684;
                                            i25 = -1648012404;
                                        }
                                    case 212086936:
                                    case 580852477:
                                        if (C1047.f3863 >= 0) {
                                            m25666 = (i22 - C2105.m6981("ܽ᩸")) * (-73);
                                            i24 = ((m25666 ^ i23) * 955) ^ (-445087356);
                                            i25 = -992986318;
                                        } else {
                                            m25666 = C0630.m2566("᩻֡") ^ i23;
                                            i24 = ((m25666 ^ i22) * (-16217)) ^ (-287201999);
                                            i25 = 915922362;
                                        }
                                    case 280255690:
                                    case 351125332:
                                        return;
                                    case 429304499:
                                    case 905974979:
                                        this.f49694 = c19659;
                                        if (C3019.f9544 >= 0) {
                                            m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                            i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                            i25 = -52087864;
                                        } else {
                                            m25666 = (i23 - C2105.m6981("᩷᩹")) * (-119);
                                            i24 = ((m25666 ^ i22) * 30451) ^ 66952806;
                                            i25 = 671550022;
                                        }
                                    case 625489896:
                                    case 1628718502:
                                        if (C3663.f11553) {
                                            m25666 = C0630.m2566("ۤۤ") ^ i23;
                                            i24 = ((m25666 ^ i22) * 25231) ^ (-1858392120);
                                            i25 = 1930074191;
                                        } else {
                                            m25666 = (C0630.m2566("᩷᩺") + i22) * 19;
                                            i24 = ((m25666 ^ i23) * 9641) ^ (-878971626);
                                            i25 = 1516229760;
                                        }
                                    case 646036583:
                                    case 1408753020:
                                        if (C0630.f2410 <= 0) {
                                            m25666 = C0630.m2566("ܶ۠") ^ i22;
                                            i24 = ((m25666 ^ i23) * 22229) ^ 1595657984;
                                            i25 = -54244306;
                                        } else {
                                            m25666 = C2105.m6981("ۗۧ") ^ i22;
                                            i24 = ((m25666 ^ i23) * 803) ^ 133487875;
                                            i25 = -931148465;
                                        }
                                    case 666310622:
                                    case 1366498471:
                                        C1420.m4913();
                                        if (C0798.f2919) {
                                            m25666 = C0630.m2566("ܶ۠") ^ i22;
                                            i24 = ((m25666 ^ i23) * 22229) ^ 1595657984;
                                            i25 = -54244306;
                                        } else {
                                            m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                            i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                            i25 = -52087864;
                                        }
                                    case 1725397839:
                                    case 1739991727:
                                        if (C0422.f1886 <= 0) {
                                            m25666 = C0630.m2566("ۤۤ") ^ i23;
                                            i24 = ((m25666 ^ i22) * 25231) ^ (-1858392120);
                                            i25 = 1930074191;
                                        } else {
                                            m25666 = C2105.m6981("᩵ۗ") ^ i22;
                                            i24 = ((m25666 ^ i23) * 405) ^ (-620726812);
                                            i25 = -810876504;
                                        }
                                    default:
                                        ServiceConnectionC3453.m10564();
                                        m25666 = (C0630.m2566("᩺᩺") ^ i23) * 95;
                                        i24 = ((m25666 ^ i22) * (-32753)) ^ (-464381783);
                                        i25 = -52087864;
                                }
                            }
                        }

                        @Override // java.lang.Runnable
                        public final void run() {
                            C3430 c34306;
                            C3430 c34307;
                            int i21 = 0;
                            C19659 c196592 = null;
                            ViewOnClickListenerC2040 viewOnClickListenerC20402 = null;
                            long j = 0;
                            int i22 = 1754216266;
                            int i23 = C3245.f10203;
                            int i24 = RunnableC3474.f10992;
                            int m25666 = C0630.m2566("ۖۛ") ^ i24;
                            int i25 = ((m25666 ^ i23) * 10425) ^ 1416575593;
                            int i26 = 1299423927;
                            while (true) {
                                i22 = ((((i22 ^ i23) * 2589) >> 31) & i25) ^ (m25666 ^ i26);
                                switch (i22) {
                                    case -2006954759:
                                    case -400203274:
                                        if (C3746.f11829 <= 0) {
                                            m25666 = C0630.m2566("᩷ܶ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-30257)) ^ (-35624324);
                                            i26 = 892729430;
                                        } else {
                                            m25666 = (C0630.m2566("۟ۨ") + i23) * 101;
                                            i25 = ((m25666 ^ i24) * (-8205)) ^ (-442894862);
                                            i26 = -992942381;
                                        }
                                    case -1973496549:
                                    case 391093153:
                                        if (C0798.f2919) {
                                            m25666 = (C0630.m2566("ܿ᩷") + i24) * 123;
                                            i25 = ((m25666 ^ i23) * 827) ^ (-1164585362);
                                            i26 = 225773473;
                                        } else {
                                            m25666 = C2105.m6981("ܽܽ") ^ i24;
                                            i25 = ((m25666 ^ i23) * 11601) ^ 659771476;
                                            i26 = 1127040210;
                                        }
                                    case -1922534871:
                                    case -228744165:
                                        C2520.m8026();
                                        if (C3537.f11231 < 0) {
                                            m25666 = (C0630.m2566("ܿ᩷") + i24) * 123;
                                            i25 = ((m25666 ^ i23) * 827) ^ (-1164585362);
                                            i26 = 225773473;
                                        } else {
                                            m25666 = C2105.m6981("ۚᩳ") ^ i23;
                                            i25 = ((m25666 ^ i24) * 19101) ^ 331553899;
                                            i26 = 304988664;
                                        }
                                    case -1911647779:
                                    case 20738310:
                                        if (C3911.f12484 < 0) {
                                            m25666 = C0630.m2566("ܿۛ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-2413)) ^ 1604664358;
                                            i26 = -1859316652;
                                        } else {
                                            m25666 = C2105.m6981("ܽܽ") ^ i24;
                                            i25 = ((m25666 ^ i23) * 11601) ^ 659771476;
                                            i26 = 1127040210;
                                        }
                                    case -1757366995:
                                    case 2105012898:
                                        if (RunnableC3474.f10992 <= 0) {
                                            m25666 = (i24 - C2105.m6981("ۨ᩸")) * (-73);
                                            i25 = ((m25666 ^ i23) * 19963) ^ (-405854765);
                                            i26 = -1725464430;
                                        } else {
                                            m25666 = C2105.m6981("ۜۨ") ^ i24;
                                            i25 = ((m25666 ^ i23) * (-10821)) ^ (-29965988);
                                            i26 = -376808744;
                                        }
                                    case -1589995338:
                                    case 748271071:
                                        i21 = i20;
                                        if (C2272.m7503()) {
                                            m25666 = C0630.m2566("᩷ܶ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-30257)) ^ (-35624324);
                                            i26 = 892729430;
                                        } else {
                                            m25666 = (C2105.m6981("ۘ᩸") + i23) * 15;
                                            i25 = ((m25666 ^ i24) * 23183) ^ (-234491020);
                                            i26 = -1838506923;
                                        }
                                    case -1551673953:
                                    case -1010750116:
                                        try {
                                            SystemClock.sleep(j);
                                            c34306 = viewOnClickListenerC20402.f6822;
                                            C19119 c191197 = c34306.f10837.f65737;
                                            c34307 = viewOnClickListenerC20402.f6822;
                                            ViewOnClickListenerC2040.m6658(viewOnClickListenerC20402, c191197, c34307.f10842, viewOnClickListenerC20402.f6816, i21);
                                        } catch (Exception unused) {
                                        }
                                        m25666 = C0630.m2566("᩵ᩴ") ^ i24;
                                        i25 = ((m25666 ^ i23) * 13607) ^ (-1093746320);
                                        i26 = -1426160103;
                                    case -1483768601:
                                    case -262288771:
                                        if (C1504.m5179()) {
                                            m25666 = C0630.m2566("ܶ֫") ^ i23;
                                            i25 = ((m25666 ^ i24) * o.a.a) ^ 698626240;
                                            i26 = 1639133067;
                                        } else {
                                            m25666 = (C0630.m2566("ܿ᩷") + i24) * 123;
                                            i25 = ((m25666 ^ i23) * 827) ^ (-1164585362);
                                            i26 = 225773473;
                                        }
                                    case -1315579021:
                                    case -1176641865:
                                        if (C4075.f12947 >= 0) {
                                            m25666 = (C0630.m2566("ܿ᩷") + i24) * 123;
                                            i25 = ((m25666 ^ i23) * 827) ^ (-1164585362);
                                            i26 = 225773473;
                                        } else {
                                            m25666 = C0630.m2566("᩹֫") ^ i24;
                                            i25 = ((m25666 ^ i23) * (-761)) ^ 1899282107;
                                            i26 = -966358248;
                                        }
                                    case -1307021598:
                                    case 671199915:
                                        if (C7106.f21815 != 0) {
                                            m25666 = C0630.m2566("ܿۛ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-2413)) ^ 1604664358;
                                            i26 = -1859316652;
                                        } else {
                                            m25666 = C2105.m6981("ۛ۟") ^ i24;
                                            i25 = ((m25666 ^ i23) * (-27189)) ^ 498956667;
                                            i26 = -1273777362;
                                        }
                                    case -1286296768:
                                    case -404868771:
                                        C1504.m5179();
                                        break;
                                    case -887683797:
                                    case 1034078445:
                                        break;
                                    case -877211081:
                                    case -705059353:
                                        if (C3683.f11629 >= 0) {
                                            m25666 = C2105.m6981("ܽܽ") ^ i24;
                                            i25 = ((m25666 ^ i23) * 11601) ^ 659771476;
                                            i26 = 1127040210;
                                        } else {
                                            m25666 = C2105.m6981("ܶ۬") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-26925)) ^ (-1394066611);
                                            i26 = -1813224083;
                                        }
                                    case -647387883:
                                    case 454291850:
                                        if (C3537.m10746() <= 0) {
                                            m25666 = C0630.m2566("ܿۛ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-2413)) ^ 1604664358;
                                            i26 = -1859316652;
                                        } else {
                                            m25666 = (C2105.m6981("ܰܶ") + i23) * 31;
                                            i25 = ((m25666 ^ i24) * (-12787)) ^ (-1510914886);
                                            i26 = 80494073;
                                        }
                                    case -407986164:
                                    case 1532512784:
                                        viewOnClickListenerC20402 = c196592.f63476;
                                        j = 100;
                                        m25666 = C0630.m2566("ۗۗ") ^ i23;
                                        i25 = ((m25666 ^ i24) * (-32133)) ^ (-1768904700);
                                        i26 = -507990060;
                                    case 281858790:
                                    case 1137349334:
                                        c196592 = this.f49694;
                                        if (C2958.f9394 >= 0) {
                                            m25666 = (i24 - C2105.m6981("ۨ᩸")) * (-73);
                                            i25 = ((m25666 ^ i23) * 19963) ^ (-405854765);
                                            i26 = -1725464430;
                                        } else {
                                            m25666 = C2105.m6981("᩺᩵") ^ i24;
                                            i25 = ((m25666 ^ i23) * (-2375)) ^ (-1747533934);
                                            i26 = 984729734;
                                        }
                                    case 326948188:
                                    case 1592149286:
                                        if (C0237.f1507 != 0) {
                                            m25666 = C0630.m2566("᩷ܶ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-30257)) ^ (-35624324);
                                            i26 = 892729430;
                                        } else {
                                            m25666 = (C2105.m6981("ۤ᩹") ^ i24) * (-61);
                                            i25 = ((m25666 ^ i23) * (-27903)) ^ 559515615;
                                            i26 = -1338197342;
                                        }
                                    case 583495391:
                                    case 1230425214:
                                        C3537.m10746();
                                        C0714.m2805();
                                        m25666 = C0630.m2566("ܿۛ") ^ i23;
                                        i25 = ((m25666 ^ i24) * (-2413)) ^ 1604664358;
                                        i26 = -1859316652;
                                    default:
                                        if (C3746.f11829 > 0) {
                                            m25666 = C2105.m6981("ܽܽ") ^ i24;
                                            i25 = ((m25666 ^ i23) * 11601) ^ 659771476;
                                            i26 = 1127040210;
                                        } else {
                                            m25666 = C0630.m2566("᩷ܶ") ^ i23;
                                            i25 = ((m25666 ^ i24) * (-30257)) ^ (-35624324);
                                            i26 = 892729430;
                                        }
                                }
                                return;
                            }
                        }
                    }));
                    if (!C0798.f2919) {
                        C1005.m3499(new Thread(new Runnable(c19659) { // from class: l.ۖᩴ᩷

                            /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
                            public final /* synthetic */ C19659 f8497;

                            {
                                int i21 = -1930030891;
                                int i22 = C3911.f12484;
                                int i23 = C3432.f10845;
                                int m25666 = (i23 - C0630.m2566("᩷֨")) * 115;
                                int i24 = ((m25666 ^ i22) * 28119) ^ (-1882479446);
                                int i25 = -72271284;
                                while (true) {
                                    i21 = ((((i21 ^ i22) * (-8461)) >> 31) & i24) ^ (m25666 ^ i25);
                                    switch (i21) {
                                        case -2046133446:
                                        case -603112574:
                                            if (C0964.f3626 != 0) {
                                                m25666 = C0630.m2566("۠ۙ") ^ i23;
                                                i24 = ((m25666 ^ i22) * 18935) ^ 1733191853;
                                                i25 = -324001778;
                                            } else {
                                                m25666 = (i23 - C2105.m6981("ۚ۠")) * 79;
                                                i24 = ((m25666 ^ i22) * 17433) ^ 1403012645;
                                                i25 = 1603560463;
                                            }
                                        case -1952443323:
                                        case -658911761:
                                            if (C3019.m9255() <= 0) {
                                                m25666 = C0630.m2566("۠ۙ") ^ i23;
                                                i24 = ((m25666 ^ i22) * 18935) ^ 1733191853;
                                                i25 = -324001778;
                                            } else {
                                                m25666 = C2105.m6981("ۤۚ") ^ i23;
                                                i24 = ((m25666 ^ i22) * 16011) ^ (-2103312768);
                                                i25 = 979955451;
                                            }
                                        case -1887671899:
                                        case -1655100772:
                                            return;
                                        case -1840902751:
                                        case 715734504:
                                            C2520.m8026();
                                            if (C0964.f3626 == 0) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = (C0630.m2566("ۜᩳ") + i22) * 89;
                                                i24 = ((m25666 ^ i23) * 10975) ^ (-857539338);
                                                i25 = -1906146645;
                                            }
                                        case -1733716437:
                                        case -1331100445:
                                            if (C1128.f4106 <= 0) {
                                                m25666 = (C0630.m2566("ۜᩳ") + i22) * 89;
                                                i24 = ((m25666 ^ i23) * 10975) ^ (-857539338);
                                                i25 = -1906146645;
                                            } else {
                                                m25666 = C2105.m6981("ᩳ᩹") ^ i22;
                                                i24 = ((m25666 ^ i23) * (-8411)) ^ (-39063137);
                                                i25 = 1625953097;
                                            }
                                        case -1667955858:
                                        case 1503961311:
                                            if (RunnableC3474.f10992 > 0) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = C2105.m6981("᩶᩷") ^ i22;
                                                i24 = ((m25666 ^ i23) * 27775) ^ 136213349;
                                                i25 = 704101235;
                                            }
                                        case -1559459113:
                                        case -1161459584:
                                            C5695.m16023();
                                            throw new RuntimeException();
                                        case -1392449767:
                                        case 1214251379:
                                            this.f8497 = c19659;
                                            if (C11340.f33930 >= 0) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = C0630.m2566("ܳ۟") ^ i23;
                                                i24 = ((m25666 ^ i22) * 19779) ^ 2092326472;
                                                i25 = 1487478258;
                                            }
                                        case -1097854287:
                                        case -634120153:
                                            if (C3911.f12484 >= 0) {
                                                m25666 = (C0630.m2566("ۜᩳ") + i22) * 89;
                                                i24 = ((m25666 ^ i23) * 10975) ^ (-857539338);
                                                i25 = -1906146645;
                                            } else {
                                                m25666 = C2105.m6981("ܿ᩸") ^ i23;
                                                i24 = ((m25666 ^ i22) * 18485) ^ 306496027;
                                                i25 = -1590046468;
                                            }
                                        case -886448409:
                                        case -29951475:
                                            C3683.m11222();
                                            C1128.m3851();
                                            m25666 = C2105.m6981("ۘ۠") ^ i23;
                                            i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                            i25 = 265357472;
                                        case -820522073:
                                        case 1797110470:
                                            C2958.m9034();
                                            if (C0422.f1886 <= 0) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = C2105.m6981("ܳ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 26261) ^ 1042105017;
                                                i25 = -1614970675;
                                            }
                                        case -393748792:
                                        case -58659562:
                                            if (C3245.f10203 <= 0) {
                                                m25666 = C2105.m6981("᩶᩷") ^ i22;
                                                i24 = ((m25666 ^ i23) * 27775) ^ 136213349;
                                                i25 = 704101235;
                                            } else {
                                                m25666 = (C0630.m2566("۬᩵") + i22) * 83;
                                                i24 = ((m25666 ^ i23) * (-25113)) ^ (-2029264266);
                                                i25 = 1130031249;
                                            }
                                        case -330671541:
                                        case 1107038457:
                                            if (AbstractC2021.m6574()) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = C0630.m2566("᩵᩷") ^ i23;
                                                i24 = ((m25666 ^ i22) * 27675) ^ (-191908325);
                                                i25 = 1569770306;
                                            }
                                        case -107915358:
                                        case 338522317:
                                            if (C3432.f10845 >= 0) {
                                                m25666 = (C0630.m2566("ۜᩳ") + i22) * 89;
                                                i24 = ((m25666 ^ i23) * 10975) ^ (-857539338);
                                                i25 = -1906146645;
                                            } else {
                                                m25666 = C0630.m2566("۫᩵") ^ i22;
                                                i24 = ((m25666 ^ i23) * 15419) ^ 1038983290;
                                                i25 = -876640510;
                                            }
                                        case 761025021:
                                        case 1342039306:
                                            if (C1773.f6144 <= 0) {
                                                m25666 = C2105.m6981("ۘ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 10883) ^ (-2127053496);
                                                i25 = 265357472;
                                            } else {
                                                m25666 = C2105.m6981("ܶۖ") ^ i22;
                                                i24 = ((m25666 ^ i23) * 11505) ^ (-908794073);
                                                i25 = 1046089114;
                                            }
                                        default:
                                            if (C3911.m11924() <= 0) {
                                                m25666 = C2105.m6981("ܳ۠") ^ i23;
                                                i24 = ((m25666 ^ i22) * 26261) ^ 1042105017;
                                                i25 = -1614970675;
                                            } else {
                                                m25666 = (i22 - C2105.m6981("ᩳܿ")) * (-87);
                                                i24 = ((m25666 ^ i23) * 32001) ^ (-1238610869);
                                                i25 = 1705865370;
                                            }
                                    }
                                }
                            }

                            @Override // java.lang.Runnable
                            public final void run() {
                                C3430 c34306;
                                C3430 c34307;
                                int i21 = 0;
                                C19659 c196592 = null;
                                ViewOnClickListenerC2040 viewOnClickListenerC20402 = null;
                                long j = 0;
                                int i22 = 334257038;
                                int i23 = C1047.f3863;
                                int i24 = C4616.f14690;
                                int m25666 = C0630.m2566("᩶ۢ") ^ i24;
                                int i25 = ((m25666 ^ i23) * (-3613)) ^ (-2116912882);
                                int i26 = -1734320456;
                                while (true) {
                                    i22 = ((((i22 ^ i23) * 21995) >> 31) & i25) ^ (m25666 ^ i26);
                                    switch (i22) {
                                        case -2066693415:
                                        case -88001046:
                                            if (C5695.f17556 >= 0) {
                                                m25666 = C0630.m2566("᩵۬") ^ i24;
                                                i25 = ((m25666 ^ i23) * 11281) ^ (-685272828);
                                                i26 = 1434710948;
                                            } else {
                                                m25666 = (i24 - C0630.m2566("۬ᩳ")) * (-55);
                                                i25 = ((m25666 ^ i23) * 699) ^ (-581574039);
                                                i26 = -1613319083;
                                            }
                                        case -1870568338:
                                        case 1979953773:
                                            if (C2958.f9394 >= 0) {
                                                m25666 = (i23 - C0630.m2566("ᩴۜ")) * (-7);
                                                i25 = ((m25666 ^ i24) * 29887) ^ (-1060850901);
                                                i26 = -294540467;
                                            } else {
                                                m25666 = C0630.m2566("ܰ᩵") ^ i24;
                                                i25 = ((m25666 ^ i23) * (-19923)) ^ 1906900526;
                                                i26 = -488113307;
                                            }
                                        case -1740635197:
                                        case 1940971917:
                                            if (C4263.f13799 <= 0) {
                                                m25666 = C0630.m2566("᩵۬") ^ i24;
                                                i25 = ((m25666 ^ i23) * 11281) ^ (-685272828);
                                                i26 = 1434710948;
                                            } else {
                                                m25666 = C0630.m2566("ܶ᩹") ^ i23;
                                                i25 = ((m25666 ^ i24) * 30409) ^ (-1990923593);
                                                i26 = -378580544;
                                            }
                                        case -1491987838:
                                        case -287100673:
                                            if (RunnableC0588.f2309 >= 0) {
                                                m25666 = (C2105.m6981("ܽ֫") + i23) * (-117);
                                                i25 = ((m25666 ^ i24) * 12243) ^ (-1157189508);
                                                i26 = -1529021304;
                                            } else {
                                                m25666 = (C2105.m6981("ۚ᩹") ^ i24) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                                i25 = ((m25666 ^ i23) * 25715) ^ (-849755767);
                                                i26 = 1712750190;
                                            }
                                        case -1429790025:
                                        case 255572573:
                                            if (C3537.f11231 >= 0) {
                                                m25666 = (i24 - C0630.m2566("ܿۘ")) * (-51);
                                                i25 = ((m25666 ^ i23) * 6895) ^ 391644108;
                                                i26 = 287945740;
                                            } else {
                                                m25666 = C2105.m6981("۟۟") ^ i24;
                                                i25 = ((m25666 ^ i23) * 28549) ^ 580791971;
                                                i26 = -1090844957;
                                            }
                                        case -1111681855:
                                        case 1948565987:
                                            try {
                                                SystemClock.sleep(j);
                                                c34306 = viewOnClickListenerC20402.f6815;
                                                C19119 c191197 = c34306.f10837.f65737;
                                                c34307 = viewOnClickListenerC20402.f6815;
                                                ViewOnClickListenerC2040.m6658(viewOnClickListenerC20402, c191197, c34307.f10842, viewOnClickListenerC20402.f6816, i21);
                                            } catch (Exception unused) {
                                            }
                                            m25666 = C0630.m2566("᩻ܶ") ^ i24;
                                            i25 = ((m25666 ^ i23) * (-8347)) ^ 65311975;
                                            i26 = -1728531105;
                                        case -1105675436:
                                        case -1055553355:
                                            i21 = i20;
                                            if (C2105.m6982() != 0) {
                                                m25666 = (i23 - C0630.m2566("ᩴۜ")) * (-7);
                                                i25 = ((m25666 ^ i24) * 29887) ^ (-1060850901);
                                                i26 = -294540467;
                                            } else {
                                                m25666 = C0630.m2566("᩹ۡ") ^ i23;
                                                i25 = ((m25666 ^ i24) * (-2591)) ^ 1281442818;
                                                i26 = 502946447;
                                            }
                                        case -1103079548:
                                        case 1486468185:
                                            break;
                                        case -1000547104:
                                        case 157096370:
                                            if (C2520.m8026()) {
                                                m25666 = (C2105.m6981("ܽ֫") + i23) * (-117);
                                                i25 = ((m25666 ^ i24) * 12243) ^ (-1157189508);
                                                i26 = -1529021304;
                                            } else {
                                                m25666 = (C2105.m6981("ۚۤ") ^ i23) * (-83);
                                                i25 = ((m25666 ^ i24) * (-14385)) ^ 1665114676;
                                                i26 = -2032277467;
                                            }
                                        case -973096423:
                                        case -696610552:
                                            viewOnClickListenerC20402 = c196592.f63476;
                                            j = 100;
                                            m25666 = C2105.m6981("֨ۡ") ^ i23;
                                            i25 = ((m25666 ^ i24) * 16601) ^ (-1114502606);
                                            i26 = -111381837;
                                        case -809509580:
                                        case -297281512:
                                            ServiceConnectionC3453.m10564();
                                            if (C3245.f10203 > 0) {
                                                m25666 = C2105.m6981("ܳ֡") ^ i23;
                                                i25 = ((m25666 ^ i24) * 6719) ^ 1349334259;
                                                i26 = -128393662;
                                            } else {
                                                m25666 = (i24 - C0630.m2566("ܿۘ")) * (-51);
                                                i25 = ((m25666 ^ i23) * 6895) ^ 391644108;
                                                i26 = 287945740;
                                            }
                                        case -758751675:
                                        case 838883604:
                                            if (C1128.f4106 <= 0) {
                                                m25666 = (i23 - C0630.m2566("ᩴۜ")) * (-7);
                                                i25 = ((m25666 ^ i24) * 29887) ^ (-1060850901);
                                                i26 = -294540467;
                                            } else {
                                                m25666 = (C0630.m2566("ܰ᩸") + i23) * 11;
                                                i25 = ((m25666 ^ i24) * 23981) ^ 1494587285;
                                                i26 = -1091185876;
                                            }
                                        case -594313778:
                                        case -211771883:
                                            if (C4263.m12819() < 0) {
                                                m25666 = C2105.m6981("ܳ֡") ^ i23;
                                                i25 = ((m25666 ^ i24) * 6719) ^ 1349334259;
                                                i26 = -128393662;
                                            } else {
                                                m25666 = C0630.m2566("᩵۬") ^ i24;
                                                i25 = ((m25666 ^ i23) * 11281) ^ (-685272828);
                                                i26 = 1434710948;
                                            }
                                        case -453305593:
                                        case 1028759724:
                                            if (C7811.f24123 < 0) {
                                                m25666 = (i24 - C0630.m2566("ܿۘ")) * (-51);
                                                i25 = ((m25666 ^ i23) * 6895) ^ 391644108;
                                                i26 = 287945740;
                                            } else {
                                                m25666 = (i23 - C0630.m2566("ᩴۜ")) * (-7);
                                                i25 = ((m25666 ^ i24) * 29887) ^ (-1060850901);
                                                i26 = -294540467;
                                            }
                                        case 252185455:
                                        case 867776728:
                                            c196592 = this.f8497;
                                            if (C4159.m12565() >= 0) {
                                                m25666 = (C2105.m6981("ܽܺ") ^ i24) * 39;
                                                i25 = ((m25666 ^ i23) * 4611) ^ (-1018726547);
                                                i26 = 41854508;
                                            } else {
                                                m25666 = (C0630.m2566("۬ۜ") + i24) * 33;
                                                i25 = ((m25666 ^ i23) * 8547) ^ 752302970;
                                                i26 = 674157368;
                                            }
                                        case 350255669:
                                        case 1508444375:
                                            if (C3537.f11231 >= 0) {
                                                m25666 = C2105.m6981("ܳ֡") ^ i23;
                                                i25 = ((m25666 ^ i24) * 6719) ^ 1349334259;
                                                i26 = -128393662;
                                            } else {
                                                m25666 = (C2105.m6981("ܽ֫") + i23) * (-117);
                                                i25 = ((m25666 ^ i24) * 12243) ^ (-1157189508);
                                                i26 = -1529021304;
                                            }
                                        case 553291367:
                                        case 1679273642:
                                            if (RunnableC0588.m2441() >= 0) {
                                                m25666 = C0630.m2566("᩵۬") ^ i24;
                                                i25 = ((m25666 ^ i23) * 11281) ^ (-685272828);
                                                i26 = 1434710948;
                                            } else {
                                                m25666 = (i23 - C2105.m6981("ۜۚ")) * (-59);
                                                i25 = ((m25666 ^ i24) * 23607) ^ (-1535986874);
                                                i26 = 1786863032;
                                            }
                                        case 712184809:
                                        case 1933252211:
                                            C0630.m2564();
                                            m25666 = C2105.m6981("ܳ֡") ^ i23;
                                            i25 = ((m25666 ^ i24) * 6719) ^ 1349334259;
                                            i26 = -128393662;
                                        default:
                                            C0422.m1963();
                                            C0483.m2121();
                                            break;
                                    }
                                    return;
                                }
                            }
                        }));
                        interfaceC12344 = ApplicationC20075.f65008;
                        m2566 = C2105.m6981("ۘ֫") ^ i10;
                        i = ((m2566 ^ i9) * 17929) ^ (-231987654);
                        i2 = 965611373;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    }
                    m2566 = (C2105.m6981("ۜۛ") ^ i10) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                    i = ((m2566 ^ i9) * (-16615)) ^ (-445579542);
                    i2 = 1127579538;
                    i8 = m2566 ^ i2;
                    str5 = str;
                    c192582 = c19258;
                    i12 = i8;
                    i11 = i;
                case -449916643:
                case 1109211000:
                    RunnableC1937.m6387();
                    break;
                case -342567329:
                case 1362676:
                    str = str5;
                    i18 = C2105.m6981(C7811.m20837(f63473, 53, 3, i13));
                    if (C3663.f11553) {
                        m25662 = (i9 - C0630.m2566("۫ܳ")) * (-15);
                        i = ((m25662 ^ i10) * (-15191)) ^ 572355809;
                        i3 = 1201363960;
                    } else {
                        m25662 = (C2105.m6981("ܳܽ") + i9) * (-93);
                        i = ((m25662 ^ i10) * 3441) ^ (-1387934766);
                        i3 = -589833973;
                    }
                    i8 = m25662 ^ i3;
                    str5 = str;
                    i12 = i8;
                    i11 = i;
                case 66271000:
                case 522133244:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    int i21 = (s * s) + 304781764;
                    if ((i21 + i21) - (i16 * i16) >= 0) {
                        m25663 = (i10 - C0630.m2566("ܰۗ")) * 87;
                        i4 = ((m25663 ^ i9) * (-31809)) ^ (-246489600);
                        i5 = -353627191;
                        z2 = r6;
                    } else {
                        m25663 = (C0630.m2566("֡ۧ") ^ i9) * (-111);
                        i4 = ((m25663 ^ i10) * 28113) ^ 944923282;
                        i5 = -2064138437;
                        z2 = r6;
                    }
                    int i1922222 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i1922222;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
                case 92447412:
                case 1323148249:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    ViewOnClickListenerC2040.m6657(viewOnClickListenerC2040, ViewOnClickListenerC2040.m6646(viewOnClickListenerC2040, c19119, c191192, str6, c20364.f65738));
                    executorService = C1802.f6208;
                    z = r6;
                    if (!C0382.m1848()) {
                        m25663 = C2105.m6981("ۗ᩻") ^ i10;
                        i4 = ((m25663 ^ i9) * 30155) ^ (-2103232161);
                        i5 = -1247013196;
                        z2 = r6;
                        int i19222222 = m25663 ^ i5;
                        c191195 = c19119;
                        c191196 = c191192;
                        str5 = str;
                        i12 = i19222222;
                        i11 = i4;
                        r6 = z2;
                        c192582 = c19258;
                    }
                    m25663 = C2105.m6981("۫᩷") ^ i9;
                    i4 = ((m25663 ^ i10) * 3725) ^ 288021816;
                    i5 = -1385480026;
                    z2 = z;
                    int i192222222 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i192222222;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
                case 386494627:
                case 801980886:
                    str = str5;
                    C19258 c192583 = c192582;
                    c191193 = c191195;
                    c191194 = c191196;
                    short s2 = f63473[0];
                    int i22 = s2 + 17458;
                    if (C0630.f2410 <= 0) {
                        s = s2;
                        i16 = i22;
                        c192582 = c192583;
                        int m25665222 = (C0630.m2566("۠᩵") + i10) * (-49);
                        c191195 = c191193;
                        c191196 = c191194;
                        str5 = str;
                        i12 = m25665222 ^ (-2045420647);
                        i11 = ((m25665222 ^ i9) * 24103) ^ (-935814965);
                        c19659 = this;
                    } else {
                        int m69812 = C2105.m6981("ۙᩳ") ^ i9;
                        s = s2;
                        i11 = ((m69812 ^ i10) * (-5267)) ^ 458486779;
                        c191195 = c191193;
                        c191196 = c191194;
                        i16 = i22;
                        str5 = str;
                        c192582 = c192583;
                        i12 = m69812 ^ (-968262560);
                        c19659 = this;
                    }
                case 572907457:
                case 1866943513:
                    str = str5;
                    c19258 = c192582;
                    if (C4263.m12818(interfaceC12344, RunnableC0588.m2436(f63473, 1, 5, i13), z4)) {
                        str5 = str;
                        m6981 = C2105.m6981("᩶᩺") ^ i9;
                        i6 = ((m6981 ^ i10) * 19747) ^ 896104428;
                        i7 = -1731041595;
                        i12 = m6981 ^ i7;
                        i11 = i6;
                        r6 = r6;
                        c192582 = c19258;
                    } else {
                        m2566 = C0630.m2566("ܿۖ") ^ i10;
                        i = ((m2566 ^ i9) * (-4737)) ^ (-2069027318);
                        i2 = 1008095275;
                        i8 = m2566 ^ i2;
                        str5 = str;
                        c192582 = c19258;
                        i12 = i8;
                        i11 = i;
                    }
                case 608373975:
                case 938252158:
                    C1711.m5736();
                    str = str5;
                    c191193 = c191195;
                    c191194 = c191196;
                    int m256652222 = (C0630.m2566("۠᩵") + i10) * (-49);
                    c191195 = c191193;
                    c191196 = c191194;
                    str5 = str;
                    i12 = m256652222 ^ (-2045420647);
                    i11 = ((m256652222 ^ i9) * 24103) ^ (-935814965);
                    c19659 = this;
                case 685851111:
                case 1608274805:
                    str = str5;
                    C3432.m10490(c192582, i14 ^ i15);
                    str2 = AbstractC2021.m6573(f63473, 50, 3, i13);
                    if (C0050.f910 < 0) {
                        m25662 = C2105.m6981("۟ۘ") ^ i9;
                        i = ((m25662 ^ i10) * (-7351)) ^ 63497165;
                        i3 = -1122958042;
                        i8 = m25662 ^ i3;
                        str5 = str;
                        i12 = i8;
                        i11 = i;
                    }
                    c19258 = c192582;
                    m2566 = (C2105.m6981("ۜۛ") ^ i10) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                    i = ((m2566 ^ i9) * (-16615)) ^ (-445579542);
                    i2 = 1127579538;
                    i8 = m2566 ^ i2;
                    str5 = str;
                    c192582 = c19258;
                    i12 = i8;
                    i11 = i;
                case 845837339:
                case 2088941099:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    z4 = false;
                    c19659.f63478 = false;
                    ViewOnClickListenerC2040.m6659(viewOnClickListenerC2040, c19659.f63477, c19119, c191192);
                    z = true;
                    z2 = true;
                    if (C5695.f17556 < 0) {
                        m25663 = C0630.m2566("ܽܳ") ^ i9;
                        i4 = ((m25663 ^ i10) * 2091) ^ 1558373100;
                        i5 = 2078400741;
                        int i1922222222 = m25663 ^ i5;
                        c191195 = c19119;
                        c191196 = c191192;
                        str5 = str;
                        i12 = i1922222222;
                        i11 = i4;
                        r6 = z2;
                        c192582 = c19258;
                    }
                    m25663 = C2105.m6981("۫᩷") ^ i9;
                    i4 = ((m25663 ^ i10) * 3725) ^ 288021816;
                    i5 = -1385480026;
                    z2 = z;
                    int i19222222222 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i19222222222;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
                case 1401720475:
                case 1960822428:
                    dialogInterfaceOnClickListenerC18953 = new DialogInterfaceOnClickListenerC18953();
                    str = str5;
                    str3 = C1005.m3502(f63473, 59, 3, i13);
                    m25662 = (i10 - C2105.m6981("ۡ֨")) * 63;
                    i = ((m25662 ^ i9) * (-32621)) ^ 300951905;
                    i3 = -276949601;
                    i8 = m25662 ^ i3;
                    str5 = str;
                    i12 = i8;
                    i11 = i;
                default:
                    str = str5;
                    c19258 = c192582;
                    c19119 = c191195;
                    c191192 = c191196;
                    c19659.f63478 = r6;
                    c34302 = viewOnClickListenerC2040.f6822;
                    str6 = c34302.f10837.f65738;
                    c34303 = viewOnClickListenerC2040.f6815;
                    c20364 = c34303.f10837;
                    m25663 = C2105.m6981("᩺ܺ") ^ i9;
                    i4 = ((m25663 ^ i10) * (-13065)) ^ (-1672098022);
                    i5 = -589884782;
                    z2 = r6;
                    int i192222222222 = m25663 ^ i5;
                    c191195 = c19119;
                    c191196 = c191192;
                    str5 = str;
                    i12 = i192222222222;
                    i11 = i4;
                    r6 = z2;
                    c192582 = c19258;
            }
            return;
        }
    }
}
