package l;

import moe.shizuku.server.IShizukuService;

/* compiled from: H1R6 */
/* renamed from: l.᩶ۚۡ, reason: contains not printable characters */
/* loaded from: classes5.dex */
public final class C19962 extends AbstractC7548 {

    /* renamed from: ۟֡ܺ, reason: not valid java name and contains not printable characters */
    private static final short[] f64645 = {1089, -29980, -25945, -31630, 4057, 24044, 28953, -26602, 7840, 10425, 2066, 16311};

    /* renamed from: ۜ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewOnClickListenerC5850 f64646;

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C21081 f64647;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public boolean f64648;

    public C19962(ViewOnClickListenerC5850 viewOnClickListenerC5850, C21081 c21081) {
        int i = 722223935;
        int i2 = C3911.f12484;
        int i3 = C1047.f3863;
        this.f64646 = viewOnClickListenerC5850;
        this.f64647 = c21081;
        int m6981 = C2105.m6981("۠۫") ^ i2;
        int i4 = ((m6981 ^ i3) * (-32067)) ^ (-2136330722);
        int i5 = 420267294;
        while (true) {
            i = (m6981 ^ i5) ^ (i4 & (((i ^ i3) * 21647) >> 31));
            switch (i) {
                case -1608969516:
                case 1641263273:
                    AbstractC2021.m6574();
                    throw new RuntimeException();
                case -718661179:
                case -1097984:
                    if (C1773.f6144 <= 0) {
                        m6981 = C0630.m2566("᩸۟") ^ i3;
                        i4 = ((m6981 ^ i2) * 20279) ^ (-1236778522);
                        i5 = -930708210;
                    } else {
                        m6981 = (C0630.m2566("ۜ۬") + i3) * (-51);
                        i4 = ((m6981 ^ i2) * 24167) ^ 1463748095;
                        i5 = 927656926;
                    }
                case -408828485:
                case 13256020:
                    return;
                case -366115787:
                case 300556254:
                    C0382.m1848();
                    m6981 = C2105.m6981("ۡۧ") ^ i2;
                    i4 = ((m6981 ^ i3) * (-6759)) ^ 495434935;
                    i5 = 1190848743;
                case -22513621:
                case 1174256384:
                    if (C3746.m11369() < 0) {
                        m6981 = (i3 - C2105.m6981("۬֨")) * (-119);
                        i4 = ((m6981 ^ i2) * (-11677)) ^ (-652528149);
                        i5 = 745653195;
                    } else {
                        m6981 = C0630.m2566("᩺ۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 31955) ^ 620536034;
                        i5 = -2110178365;
                    }
                case 441220332:
                case 1691952712:
                    C21923.m49329();
                    if (C0483.f2088 >= 0) {
                        m6981 = (i3 - C2105.m6981("۬֨")) * (-119);
                        i4 = ((m6981 ^ i2) * (-11677)) ^ (-652528149);
                        i5 = 745653195;
                    } else {
                        m6981 = (C2105.m6981("۫۫") + i2) * 101;
                        i4 = ((m6981 ^ i3) * (-17349)) ^ 300920644;
                        i5 = -390655646;
                    }
                default:
                    if (C3746.m11369() >= 0) {
                        m6981 = C2105.m6981("ۡۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-6759)) ^ 495434935;
                        i5 = 1190848743;
                    } else {
                        m6981 = (i3 - C2105.m6981("۬֨")) * (-119);
                        i4 = ((m6981 ^ i2) * (-11677)) ^ (-652528149);
                        i5 = 745653195;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
        int i = 1202202359;
        int i2 = C2958.f9394;
        int i3 = RunnableC3474.f10992;
        int m2566 = C0630.m2566("᩸ۙ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-22599)) ^ (-213384465);
        int i5 = -1331108110;
        while (true) {
            i = ((((i ^ i3) * (-28611)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2123592388:
                case -2088350178:
                    if (C3019.m9255() <= 0) {
                        m2566 = C2105.m6981("ۖۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10801) ^ (-1096108722);
                        i5 = 1423740455;
                    } else {
                        m2566 = (C2105.m6981("᩶ۡ") ^ i2) * 127;
                        i4 = ((m2566 ^ i3) * (-12799)) ^ (-1536823127);
                        i5 = 1004673014;
                    }
                case -1876264061:
                case -391475832:
                    ViewOnClickListenerC1958.m6429();
                    if (C3746.f11829 <= 0) {
                        m2566 = C0630.m2566("ܽۗ") ^ i3;
                        i4 = ((m2566 ^ i2) * 17445) ^ (-297538483);
                        i5 = -1633559401;
                    } else {
                        m2566 = (C0630.m2566("۬ۤ") ^ i2) * 37;
                        i4 = ((m2566 ^ i3) * (-15659)) ^ 2014967348;
                        i5 = 1805173222;
                    }
                case -1746948535:
                case 1988487094:
                    if (AbstractC2021.m6574()) {
                        m2566 = (C0630.m2566("ۤ᩺") + i2) * (-19);
                        i4 = ((m2566 ^ i3) * 24505) ^ 1328948591;
                        i5 = 1585286826;
                    } else {
                        m2566 = C0630.m2566("ۧۨ") ^ i3;
                        i4 = ((m2566 ^ i2) * 15561) ^ (-2057876318);
                        i5 = 1815468515;
                    }
                case -1607668814:
                case -332548878:
                    if (C2126.f7087) {
                        m2566 = (C0630.m2566("ۤ᩺") + i2) * (-19);
                        i4 = ((m2566 ^ i3) * 24505) ^ 1328948591;
                        i5 = 1585286826;
                    } else {
                        m2566 = C0630.m2566("ۙ᩻") ^ i3;
                        i4 = ((m2566 ^ i2) * 27923) ^ 1597668645;
                        i5 = 1914376281;
                    }
                case -1271323923:
                case -456809096:
                    if (C3683.m11222()) {
                        m2566 = C0630.m2566("ܽۗ") ^ i3;
                        i4 = ((m2566 ^ i2) * 17445) ^ (-297538483);
                        i5 = -1633559401;
                    } else {
                        m2566 = (C2105.m6981("᩶᩹") ^ i3) * (-63);
                        i4 = ((m2566 ^ i2) * 22309) ^ 1108478082;
                        i5 = 1884752295;
                    }
                case -1188804258:
                case -865681817:
                    if (viewOnClickListenerC5850.isDestroyed()) {
                        m2566 = (C2105.m6981("ᩴᩴ") + i2) * 29;
                        i4 = ((m2566 ^ i3) * (-18567)) ^ 333225560;
                        i5 = -700295526;
                    } else {
                        m2566 = C2105.m6981("ۖᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-20003)) ^ 2044644766;
                        i5 = 1797174632;
                    }
                case -958081664:
                case 1666962938:
                    viewOnClickListenerC5850 = this.f64646;
                    if (C2958.m9033(viewOnClickListenerC5850)) {
                        m2566 = (C2105.m6981("ᩴᩴ") + i2) * 29;
                        i4 = ((m2566 ^ i3) * (-18567)) ^ 333225560;
                        i5 = -700295526;
                    } else {
                        m2566 = C0630.m2566("۟ۖ") ^ i3;
                        i4 = ((m2566 ^ i2) * 24373) ^ 618436392;
                        i5 = -657563868;
                    }
                case -820865217:
                case -53554989:
                    if (C2126.m7040()) {
                        m2566 = (C2105.m6981("᩺ۖ") ^ i2) * 77;
                        i4 = ((m2566 ^ i3) * 29335) ^ (-266527740);
                        i5 = 1095049032;
                    } else {
                        m2566 = C2105.m6981("ۨܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19851)) ^ 2007570399;
                        i5 = 868667996;
                    }
                case -778933381:
                case 334574390:
                    if (C4616.f14690 <= 0) {
                        m2566 = (C0630.m2566("۬ۤ") ^ i2) * 37;
                        i4 = ((m2566 ^ i3) * (-15659)) ^ 2014967348;
                        i5 = 1805173222;
                    } else {
                        m2566 = (C2105.m6981("᩹ܿ") ^ i2) * 15;
                        i4 = ((m2566 ^ i3) * (-32475)) ^ (-844925734);
                        i5 = -2286735;
                    }
                case -499028939:
                case 1540674706:
                    if (C2520.f8000 >= 0) {
                        m2566 = (C0630.m2566("۬ۤ") ^ i2) * 37;
                        i4 = ((m2566 ^ i3) * (-15659)) ^ 2014967348;
                        i5 = 1805173222;
                    } else {
                        m2566 = C0630.m2566("ۧܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * 6593) ^ (-188270368);
                        i5 = -1359444060;
                    }
                case -408457266:
                case 892770639:
                    C7811.m20844();
                    if (C2272.f7362) {
                        m2566 = (C0630.m2566("۬ۤ") ^ i2) * 37;
                        i4 = ((m2566 ^ i3) * (-15659)) ^ 2014967348;
                        i5 = 1805173222;
                    } else {
                        m2566 = (C0630.m2566("ۤ᩺") + i2) * (-19);
                        i4 = ((m2566 ^ i3) * 24505) ^ 1328948591;
                        i5 = 1585286826;
                    }
                case -238900659:
                case -11799040:
                    C0964.m3413();
                    ServiceConnectionC3453.m10564();
                    break;
                case -230444943:
                case 527639976:
                    RunnableC1108.m3781(viewOnClickListenerC5850);
                    m2566 = (C2105.m6981("ᩴᩴ") + i2) * 29;
                    i4 = ((m2566 ^ i3) * (-18567)) ^ 333225560;
                    i5 = -700295526;
                case -113843769:
                case 108258413:
                    C7106.m19120();
                    RunnableC3474.m10630();
                    m2566 = C0630.m2566("ܽۗ") ^ i3;
                    i4 = ((m2566 ^ i2) * 17445) ^ (-297538483);
                    i5 = -1633559401;
                case -92950777:
                case 1753634637:
                    C2126.m7040();
                    if (ServiceConnectionC3453.f10921 < 0) {
                        m2566 = (C0630.m2566("۬ۤ") ^ i2) * 37;
                        i4 = ((m2566 ^ i3) * (-15659)) ^ 2014967348;
                        i5 = 1805173222;
                    } else {
                        m2566 = C2105.m6981("ۖۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10801) ^ (-1096108722);
                        i5 = 1423740455;
                    }
                case 183801496:
                case 530767853:
                    C4075.m12246(viewOnClickListenerC5850, exc, null);
                    if (RunnableC1937.m6373()) {
                        m2566 = (C2105.m6981("ᩴᩴ") + i2) * 29;
                        i4 = ((m2566 ^ i3) * (-18567)) ^ 333225560;
                        i5 = -700295526;
                    } else {
                        m2566 = C2105.m6981("᩷ۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-32525)) ^ 1269608003;
                        i5 = -363674501;
                    }
                case 232769711:
                case 1776805630:
                    if (C5695.f17556 >= 0) {
                        m2566 = C2105.m6981("ۖۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10801) ^ (-1096108722);
                        i5 = 1423740455;
                    } else {
                        m2566 = (C0630.m2566("ܽܶ") ^ i2) * (-117);
                        i4 = ((m2566 ^ i3) * (-21889)) ^ 1492356971;
                        i5 = 1983288742;
                    }
                case 319877377:
                case 1143775967:
                    break;
                case 1166608132:
                case 1386639144:
                    if (C4263.m12819() >= 0) {
                        m2566 = (C0630.m2566("ۤ᩺") + i2) * (-19);
                        i4 = ((m2566 ^ i3) * 24505) ^ 1328948591;
                        i5 = 1585286826;
                    } else {
                        m2566 = C2105.m6981("ܽ۫") ^ i2;
                        i4 = ((m2566 ^ i3) * (-10273)) ^ 1014654617;
                        i5 = 1092296500;
                    }
                default:
                    if (C3019.m9255() <= 0) {
                        m2566 = C2105.m6981("ۖۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10801) ^ (-1096108722);
                        i5 = 1423740455;
                    } else {
                        m2566 = (i3 - C0630.m2566("۟᩺")) * 51;
                        i4 = ((m2566 ^ i2) * (-26855)) ^ 1346800094;
                        i5 = -633104540;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    public final void mo1009() {
        char c;
        short s;
        int m2566;
        int i;
        int i2;
        int m6981;
        int i3;
        int m25662;
        int i4;
        int i5;
        int i6;
        int i7 = C5695.f17556;
        int i8 = C3432.f10845;
        int m25663 = (C0630.m2566("᩻ۛ") + i8) * 87;
        int i9 = ((m25663 ^ i7) * 21485) ^ (-1023675927);
        C23881 c23881 = null;
        short[] sArr = null;
        int i10 = m25663 ^ (-196528860);
        boolean z = false;
        char c2 = 0;
        short s2 = 0;
        short s3 = 0;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 0;
        int i15 = -132866979;
        C21081 c21081 = null;
        C18237 c18237 = null;
        while (true) {
            i15 = i10 ^ (i9 & (((i15 ^ i7) * 3877) >> 31));
            switch (i15) {
                case -2139655652:
                case 642930187:
                    c = c2;
                    s = s2;
                    z = true;
                    m2566 = (C0630.m2566("ܺۚ") + i8) * (-47);
                    i = ((m2566 ^ i7) * (-11693)) ^ 855158264;
                    i2 = -660503405;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -2127159335:
                case 26780791:
                    c = c2;
                    s = s2;
                    i14 = 45465;
                    m2566 = (C0630.m2566("ۚܺ") + i7) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                    i = ((m2566 ^ i8) * 12171) ^ (-1409452317);
                    i2 = 1423462481;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -2059038954:
                case 808716880:
                    c = c2;
                    s = s2;
                    c18237.m42484(c21081.f67993);
                    c23881 = C3683.m11224(c18237);
                    if (C0964.m3413()) {
                        m2566 = (C0630.m2566("ܰܽ") ^ i7) * (-71);
                        i = ((m2566 ^ i8) * 1629) ^ (-818608264);
                        i2 = 546430418;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    m2566 = (C0630.m2566("ܽ۠") + i7) * (-63);
                    i = ((m2566 ^ i8) * (-7827)) ^ (-819291023);
                    i2 = -1272664243;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -1947563419:
                case -734436657:
                    C3432.m10477();
                    c = c2;
                    m6981 = C0630.m2566("֨᩸") ^ i8;
                    i = ((m6981 ^ i7) * (-21759)) ^ 1585163518;
                    i3 = 744674939;
                    i6 = m6981 ^ i3;
                    c2 = c;
                    i10 = i6;
                    i9 = i;
                case -1785544786:
                case 431580187:
                    c = c2;
                    s = s2;
                    this.f64648 = z;
                    if (!C1773.m5916(c23881)) {
                        m2566 = (C2105.m6981("֡ۜ") ^ i7) * (-79);
                        i = ((m2566 ^ i8) * (-28005)) ^ 2119973313;
                        i2 = 1555820873;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    m2566 = (C0630.m2566("ۙ᩹") ^ i7) * 17;
                    i = ((m2566 ^ i8) * (-18013)) ^ 1636188642;
                    i2 = 483145161;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -1755123707:
                case 1614809928:
                    c = c2;
                    s = s2;
                    if (!this.f64648) {
                        m2566 = C2105.m6981("ܽᩴ") ^ i8;
                        i = ((m2566 ^ i7) * (-10723)) ^ 926386613;
                        i2 = -1180445432;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    m2566 = (C0630.m2566("ۙ᩹") ^ i7) * 17;
                    i = ((m2566 ^ i8) * (-18013)) ^ 1636188642;
                    i2 = 483145161;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -1720302461:
                case -1161658414:
                    C4263.m12819();
                    return;
                case -1640160719:
                case 2129897830:
                    c = c2;
                    s = s2;
                    i14 = 21524;
                    m2566 = (C0630.m2566("ۚܺ") + i7) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                    i = ((m2566 ^ i8) * 12171) ^ (-1409452317);
                    i2 = 1423462481;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -1634852194:
                case -392954821:
                    c = c2;
                    s = s2;
                    if ((i12 + i13) - i11 < 0) {
                        m2566 = (C0630.m2566("ۚ֡") + i8) * 101;
                        i = ((m2566 ^ i7) * 11795) ^ 1338073850;
                        i2 = -261364654;
                    } else {
                        m2566 = (C0630.m2566("ܺ۠") ^ i7) * (-11);
                        i = ((m2566 ^ i8) * (-9179)) ^ 1038300022;
                        i2 = -1335238909;
                    }
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -1267974026:
                case 1099808238:
                    if (C3683.f11629 < 0) {
                        c = c2;
                        s = s2;
                        m2566 = (C0630.m2566("ܽ۠") + i7) * (-63);
                        i = ((m2566 ^ i8) * (-7827)) ^ (-819291023);
                        i2 = -1272664243;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    c = c2;
                    s = s2;
                    m2566 = (i8 - C2105.m6981("ۜᩳ")) * 115;
                    i = ((m2566 ^ i7) * (-15185)) ^ (-943198437);
                    i2 = -1330392155;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -792159409:
                case -749754416:
                    s = s2;
                    c2 = '\b';
                    if (C1005.f3721) {
                        m25662 = C0630.m2566("ᩳ۠") ^ i7;
                        i4 = ((m25662 ^ i8) * 26569) ^ (-2104360559);
                        i5 = -1597225461;
                        i10 = m25662 ^ i5;
                        i9 = i4;
                        s2 = s;
                    }
                    m25662 = C2105.m6981("᩵᩷") ^ i7;
                    i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                    i5 = 957156410;
                    i10 = m25662 ^ i5;
                    i9 = i4;
                    s2 = s;
                case -596079154:
                case -74427967:
                    return;
                case -524728751:
                case 60417089:
                    c = c2;
                    s = s2;
                    z = false;
                    m2566 = (C0630.m2566("ܺۚ") + i8) * (-47);
                    i = ((m2566 ^ i7) * (-11693)) ^ 855158264;
                    i2 = -660503405;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -458723390:
                case 1308122257:
                    c = c2;
                    s2 = sArr[c];
                    s3 = 21338;
                    if (!C2272.f7362) {
                        m6981 = C2105.m6981("᩸۠") ^ i7;
                        i = ((m6981 ^ i8) * 3669) ^ 938990705;
                        i3 = 521997342;
                        i6 = m6981 ^ i3;
                        c2 = c;
                        i10 = i6;
                        i9 = i;
                    }
                    m6981 = C2105.m6981("֡ܶ") ^ i8;
                    i = ((m6981 ^ i7) * 27453) ^ 35080634;
                    i3 = -191278221;
                    i6 = m6981 ^ i3;
                    c2 = c;
                    i10 = i6;
                    i9 = i;
                case -418752506:
                case 938994897:
                    C1773.m5908();
                    if (C22628.f73083 > 0) {
                        c = c2;
                        m6981 = C0630.m2566("֨᩸") ^ i8;
                        i = ((m6981 ^ i7) * (-21759)) ^ 1585163518;
                        i3 = 744674939;
                        i6 = m6981 ^ i3;
                        c2 = c;
                        i10 = i6;
                        i9 = i;
                    } else {
                        s = s2;
                        m25662 = C2105.m6981("᩵᩷") ^ i7;
                        i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                        i5 = 957156410;
                        i10 = m25662 ^ i5;
                        i9 = i4;
                        s2 = s;
                    }
                case -240451078:
                case 353771736:
                    c = c2;
                    s = s2;
                    if (C21923.m49333(c23881) == 1801) {
                        m2566 = (C0630.m2566("᩸᩺") + i7) * 123;
                        i = ((m2566 ^ i8) * (-3625)) ^ (-1158473654);
                        i2 = -582932024;
                    } else {
                        m2566 = C2105.m6981("ۤۚ") ^ i8;
                        i = ((m2566 ^ i7) * 28901) ^ (-1814496995);
                        i2 = -1232248033;
                    }
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
                case -171399818:
                case 2135784956:
                    c = c2;
                    s = s2;
                    sArr = f64645;
                    if (C1128.f4106 > 0) {
                        m2566 = (i8 - C0630.m2566("ܽܿ")) * (-65);
                        i = ((m2566 ^ i7) * 20985) ^ (-1369922598);
                        i2 = -691588683;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    s2 = s;
                    m6981 = C2105.m6981("֡ܶ") ^ i8;
                    i = ((m6981 ^ i7) * 27453) ^ 35080634;
                    i3 = -191278221;
                    i6 = m6981 ^ i3;
                    c2 = c;
                    i10 = i6;
                    i9 = i;
                case 12719966:
                case 1580482052:
                    c = c2;
                    s = s2;
                    c18237.m42484(c21081.f67995);
                    if (C0237.m1481() >= 0) {
                        c2 = c;
                        m25662 = C2105.m6981("᩵᩷") ^ i7;
                        i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                        i5 = 957156410;
                        i10 = m25662 ^ i5;
                        i9 = i4;
                        s2 = s;
                    } else {
                        m2566 = (C0630.m2566("ۢ᩺") ^ i8) * 25;
                        i = ((m2566 ^ i7) * 19649) ^ 1545337121;
                        i2 = 708846694;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                case 213349623:
                case 323018058:
                    short[] sArr2 = f64645;
                    c = c2;
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("֨᩸") ^ i8;
                        i = ((m6981 ^ i7) * (-21759)) ^ 1585163518;
                        i3 = 744674939;
                        i6 = m6981 ^ i3;
                        c2 = c;
                        i10 = i6;
                        i9 = i;
                    } else {
                        s = s2;
                        String m7507 = C2272.m7507(sArr2, 9, 3, i14);
                        if (RunnableC1937.f6483 >= 0) {
                            c2 = c;
                            m25662 = C2105.m6981("᩵᩷") ^ i7;
                            i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                            i5 = 957156410;
                            i10 = m25662 ^ i5;
                            i9 = i4;
                            s2 = s;
                        } else {
                            int m25664 = C0630.m2566(m7507) ^ 2127401194;
                            if (RunnableC3474.f10992 > 0) {
                                throw new C1637(AbstractC2021.m6563(c23881, m25664));
                            }
                            s2 = s;
                            m6981 = C2105.m6981("֡ܶ") ^ i8;
                            i = ((m6981 ^ i7) * 27453) ^ 35080634;
                            i3 = -191278221;
                            i6 = m6981 ^ i3;
                            c2 = c;
                            i10 = i6;
                            i9 = i;
                        }
                    }
                case 666348008:
                case 1925054572:
                    c = c2;
                    s = s2;
                    c18237 = RunnableC1108.m3787(4358);
                    c21081 = this.f64647;
                    if (C2167.m7155()) {
                        c2 = c;
                        m25662 = C2105.m6981("᩵᩷") ^ i7;
                        i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                        i5 = 957156410;
                        i10 = m25662 ^ i5;
                        i9 = i4;
                        s2 = s;
                    } else {
                        m2566 = (C2105.m6981("ܽۡ") ^ i8) * (-81);
                        i = ((m2566 ^ i7) * (-1017)) ^ 219846607;
                        i2 = -364617776;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                case 668593004:
                case 722636375:
                    C0630.m2564();
                    if (C2126.m7040()) {
                        c = c2;
                        s = s2;
                        m2566 = (i8 - C2105.m6981("ۜᩳ")) * 115;
                        i = ((m2566 ^ i7) * (-15185)) ^ (-943198437);
                        i2 = -1330392155;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    } else {
                        s = s2;
                        m25662 = C2105.m6981("᩵᩷") ^ i7;
                        i4 = ((m25662 ^ i8) * 17179) ^ (-424841755);
                        i5 = 957156410;
                        i10 = m25662 ^ i5;
                        i9 = i4;
                        s2 = s;
                    }
                default:
                    c = c2;
                    s = s2;
                    i11 = s * s3;
                    i12 = s * s;
                    i13 = 113827561;
                    if (C1294.f4556 < 0) {
                        m2566 = (C2105.m6981("ۘܿ") + i8) * 65;
                        i = ((m2566 ^ i7) * (-22999)) ^ (-188398723);
                        i2 = 317793908;
                        i6 = m2566 ^ i2;
                        c2 = c;
                        s2 = s;
                        i10 = i6;
                        i9 = i;
                    }
                    m2566 = (i8 - C2105.m6981("ۜᩳ")) * 115;
                    i = ((m2566 ^ i7) * (-15185)) ^ (-943198437);
                    i2 = -1330392155;
                    i6 = m2566 ^ i2;
                    c2 = c;
                    s2 = s;
                    i10 = i6;
                    i9 = i;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:71:0x0080, code lost:
    
        if (l.C2167.f7158 < 0) goto L66;
     */
    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1006() {
        /*
            Method dump skipped, instructions count: 968
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C19962.mo1006():void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x0070, code lost:
    
        if (l.ServiceConnectionC3453.f10921 < 0) goto L61;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x0076, code lost:
    
        if (l.C4117.f13076 > 0) goto L18;
     */
    /* JADX WARN: Code restructure failed: missing block: B:24:0x007e, code lost:
    
        if (l.C0630.f2410 > 0) goto L18;
     */
    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1008() {
        /*
            Method dump skipped, instructions count: 774
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C19962.mo1008():void");
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        C0237.m1487(this);
    }
}
