package l;

import android.content.Context;
import android.util.AttributeSet;
import com.alipay.sdk.m.y.q;

/* compiled from: Z3WS */
/* renamed from: l.᩶ۗ᩷, reason: contains not printable characters */
/* loaded from: classes5.dex */
public class C19910 extends AbstractC3723 {

    /* renamed from: ֡ۧܳ, reason: not valid java name and contains not printable characters */
    private static final short[] f64322 = {6742, 9335, 7598, 3861, 3765, 151, 11523};

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public C19910(Context context, AttributeSet attributeSet, int i, int i2) {
        super(context, attributeSet, i, i2);
        int i3 = 909169756;
        int i4 = C1047.f3863;
        int i5 = ServiceConnectionC3453.f10921;
        int m6981 = C2105.m6981("᩵۬") ^ i5;
        int i6 = ((m6981 ^ i4) * (-15653)) ^ 513352779;
        int i7 = 1062737808;
        while (true) {
            i3 = (m6981 ^ i7) ^ (i6 & (((i3 ^ i4) * (-16859)) >> 31));
            switch (i3) {
                case -1754157754:
                case -743646729:
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = (C0630.m2566("᩺᩷") + i4) * (-5);
                        i6 = ((m6981 ^ i5) * (-731)) ^ (-1982246140);
                        i7 = 1382428712;
                    } else {
                        m6981 = (C2105.m6981("᩶ۤ") + i5) * 37;
                        i6 = ((m6981 ^ i4) * (-29615)) ^ 175176726;
                        i7 = 1978274837;
                        continue;
                    }
                case -980631867:
                case 217765683:
                    if (AbstractC2021.f6743 > 0) {
                        break;
                    } else {
                        m6981 = C2105.m6981("᩷۠") ^ i4;
                        i6 = ((m6981 ^ i5) * 28795) ^ (-2065763634);
                        i7 = -1837558586;
                    }
                case -620990493:
                case 424659724:
                    if (C3911.m11924() <= 0) {
                        break;
                    } else {
                        m6981 = C0630.m2566("ۧܺ") ^ i5;
                        i6 = ((m6981 ^ i4) * (-27167)) ^ 796936732;
                        i7 = 695965318;
                    }
                case -331057320:
                case 520235750:
                    C7811.m20844();
                    C2105.m6982();
                    break;
                case 483934036:
                case 1861314794:
                    RunnableC1108.m3790();
                    if (C3245.m9925() == 0) {
                        break;
                    } else {
                        m6981 = C2105.m6981("᩶᩵") ^ i5;
                        i6 = ((m6981 ^ i4) * 24275) ^ (-692997571);
                        i7 = 906548268;
                    }
                case 899945155:
                case 1269845434:
                    return;
                default:
                    C3019.m9255();
                    throw new RuntimeException();
            }
            m6981 = (C0630.m2566("᩸ܰ") + i4) * 45;
            i6 = ((m6981 ^ i5) * (-26131)) ^ (-1924333282);
            i7 = -1342855948;
        }
    }

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public C19910(Context context, AttributeSet attributeSet, int i) {
        super(context, attributeSet, i);
        int i2 = -479611278;
        int i3 = ViewOnClickListenerC1958.f6529;
        int i4 = C1294.f4556;
        int m6981 = (C2105.m6981("۬ۙ") ^ i3) * 87;
        int i5 = ((m6981 ^ i4) * (-9125)) ^ (-1926154370);
        int i6 = 1452003796;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i4) * (-29935)) >> 31));
            switch (i2) {
                case -2059935693:
                case -1760699471:
                    C3663.m11168();
                    if (C1005.m3501()) {
                        m6981 = (C2105.m6981("᩵᩹") + i3) * 39;
                        i5 = ((m6981 ^ i4) * (-8493)) ^ 767765466;
                        i6 = 930863834;
                    } else {
                        m6981 = (i4 - C0630.m2566("ܶۢ")) * 27;
                        i5 = ((m6981 ^ i3) * 13579) ^ 487323180;
                        i6 = -1526608923;
                    }
                case -1899688644:
                case -402675852:
                    AbstractC2021.m6574();
                    if (RunnableC0588.f2309 < 0) {
                        m6981 = (C2105.m6981("᩵᩹") + i3) * 39;
                        i5 = ((m6981 ^ i4) * (-8493)) ^ 767765466;
                        i6 = 930863834;
                    } else {
                        m6981 = (C2105.m6981("֡ۘ") ^ i3) * 77;
                        i5 = ((m6981 ^ i4) * 3111) ^ (-2083172241);
                        i6 = -876881453;
                    }
                case -1876918603:
                case 1169721120:
                    return;
                case -1484006102:
                case -791469376:
                    ServiceConnectionC3453.m10564();
                    C4616.m13552();
                    m6981 = (i4 - C0630.m2566("ᩴ۠")) * 15;
                    i5 = ((m6981 ^ i3) * 14645) ^ 804166979;
                    i6 = 1611334447;
                case -1293378717:
                case 559496094:
                    C2272.m7503();
                    throw new RuntimeException();
                case -916787681:
                case -426433145:
                    if (C1916.f6442) {
                        m6981 = (i4 - C0630.m2566("ܶۢ")) * 27;
                        i5 = ((m6981 ^ i3) * 13579) ^ 487323180;
                        i6 = -1526608923;
                    } else {
                        m6981 = (i4 - C0630.m2566("ᩴ۠")) * 15;
                        i5 = ((m6981 ^ i3) * 14645) ^ 804166979;
                        i6 = 1611334447;
                    }
                default:
                    if (C1773.m5908() <= 0) {
                        m6981 = C2105.m6981("ۜۨ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-10765)) ^ 1720683000;
                        i6 = 567107739;
                    } else {
                        m6981 = C0630.m2566("ۜܳ") ^ i3;
                        i5 = ((m6981 ^ i4) * 21659) ^ (-1541328772);
                        i6 = -1006436011;
                    }
            }
        }
    }

    public C19910(Context context, AttributeSet attributeSet) {
        super(context, attributeSet);
    }

    public C19910(Context context) {
        super(context);
    }

    @Override // l.AbstractC3723
    /* renamed from: ֫ */
    public final void mo6161(AbstractActivityC3346 abstractActivityC3346) {
        String str;
        int m6981;
        int i;
        int i2;
        int m2566;
        int i3;
        int i4;
        String str2 = null;
        char c = 0;
        short s = 0;
        int i5 = 0;
        int i6 = 0;
        int i7 = 0;
        short s2 = 0;
        int i8 = 0;
        short[] sArr = null;
        int i9 = 0;
        int i10 = 0;
        short[] sArr2 = null;
        int i11 = 0;
        int i12 = 0;
        int i13 = 1730681597;
        int i14 = C5695.f17556;
        int i15 = C0630.f2410;
        int m69812 = C2105.m6981("ܶ۬") ^ i15;
        int i16 = ((m69812 ^ i14) * (-20603)) ^ (-891647330);
        int i17 = m69812 ^ 1000102620;
        short[] sArr3 = null;
        String str3 = null;
        while (true) {
            i13 = i17 ^ (i16 & (((i13 ^ i14) * (-28101)) >> 31));
            switch (i13) {
                case -2105494472:
                case 1009436380:
                    C0964.m3402(new C5092(this, abstractActivityC3346));
                    break;
                case -2086874430:
                case -872695895:
                    str = str2;
                    if (C1047.m3602()) {
                        m6981 = C0630.m2566("᩸᩷") ^ i14;
                        i = ((m6981 ^ i15) * (-8541)) ^ (-1657015437);
                        i2 = 190369680;
                    } else {
                        m6981 = (C0630.m2566("ܿ᩻") ^ i15) * 49;
                        i = ((m6981 ^ i14) * (-17847)) ^ (-684523412);
                        i2 = 201327597;
                    }
                    String str4 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4;
                case -1871848454:
                case 1431423040:
                    str = str2;
                    s = sArr3[c];
                    i5 = s * s;
                    if (C1916.f6442) {
                        m6981 = (i14 - C2105.m6981("ۚۚ")) * 31;
                        i = ((m6981 ^ i15) * 11397) ^ (-788428591);
                        i2 = 1551207899;
                        String str42 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str42;
                    }
                    m6981 = (i15 - C0630.m2566("ۤ۟")) * 97;
                    i = ((m6981 ^ i14) * 7287) ^ 1884619431;
                    i2 = -1496529754;
                    String str422 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str422;
                case -1683412312:
                case 364839773:
                    str = str2;
                    i8 = 19950;
                    m6981 = C0630.m2566("۫֡") ^ i15;
                    i = ((m6981 ^ i14) * (-16773)) ^ 312030006;
                    i2 = -1857321735;
                    String str4222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4222;
                case -1421557203:
                case -1375758077:
                    str = str2;
                    c = 0;
                    if (C5695.f17556 < 0) {
                        m6981 = C0630.m2566("ܿۧ") ^ i15;
                        i = ((m6981 ^ i14) * (-32329)) ^ (-515502619);
                        i2 = -891432140;
                        String str42222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str42222;
                    }
                    m6981 = (i15 - C0630.m2566("ۤ۟")) * 97;
                    i = ((m6981 ^ i14) * 7287) ^ 1884619431;
                    i2 = -1496529754;
                    String str422222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str422222;
                case -1352862670:
                case -608016731:
                    C5695.m16023();
                    C0422.m1963();
                    str = str2;
                    m6981 = (i15 - C0630.m2566("ۤ۟")) * 97;
                    i = ((m6981 ^ i14) * 7287) ^ 1884619431;
                    i2 = -1496529754;
                    String str4222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4222222;
                case -1293474750:
                case -576573854:
                    str = str2;
                    int i18 = s + s2;
                    if (i7 - (i18 * i18) < 0) {
                        m6981 = C0630.m2566("᩺᩺") ^ i15;
                        i = ((m6981 ^ i14) * (-9853)) ^ 928480134;
                        i2 = -1055225170;
                    } else {
                        m6981 = (C0630.m2566("ۘܺ") ^ i14) * 85;
                        i = ((m6981 ^ i15) * 4901) ^ 291087219;
                        i2 = 512210788;
                    }
                    String str42222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str42222222;
                case -1265816609:
                case 543923309:
                    sArr2 = f64322;
                    i11 = 4;
                    i12 = 3;
                    if (C3245.f10203 <= 0) {
                        m6981 = C0630.m2566("᩵ۘ") ^ i15;
                        str = str2;
                        i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                        i2 = 1194163938;
                        String str422222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str422222222;
                    } else {
                        m2566 = (C0630.m2566("۬ܺ") + i14) * (-21);
                        i3 = ((m2566 ^ i15) * (-17739)) ^ (-1042272880);
                        i4 = 1766862372;
                        i17 = m2566 ^ i4;
                        i16 = i3;
                    }
                case -1204085255:
                case 496937639:
                    if (C2167.f7158 < 0) {
                        str = str2;
                        m6981 = C2105.m6981("᩶ۚ") ^ i14;
                        i = ((m6981 ^ i15) * 26269) ^ (-920366245);
                        i2 = -180200534;
                        String str4222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str4222222222;
                    }
                    m6981 = (C2105.m6981("ᩴۙ") ^ i15) * 65;
                    str = str2;
                    i = ((m6981 ^ i14) * (-7725)) ^ (-1872063210);
                    i2 = 399859880;
                    String str42222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str42222222222;
                case -1162063103:
                case 276586187:
                    C4159.m12565();
                    if (C1773.f6144 <= 0) {
                        str = str2;
                        m6981 = (i15 - C0630.m2566("ۤ۟")) * 97;
                        i = ((m6981 ^ i14) * 7287) ^ 1884619431;
                        i2 = -1496529754;
                        String str422222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str422222222222;
                    } else {
                        m2566 = (i14 - C0630.m2566("۫ۛ")) * 19;
                        i3 = ((m2566 ^ i15) * (-9299)) ^ (-497180592);
                        i4 = 1086627616;
                        i17 = m2566 ^ i4;
                        i16 = i3;
                    }
                case -1018101624:
                case -437792750:
                    str = str2;
                    i6 = 96943716;
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("ۧۖ") ^ i15;
                        i = ((m6981 ^ i14) * (-29347)) ^ 1583688404;
                        i2 = -1962599392;
                        String str4222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str4222222222222;
                    }
                    str2 = str;
                    m6981 = C0630.m2566("᩵ۘ") ^ i15;
                    str = str2;
                    i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                    i2 = 1194163938;
                    String str42222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str42222222222222;
                case -857613486:
                case 467765856:
                    C1504.m5167(C2105.m6981(str2) ^ 2130230143);
                    break;
                case -776654935:
                case 1911912667:
                    str = str2;
                    int i19 = i5 + i6;
                    i7 = i19 + i19;
                    s2 = 9846;
                    if (RunnableC3474.m10630()) {
                        m6981 = (C2105.m6981("ۤܶ") ^ i14) * 15;
                        i = ((m6981 ^ i15) * 11171) ^ (-1153761561);
                        i2 = 1419833225;
                        String str422222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str422222222222222;
                    }
                    str2 = str;
                    m6981 = C0630.m2566("᩵ۘ") ^ i15;
                    str = str2;
                    i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                    i2 = 1194163938;
                    String str4222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4222222222222222;
                case -586031107:
                case 854543541:
                    str = str2;
                    i8 = 28747;
                    m6981 = C0630.m2566("۫֡") ^ i15;
                    i = ((m6981 ^ i14) * (-16773)) ^ 312030006;
                    i2 = -1857321735;
                    String str42222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str42222222222222222;
                case -482866989:
                case 1089999206:
                    str2 = ViewOnClickListenerC1958.m6435(sArr2, i11, i12, i8);
                    if (C1294.f4556 >= 0) {
                        m6981 = C0630.m2566("᩵ۘ") ^ i15;
                        str = str2;
                        i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                        i2 = 1194163938;
                        String str422222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str422222222222222222;
                    } else {
                        m2566 = (C0630.m2566("᩺ܽ") ^ i14) * (-33);
                        i3 = ((m2566 ^ i15) * (-11497)) ^ (-280522572);
                        i4 = -1599503746;
                        i17 = m2566 ^ i4;
                        i16 = i3;
                    }
                case -429088456:
                case 994725057:
                    str = str2;
                    if (C0798.m3001()) {
                        m6981 = (C2105.m6981("ᩳܽ") ^ i15) * 49;
                        i = ((m6981 ^ i14) * 20277) ^ (-121134573);
                        i2 = 1614900848;
                    } else {
                        m6981 = C2105.m6981("ۨ۬") ^ i15;
                        i = ((m6981 ^ i14) * (-7723)) ^ (-858310709);
                        i2 = 2061217327;
                    }
                    String str4222222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4222222222222222222;
                case 90884965:
                case 1712753247:
                    str3 = RunnableC1108.m3789(sArr, i9, i10, i8);
                    if (!C1504.f5354) {
                        str = str2;
                        m6981 = C2105.m6981("ۛ᩹") ^ i14;
                        i = ((m6981 ^ i15) * (-8655)) ^ 700069430;
                        i2 = -594668905;
                        String str42222222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str42222222222222222222;
                    }
                    m6981 = (C2105.m6981("ᩴۙ") ^ i15) * 65;
                    str = str2;
                    i = ((m6981 ^ i14) * (-7725)) ^ (-1872063210);
                    i2 = 399859880;
                    String str422222222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str422222222222222222222;
                case 410403033:
                case 1417998595:
                    C4117.m12364();
                    if (C0422.f1886 <= 0) {
                        m2566 = (i14 - C0630.m2566("۫ۛ")) * 19;
                        i3 = ((m2566 ^ i15) * (-9299)) ^ (-497180592);
                        i4 = 1086627616;
                        i17 = m2566 ^ i4;
                        i16 = i3;
                    } else {
                        m6981 = (C2105.m6981("ᩴۙ") ^ i15) * 65;
                        str = str2;
                        i = ((m6981 ^ i14) * (-7725)) ^ (-1872063210);
                        i2 = 399859880;
                        String str4222222222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str4222222222222222222222;
                    }
                case 529673326:
                case 530833451:
                    str = str2;
                    sArr3 = f64322;
                    if (!C3663.f11553) {
                        m6981 = C2105.m6981("ܺ᩷") ^ i14;
                        i = ((m6981 ^ i15) * (-20395)) ^ (-1450596366);
                        i2 = 1181947911;
                        String str42222222222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str42222222222222222222222;
                    }
                    m6981 = C2105.m6981("᩶ۚ") ^ i14;
                    i = ((m6981 ^ i15) * 26269) ^ (-920366245);
                    i2 = -180200534;
                    String str422222222222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str422222222222222222222222;
                case 834264126:
                case 911747767:
                    C1504.m5167(C2105.m6981(str3) ^ 2119697410);
                    break;
                case 1029740718:
                case 1471407831:
                    str = str2;
                    sArr = f64322;
                    i9 = 1;
                    i10 = 3;
                    if (C3245.f10203 > 0) {
                        m6981 = (C2105.m6981("ᩴ᩶") + i14) * (-45);
                        i = ((m6981 ^ i15) * (-27777)) ^ 496060889;
                        i2 = 715917700;
                        String str4222222222222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str4222222222222222222222222;
                    }
                    str2 = str;
                    m6981 = C0630.m2566("᩵ۘ") ^ i15;
                    str = str2;
                    i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                    i2 = 1194163938;
                    String str42222222222222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str42222222222222222222222222;
                case 1055404785:
                case 1630295020:
                    str = str2;
                    if (C3019.f9544 < 0) {
                        m6981 = (C2105.m6981("᩻᩵") ^ i15) * q.h;
                        i = ((m6981 ^ i14) * (-2829)) ^ 251284740;
                        i2 = 1444334983;
                        String str422222222222222222222222222 = str;
                        i17 = m6981 ^ i2;
                        i16 = i;
                        str2 = str422222222222222222222222222;
                    }
                    str2 = str;
                    m6981 = C0630.m2566("᩵ۘ") ^ i15;
                    str = str2;
                    i = ((m6981 ^ i14) * (-6085)) ^ 1902585720;
                    i2 = 1194163938;
                    String str4222222222222222222222222222 = str;
                    i17 = m6981 ^ i2;
                    i16 = i;
                    str2 = str4222222222222222222222222222;
                default:
                    C1916.m6308();
                    break;
            }
            return;
        }
    }
}
