package l;

import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.concurrent.ExecutorService;

/* compiled from: GA31 */
/* renamed from: l.᩶ܳ᩷, reason: contains not printable characters */
/* loaded from: classes5.dex */
public final class C20238 implements InterfaceC23849 {
    @Override // l.InterfaceC23849
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final void mo46485() {
        ExecutorService executorService = null;
        int i = -475235106;
        int i2 = C4616.f14690;
        int i3 = C3537.f11231;
        int m6981 = C2105.m6981("۫۬") ^ i3;
        int i4 = ((m6981 ^ i2) * 25531) ^ (-364297149);
        int i5 = -284096392;
        while (true) {
            i = ((((i ^ i2) * (-14127)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2128385128:
                case -1253616865:
                    if (C1005.f3721) {
                        m6981 = (C2105.m6981("ܿۢ") ^ i2) * 91;
                        i4 = ((m6981 ^ i3) * 11083) ^ 987254638;
                        i5 = -1237889646;
                    } else {
                        m6981 = C0630.m2566("ܿܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18875) ^ 1042982592;
                        i5 = 691268215;
                    }
                case -2127076010:
                case 553538068:
                    C0630.m2564();
                    C3663.m11168();
                    m6981 = (i3 - C0630.m2566("ۧ֡")) * (-115);
                    i4 = ((m6981 ^ i2) * (-5553)) ^ 438755175;
                    i5 = 2064787663;
                case -1914667336:
                case -1499598597:
                    if (C1047.m3599() >= 0) {
                        m6981 = C2105.m6981("ᩳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16151)) ^ 1776175455;
                        i5 = -1057015797;
                    } else {
                        m6981 = C0630.m2566("֡ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-17511)) ^ (-1073188123);
                        i5 = -999241420;
                    }
                case -1816627050:
                case 1148304827:
                    if (C0964.f3626 != 0) {
                        m6981 = C2105.m6981("ᩳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16151)) ^ 1776175455;
                        i5 = -1057015797;
                    } else {
                        m6981 = C0630.m2566("ܰ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-3445)) ^ 1275174080;
                        i5 = 994817110;
                    }
                case -1807063147:
                case 2118139005:
                    if (RunnableC1108.m3790()) {
                        m6981 = C0630.m2566("ܿܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18875) ^ 1042982592;
                        i5 = 691268215;
                    } else {
                        m6981 = (C2105.m6981("᩻ۘ") ^ i3) * 123;
                        i4 = ((m6981 ^ i2) * 14549) ^ 1893937875;
                        i5 = 1721789801;
                    }
                case -1562865980:
                case -1277538394:
                    if (C0237.f1507 != 0) {
                        m6981 = (i3 - C0630.m2566("ۧ֡")) * (-115);
                        i4 = ((m6981 ^ i2) * (-5553)) ^ 438755175;
                        i5 = 2064787663;
                    } else {
                        m6981 = (C0630.m2566("֨ۛ") ^ i3) * (-41);
                        i4 = ((m6981 ^ i2) * (-27205)) ^ (-1347999194);
                        i5 = -807611804;
                    }
                case -1361067112:
                case 502304550:
                    if (C5695.f17556 >= 0) {
                        m6981 = C0630.m2566("۠۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-2123)) ^ (-969451061);
                        i5 = 804252018;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۢ᩸")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m6981 ^ i3) * (-9545)) ^ 1968780723;
                        i5 = 1378136720;
                    }
                case -915190955:
                case -125173268:
                    if (C5695.m16023() < 0) {
                        m6981 = (i3 - C0630.m2566("ۧ֡")) * (-115);
                        i4 = ((m6981 ^ i2) * (-5553)) ^ 438755175;
                        i5 = 2064787663;
                    } else {
                        m6981 = C0630.m2566("۠۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-2123)) ^ (-969451061);
                        i5 = 804252018;
                    }
                case -665294589:
                case -489971135:
                    if (C3019.m9255() <= 0) {
                        m6981 = C2105.m6981("ᩳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16151)) ^ 1776175455;
                        i5 = -1057015797;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܰۚ")) * 109;
                        i4 = ((m6981 ^ i2) * (-16903)) ^ (-1150467891);
                        i5 = -657454410;
                    }
                case -297263943:
                case 1051253075:
                    executorService = C1802.f6208;
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (C2105.m6981("ܽ֫") ^ i2) * (-19);
                        i4 = ((m6981 ^ i3) * (-23447)) ^ (-525857762);
                        i5 = 14981794;
                    } else {
                        m6981 = C2105.m6981("ۚᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 6877) ^ 1131022743;
                        i5 = 1694413199;
                    }
                case 156560306:
                case 1586683883:
                    C2272.m7503();
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = (C2105.m6981("ܽ֫") ^ i2) * (-19);
                        i4 = ((m6981 ^ i3) * (-23447)) ^ (-525857762);
                        i5 = 14981794;
                    } else {
                        m6981 = C2105.m6981("ᩳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16151)) ^ 1776175455;
                        i5 = -1057015797;
                    }
                case 289765925:
                case 296183780:
                    if (C7811.f24123 >= 0) {
                        m6981 = (i3 - C0630.m2566("ۧ֡")) * (-115);
                        i4 = ((m6981 ^ i2) * (-5553)) ^ 438755175;
                        i5 = 2064787663;
                    } else {
                        m6981 = (C2105.m6981("ܽ֫") ^ i2) * (-19);
                        i4 = ((m6981 ^ i3) * (-23447)) ^ (-525857762);
                        i5 = 14981794;
                    }
                case 354979177:
                case 1252509658:
                    if (C1005.f3721) {
                        C2105.m6975(executorService, new RunnableC8704(1));
                        break;
                    }
                    m6981 = C0630.m2566("ܿܰ") ^ i3;
                    i4 = ((m6981 ^ i2) * 18875) ^ 1042982592;
                    i5 = 691268215;
                case 1216557124:
                case 1924798275:
                    if (C1294.f4556 >= 0) {
                        m6981 = C0630.m2566("ܿܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 18875) ^ 1042982592;
                        i5 = 691268215;
                    } else {
                        m6981 = C2105.m6981("֡ܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * 19863) ^ (-2122562254);
                        i5 = -1292825367;
                    }
                default:
                    C2272.m7503();
                    C2958.m9034();
                    break;
            }
            return;
        }
    }

    @Override // l.InterfaceC23849
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final void mo46483() {
        C0237.m1492(new RunnableC22354());
    }

    @Override // l.InterfaceC23849
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final void mo46484() {
        C0237.m1492(new RunnableC22354());
    }
}
