package l;

import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: P71B */
/* renamed from: l.᩷ᩳܳ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final class C21042 {

    /* renamed from: ۬ᩴ֫, reason: not valid java name and contains not printable characters */
    private static final short[] f67893 = {7086, -2640, -2628, -2576, -2567, -2574, -2565, -2584, -2572, -2655, -2640, -2628, -2577, -2573, -2583, -2578, -2561, -2567, -2608, -2567, -2574, -2565, -2584, -2572, -2655, -2577, -2573, -2583, -2578, -2561, -2567, -2605, -2566, -2566, -2577, -2567, -2584, -2655, 7454, -31902, -31926, -31913, -31917, -31906, -31993, -31934, -31905, -31917, -31934, -31927, -31917};

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final int f67894;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final C17513 f67895;

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public final InterfaceC18883 f67896;

    /* renamed from: ᩳ, reason: not valid java name and contains not printable characters */
    public final int f67897;

    /* JADX WARN: Code restructure failed: missing block: B:109:0x0113, code lost:
    
        if (l.C21923.f70183 == 0) goto L16;
     */
    /* JADX WARN: Code restructure failed: missing block: B:92:0x00e9, code lost:
    
        if (l.C3432.f10845 < 0) goto L16;
     */
    /* JADX WARN: Type inference failed for: r11v0 */
    /* JADX WARN: Type inference failed for: r11v1, types: [l.ܿᩳܳ, l.᩷ᩳܳ] */
    /* JADX WARN: Type inference failed for: r11v10 */
    /* JADX WARN: Type inference failed for: r11v17 */
    /* JADX WARN: Type inference failed for: r11v18 */
    /* JADX WARN: Type inference failed for: r11v6 */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final l.C21042 m47874(l.C21042 r43) {
        /*
            Method dump skipped, instructions count: 2080
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C21042.m47874(l.᩷ᩳܳ):l.᩷ᩳܳ");
    }

    /* JADX WARN: Code restructure failed: missing block: B:30:0x005b, code lost:
    
        if (l.C1711.f5919 == false) goto L15;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static boolean m47872(l.C17513 r15, int r16, long r17, int r19, int r20) {
        /*
            Method dump skipped, instructions count: 886
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C21042.m47872(l.ܿᩳܳ, int, long, int, int):boolean");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final C21042 m47873(int i, int i2) {
        int i3;
        int i4;
        int m6981;
        int i5;
        int i6;
        int i7;
        int m2566;
        int i8;
        int i9;
        C17513 m40926;
        int i10 = C22628.f73083;
        int i11 = C2167.f7158;
        int m69812 = (C2105.m6981("ᩴܰ") ^ i11) * 5;
        int i12 = ((m69812 ^ i10) * 1901) ^ 1448882007;
        short[] sArr = null;
        int i13 = m69812 ^ 458682984;
        int i14 = 0;
        short s = 0;
        int i15 = 0;
        short s2 = 0;
        int i16 = 0;
        int i17 = -1183885104;
        C17513 c17513 = null;
        C17513 c175132 = null;
        int i18 = 0;
        while (true) {
            int i19 = i13 ^ (i12 & (((i17 ^ i10) * (-1359)) >> 31));
            switch (i19) {
                case -2097992891:
                case -483038596:
                    i4 = i19;
                    RunnableC0588.m2441();
                    if (C22628.f73083 > 0) {
                        i3 = i14;
                        m6981 = (C0630.m2566("ۘܶ") + i10) * 67;
                        i5 = ((m6981 ^ i11) * 25287) ^ 1049667372;
                        i6 = 1651947784;
                        int i20 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i20;
                        i12 = i5;
                        i14 = i3;
                    }
                    i3 = i14;
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i202 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202;
                    i12 = i5;
                    i14 = i3;
                case -2007404489:
                case -685184032:
                    return new C21042(this.f67896, i18, i2, c17513);
                case -1958580392:
                case 763565733:
                    i7 = i19;
                    if (i == 0) {
                        m2566 = (C0630.m2566("ᩳۗ") + i10) * 17;
                        i8 = ((m2566 ^ i11) * (-20801)) ^ 1150441909;
                        i9 = 1561644309;
                        int i21 = i7;
                        i13 = m2566 ^ i9;
                        i12 = i8;
                        i17 = i21;
                    }
                    m2566 = C2105.m6981("ۢ᩶") ^ i11;
                    i8 = ((m2566 ^ i10) * 24665) ^ (-1779360624);
                    i9 = 189538146;
                    int i212 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i212;
                case -1906438160:
                case 637166058:
                    i3 = i14;
                    i4 = i19;
                    if (C2105.f7037 == 0) {
                        m6981 = C2105.m6981("ܳۨ") ^ i10;
                        i5 = ((m6981 ^ i11) * (-2495)) ^ 1673494578;
                        i6 = 1837450259;
                        int i2022 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i2022;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = C2105.m6981("۫ۙ") ^ i10;
                    i5 = ((m6981 ^ i11) * 3237) ^ 1899868590;
                    i6 = -690572847;
                    int i20222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i20222;
                    i12 = i5;
                    i14 = i3;
                case -1772370163:
                case -691714576:
                    i4 = i19;
                    if (C2958.f9394 < 0) {
                        i3 = i14;
                        m6981 = C2105.m6981("۫ۙ") ^ i10;
                        i5 = ((m6981 ^ i11) * 3237) ^ 1899868590;
                        i6 = -690572847;
                        int i202222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i202222;
                        i12 = i5;
                        i14 = i3;
                    }
                    i3 = i14;
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i2022222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i2022222;
                    i12 = i5;
                    i14 = i3;
                case -1623757852:
                case 75149701:
                    i3 = i14;
                    i4 = i19;
                    i16 = 33575;
                    m6981 = C0630.m2566("ܽ᩻") ^ i10;
                    i5 = ((m6981 ^ i11) * (-18589)) ^ (-2077688799);
                    i6 = 788645438;
                    int i20222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i20222222;
                    i12 = i5;
                    i14 = i3;
                case -1493961273:
                case 1126368567:
                    i3 = i14;
                    i4 = i19;
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ᩴ᩷") ^ i11;
                        i5 = ((m6981 ^ i10) * (-13113)) ^ (-1988347227);
                        i6 = -889673005;
                        int i202222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i202222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C2105.m6981("ۡ᩻") ^ i11) * (-117);
                    i5 = ((m6981 ^ i10) * (-8971)) ^ 1249364;
                    i6 = -107776776;
                    int i2022222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i2022222222;
                    i12 = i5;
                    i14 = i3;
                case -1362845619:
                case 1424554550:
                    i7 = i19;
                    m40926 = null;
                    c17513 = m40926;
                    m2566 = C0630.m2566("ᩳۖ") ^ i10;
                    i8 = ((m2566 ^ i11) * 1883) ^ 2091984885;
                    i9 = -490154048;
                    int i2122 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i2122;
                case -1219384889:
                case -477418087:
                    C2167.m7155();
                    C1916.m6308();
                    return null;
                case -1073518024:
                case -916549374:
                    i7 = i19;
                    if (i2 == i14) {
                        m2566 = (C0630.m2566("֡ᩴ") + i11) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i8 = ((m2566 ^ i10) * 17731) ^ (-605779069);
                        i9 = -1849752384;
                        int i21222 = i7;
                        i13 = m2566 ^ i9;
                        i12 = i8;
                        i17 = i21222;
                    }
                    m2566 = C2105.m6981("ۢ᩶") ^ i11;
                    i8 = ((m2566 ^ i10) * 24665) ^ (-1779360624);
                    i9 = 189538146;
                    int i212222 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i212222;
                case -943504365:
                case 2048860488:
                    i7 = i19;
                    m40926 = c175132.m40926(i18, i2);
                    c17513 = m40926;
                    m2566 = C0630.m2566("ᩳۖ") ^ i10;
                    i8 = ((m2566 ^ i11) * 1883) ^ 2091984885;
                    i9 = -490154048;
                    int i2122222 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i2122222;
                case -927823629:
                case 1048030018:
                    i3 = i14;
                    i4 = i19;
                    i15 = s * 6464;
                    s2 = 1616;
                    if (C3019.f9544 < 0) {
                        m6981 = C0630.m2566("᩺᩺") ^ i11;
                        i5 = ((m6981 ^ i10) * 2933) ^ 334262747;
                        i6 = -919060918;
                        int i20222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i20222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C0630.m2566("ۘܶ") + i10) * 67;
                    i5 = ((m6981 ^ i11) * 25287) ^ 1049667372;
                    i6 = 1651947784;
                    int i202222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202222222222;
                    i12 = i5;
                    i14 = i3;
                case -770016112:
                case 387834601:
                    i7 = i19;
                    i18 = this.f67897 + i;
                    c175132 = this.f67895;
                    if (c175132 == null) {
                        m2566 = C2105.m6981("᩵᩶") ^ i10;
                        i8 = ((m2566 ^ i11) * 8281) ^ (-566584129);
                        i9 = -1692080113;
                    } else {
                        m2566 = C0630.m2566("ۨ᩵") ^ i11;
                        i8 = ((m2566 ^ i10) * (-17691)) ^ (-1556424909);
                        i9 = -1555472925;
                    }
                    int i21222222 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i21222222;
                case -282036426:
                case 2134378899:
                    i3 = i14;
                    i4 = i19;
                    i16 = 49871;
                    m6981 = C0630.m2566("ܽ᩻") ^ i10;
                    i5 = ((m6981 ^ i11) * (-18589)) ^ (-2077688799);
                    i6 = 788645438;
                    int i2022222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i2022222222222;
                    i12 = i5;
                    i14 = i3;
                case -43003157:
                case 907899976:
                    i3 = i14;
                    i4 = i19;
                    sArr = f67893;
                    if (C3911.f12484 < 0) {
                        m6981 = C0630.m2566("᩻᩵") ^ i11;
                        i5 = ((m6981 ^ i10) * (-2775)) ^ 1110777447;
                        i6 = -1566810194;
                        int i20222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i20222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i202222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202222222222222;
                    i12 = i5;
                    i14 = i3;
                case 3578732:
                case 1248499758:
                    i3 = i14;
                    i4 = i19;
                    if (C1773.f6144 > 0) {
                        m6981 = (C0630.m2566("᩵ܰ") + i10) * 91;
                        i5 = ((m6981 ^ i11) * 21233) ^ (-18880561);
                        i6 = 516225090;
                        int i2022222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i2022222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i20222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i20222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 159739966:
                case 275643692:
                    i3 = i14;
                    i4 = i19;
                    int i22 = s + s2;
                    if (i15 - (i22 * i22) <= 0) {
                        m6981 = C2105.m6981("۬ۖ") ^ i10;
                        i5 = ((m6981 ^ i11) * (-5201)) ^ 1955090368;
                        i6 = -1428901779;
                    } else {
                        m6981 = (i11 - C0630.m2566("֡ܰ")) * (-71);
                        i5 = ((m6981 ^ i10) * (-24799)) ^ (-203532487);
                        i6 = -972452500;
                    }
                    int i202222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 306722973:
                case 686868695:
                    i4 = i19;
                    short[] sArr2 = f67893;
                    i3 = i14;
                    if (C0050.f910 < 0) {
                        throw new IllegalArgumentException(C0382.m1840(sArr2, 39, 12, i16));
                    }
                    m6981 = (C0630.m2566("ۘܶ") + i10) * 67;
                    i5 = ((m6981 ^ i11) * 25287) ^ 1049667372;
                    i6 = 1651947784;
                    int i2022222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i2022222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 330131574:
                case 2028275897:
                    i3 = i14;
                    i4 = i19;
                    if (!C3663.f11553) {
                        m6981 = C0630.m2566("ۚۧ") ^ i11;
                        i5 = ((m6981 ^ i10) * (-19871)) ^ 998275018;
                        i6 = -647967737;
                        int i20222222222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i20222222222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = C2105.m6981("۫ۙ") ^ i10;
                    i5 = ((m6981 ^ i11) * 3237) ^ 1899868590;
                    i6 = -690572847;
                    int i202222222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202222222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 451033603:
                case 1408786771:
                    i7 = i19;
                    i14 = this.f67894;
                    C9005.m23246(i14, i, i2);
                    if (i2 != 0) {
                        m2566 = C2105.m6981("᩷ܽ") ^ i11;
                        i8 = ((m2566 ^ i10) * 29963) ^ 204122044;
                        i9 = 1377294552;
                    } else {
                        m2566 = (i10 - C0630.m2566("ۡۘ")) * 59;
                        i8 = ((m2566 ^ i11) * 6519) ^ 867825796;
                        i9 = 2035803545;
                    }
                    int i212222222 = i7;
                    i13 = m2566 ^ i9;
                    i12 = i8;
                    i17 = i212222222;
                case 490418314:
                case 840616971:
                    i3 = i14;
                    i4 = i19;
                    if (C4159.f13567) {
                        m6981 = C2105.m6981("ۢۛ") ^ i10;
                        i5 = ((m6981 ^ i11) * 30655) ^ 57408244;
                        i6 = -1827655907;
                        int i2022222222222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i2022222222222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i20222222222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i20222222222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 926634946:
                case 2076810450:
                    i3 = i14;
                    i4 = i19;
                    s = sArr[38];
                    if (C0630.f2410 > 0) {
                        m6981 = (C2105.m6981("۠ۙ") ^ i10) * 51;
                        i5 = ((m6981 ^ i11) * (-20479)) ^ (-1141627975);
                        i6 = 1960281309;
                        int i202222222222222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i202222222222222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C2105.m6981("ۡ᩻") ^ i11) * (-117);
                    i5 = ((m6981 ^ i10) * (-8971)) ^ 1249364;
                    i6 = -107776776;
                    int i2022222222222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i2022222222222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 940155911:
                case 1483121893:
                    i3 = i14;
                    i4 = i19;
                    if (C1128.m3851() > 0) {
                        m6981 = C0630.m2566("ܽۤ") ^ i11;
                        i5 = ((m6981 ^ i10) * (-31755)) ^ (-603410453);
                        i6 = -999466005;
                        int i20222222222222222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i20222222222222222222222222;
                        i12 = i5;
                        i14 = i3;
                    }
                    m6981 = (C0630.m2566("ۘܶ") + i10) * 67;
                    i5 = ((m6981 ^ i11) * 25287) ^ 1049667372;
                    i6 = 1651947784;
                    int i202222222222222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i202222222222222222222222222;
                    i12 = i5;
                    i14 = i3;
                case 1377242444:
                case 1495318363:
                    if (C3537.f11231 >= 0) {
                        i3 = i14;
                        i4 = i19;
                        m6981 = (C0630.m2566("ۘܶ") + i10) * 67;
                        i5 = ((m6981 ^ i11) * 25287) ^ 1049667372;
                        i6 = 1651947784;
                        int i2022222222222222222222222222 = m6981 ^ i6;
                        i17 = i4;
                        i13 = i2022222222222222222222222222;
                        i12 = i5;
                        i14 = i3;
                    } else {
                        m2566 = (C0630.m2566("ۚܽ") + i11) * 69;
                        i7 = i19;
                        i8 = ((m2566 ^ i10) * 8283) ^ 1653419207;
                        i9 = 47529504;
                        int i2122222222 = i7;
                        i13 = m2566 ^ i9;
                        i12 = i8;
                        i17 = i2122222222;
                    }
                case 2027064843:
                case 2064747236:
                    i4 = i19;
                    C0422.m1963();
                    C1773.m5908();
                    i3 = i14;
                    m6981 = (C2105.m6981("ۜ᩷") + i11) * 127;
                    i5 = ((m6981 ^ i10) * 12859) ^ 141213674;
                    i6 = 837617830;
                    int i20222222222222222222222222222 = m6981 ^ i6;
                    i17 = i4;
                    i13 = i20222222222222222222222222222;
                    i12 = i5;
                    i14 = i3;
                default:
                    return this;
            }
        }
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final void m47875(int i, byte[] bArr, int i2, int i3) {
        int i4 = 0;
        int i5 = 0;
        C17513 c17513 = null;
        int i6 = 1387608514;
        int i7 = C0050.f910;
        int i8 = C0422.f1886;
        int m6981 = C2105.m6981("ۗܿ") ^ i8;
        int i9 = ((m6981 ^ i7) * 4805) ^ 910334636;
        int i10 = 404945436;
        while (true) {
            i6 = ((((i6 ^ i7) * 21051) >> 31) & i9) ^ (m6981 ^ i10);
            switch (i6) {
                case -1995048961:
                case 1432662016:
                    c17513.m40917(i5 + i, bArr, i2, i3);
                    m6981 = (C0630.m2566("ۗ֨") + i7) * 23;
                    i9 = ((m6981 ^ i8) * (-20901)) ^ (-1254276182);
                    i10 = 457102520;
                case -1637961645:
                case -791782475:
                    if (C0964.f3626 != 0) {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    } else {
                        m6981 = (C0630.m2566("᩻۠") + i7) * (-25);
                        i9 = ((m6981 ^ i8) * 5699) ^ 1461739405;
                        i10 = -169759557;
                    }
                case -1541911606:
                case -579681164:
                    C2167.m7155();
                    C7106.m19120();
                    m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                    i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                    i10 = -484715747;
                case -1524382763:
                case -1502682677:
                    if (C1128.f4106 <= 0) {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    } else {
                        m6981 = C0630.m2566("۠᩶") ^ i8;
                        i9 = ((m6981 ^ i7) * (-18843)) ^ (-492458168);
                        i10 = 1140397569;
                    }
                case -1445469156:
                case -1187060207:
                    break;
                case -1336859057:
                case 1760707229:
                    C9005.m23246(i4, i, i3);
                    i5 = this.f67897;
                    this.f67896.mo10084(i5 + i, bArr, i2, i3);
                    c17513 = this.f67895;
                    if (c17513 != null) {
                        m6981 = (i8 - C0630.m2566("ۛ᩸")) * 79;
                        i9 = ((m6981 ^ i7) * 6301) ^ (-288233724);
                        i10 = 962206403;
                    } else {
                        m6981 = (C0630.m2566("ۗ֨") + i7) * 23;
                        i9 = ((m6981 ^ i8) * (-20901)) ^ (-1254276182);
                        i10 = 457102520;
                    }
                case -1167149942:
                case 765869617:
                    if (C2958.f9394 >= 0) {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    } else {
                        m6981 = (i7 - C2105.m6981("᩺֡")) * (-75);
                        i9 = ((m6981 ^ i8) * (-15821)) ^ (-1188494217);
                        i10 = 115104433;
                    }
                case -728842273:
                case 2114870120:
                    C3537.m10746();
                    if (C0422.f1886 <= 0) {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    } else {
                        m6981 = C0630.m2566("ۤ֫") ^ i8;
                        i9 = ((m6981 ^ i7) * (-27627)) ^ (-484056657);
                        i10 = -979805134;
                    }
                case -624891288:
                case -623806377:
                    C0422.m1963();
                    break;
                case -498942206:
                case 43730808:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("ۤ֫") ^ i8;
                        i9 = ((m6981 ^ i7) * (-27627)) ^ (-484056657);
                        i10 = -979805134;
                    } else {
                        m6981 = (C0630.m2566("۫۟") + i8) * 17;
                        i9 = ((m6981 ^ i7) * 22569) ^ 1873167580;
                        i10 = -1448199078;
                    }
                case -367688174:
                case 1527954070:
                    if (C22628.m50615() != 0) {
                        m6981 = (C2105.m6981("ܿۗ") ^ i7) * 115;
                        i9 = ((m6981 ^ i8) * (-17047)) ^ (-2114540454);
                        i10 = 323290308;
                    } else {
                        m6981 = C0630.m2566("۫ܽ") ^ i7;
                        i9 = ((m6981 ^ i8) * (-26851)) ^ 1209910114;
                        i10 = 518488059;
                    }
                case -97814352:
                case 599808879:
                    i4 = this.f67894;
                    if (C4075.f12947 >= 0) {
                        m6981 = (C2105.m6981("ܿۗ") ^ i7) * 115;
                        i9 = ((m6981 ^ i8) * (-17047)) ^ (-2114540454);
                        i10 = 323290308;
                    } else {
                        m6981 = (C0630.m2566("ۙܳ") + i8) * (-43);
                        i9 = ((m6981 ^ i7) * (-14821)) ^ (-1371645402);
                        i10 = -1197169718;
                    }
                case -95494779:
                case 1171954045:
                    if (C1005.m3501()) {
                        m6981 = C0630.m2566("᩻۬") ^ i7;
                        i9 = ((m6981 ^ i8) * 2577) ^ (-151982444);
                        i10 = -546931211;
                    } else {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    }
                case 13197909:
                case 55412339:
                    if (C4075.f12947 >= 0) {
                        m6981 = (C2105.m6981("ܿۗ") ^ i7) * 115;
                        i9 = ((m6981 ^ i8) * (-17047)) ^ (-2114540454);
                        i10 = 323290308;
                    } else {
                        m6981 = C0630.m2566("ۨۗ") ^ i8;
                        i9 = ((m6981 ^ i7) * (-32223)) ^ (-894478652);
                        i10 = 1403801463;
                    }
                case 614361695:
                case 1841979437:
                    C0050.m940();
                    if (C3663.f11553) {
                        m6981 = C2105.m6981("᩸ۛ") ^ i7;
                        i9 = ((m6981 ^ i8) * 27827) ^ 58324417;
                        i10 = -2099572891;
                    } else {
                        m6981 = (i7 - C0630.m2566("ۗܳ")) * 59;
                        i9 = ((m6981 ^ i8) * 13005) ^ 195896539;
                        i10 = -484715747;
                    }
                case 902814503:
                case 2122131789:
                    if (C1711.m5736() <= 0) {
                        m6981 = C0630.m2566("ۤ֫") ^ i8;
                        i9 = ((m6981 ^ i7) * (-27627)) ^ (-484056657);
                        i10 = -979805134;
                    } else {
                        m6981 = (C0630.m2566("۫ۛ") ^ i8) * (-57);
                        i9 = ((m6981 ^ i7) * (-23201)) ^ (-382243981);
                        i10 = -1492713432;
                    }
                case 1211705112:
                case 1262997657:
                    if (C2520.m8026()) {
                        m6981 = (C0630.m2566("۫ۛ") ^ i8) * (-57);
                        i9 = ((m6981 ^ i7) * (-23201)) ^ (-382243981);
                        i10 = -1492713432;
                    } else {
                        m6981 = C2105.m6981("ۗۧ") ^ i7;
                        i9 = ((m6981 ^ i8) * (-21529)) ^ (-1101469136);
                        i10 = 745249806;
                    }
                default:
                    if (C0422.f1886 <= 0) {
                        m6981 = C0630.m2566("ۤ֫") ^ i8;
                        i9 = ((m6981 ^ i7) * (-27627)) ^ (-484056657);
                        i10 = -979805134;
                    } else {
                        m6981 = C0630.m2566("ܳ᩶") ^ i8;
                        i9 = ((m6981 ^ i7) * (-3475)) ^ 2139507342;
                        i10 = 894272659;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:79:0x00a3, code lost:
    
        r10 = l.C0630.m2566("ۨܶ") ^ r8;
        r11 = ((r10 ^ r7) * 3657) ^ 847428907;
        r12 = -645182052;
     */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public C21042(l.InterfaceC18883 r19, int r20, int r21, l.C17513 r22) {
        /*
            Method dump skipped, instructions count: 690
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C21042.<init>(l.ᩴܽܳ, int, int, l.ܿᩳܳ):void");
    }
}
