package l;

import android.content.DialogInterface;
import com.umeng.commonsdk.statistics.UMErrorCode;
import moe.shizuku.server.IShizukuService;

/* compiled from: F2T1 */
/* renamed from: l.᩹֫᩷, reason: contains not printable characters */
/* loaded from: classes.dex */
public final class C21985 extends AbstractDialogInterfaceOnClickListenerC12849 {

    /* renamed from: ۤ᩸ۜ, reason: not valid java name and contains not printable characters */
    private static final short[] f70390 = {8712, 32180, 32155, 32200, 3239, 6003, 472, 9032, -2027, -4555, 1874, 8284, -6764, -7014, -7424, 2052, 7318, 3970, -482};

    /* renamed from: ۟, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ActivityC16608 f70391;

    @Override // l.AbstractDialogInterfaceOnClickListenerC12849
    /* renamed from: ᩴ */
    public final void mo2170() {
        int m6981;
        int i;
        int i2;
        int i3;
        short[] sArr;
        String str;
        short[] sArr2;
        int i4;
        int m69812;
        int i5;
        int i6;
        short[] sArr3;
        int m2566;
        int i7;
        short[] sArr4;
        int i8;
        int i9;
        int m69813;
        int i10;
        int i11;
        int m25662;
        int i12;
        int i13;
        final C21985 c21985 = this;
        short[] sArr5 = null;
        int i14 = 0;
        int i15 = 1973764911;
        int i16 = C22628.f73083;
        int i17 = C0714.f2697;
        int m69814 = C2105.m6981("᩷ᩴ") ^ i16;
        int i18 = ((m69814 ^ i17) * 13197) ^ (-1191933291);
        int i19 = m69814 ^ (-778141885);
        String str2 = null;
        C19258 c19258 = null;
        Object[] objArr = null;
        DialogInterface.OnClickListener onClickListener = null;
        String str3 = null;
        short[] sArr6 = null;
        short[] sArr7 = null;
        int i20 = 0;
        int i21 = 0;
        int i22 = 0;
        int i23 = 0;
        int i24 = 0;
        int i25 = 0;
        short s = 0;
        String str4 = null;
        int i26 = 0;
        int i27 = 0;
        int i28 = 0;
        ActivityC16608 activityC16608 = null;
        short[] sArr8 = null;
        String str5 = null;
        final String str6 = null;
        int i29 = 0;
        int i30 = 0;
        while (true) {
            i15 = i19 ^ (i18 & (((i15 ^ i17) * 12787) >> 31));
            switch (i15) {
                case -2060508327:
                case -114955866:
                    int i31 = DialogInterfaceC0206.f1451;
                    c19258 = new C19258(activityC16608);
                    i3 = i29;
                    str3 = C0964.m3396(f70390, 4, 3, i24);
                    if (C11340.f33930 < 0) {
                        m25662 = C0630.m2566("ۙ۠") ^ i16;
                        i12 = ((m25662 ^ i17) * (-17921)) ^ (-609913560);
                        i13 = 1788860570;
                        i19 = m25662 ^ i13;
                        i18 = i12;
                        i29 = i3;
                    }
                    m25662 = C0630.m2566("᩸᩸") ^ i16;
                    i12 = ((m25662 ^ i17) * 17983) ^ 2030523233;
                    i13 = 1807285587;
                    i19 = m25662 ^ i13;
                    i18 = i12;
                    i29 = i3;
                case -2055916714:
                case 1428979290:
                    ViewOnClickListenerC1958.m6441(c19258, i22, onClickListener);
                    i23 = C0630.m2566(RunnableC3474.m10633(f70390, 13, 3, i24));
                    if (C4616.f14690 <= 0) {
                        i3 = i29;
                        sArr = sArr5;
                        str = str5;
                        sArr2 = sArr6;
                        i4 = i27;
                        m69812 = (C2105.m6981("ۨ᩻") + i17) * 71;
                        i18 = ((m69812 ^ i16) * 26859) ^ 1899610194;
                        i5 = -559224128;
                        i6 = m69812 ^ i5;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    } else {
                        m6981 = C2105.m6981("ۙ۬") ^ i16;
                        i = ((m6981 ^ i17) * (-29527)) ^ (-597870499);
                        i2 = 1717067896;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    }
                case -1724149404:
                case 1180357736:
                    C3019.m9255();
                    if (C2167.f7158 < 0) {
                        m6981 = C2105.m6981("᩺۬") ^ i16;
                        i = ((m6981 ^ i17) * (-14775)) ^ 159228987;
                        i2 = 473946708;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    } else {
                        i3 = i29;
                        sArr = sArr5;
                        str = str5;
                        sArr2 = sArr6;
                        i4 = i27;
                        m69812 = (C2105.m6981("ۨ᩻") + i17) * 71;
                        i18 = ((m69812 ^ i16) * 26859) ^ 1899610194;
                        i5 = -559224128;
                        i6 = m69812 ^ i5;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    }
                case -1664099923:
                case 1806370857:
                    c21985.m31263(C2105.m6981(C1128.m3841(f70390, 16, 3, i24)) ^ 2121161356);
                    break;
                case -1499980784:
                case 1861085843:
                    C4616.m13552();
                    m6981 = C2105.m6981("᩺۬") ^ i16;
                    i = ((m6981 ^ i17) * (-14775)) ^ 159228987;
                    i2 = 473946708;
                    i19 = m6981 ^ i2;
                    i18 = i;
                case -1241668159:
                case -577246054:
                    short[] sArr9 = sArr8;
                    i21 = 2120615524 ^ C0630.m2566(C2167.m7159(sArr9, i29, i30, i24));
                    if (C2126.f7087) {
                        sArr8 = sArr9;
                        i3 = i29;
                        m25662 = C0630.m2566("᩸᩸") ^ i16;
                        i12 = ((m25662 ^ i17) * 17983) ^ 2030523233;
                        i13 = 1807285587;
                        i19 = m25662 ^ i13;
                        i18 = i12;
                        i29 = i3;
                    } else {
                        int m25663 = (C0630.m2566("۠ۚ") ^ i16) * 11;
                        sArr8 = sArr9;
                        i18 = ((m25663 ^ i17) * 6985) ^ (-235115429);
                        i19 = m25663 ^ 1850597404;
                    }
                case -1107906514:
                case 1689855834:
                    i22 = C2105.m6981(C3911.m11919(sArr7, i20, 3, i24)) ^ 2127209096;
                    if (C0630.f2410 <= 0) {
                        i3 = i29;
                        sArr = sArr5;
                        str = str5;
                        sArr2 = sArr6;
                        i4 = i27;
                        m69812 = (C2105.m6981("ۨ᩻") + i17) * 71;
                        i18 = ((m69812 ^ i16) * 26859) ^ 1899610194;
                        i5 = -559224128;
                        i6 = m69812 ^ i5;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    } else {
                        m6981 = C0630.m2566("֫᩵") ^ i17;
                        i = ((m6981 ^ i16) * 31837) ^ 897709576;
                        i2 = 188408673;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    }
                case -933362905:
                case -149758208:
                    i3 = i29;
                    sArr = sArr5;
                    str = str5;
                    sArr2 = sArr6;
                    i4 = i27;
                    int i32 = (s * s) + 19766916;
                    if ((i25 * i25) - (i32 + i32) > 0) {
                        m69812 = C0630.m2566("ۨۨ") ^ i16;
                        i18 = ((m69812 ^ i17) * 24567) ^ (-1142992318);
                        i5 = 1301693915;
                    } else {
                        m69812 = C0630.m2566("ۙ۫") ^ i17;
                        i18 = ((m69812 ^ i16) * (-20303)) ^ (-1123649243);
                        i5 = -1113306544;
                    }
                    i6 = m69812 ^ i5;
                    sArr5 = sArr;
                    i27 = i4;
                    sArr6 = sArr2;
                    i19 = i6;
                    str5 = str;
                    i29 = i3;
                    c21985 = this;
                case -878709766:
                case 183093471:
                    int i33 = i26;
                    objArr = new Object[i33];
                    objArr[0] = str6;
                    sArr8 = f70390;
                    i30 = 3;
                    if (C0237.f1507 != 0) {
                        i26 = i33;
                        sArr3 = sArr5;
                        str = str5;
                        i3 = 7;
                        m2566 = C0630.m2566("᩷ۛ") ^ i17;
                        i18 = ((m2566 ^ i16) * (-21729)) ^ (-657413439);
                        i7 = -1160320628;
                        i19 = m2566 ^ i7;
                        c21985 = this;
                        sArr5 = sArr3;
                        str5 = str;
                        i29 = i3;
                    } else {
                        int m25664 = (C0630.m2566("ܳܺ") + i16) * (-97);
                        i19 = m25664 ^ 1228208748;
                        i26 = i33;
                        i18 = ((m25664 ^ i17) * (-6783)) ^ (-1006637008);
                        i29 = 7;
                    }
                case -461490307:
                case 275221423:
                    i3 = i29;
                    sArr = sArr5;
                    str = str5;
                    sArr2 = sArr6;
                    i4 = i27;
                    short s2 = f70390[0];
                    int i34 = s2 + 4446;
                    if (C1047.f3863 >= 0) {
                        s = s2;
                        i25 = i34;
                        m69812 = (C2105.m6981("ۨ᩻") + i17) * 71;
                        i18 = ((m69812 ^ i16) * 26859) ^ 1899610194;
                        i5 = -559224128;
                        i6 = m69812 ^ i5;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    } else {
                        int m25665 = C0630.m2566("ۛۖ") ^ i16;
                        s = s2;
                        int i35 = ((m25665 ^ i17) * 729) ^ 1346918650;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        str5 = str;
                        i19 = m25665 ^ (-1024392520);
                        i29 = i3;
                        i25 = i34;
                        i18 = i35;
                        c21985 = this;
                    }
                case -335109528:
                case 2020974136:
                    i3 = i29;
                    sArr = sArr5;
                    str = str5;
                    sArr2 = sArr6;
                    i4 = i27;
                    i24 = 58024;
                    m69812 = C0630.m2566("֨ܳ") ^ i17;
                    i18 = ((m69812 ^ i16) * 1589) ^ 1986002414;
                    i5 = 1896931716;
                    i6 = m69812 ^ i5;
                    sArr5 = sArr;
                    i27 = i4;
                    sArr6 = sArr2;
                    i19 = i6;
                    str5 = str;
                    i29 = i3;
                    c21985 = this;
                case -156713070:
                case 702539525:
                    C1916.m6308();
                    break;
                case -10531566:
                case 1874770117:
                    i3 = i29;
                    sArr3 = sArr5;
                    str = str5;
                    str4 = m31260();
                    sArr6 = f70390;
                    i27 = 1;
                    i28 = 2;
                    if (C4117.m12364() == 0) {
                        m2566 = C0630.m2566("֫ᩴ") ^ i16;
                        i18 = ((m2566 ^ i17) * (-15357)) ^ (-1653265195);
                        i7 = 1171184182;
                        i19 = m2566 ^ i7;
                        c21985 = this;
                        sArr5 = sArr3;
                        str5 = str;
                        i29 = i3;
                    }
                    m2566 = C0630.m2566("᩷ۛ") ^ i17;
                    i18 = ((m2566 ^ i16) * (-21729)) ^ (-657413439);
                    i7 = -1160320628;
                    i19 = m2566 ^ i7;
                    c21985 = this;
                    sArr5 = sArr3;
                    str5 = str;
                    i29 = i3;
                case 23255600:
                case 1141972259:
                    int i36 = i29;
                    short[] sArr10 = sArr5;
                    int i37 = i14;
                    String m9031 = C2958.m9031(sArr10, i37, 1, i24);
                    String str7 = str4;
                    String str8 = str2;
                    String m12570 = C4159.m12570(C0964.m3408(str7, str8, m9031));
                    boolean m19121 = C7106.m19121(m12570);
                    ActivityC16608 activityC166082 = c21985.f70391;
                    if (m19121) {
                        int m25666 = C0630.m2566("ۢ᩻") ^ i16;
                        int i38 = ((m25666 ^ i17) * (-18981)) ^ (-1959398328);
                        i19 = m25666 ^ 1800562083;
                        i14 = i37;
                        str2 = str8;
                        str5 = m9031;
                        i29 = i36;
                        activityC16608 = activityC166082;
                        sArr5 = sArr10;
                        i18 = i38;
                        c21985 = this;
                        str4 = str7;
                        str6 = m12570;
                    } else {
                        int m25667 = C0630.m2566("ۘܰ") ^ i17;
                        i18 = ((m25667 ^ i16) * 17943) ^ 2008381353;
                        i19 = m25667 ^ (-541544676);
                        c21985 = this;
                        i14 = i37;
                        str5 = m9031;
                        i29 = i36;
                        sArr5 = sArr10;
                        str4 = str7;
                        str6 = m12570;
                        str2 = str8;
                        activityC16608 = activityC166082;
                    }
                case 105052243:
                case 1582871728:
                    ViewOnClickListenerC1958.m6429();
                    if (!C2167.m7155()) {
                        i3 = i29;
                        sArr3 = sArr5;
                        str = str5;
                        m2566 = C0630.m2566("᩷ۛ") ^ i17;
                        i18 = ((m2566 ^ i16) * (-21729)) ^ (-657413439);
                        i7 = -1160320628;
                        i19 = m2566 ^ i7;
                        c21985 = this;
                        sArr5 = sArr3;
                        str5 = str;
                        i29 = i3;
                    }
                    i3 = i29;
                    str = str5;
                    sArr4 = sArr6;
                    i8 = i27;
                    i9 = i28;
                    int m25668 = C0630.m2566("᩶᩹") ^ i16;
                    i27 = i8;
                    i28 = i9;
                    sArr6 = sArr4;
                    i18 = ((m25668 ^ i17) * (-7731)) ^ (-821153067);
                    i19 = m25668 ^ (-1394878140);
                    c21985 = this;
                    str5 = str;
                    i29 = i3;
                case 358713248:
                case 1404812712:
                    C5695.m16035(c19258, 2101459368 ^ i23, null);
                    C3683.m11213(c19258);
                    break;
                case 871074687:
                case 1256953430:
                    i3 = i29;
                    sArr = sArr5;
                    str = str5;
                    sArr2 = sArr6;
                    i4 = i27;
                    i24 = 32232;
                    m69812 = C0630.m2566("֨ܳ") ^ i17;
                    i18 = ((m69812 ^ i16) * 1589) ^ 1986002414;
                    i5 = 1896931716;
                    i6 = m69812 ^ i5;
                    sArr5 = sArr;
                    i27 = i4;
                    sArr6 = sArr2;
                    i19 = i6;
                    str5 = str;
                    i29 = i3;
                    c21985 = this;
                case 875818380:
                case 1588694169:
                    RunnableC1108.m3781(activityC16608);
                    break;
                case 882559189:
                case 2119135122:
                    if (C3911.f12484 >= 0) {
                        m6981 = C2105.m6981("᩺۬") ^ i16;
                        i = ((m6981 ^ i17) * (-14775)) ^ 159228987;
                        i2 = 473946708;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    } else {
                        i3 = i29;
                        str = str5;
                        sArr4 = sArr6;
                        i8 = i27;
                        i9 = i28;
                        int m256682 = C0630.m2566("᩶᩹") ^ i16;
                        i27 = i8;
                        i28 = i9;
                        sArr6 = sArr4;
                        i18 = ((m256682 ^ i17) * (-7731)) ^ (-821153067);
                        i19 = m256682 ^ (-1394878140);
                        c21985 = this;
                        str5 = str;
                        i29 = i3;
                    }
                case 1029655066:
                case 1375170137:
                    i3 = i29;
                    str = str5;
                    if (C0050.m938(str6, str)) {
                        m69813 = (C0630.m2566("᩹ܰ") + i17) * 47;
                        i10 = ((m69813 ^ i16) * (-589)) ^ 1186551641;
                        i11 = 1253494757;
                    } else {
                        m69813 = (C2105.m6981("۟ۤ") ^ i17) * (-61);
                        i10 = ((m69813 ^ i16) * 15197) ^ (-515480832);
                        i11 = -270848434;
                    }
                    i19 = m69813 ^ i11;
                    i18 = i10;
                    str5 = str;
                    i29 = i3;
                case 1049059343:
                case 1143172010:
                    C3019.m9252(c19258, ServiceConnectionC3453.m10566(activityC16608, i21, objArr));
                    onClickListener = new DialogInterface.OnClickListener(c21985) { // from class: l.᩸֫᩷

                        /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
                        public final /* synthetic */ C21985 f68629;

                        {
                            int i39 = 1686206897;
                            int i40 = C0630.f2410;
                            int i41 = C4117.f13076;
                            int m69815 = (C2105.m6981("۠۬") ^ i41) * (-105);
                            int i42 = ((m69815 ^ i40) * (-13383)) ^ (-1621539696);
                            int i43 = -5799990;
                            while (true) {
                                i39 = ((((i39 ^ i40) * (-9473)) >> 31) & i42) ^ (m69815 ^ i43);
                                switch (i39) {
                                    case -2099187691:
                                    case -806693257:
                                        if (C0237.m1481() >= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = C2105.m6981("ܿ᩵") ^ i41;
                                            i42 = ((m69815 ^ i40) * 23755) ^ (-1418104538);
                                            i43 = 1774316284;
                                        }
                                    case -1730839529:
                                    case 1097653636:
                                        this.f68629 = c21985;
                                        if (C1128.m3851() <= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = (C2105.m6981("ۛܿ") ^ i41) * 71;
                                            i42 = ((m69815 ^ i40) * 16723) ^ (-886389554);
                                            i43 = 1013370856;
                                        }
                                    case -1554885670:
                                    case 767028637:
                                        if (C3537.m10746() <= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = C2105.m6981("ܿۖ") ^ i40;
                                            i42 = ((m69815 ^ i41) * (-22855)) ^ 707966591;
                                            i43 = 1334331775;
                                        }
                                    case -1540702354:
                                    case 1733943191:
                                        if (RunnableC3474.f10992 <= 0) {
                                            m69815 = C0630.m2566("ۙ۟") ^ i41;
                                            i42 = ((m69815 ^ i40) * 20835) ^ 226008093;
                                            i43 = -320524146;
                                        } else {
                                            m69815 = C0630.m2566("ܺ᩺") ^ i40;
                                            i42 = ((m69815 ^ i41) * 18975) ^ (-350207779);
                                            i43 = -665786925;
                                        }
                                    case -1408335090:
                                    case 18439267:
                                        C1773.m5908();
                                        if (C4117.f13076 > 0) {
                                            m69815 = C2105.m6981("ܿ᩸") ^ i41;
                                            i42 = ((m69815 ^ i40) * (-22553)) ^ 168095921;
                                            i43 = 1639443985;
                                        } else {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        }
                                    case -1171492593:
                                    case -468754201:
                                        if (C1504.f5354) {
                                            m69815 = C2105.m6981("ܿ᩸") ^ i41;
                                            i42 = ((m69815 ^ i40) * (-22553)) ^ 168095921;
                                            i43 = 1639443985;
                                        } else {
                                            m69815 = (i40 - C0630.m2566("ܶۗ")) * (-33);
                                            i42 = ((m69815 ^ i41) * (-21793)) ^ 1575818448;
                                            i43 = 80331981;
                                        }
                                    case -1014909226:
                                    case 931041199:
                                        C2105.m6982();
                                        C3911.m11924();
                                        throw new RuntimeException();
                                    case -613573182:
                                    case 1267146422:
                                        C3663.m11168();
                                        C3663.m11168();
                                        m69815 = C2105.m6981("ܿ᩸") ^ i41;
                                        i42 = ((m69815 ^ i40) * (-22553)) ^ 168095921;
                                        i43 = 1639443985;
                                    case -433551546:
                                    case 551570684:
                                        if (C4075.m12263() <= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = (i41 - C2105.m6981("᩹ۨ")) * 91;
                                            i42 = ((m69815 ^ i40) * (-15815)) ^ 1502067495;
                                            i43 = -1076227553;
                                        }
                                    case -219955947:
                                    case 928195048:
                                        return;
                                    case 21672457:
                                    case 1448477864:
                                        if (C22628.f73083 <= 0) {
                                            m69815 = (C2105.m6981("֨ۖ") + i40) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i42 = ((m69815 ^ i41) * (-29385)) ^ 1765827032;
                                            i43 = 1912189146;
                                        } else {
                                            m69815 = (C0630.m2566("ۜ֫") + i40) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                            i42 = ((m69815 ^ i41) * 15767) ^ 331691673;
                                            i43 = 1682261619;
                                        }
                                    case 129293238:
                                    case 1057524557:
                                        if (C1128.f4106 <= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = C2105.m6981("ᩴۘ") ^ i40;
                                            i42 = ((m69815 ^ i41) * 24947) ^ (-103323430);
                                            i43 = 56369186;
                                        }
                                    case 356008270:
                                    case 2035860823:
                                        if (RunnableC0588.f2309 >= 0) {
                                            m69815 = (C2105.m6981("ܺۗ") ^ i40) * (-63);
                                            i42 = ((m69815 ^ i41) * 7049) ^ 468434867;
                                            i43 = -1969794264;
                                        } else {
                                            m69815 = (i40 - C2105.m6981("᩷ܺ")) * 71;
                                            i42 = ((m69815 ^ i41) * (-25141)) ^ 470343292;
                                            i43 = 114073289;
                                        }
                                    case 607842803:
                                    case 1078329372:
                                        if (C2272.f7362) {
                                            m69815 = (i40 - C0630.m2566("ܶۗ")) * (-33);
                                            i42 = ((m69815 ^ i41) * (-21793)) ^ 1575818448;
                                            i43 = 80331981;
                                        } else {
                                            m69815 = C0630.m2566("ۙ۟") ^ i41;
                                            i42 = ((m69815 ^ i40) * 20835) ^ 226008093;
                                            i43 = -320524146;
                                        }
                                    case 805213006:
                                    case 1836591246:
                                        if (C7811.f24123 >= 0) {
                                            m69815 = C0630.m2566("ۙ۟") ^ i41;
                                            i42 = ((m69815 ^ i40) * 20835) ^ 226008093;
                                            i43 = -320524146;
                                        } else {
                                            m69815 = C0630.m2566("֡ۤ") ^ i41;
                                            i42 = ((m69815 ^ i40) * (-2747)) ^ 1989671851;
                                            i43 = 1468243405;
                                        }
                                    default:
                                        if (C2105.m6982() != 0) {
                                            m69815 = (i40 - C0630.m2566("ܶۗ")) * (-33);
                                            i42 = ((m69815 ^ i41) * (-21793)) ^ 1575818448;
                                            i43 = 80331981;
                                        } else {
                                            m69815 = (C2105.m6981("ۢ᩹") ^ i41) * 59;
                                            i42 = ((m69815 ^ i40) * (-5291)) ^ (-1550502642);
                                            i43 = 798000030;
                                        }
                                }
                            }
                        }

                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i39) {
                            C21985 c219852 = null;
                            ActivityC16608 activityC166083 = null;
                            int i40 = -1609409966;
                            int i41 = C0050.f910;
                            int i42 = RunnableC0588.f2309;
                            int m69815 = (C2105.m6981("ᩳ۟") + i42) * 101;
                            int i43 = ((m69815 ^ i41) * (-29071)) ^ (-1229402598);
                            int i44 = -1826457518;
                            while (true) {
                                i40 = ((((i40 ^ i41) * 12223) >> 31) & i43) ^ (m69815 ^ i44);
                                switch (i40) {
                                    case -1948314875:
                                    case 1783702569:
                                        if (C2105.m6982() != 0) {
                                            m69815 = (i42 - C2105.m6981("۟ۗ")) * 37;
                                            i43 = ((m69815 ^ i41) * (-11653)) ^ (-1626535733);
                                            i44 = 1071193695;
                                        } else {
                                            m69815 = (C0630.m2566("ܿۧ") ^ i42) * (-51);
                                            i43 = ((m69815 ^ i41) * 31527) ^ 58411635;
                                            i44 = -819612103;
                                        }
                                    case -1655451355:
                                    case -867162710:
                                        boolean z = ActivityC16608.f51007;
                                        String str9 = str6;
                                        if (C4263.f13799 > 0) {
                                            C4263.m12821(new C19869(activityC166083, str9, c219852));
                                            break;
                                        }
                                        m69815 = (i42 - C2105.m6981("ᩴۖ")) * 35;
                                        i43 = ((m69815 ^ i41) * (-77)) ^ 213787541;
                                        i44 = -1813742090;
                                    case -1646295550:
                                    case -705662879:
                                        if (C1711.f5919) {
                                            m69815 = (i42 - C2105.m6981("ᩴۖ")) * 35;
                                            i43 = ((m69815 ^ i41) * (-77)) ^ 213787541;
                                            i44 = -1813742090;
                                        } else {
                                            m69815 = C0630.m2566("֨۠") ^ i41;
                                            i43 = ((m69815 ^ i42) * 20425) ^ (-1907594151);
                                            i44 = -1790884146;
                                        }
                                    case -1629055503:
                                    case -1037857216:
                                        RunnableC1937.m6387();
                                        C0798.m2998();
                                        break;
                                    case -1236671537:
                                    case 2123706444:
                                        if (C3432.m10477() <= 0) {
                                            m69815 = C0630.m2566("ܽۜ") ^ i42;
                                            i43 = ((m69815 ^ i41) * 29707) ^ (-983345357);
                                            i44 = 2046380390;
                                        } else {
                                            m69815 = C2105.m6981("ܺ֡") ^ i41;
                                            i43 = ((m69815 ^ i42) * (-22611)) ^ (-1021176081);
                                            i44 = -576419496;
                                        }
                                    case -1056676601:
                                    case -472255276:
                                        if (C0050.f910 >= 0) {
                                            m69815 = C2105.m6981("ܺ֡") ^ i41;
                                            i43 = ((m69815 ^ i42) * (-22611)) ^ (-1021176081);
                                            i44 = -576419496;
                                        } else {
                                            m69815 = (C2105.m6981("ۛ᩺") + i42) * (-93);
                                            i43 = ((m69815 ^ i41) * 31411) ^ (-1333120705);
                                            i44 = 259262794;
                                        }
                                    case -791643476:
                                    case -536718858:
                                        C3663.m11168();
                                        m69815 = (i42 - C2105.m6981("ᩴۖ")) * 35;
                                        i43 = ((m69815 ^ i41) * (-77)) ^ 213787541;
                                        i44 = -1813742090;
                                    case 78693473:
                                    case 637817309:
                                        if (C7106.f21815 != 0) {
                                            m69815 = (i42 - C2105.m6981("۟ۗ")) * 37;
                                            i43 = ((m69815 ^ i41) * (-11653)) ^ (-1626535733);
                                            i44 = 1071193695;
                                        } else {
                                            m69815 = C0630.m2566("۟ܳ") ^ i41;
                                            i43 = ((m69815 ^ i42) * 12641) ^ 1163178077;
                                            i44 = -290728191;
                                        }
                                    case 213915250:
                                    case 1869247588:
                                        if (C3683.f11629 >= 0) {
                                            m69815 = C2105.m6981("ܺ֡") ^ i41;
                                            i43 = ((m69815 ^ i42) * (-22611)) ^ (-1021176081);
                                            i44 = -576419496;
                                        } else {
                                            m69815 = (C0630.m2566("ۚۜ") + i42) * (-113);
                                            i43 = ((m69815 ^ i41) * 17891) ^ 1349109456;
                                            i44 = 1832026038;
                                        }
                                    case 302913150:
                                    case 635517683:
                                        c219852 = this.f68629;
                                        activityC166083 = c219852.f70391;
                                        if (C3245.m9925() != 0) {
                                            m69815 = (C2105.m6981("֫ܶ") ^ i41) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i43 = ((m69815 ^ i42) * 3071) ^ 956232124;
                                            i44 = -1123358645;
                                        } else {
                                            m69815 = (i41 - C2105.m6981("۟ۤ")) * (-117);
                                            i43 = ((m69815 ^ i42) * (-16707)) ^ (-1452433194);
                                            i44 = 364760391;
                                        }
                                    case 553742772:
                                    case 841480732:
                                        if (ViewOnClickListenerC1958.m6429() >= 0) {
                                            m69815 = (i42 - C2105.m6981("ᩴۖ")) * 35;
                                            i43 = ((m69815 ^ i41) * (-77)) ^ 213787541;
                                            i44 = -1813742090;
                                        } else {
                                            m69815 = C0630.m2566("ܽۜ") ^ i42;
                                            i43 = ((m69815 ^ i41) * 29707) ^ (-983345357);
                                            i44 = 2046380390;
                                        }
                                    case 586779883:
                                    case 2067490214:
                                        C0964.m3413();
                                        if (C1294.f4556 < 0) {
                                            m69815 = C0630.m2566("ܽۜ") ^ i42;
                                            i43 = ((m69815 ^ i41) * 29707) ^ (-983345357);
                                            i44 = 2046380390;
                                        } else {
                                            m69815 = (i42 - C2105.m6981("۟ۗ")) * 37;
                                            i43 = ((m69815 ^ i41) * (-11653)) ^ (-1626535733);
                                            i44 = 1071193695;
                                        }
                                    case 1385196245:
                                    case 1443726787:
                                        if (C1047.f3863 >= 0) {
                                            m69815 = (C2105.m6981("֫ܶ") ^ i41) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i43 = ((m69815 ^ i42) * 3071) ^ 956232124;
                                            i44 = -1123358645;
                                        } else {
                                            m69815 = (C2105.m6981("ܿ᩷") + i41) * 23;
                                            i43 = ((m69815 ^ i42) * 26487) ^ (-2997392);
                                            i44 = -578403199;
                                        }
                                    case 1424491864:
                                    case 1776610749:
                                        if (C4263.f13799 <= 0) {
                                            m69815 = C2105.m6981("ܺ֡") ^ i41;
                                            i43 = ((m69815 ^ i42) * (-22611)) ^ (-1021176081);
                                            i44 = -576419496;
                                        } else {
                                            m69815 = (C2105.m6981("ۤۤ") ^ i41) * (-121);
                                            i43 = ((m69815 ^ i42) * 17021) ^ (-900867383);
                                            i44 = 1419969034;
                                        }
                                    default:
                                        if (C1420.f5096 <= 0) {
                                            m69815 = (i42 - C2105.m6981("۟ۗ")) * 37;
                                            i43 = ((m69815 ^ i41) * (-11653)) ^ (-1626535733);
                                            i44 = 1071193695;
                                        } else {
                                            m69815 = (C2105.m6981("᩺ܶ") ^ i42) * 59;
                                            i43 = ((m69815 ^ i41) * (-609)) ^ 1711977578;
                                            i44 = 2028337984;
                                        }
                                }
                                return;
                            }
                        }
                    };
                    sArr7 = f70390;
                    i20 = 10;
                    if (C1420.m4913()) {
                        i3 = i29;
                        sArr = sArr5;
                        str = str5;
                        sArr2 = sArr6;
                        i4 = i27;
                        m69812 = (C2105.m6981("ۨ᩻") + i17) * 71;
                        i18 = ((m69812 ^ i16) * 26859) ^ 1899610194;
                        i5 = -559224128;
                        i6 = m69812 ^ i5;
                        sArr5 = sArr;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    } else {
                        m6981 = (i17 - C2105.m6981("᩵ۛ")) * 43;
                        i = ((m6981 ^ i16) * (-24719)) ^ 102804522;
                        i2 = -2113446009;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    }
                case 1576278700:
                case 1882003196:
                    i3 = i29;
                    str = str5;
                    sArr4 = sArr6;
                    i8 = i27;
                    i9 = i28;
                    str2 = C2520.m8030(sArr4, i8, i9, i24);
                    sArr5 = f70390;
                    i14 = 3;
                    if (C1005.f3721) {
                        sArr2 = sArr4;
                        int m25669 = C0630.m2566("۬ۖ") ^ i17;
                        i4 = i8;
                        i18 = ((m25669 ^ i16) * (-8275)) ^ (-877037033);
                        i6 = m25669 ^ (-899753388);
                        i28 = i9;
                        i27 = i4;
                        sArr6 = sArr2;
                        i19 = i6;
                        str5 = str;
                        i29 = i3;
                        c21985 = this;
                    } else {
                        int m2566822 = C0630.m2566("᩶᩹") ^ i16;
                        i27 = i8;
                        i28 = i9;
                        sArr6 = sArr4;
                        i18 = ((m2566822 ^ i17) * (-7731)) ^ (-821153067);
                        i19 = m2566822 ^ (-1394878140);
                        c21985 = this;
                        str5 = str;
                        i29 = i3;
                    }
                default:
                    C3432.m10490(c19258, C2105.m6981(str3) ^ 2124724757);
                    i26 = 1;
                    if (C21923.f70183 == 0) {
                        m6981 = (i17 - C2105.m6981("ᩳܶ")) * (-123);
                        i = ((m6981 ^ i16) * 10139) ^ 363854782;
                        i2 = -1419635395;
                        i19 = m6981 ^ i2;
                        i18 = i;
                    }
                    m6981 = C2105.m6981("᩺۬") ^ i16;
                    i = ((m6981 ^ i17) * (-14775)) ^ 159228987;
                    i2 = 473946708;
                    i19 = m6981 ^ i2;
                    i18 = i;
            }
            return;
        }
    }

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public C21985(ActivityC16608 activityC16608, AbstractActivityC3346 abstractActivityC3346) {
        super(abstractActivityC3346, -1);
        int i = -1039194205;
        int i2 = C1420.f5096;
        int i3 = RunnableC0588.f2309;
        this.f70391 = activityC16608;
        int m6981 = (C2105.m6981("ᩳۤ") ^ i3) * (-55);
        int i4 = ((m6981 ^ i2) * 31053) ^ (-1472832540);
        int i5 = 2076525820;
        while (true) {
            i = (m6981 ^ i5) ^ (i4 & (((i ^ i2) * (-4257)) >> 31));
            switch (i) {
                case -2030609999:
                case -1494959404:
                    return;
                case -1896154466:
                case -65328451:
                    C0422.m1963();
                    m6981 = C0630.m2566("ᩳܰ") ^ i2;
                    i4 = ((m6981 ^ i3) * 6879) ^ 814613598;
                    i5 = -9815533;
                case -1874275054:
                case 2010881604:
                    if (C3746.f11829 <= 0) {
                        m6981 = C2105.m6981("۬ۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-131)) ^ 2117048644;
                        i5 = 1263077754;
                    } else {
                        m6981 = (C2105.m6981("֨ۗ") ^ i3) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i4 = ((m6981 ^ i2) * (-27393)) ^ 433330825;
                        i5 = 1897670705;
                    }
                case -1526783778:
                case -1130112358:
                    C4117.m12364();
                    throw new RuntimeException();
                case 142806917:
                case 784464593:
                    if (C3746.f11829 <= 0) {
                        m6981 = (C2105.m6981("ۢۗ") ^ i3) * (-23);
                        i4 = ((m6981 ^ i2) * (-28367)) ^ (-782423939);
                        i5 = -696981609;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܿۡ")) * (-37);
                        i4 = ((m6981 ^ i2) * 11289) ^ (-1031912214);
                        i5 = -2098873155;
                    }
                case 1011891650:
                case 1530805723:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ᩳܰ") ^ i2;
                        i4 = ((m6981 ^ i3) * 6879) ^ 814613598;
                        i5 = -9815533;
                    } else {
                        m6981 = (C2105.m6981("᩺᩶") + i2) * 109;
                        i4 = ((m6981 ^ i3) * 30507) ^ 948248737;
                        i5 = -119690921;
                    }
                default:
                    if (C1504.m5179()) {
                        m6981 = C0630.m2566("ᩳܰ") ^ i2;
                        i4 = ((m6981 ^ i3) * 6879) ^ 814613598;
                        i5 = -9815533;
                    } else {
                        m6981 = (C2105.m6981("ۢۗ") ^ i3) * (-23);
                        i4 = ((m6981 ^ i2) * (-28367)) ^ (-782423939);
                        i5 = -696981609;
                    }
            }
        }
    }
}
