package l;

import android.widget.TextView;
import com.alipay.sdk.m.y.q;
import com.google.android.material.slider.BaseSlider;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.List;

/* compiled from: 82RX */
/* renamed from: l.᩹ܽ᩷, reason: contains not printable characters */
/* loaded from: classes.dex */
public final class C22417 extends AbstractC7548 {

    /* renamed from: ۧۧ۟, reason: not valid java name and contains not printable characters */
    private static final short[] f72642 = {757, 3853, -7683, 801};

    /* renamed from: ۜ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f72643;

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public List f72644;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C13244 f72645;

    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    public final void mo1008() {
        C13244 c13244 = null;
        TextView textView = null;
        int i = 0;
        C12346 c12346 = null;
        int i2 = 1105551559;
        int i3 = C4117.f13076;
        int i4 = C22628.f73083;
        int m2566 = (i3 - C0630.m2566("ۨۨ")) * (-79);
        int i5 = ((m2566 ^ i4) * 2721) ^ 1172158988;
        int i6 = 1313019057;
        while (true) {
            i2 = ((((i2 ^ i4) * 21703) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2030131625:
                case 1981956500:
                    C0050.m940();
                    C4159.m12565();
                    m2566 = C0630.m2566("᩷᩻") ^ i3;
                    i5 = ((m2566 ^ i4) * (-17295)) ^ 168301867;
                    i6 = 1242427264;
                case -1970902870:
                case 1564836644:
                    if (C0237.f1507 != 0) {
                        m2566 = (C0630.m2566("᩶᩶") ^ i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i5 = ((m2566 ^ i4) * (-32425)) ^ (-583225352);
                        i6 = 235373647;
                    } else {
                        m2566 = (C2105.m6981("۠᩸") + i3) * (-21);
                        i5 = ((m2566 ^ i4) * 5305) ^ (-1304180922);
                        i6 = -1410196428;
                    }
                case -1718740945:
                case 1715977757:
                    if (RunnableC1108.f4040) {
                        m2566 = (C2105.m6981("ܶ۬") + i3) * (-113);
                        i5 = ((m2566 ^ i4) * 24997) ^ 507466805;
                        i6 = 1510740787;
                    } else {
                        m2566 = (C0630.m2566("᩶᩶") ^ i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i5 = ((m2566 ^ i4) * (-32425)) ^ (-583225352);
                        i6 = 235373647;
                    }
                case -1085516216:
                case 482819011:
                    C0798.m2998();
                    C1773.m5908();
                    break;
                case -526130446:
                case 1584960972:
                    if (C0714.m2805()) {
                        m2566 = (i4 - C0630.m2566("ܰ᩺")) * (-63);
                        i5 = ((m2566 ^ i3) * (-9595)) ^ 42166069;
                        i6 = -881006899;
                    } else {
                        m2566 = C0630.m2566("᩷᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-17295)) ^ 168301867;
                        i6 = 1242427264;
                    }
                case -480010138:
                case 500435428:
                    c12346.m29958(true);
                    break;
                case -359591680:
                case 1051045669:
                    textView = c13244.f39643;
                    if (C0964.m3413()) {
                        m2566 = (C0630.m2566("ᩴۚ") ^ i4) * 115;
                        i5 = ((m2566 ^ i3) * 2437) ^ (-2094465424);
                        i6 = 1203931448;
                    } else {
                        m2566 = (i4 - C0630.m2566("ܰ᩺")) * (-63);
                        i5 = ((m2566 ^ i3) * (-9595)) ^ 42166069;
                        i6 = -881006899;
                    }
                case -358168274:
                case 759947402:
                    C3746.m11360(textView, i);
                    c12346 = c13244.f39638;
                    if (C3537.m10746() <= 0) {
                        m2566 = C2105.m6981("۠ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12891) ^ (-411717964);
                        i6 = 1796108359;
                    } else {
                        m2566 = (C2105.m6981("ۡ֨") + i3) * (-127);
                        i5 = ((m2566 ^ i4) * (-32119)) ^ 1576523223;
                        i6 = 317460200;
                    }
                case -299806949:
                case 615206939:
                    if (C4616.f14690 <= 0) {
                        m2566 = C2105.m6981("۠ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12891) ^ (-411717964);
                        i6 = 1796108359;
                    } else {
                        m2566 = (C2105.m6981("ܺ۫") ^ i4) * (-121);
                        i5 = ((m2566 ^ i3) * (-16623)) ^ (-1707922360);
                        i6 = -32524460;
                    }
                case 58269924:
                case 313853715:
                    if (C2167.f7158 >= 0) {
                        m2566 = C0630.m2566("᩷᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-17295)) ^ 168301867;
                        i6 = 1242427264;
                    } else {
                        m2566 = C0630.m2566("֫ۤ") ^ i4;
                        i5 = ((m2566 ^ i3) * 5213) ^ (-1369214853);
                        i6 = 1403260519;
                    }
                case 543806430:
                case 1984851398:
                    c13244 = this.f72645;
                    if (C4263.f13799 <= 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩺")) * (-63);
                        i5 = ((m2566 ^ i3) * (-9595)) ^ 42166069;
                        i6 = -881006899;
                    } else {
                        m2566 = C0630.m2566("ۖۘ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-23663)) ^ 412133480;
                        i6 = 1755733765;
                    }
                case 550559243:
                case 2034540586:
                    if (RunnableC1937.m6387() != 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩺")) * (-63);
                        i5 = ((m2566 ^ i3) * (-9595)) ^ 42166069;
                        i6 = -881006899;
                    } else {
                        m2566 = C0630.m2566("᩻᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * 29845) ^ (-1161292797);
                        i6 = 1437857059;
                    }
                case 882393999:
                case 1954053895:
                    i = 8;
                    if (C0714.f2697 >= 0) {
                        m2566 = (C0630.m2566("᩶᩶") ^ i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i5 = ((m2566 ^ i4) * (-32425)) ^ (-583225352);
                        i6 = 235373647;
                    } else {
                        m2566 = (C2105.m6981("ܺۖ") + i4) * 9;
                        i5 = ((m2566 ^ i3) * 12519) ^ (-2016797484);
                        i6 = -934757571;
                    }
                case 1036453235:
                case 1342537898:
                    C7106.m19120();
                    if (C2958.f9394 < 0) {
                        m2566 = C0630.m2566("᩷᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-17295)) ^ 168301867;
                        i6 = 1242427264;
                    } else {
                        m2566 = (C0630.m2566("ۧ۫") + i4) * q.h;
                        i5 = ((m2566 ^ i3) * 5419) ^ 1554955962;
                        i6 = -1327113511;
                    }
                case 1250997473:
                case 1266708129:
                    if (C2126.f7087) {
                        m2566 = C0630.m2566("᩷᩻") ^ i3;
                        i5 = ((m2566 ^ i4) * (-17295)) ^ 168301867;
                        i6 = 1242427264;
                    } else {
                        m2566 = C2105.m6981("ۜۜ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-1619)) ^ 286669940;
                        i6 = -1192751556;
                    }
                default:
                    if (C3746.f11829 > 0) {
                        m2566 = (i4 - C0630.m2566("ܰ᩺")) * (-63);
                        i5 = ((m2566 ^ i3) * (-9595)) ^ 42166069;
                        i6 = -881006899;
                    } else {
                        m2566 = C2105.m6981("۠ᩳ") ^ i3;
                        i5 = ((m2566 ^ i4) * 12891) ^ (-411717964);
                        i6 = 1796108359;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:16:0x0164, code lost:
    
        r5 = l.C2105.m6981("ᩳᩳ") ^ r4;
        r6 = ((r5 ^ r3) * (-5441)) ^ 1680889280;
        r7 = -97145789;
     */
    /* JADX WARN: Code restructure failed: missing block: B:20:0x01c3, code lost:
    
        r5 = l.C0630.m2566("֫ۘ") ^ r4;
        r6 = ((r5 ^ r3) * 21657) ^ 903724490;
        r7 = 1646810162;
     */
    /* JADX WARN: Code restructure failed: missing block: B:54:0x0190, code lost:
    
        r5 = l.C0630.m2566("ۢܶ") ^ r3;
        r6 = ((r5 ^ r4) * 16257) ^ 1162448096;
        r7 = -356796273;
     */
    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1006() {
        /*
            Method dump skipped, instructions count: 622
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C22417.mo1006():void");
    }

    public C22417(C13244 c13244, int i) {
        int i2 = -1356068804;
        int i3 = C0422.f1886;
        int i4 = ServiceConnectionC3453.f10921;
        this.f72645 = c13244;
        this.f72643 = i;
        int m6981 = C2105.m6981("ܶ۬") ^ i4;
        int i5 = ((m6981 ^ i3) * 973) ^ 532985514;
        int i6 = 1578209512;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * (-6675)) >> 31));
            switch (i2) {
                case -1794989006:
                case 1417721770:
                    C0237.m1481();
                    m6981 = C2105.m6981("ۡ᩵") ^ i3;
                    i5 = ((m6981 ^ i4) * (-17837)) ^ (-1918547248);
                    i6 = 863493389;
                case -1360766100:
                case 1884885007:
                    C11340.m28031();
                    if (C1773.m5908() > 0) {
                        m6981 = C2105.m6981("ۡ᩵") ^ i3;
                        i5 = ((m6981 ^ i4) * (-17837)) ^ (-1918547248);
                        i6 = 863493389;
                    } else {
                        m6981 = (C0630.m2566("۫ܰ") ^ i4) * (-83);
                        i5 = ((m6981 ^ i3) * 2685) ^ (-623554286);
                        i6 = 192135587;
                    }
                case -1293515794:
                case 1656627167:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ۜܶ") ^ i3;
                        i5 = ((m6981 ^ i4) * 21965) ^ 480819791;
                        i6 = 420213376;
                    } else {
                        m6981 = C0630.m2566("ۡ۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 11877) ^ (-844353585);
                        i6 = -837222841;
                    }
                case -1029961801:
                case 731673016:
                    C0630.m2564();
                    C0382.m1848();
                    throw new RuntimeException();
                case -657751952:
                case 548275026:
                    C0382.m1848();
                    if (C1420.f5096 <= 0) {
                        m6981 = C2105.m6981("ۡ᩵") ^ i3;
                        i5 = ((m6981 ^ i4) * (-17837)) ^ (-1918547248);
                        i6 = 863493389;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۛ᩻")) * 69;
                        i5 = ((m6981 ^ i4) * 32437) ^ 526291937;
                        i6 = -475524113;
                    }
                case -161134341:
                case 31484507:
                    if (C1294.f4556 >= 0) {
                        m6981 = (i3 - C2105.m6981("ۛ᩻")) * 69;
                        i5 = ((m6981 ^ i4) * 32437) ^ 526291937;
                        i6 = -475524113;
                    } else {
                        m6981 = (C0630.m2566("᩷ܿ") + i4) * (-35);
                        i5 = ((m6981 ^ i3) * (-9265)) ^ 169190900;
                        i6 = 927732436;
                    }
                default:
                    return;
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        int i;
        C12346 c12346;
        C13244 c13244 = null;
        TextView textView = null;
        boolean z = false;
        int i2 = -419924683;
        int i3 = C4117.f13076;
        int i4 = C2958.f9394;
        int m2566 = (C0630.m2566("᩺᩵") ^ i4) * (-49);
        int i5 = ((m2566 ^ i3) * 24971) ^ 1926986412;
        int i6 = 1692581166;
        while (true) {
            i2 = ((((i2 ^ i3) * 14353) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2118274817:
                case 70512451:
                    C21923.m49329();
                    if (C2272.f7362) {
                        m2566 = C0630.m2566("᩺᩸") ^ i4;
                        i5 = ((m2566 ^ i3) * (-8459)) ^ 1815787486;
                        i6 = 2083747638;
                    } else {
                        m2566 = C2105.m6981("ᩴᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-25091)) ^ 2116766226;
                        i6 = 1862797322;
                    }
                case -2059562200:
                case 998773876:
                    C3746.m11360(textView, z ? 1 : 0);
                    if (C4616.m13552() != 0) {
                        m2566 = (i3 - C0630.m2566("ۛܽ")) * 87;
                        i5 = ((m2566 ^ i4) * 31617) ^ 1437773116;
                        i6 = -851377826;
                    } else {
                        m2566 = (i3 - C2105.m6981("ܶ֫")) * (-69);
                        i5 = ((m2566 ^ i4) * 4563) ^ (-1835030068);
                        i6 = 1772417272;
                    }
                case -1995251041:
                case -297871065:
                    if (RunnableC0588.f2309 < 0) {
                        m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                        i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                        i6 = -362576985;
                    } else {
                        m2566 = C2105.m6981("ᩴᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-25091)) ^ 2116766226;
                        i6 = 1862797322;
                    }
                case -1588369403:
                case -951499629:
                    if (C1711.m5736() <= 0) {
                        m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                        i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                        i6 = -362576985;
                    } else {
                        m2566 = C0630.m2566("ܳܽ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-23967)) ^ 1453678003;
                        i6 = 409575184;
                    }
                case -1520996983:
                case -209503717:
                    textView = c13244.f39643;
                    z = false;
                    z = false;
                    if (C4159.m12565() >= 0) {
                        m2566 = (C2105.m6981("֨۟") ^ i3) * 41;
                        i5 = ((m2566 ^ i4) * 5113) ^ 273671923;
                        i6 = -502543277;
                    } else {
                        m2566 = C0630.m2566("۫ܿ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-17973)) ^ 496225520;
                        i6 = -827714729;
                    }
                case -1496187027:
                case 896755424:
                    if (C4263.f13799 <= 0) {
                        m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                        i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                        i6 = -362576985;
                    } else {
                        m2566 = C2105.m6981("ۨ᩸") ^ i3;
                        i5 = ((m2566 ^ i4) * (-27531)) ^ 439227830;
                        i6 = -140901838;
                    }
                case -1317047085:
                case -81232819:
                    if (C11340.f33930 >= 0) {
                        m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                        i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                        i6 = -362576985;
                    } else {
                        m2566 = (i3 - C0630.m2566("ܽ֫")) * (-47);
                        i5 = ((m2566 ^ i4) * (-5645)) ^ (-898186940);
                        i6 = -1411619136;
                    }
                case -1283858803:
                case 2121212149:
                    C1005.m3501();
                    if (C7811.f24123 >= 0) {
                        m2566 = C0630.m2566("᩺᩸") ^ i4;
                        i5 = ((m2566 ^ i3) * (-8459)) ^ 1815787486;
                        i6 = 2083747638;
                    } else {
                        m2566 = (C2105.m6981("֨۟") ^ i3) * 41;
                        i5 = ((m2566 ^ i4) * 5113) ^ 273671923;
                        i6 = -502543277;
                    }
                case -1157975767:
                case 1647185143:
                    if (C1916.f6442) {
                        m2566 = C2105.m6981("ۙۛ") ^ i4;
                        i5 = ((m2566 ^ i3) * 10555) ^ 276825771;
                        i6 = 1408499416;
                    } else {
                        m2566 = C0630.m2566("᩺᩸") ^ i4;
                        i5 = ((m2566 ^ i3) * (-8459)) ^ 1815787486;
                        i6 = 2083747638;
                    }
                case -954667906:
                case 722116414:
                    break;
                case -914429529:
                case 1886447418:
                    c13244 = this.f72645;
                    if (C7106.f21815 != 0) {
                        m2566 = C0630.m2566("᩺᩸") ^ i4;
                        i5 = ((m2566 ^ i3) * (-8459)) ^ 1815787486;
                        i6 = 2083747638;
                    } else {
                        m2566 = C0630.m2566("ۙܶ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-7133)) ^ 873610792;
                        i6 = -1106344322;
                    }
                case -563838012:
                case -440188040:
                    if (C3683.f11629 >= 0) {
                        m2566 = (i3 - C0630.m2566("ۛܽ")) * 87;
                        i5 = ((m2566 ^ i4) * 31617) ^ 1437773116;
                        i6 = -851377826;
                    } else {
                        m2566 = C0630.m2566("ۧܳ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-26569)) ^ 899443098;
                        i6 = -407489704;
                    }
                case -389560412:
                case 2028746251:
                    if (C1420.f5096 <= 0) {
                        m2566 = C2105.m6981("ᩴᩴ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-25091)) ^ 2116766226;
                        i6 = 1862797322;
                    } else {
                        m2566 = (C2105.m6981("ܳ᩷") + i4) * 65;
                        i5 = ((m2566 ^ i3) * 2793) ^ (-906534591);
                        i6 = 1627813035;
                    }
                case -313809939:
                case 786039364:
                    i = c13244.f39640;
                    if (this.f72643 != i) {
                        m2566 = (i4 - C2105.m6981("᩶۬")) * 9;
                        i5 = ((m2566 ^ i3) * (-27579)) ^ (-1459602234);
                        i6 = -1256848041;
                    } else {
                        m2566 = (C2105.m6981("ۤ۫") ^ i3) * (-123);
                        i5 = ((m2566 ^ i4) * (-21235)) ^ 1956308569;
                        i6 = -400809175;
                    }
                case -230430530:
                case 238236209:
                    c12346 = c13244.f39638;
                    c12346.m29958(z);
                    break;
                case 62117037:
                case 1595840080:
                    if (C2520.f8000 >= 0) {
                        m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                        i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                        i6 = -362576985;
                    } else {
                        m2566 = C0630.m2566("ܽܶ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-12345)) ^ 1789934563;
                        i6 = 283213430;
                    }
                case 969071661:
                case 2034361807:
                    C0237.m1481();
                    C7811.m20844();
                    m2566 = (C0630.m2566("ᩴ᩹") ^ i4) * (-101);
                    i5 = ((m2566 ^ i3) * 11339) ^ (-1959467210);
                    i6 = -362576985;
                default:
                    C1504.m5179();
                    RunnableC0588.m2441();
                    break;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:29:0x0056, code lost:
    
        if (l.RunnableC3474.f10992 > 0) goto L66;
     */
    /* JADX WARN: Code restructure failed: missing block: B:33:0x005f, code lost:
    
        if (l.C1420.f5096 <= 0) goto L58;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static /* synthetic */ void m50344(l.C22417 r23) {
        /*
            Method dump skipped, instructions count: 796
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C22417.m50344(l.᩹ܽ᩷):void");
    }

    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    public final void mo1009() {
        this.f72644 = C0753.m2891();
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        int m2566;
        int i;
        int i2;
        int m6981;
        int i3;
        C13244 c13244 = null;
        int i4 = 0;
        int i5 = 1836082541;
        int i6 = C3911.f12484;
        int i7 = C0714.f2697;
        int m25662 = C0630.m2566("ۜ᩸") ^ i7;
        int i8 = ((m25662 ^ i6) * 20455) ^ 1763291394;
        int i9 = -391261900;
        while (true) {
            int i10 = m25662 ^ i9;
            RunnableC8243 runnableC8243 = null;
            while (true) {
                i5 = ((((i5 ^ i6) * (-10579)) >> 31) & i8) ^ i10;
                switch (i5) {
                    case -2099823339:
                    case 617593822:
                        if (RunnableC1937.f6483 >= 0) {
                            break;
                        }
                        m2566 = C2105.m6981("ۗ۬") ^ i7;
                        i8 = ((m2566 ^ i6) * (-20693)) ^ (-41133852);
                        i = 1087897727;
                        i10 = m2566 ^ i;
                        break;
                    case -1837364524:
                    case 1248035302:
                        i2 = c13244.f39640;
                        int i11 = this.f72643;
                        if (i11 != i2) {
                            m6981 = C0630.m2566("ۡ᩶") ^ i6;
                            i8 = ((m6981 ^ i7) * (-16423)) ^ 468791364;
                            i3 = 848221199;
                        } else {
                            m6981 = C2105.m6981("᩵ۙ") ^ i6;
                            i8 = ((m6981 ^ i7) * (-7125)) ^ (-1423203293);
                            i3 = 1242976942;
                        }
                        i10 = m6981 ^ i3;
                        i4 = i11;
                    case -1803653536:
                    case 959147406:
                        C0050.m940();
                        break;
                    case -1710317952:
                    case 178935767:
                        C11340.m28031();
                        if (C0714.f2697 >= 0) {
                            break;
                        }
                        m2566 = C0630.m2566("ۧ᩺") ^ i7;
                        i8 = ((m2566 ^ i6) * 1705) ^ (-1953964835);
                        i = -1218148384;
                        i10 = m2566 ^ i;
                        break;
                    case -1633618224:
                    case -704651406:
                        C13244.m32127(i4, c13244, runnableC8243, false);
                        break;
                    case -1393143873:
                    case 2004694168:
                        int i12 = 1;
                        if (C3432.f10845 >= 0) {
                            break;
                        }
                        runnableC8243 = new RunnableC8243(i12, this);
                        if (C21923.f70183 == 0) {
                            m2566 = C2105.m6981("ܿۨ") ^ i7;
                            i8 = ((m2566 ^ i6) * (-837)) ^ (-1987478887);
                            i = 284101444;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("۫۟") ^ i7;
                        i8 = ((m2566 ^ i6) * (-5005)) ^ 346735875;
                        i = -2065330018;
                        i10 = m2566 ^ i;
                        break;
                    case -1230632431:
                    case -706489508:
                        if (C2520.f8000 >= 0) {
                            break;
                        }
                        m2566 = C2105.m6981("ۖܽ") ^ i7;
                        i8 = ((m2566 ^ i6) * 24667) ^ (-1438692482);
                        i = -1434420508;
                        i10 = m2566 ^ i;
                        break;
                    case -1212876297:
                    case -553428991:
                        c13244 = this.f72645;
                        if (C7106.m19120() > 0) {
                            m2566 = (C0630.m2566("ۗ֨") + i6) * 31;
                            i8 = ((m2566 ^ i7) * (-27001)) ^ (-11564317);
                            i = -1074235108;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("֨ۧ") ^ i6;
                        i8 = ((m2566 ^ i7) * 6311) ^ 1618678860;
                        i = 274982658;
                        i10 = m2566 ^ i;
                    case -1139191072:
                    case 137174617:
                        if (C4263.f13799 <= 0) {
                            break;
                        }
                        m2566 = (i6 - C0630.m2566("ۙ᩸")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i8 = ((m2566 ^ i7) * (-25683)) ^ (-5232366);
                        i = -183503622;
                        i10 = m2566 ^ i;
                        break;
                    case -982581515:
                    case 1786042422:
                        if (RunnableC3474.f10992 > 0) {
                            m2566 = (C0630.m2566("֨ۢ") ^ i7) * (-27);
                            i8 = ((m2566 ^ i6) * 9449) ^ 425881872;
                            i = 1244409364;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("֨ۧ") ^ i6;
                        i8 = ((m2566 ^ i7) * 6311) ^ 1618678860;
                        i = 274982658;
                        i10 = m2566 ^ i;
                    case -957467077:
                    case 1726096437:
                        if (C0714.f2697 < 0) {
                            m2566 = C0630.m2566("᩺ۚ") ^ i7;
                            i8 = ((m2566 ^ i6) * 12121) ^ 1565893716;
                            i = -1569622296;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("۫۟") ^ i7;
                        i8 = ((m2566 ^ i6) * (-5005)) ^ 346735875;
                        i = -2065330018;
                        i10 = m2566 ^ i;
                    case -828915561:
                    case -319871220:
                        if (!C1420.m4913()) {
                            m2566 = C0630.m2566("ۜܽ") ^ i6;
                            i8 = ((m2566 ^ i7) * 16579) ^ 1521795256;
                            i = 596443905;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("ۧ᩺") ^ i7;
                        i8 = ((m2566 ^ i6) * 1705) ^ (-1953964835);
                        i = -1218148384;
                        i10 = m2566 ^ i;
                    case -743675805:
                    case 354495677:
                        if (ViewOnClickListenerC1958.f6529 <= 0) {
                            m2566 = (C0630.m2566("ۙ֨") + i6) * 97;
                            i8 = ((m2566 ^ i7) * 6095) ^ 82145727;
                            i = 981950322;
                            i10 = m2566 ^ i;
                        }
                        m2566 = C0630.m2566("ۧ᩺") ^ i7;
                        i8 = ((m2566 ^ i6) * 1705) ^ (-1953964835);
                        i = -1218148384;
                        i10 = m2566 ^ i;
                    case -478662011:
                    case -159353048:
                        if (!C2520.m8026()) {
                            break;
                        }
                        m2566 = C0630.m2566("۫۟") ^ i7;
                        i8 = ((m2566 ^ i6) * (-5005)) ^ 346735875;
                        i = -2065330018;
                        i10 = m2566 ^ i;
                        break;
                    case -229629698:
                    case 1189306102:
                        C11340.m28031();
                        C1047.m3599();
                        m2566 = C0630.m2566("ۧ᩺") ^ i7;
                        i8 = ((m2566 ^ i6) * 1705) ^ (-1953964835);
                        i = -1218148384;
                        i10 = m2566 ^ i;
                    case -165055895:
                    case 742217557:
                        if (C0237.f1507 != 0) {
                            break;
                        }
                        m2566 = (i6 - C0630.m2566("ۖۨ")) * (-49);
                        i8 = ((m2566 ^ i7) * 23559) ^ (-1059552279);
                        i = 1924582093;
                        i10 = m2566 ^ i;
                        break;
                }
                return;
            }
            m25662 = (i7 - C2105.m6981("᩻ۘ")) * (-109);
            i8 = ((m25662 ^ i6) * 29345) ^ (-1344481653);
            i9 = 2090040733;
        }
    }
}
