package l;

import com.google.android.material.slider.BaseSlider;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;

/* compiled from: G9A5 */
/* renamed from: l.᩺۟ܽ, reason: contains not printable characters */
/* loaded from: classes.dex */
public final class C22849 extends AbstractC7548 {

    /* renamed from: ۧ֨᩷, reason: not valid java name and contains not printable characters */
    private static final short[] f73737 = {2985, 10955, 2781, 9184};

    /* renamed from: ۜ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ RunnableC18617 f73738;

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ActivityC13676 f73739;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ List f73740;

    /* JADX WARN: Code restructure failed: missing block: B:15:0x0072, code lost:
    
        if (l.C4159.f13567 != false) goto L27;
     */
    /* JADX WARN: Code restructure failed: missing block: B:19:0x007c, code lost:
    
        if (l.C3911.m11924() > 0) goto L57;
     */
    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1008() {
        /*
            Method dump skipped, instructions count: 774
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C22849.mo1008():void");
    }

    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    public final void mo1009() {
        AbstractC15440 abstractC15440;
        ActivityC13676 activityC13676 = null;
        AbstractC15440 abstractC154402 = null;
        String str = null;
        EnumC13671[] enumC13671Arr = null;
        EnumC13671 enumC13671 = null;
        char c = 0;
        C21434 c21434 = null;
        Iterator it = null;
        C8739 c8739 = null;
        int i = 722707339;
        int i2 = C0714.f2697;
        int i3 = C3019.f9544;
        int m6981 = (i3 - C2105.m6981("ۗܶ")) * (-15);
        int i4 = ((m6981 ^ i2) * 4309) ^ (-213418338);
        int i5 = 664466716;
        while (true) {
            i = ((((i ^ i2) * (-16955)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1824248128:
                case -591360538:
                    C0483.m2121();
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("֡᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                        i5 = -959982295;
                    } else {
                        m6981 = (i2 - C0630.m2566("۠᩺")) * 11;
                        i4 = ((m6981 ^ i3) * (-10547)) ^ (-247023594);
                        i5 = 627036334;
                    }
                case -1733161838:
                case 2139827974:
                    enumC13671 = EnumC13671.OrderedField;
                    c = 0;
                    if (C1128.f4106 <= 0) {
                        m6981 = (i2 - C0630.m2566("ۧᩳ")) * 21;
                        i4 = ((m6981 ^ i3) * 11213) ^ 610426263;
                        i5 = 1890182755;
                    } else {
                        m6981 = (C2105.m6981("۫֡") ^ i3) * 57;
                        i4 = ((m6981 ^ i2) * (-13447)) ^ (-696396658);
                        i5 = 1509401811;
                    }
                case -1565741684:
                case 575439497:
                    abstractC154402 = activityC13676.f40825;
                    if (RunnableC3474.m10630()) {
                        m6981 = C0630.m2566("ۤ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29719)) ^ (-1887196087);
                        i5 = -1073717467;
                    } else {
                        m6981 = C2105.m6981("֡᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                        i5 = -959982295;
                    }
                case -1323596571:
                case -545405128:
                    enumC13671Arr[c] = enumC13671;
                    if (C3432.f10845 >= 0) {
                        m6981 = C0630.m2566("᩸ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 29543) ^ (-170846714);
                        i5 = 664390534;
                    } else {
                        m6981 = C2105.m6981("֫ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-3289)) ^ (-1749315777);
                        i5 = 1097562536;
                    }
                case -1006984881:
                case 873412285:
                    activityC13676 = this.f73739;
                    if (C0422.m1963()) {
                        m6981 = (C0630.m2566("ܳ֨") ^ i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m6981 ^ i2) * 27853) ^ 1745028700;
                        i5 = -2135567501;
                    } else {
                        m6981 = C0630.m2566("ۚ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * 325) ^ 1048730499;
                        i5 = 282602977;
                    }
                case -995973746:
                case 1039047602:
                    abstractC15440 = activityC13676.f40825;
                    abstractC15440.m36510(c21434.mo14987());
                    break;
                case -934204396:
                case 1313839536:
                    str = abstractC154402.m36489();
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("֡᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                        i5 = -959982295;
                    } else {
                        m6981 = (i2 - C0630.m2566("۠ܽ")) * 51;
                        i4 = ((m6981 ^ i3) * (-19677)) ^ (-1249894152);
                        i5 = 671001222;
                    }
                case -925420719:
                case -902071859:
                    C22628.m50615();
                    if (C1711.f5919) {
                        m6981 = C2105.m6981("֡᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                        i5 = -959982295;
                    } else {
                        m6981 = C0630.m2566("ۚ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * 325) ^ 1048730499;
                        i5 = 282602977;
                    }
                case -819680867:
                case 1180666529:
                    c21434 = AbstractC5206.m14984(str, enumC13671Arr);
                    it = RunnableC1937.m6374(this.f73740);
                    m6981 = C0630.m2566("᩹ۘ") ^ i2;
                    i4 = ((m6981 ^ i3) * 26939) ^ (-37378138);
                    i5 = -686687307;
                case -625375582:
                case 443757210:
                    if (C1773.m5908() <= 0) {
                        m6981 = (i2 - C0630.m2566("۠᩺")) * 11;
                        i4 = ((m6981 ^ i3) * (-10547)) ^ (-247023594);
                        i5 = 627036334;
                    } else {
                        m6981 = (C2105.m6981("֨ۡ") + i2) * 63;
                        i4 = ((m6981 ^ i3) * 17973) ^ 406176237;
                        i5 = -637802527;
                    }
                case -597712181:
                case 1532847620:
                    if (C1005.m3501()) {
                        m6981 = C0630.m2566("ܶۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * 17801) ^ (-875650487);
                        i5 = 2105276015;
                    } else {
                        m6981 = C0630.m2566("᩸ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 29543) ^ (-170846714);
                        i5 = 664390534;
                    }
                case -214693351:
                case -122639642:
                    if (C21923.f70183 != 0) {
                        m6981 = (i2 - C0630.m2566("۠᩺")) * 11;
                        i4 = ((m6981 ^ i3) * (-10547)) ^ (-247023594);
                        i5 = 627036334;
                    } else {
                        m6981 = (C2105.m6981("۠ۤ") + i3) * 99;
                        i4 = ((m6981 ^ i2) * 29649) ^ 600330486;
                        i5 = 203143961;
                    }
                case -42382644:
                case 507509951:
                    C2167.m7155();
                    m6981 = C2105.m6981("֡᩸") ^ i2;
                    i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                    i5 = -959982295;
                case 379466542:
                case 2120804294:
                    enumC13671Arr = new EnumC13671[1];
                    if (C0714.f2697 >= 0) {
                        m6981 = (i2 - C0630.m2566("ۧᩳ")) * 21;
                        i4 = ((m6981 ^ i3) * 11213) ^ 610426263;
                        i5 = 1890182755;
                    } else {
                        m6981 = C0630.m2566("ۢ۟") ^ i3;
                        i4 = ((m6981 ^ i2) * 20475) ^ 1651528548;
                        i5 = -1842709813;
                    }
                case 530208205:
                case 1216874435:
                    C0630.m2564();
                    break;
                case 628213463:
                case 1499323095:
                    if (C0483.m2123(it)) {
                        m6981 = C2105.m6981("ۘۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-4511)) ^ 495623136;
                        i5 = -1468112373;
                    } else {
                        m6981 = (i3 - C2105.m6981("۬ܰ")) * 93;
                        i4 = ((m6981 ^ i2) * 4429) ^ 1370812305;
                        i5 = 1857032270;
                    }
                case 640787231:
                case 663924379:
                    c8739 = (C8739) C2272.m7513(it);
                    if (c8739.f26611 != null) {
                        m6981 = C0630.m2566("ۗ֡") ^ i3;
                        i4 = ((m6981 ^ i2) * 29895) ^ (-1208663614);
                        i5 = -1072943628;
                    } else {
                        m6981 = C0630.m2566("᩹ۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 26939) ^ (-37378138);
                        i5 = -686687307;
                    }
                case 753644484:
                case 939787023:
                    if (C0237.m1481() < 0) {
                        m6981 = C2105.m6981("֡᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * 14035) ^ (-205602720);
                        i5 = -959982295;
                    } else {
                        m6981 = C0630.m2566("᩸ܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 29543) ^ (-170846714);
                        i5 = 664390534;
                    }
                case 766344622:
                case 1035720029:
                    c21434.m48549(c8739.m22597(), c8739.f26611);
                    m6981 = C0630.m2566("᩹ۘ") ^ i2;
                    i4 = ((m6981 ^ i3) * 26939) ^ (-37378138);
                    i5 = -686687307;
                default:
                    if (C2105.m6982() != 0) {
                        m6981 = (i2 - C0630.m2566("۠᩺")) * 11;
                        i4 = ((m6981 ^ i3) * (-10547)) ^ (-247023594);
                        i5 = 627036334;
                    } else {
                        m6981 = C0630.m2566("᩷ۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * 5325) ^ 375437103;
                        i5 = 1326325571;
                    }
            }
            return;
        }
    }

    public C22849(ActivityC13676 activityC13676, ArrayList arrayList, RunnableC18617 runnableC18617) {
        int i = -522836681;
        int i2 = C11340.f33930;
        int i3 = C4075.f12947;
        this.f73739 = activityC13676;
        this.f73740 = arrayList;
        this.f73738 = runnableC18617;
        int m6981 = (C2105.m6981("֡ۜ") ^ i2) * (-117);
        int i4 = ((m6981 ^ i3) * 4071) ^ 1056534053;
        int i5 = -455758339;
        while (true) {
            i = (m6981 ^ i5) ^ (i4 & (((i ^ i3) * 12873) >> 31));
            switch (i) {
                case -2021353978:
                case 633395486:
                    return;
                case -1964491801:
                case 681257516:
                    C0630.m2564();
                    if (C2272.f7362) {
                        m6981 = C0630.m2566("ܳۙ") ^ i2;
                        i4 = ((m6981 ^ i3) * 19269) ^ 806546305;
                        i5 = 952514246;
                    } else {
                        m6981 = (C2105.m6981("ۘܳ") ^ i2) * (-13);
                        i4 = ((m6981 ^ i3) * 12215) ^ 66996438;
                        i5 = 1835742149;
                    }
                case -1641963881:
                case -320014340:
                    C0714.m2805();
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (C2105.m6981("ۜ᩻") + i3) * (-101);
                        i4 = ((m6981 ^ i2) * (-11155)) ^ 1956324977;
                        i5 = 1244102243;
                    } else {
                        m6981 = C0630.m2566("ܺᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28105) ^ 889196731;
                        i5 = -1177166966;
                    }
                case -1098559770:
                case -329336048:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C2105.m6981("᩷ۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * 12671) ^ 322984218;
                        i5 = 45093236;
                    } else {
                        m6981 = C2105.m6981("۟ۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2117)) ^ 665231994;
                        i5 = 266296380;
                    }
                case 472720749:
                case 1421483264:
                    C4117.m12364();
                    throw new RuntimeException();
                case 1032217282:
                case 2039800046:
                    C4075.m12263();
                    C3683.m11222();
                    m6981 = (C2105.m6981("ۘܳ") ^ i2) * (-13);
                    i4 = ((m6981 ^ i3) * 12215) ^ 66996438;
                    i5 = 1835742149;
                default:
                    C2272.m7503();
                    if (C0630.f2410 <= 0) {
                        m6981 = (C2105.m6981("ۘܳ") ^ i2) * (-13);
                        i4 = ((m6981 ^ i3) * 12215) ^ 66996438;
                        i5 = 1835742149;
                    } else {
                        m6981 = (C2105.m6981("ۜ᩻") + i3) * (-101);
                        i4 = ((m6981 ^ i2) * (-11155)) ^ 1956324977;
                        i5 = 1244102243;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        ActivityC13676 activityC13676 = null;
        int i = -112336228;
        int i2 = RunnableC1937.f6483;
        int i3 = C4263.f13799;
        int m6981 = (C2105.m6981("֨ۜ") ^ i2) * (-121);
        int i4 = ((m6981 ^ i3) * 23185) ^ (-582176411);
        int i5 = 514376614;
        while (true) {
            i = ((((i ^ i3) * 24585) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2012263250:
                case 1813300882:
                    C3746.m11369();
                    C22628.m50615();
                    break;
                case -1985827146:
                case 1357996374:
                    activityC13676 = this.f73739;
                    if (C2167.f7158 >= 0) {
                        m6981 = C2105.m6981("᩵۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23793)) ^ 1835051566;
                        i5 = -1436235429;
                    } else {
                        m6981 = (C0630.m2566("֫ᩴ") ^ i2) * 21;
                        i4 = ((m6981 ^ i3) * 12113) ^ (-342181491);
                        i5 = 1213272388;
                    }
                case -1965961373:
                case -1110254887:
                    if (C4616.m13552() != 0) {
                        m6981 = C2105.m6981("᩵۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23793)) ^ 1835051566;
                        i5 = -1436235429;
                    } else {
                        m6981 = C2105.m6981("᩺ۙ") ^ i3;
                        i4 = ((m6981 ^ i2) * 27189) ^ 645591057;
                        i5 = 807665479;
                    }
                case -1439246896:
                case 2055383351:
                    if (C1294.m4372() <= 0) {
                        m6981 = C2105.m6981("᩷ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-30433)) ^ 878677458;
                        i5 = 230258511;
                    } else {
                        m6981 = (C0630.m2566("ۨ۠") ^ i2) * 35;
                        i4 = ((m6981 ^ i3) * (-19021)) ^ (-1895998297);
                        i5 = -873159463;
                    }
                case -1431755893:
                case 545171140:
                    if (C2126.f7087) {
                        m6981 = C2105.m6981("ۖ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1645)) ^ (-1681799563);
                        i5 = 803051195;
                    } else {
                        m6981 = (i2 - C2105.m6981("ᩴۚ")) * (-39);
                        i4 = ((m6981 ^ i3) * (-7189)) ^ 1163294441;
                        i5 = -1643989619;
                    }
                case -1103195301:
                case -680367114:
                    if (C1047.f3863 < 0) {
                        m6981 = C0630.m2566("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28893) ^ 1085543568;
                        i5 = -34318554;
                    } else {
                        m6981 = C2105.m6981("۟ܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32425)) ^ (-223031809);
                        i5 = -677149503;
                    }
                case -1074681733:
                case 892780977:
                    C4075.m12246(activityC13676, exc, null);
                    break;
                case -469798434:
                case 1867297058:
                    C1047.m3599();
                    if (C0050.f910 < 0) {
                        m6981 = C0630.m2566("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28893) ^ 1085543568;
                        i5 = -34318554;
                    } else {
                        m6981 = C2105.m6981("᩷ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-30433)) ^ 878677458;
                        i5 = 230258511;
                    }
                case 75296240:
                case 1598000736:
                    if (RunnableC3474.m10630()) {
                        m6981 = C0630.m2566("֨ۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 8445) ^ (-1133202381);
                        i5 = 305064226;
                    } else {
                        m6981 = C0630.m2566("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28893) ^ 1085543568;
                        i5 = -34318554;
                    }
                case 355177332:
                case 1980946571:
                    if (C7811.m20844() != 0) {
                        m6981 = C2105.m6981("۟ܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32425)) ^ (-223031809);
                        i5 = -677149503;
                    } else {
                        m6981 = (i3 - C0630.m2566("ܽ۠")) * (-91);
                        i4 = ((m6981 ^ i2) * (-22327)) ^ (-1770179132);
                        i5 = 1139881309;
                    }
                case 592778674:
                case 972890479:
                    if (C1128.f4106 <= 0) {
                        m6981 = C2105.m6981("᩷ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-30433)) ^ 878677458;
                        i5 = 230258511;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۗ֫")) * (-71);
                        i4 = ((m6981 ^ i3) * (-15733)) ^ (-750054680);
                        i5 = -1580299238;
                    }
                case 734523484:
                case 1428708366:
                    if (C2272.f7362) {
                        m6981 = C2105.m6981("᩵۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23793)) ^ 1835051566;
                        i5 = -1436235429;
                    } else {
                        m6981 = C0630.m2566("᩵᩶") ^ i3;
                        i4 = ((m6981 ^ i2) * 6811) ^ (-1291367157);
                        i5 = -1987199664;
                    }
                case 938454596:
                case 1489259561:
                    if (C5695.m16023() >= 0) {
                        m6981 = C2105.m6981("۟ܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32425)) ^ (-223031809);
                        i5 = -677149503;
                    } else {
                        m6981 = (C2105.m6981("ۚۡ") ^ i3) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m6981 ^ i2) * 2435) ^ (-1115531450);
                        i5 = 511429617;
                    }
                case 971400503:
                case 1137858059:
                    C1128.m3851();
                    m6981 = C0630.m2566("᩵ᩳ") ^ i2;
                    i4 = ((m6981 ^ i3) * 28893) ^ 1085543568;
                    i5 = -34318554;
                case 998518118:
                case 1231807603:
                    if (C3663.f11553) {
                        m6981 = C2105.m6981("ۖ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1645)) ^ (-1681799563);
                        i5 = 803051195;
                    } else {
                        m6981 = C2105.m6981("᩷ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-30433)) ^ 878677458;
                        i5 = 230258511;
                    }
                default:
                    if (C1128.f4106 <= 0) {
                        m6981 = C0630.m2566("᩵ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 28893) ^ 1085543568;
                        i5 = -34318554;
                    } else {
                        m6981 = C2105.m6981("ۗ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * 22685) ^ (-1882398793);
                        i5 = 1689102079;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1006() {
        this.f73738.run();
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        C0237.m1487(this);
    }
}
