package l;

import android.view.View;
import android.widget.AdapterView;

/* compiled from: 05ZQ */
/* renamed from: l.ۖܺܳ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class C2634 implements AdapterView.OnItemSelectedListener {

    /* renamed from: ۚܺᩴ, reason: not valid java name and contains not printable characters */
    private static final short[] f8314 = {3236, -3257, -3255, -3262};

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int[] f8315;

    @Override // android.widget.AdapterView.OnItemSelectedListener
    public final void onNothingSelected(AdapterView adapterView) {
    }

    @Override // android.widget.AdapterView.OnItemSelectedListener
    public final void onItemSelected(AdapterView adapterView, View view, int i, long j) {
        InterfaceC12344 interfaceC12344 = null;
        InterfaceC13049 interfaceC13049 = null;
        short s = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        short[] sArr = null;
        int i5 = -2082217282;
        int i6 = C1294.f4556;
        int i7 = C11340.f33930;
        int m6981 = C2105.m6981("᩸ܶ") ^ i7;
        int i8 = ((m6981 ^ i6) * 31919) ^ (-782197093);
        int i9 = 815019335;
        while (true) {
            i5 = ((((i5 ^ i6) * (-17301)) >> 31) & i8) ^ (m6981 ^ i9);
            switch (i5) {
                case -1924759911:
                case 46904967:
                    if (C2167.f7158 >= 0) {
                        m6981 = C0630.m2566("ܺ۟") ^ i7;
                        i8 = ((m6981 ^ i6) * (-16031)) ^ (-1410556834);
                        i9 = -920787452;
                    } else {
                        m6981 = C2105.m6981("ۛۢ") ^ i6;
                        i8 = ((m6981 ^ i7) * 32281) ^ (-1140635565);
                        i9 = -18424448;
                    }
                case -1917240836:
                case -854069155:
                    int i10 = s + 17630;
                    i2 = i10 * i10;
                    i3 = s * s;
                    if (C0630.f2410 <= 0) {
                        m6981 = C0630.m2566("ܺ۟") ^ i7;
                        i8 = ((m6981 ^ i6) * (-16031)) ^ (-1410556834);
                        i9 = -920787452;
                    } else {
                        m6981 = C2105.m6981("᩷᩷") ^ i7;
                        i8 = ((m6981 ^ i6) * (-30333)) ^ (-250467736);
                        i9 = -2001059935;
                    }
                case -1845390424:
                case 1773076034:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = (C0630.m2566("ᩳ۫") ^ i6) * 25;
                        i8 = ((m6981 ^ i7) * (-5285)) ^ (-2025114897);
                        i9 = -1452130313;
                    } else {
                        m6981 = C0630.m2566("᩺۬") ^ i6;
                        i8 = ((m6981 ^ i7) * (-18173)) ^ (-1789746480);
                        i9 = 1714994036;
                    }
                case -1823427065:
                case -900317602:
                    interfaceC13049 = C1294.m4377(interfaceC12344);
                    sArr = f8314;
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = C2105.m6981("ᩴۗ") ^ i7;
                        i8 = ((m6981 ^ i6) * 20637) ^ 1189264994;
                        i9 = -451488433;
                    } else {
                        m6981 = C0630.m2566("᩸᩵") ^ i7;
                        i8 = ((m6981 ^ i6) * 25841) ^ 183724990;
                        i9 = -928878878;
                    }
                case -1814990158:
                case -775244894:
                    this.f8315[0] = i;
                    interfaceC12344 = ApplicationC20075.f65008;
                    if (C4616.f14690 <= 0) {
                        m6981 = (C0630.m2566("ᩳ۫") ^ i6) * 25;
                        i8 = ((m6981 ^ i7) * (-5285)) ^ (-2025114897);
                        i9 = -1452130313;
                    } else {
                        m6981 = (C2105.m6981("۟ܿ") ^ i7) * (-63);
                        i8 = ((m6981 ^ i6) * (-11751)) ^ (-1338013658);
                        i9 = 1513925243;
                    }
                case -1791367586:
                case -1319961524:
                    if (C2272.f7362) {
                        m6981 = C0630.m2566("ܺ۟") ^ i7;
                        i8 = ((m6981 ^ i6) * (-16031)) ^ (-1410556834);
                        i9 = -920787452;
                    } else {
                        m6981 = C2105.m6981("ᩴۗ") ^ i7;
                        i8 = ((m6981 ^ i6) * 20637) ^ 1189264994;
                        i9 = -451488433;
                    }
                case -1705943247:
                case 490153949:
                    C5695.m16023();
                    C3911.m11924();
                    m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                    i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                    i9 = -611565322;
                case -1319744145:
                case 515295572:
                    i4 = 20121;
                    m6981 = (C2105.m6981("᩻ۢ") + i6) * (-61);
                    i8 = ((m6981 ^ i7) * 14353) ^ 815223834;
                    i9 = -638178332;
                case -1170933226:
                case 623783157:
                    C3663.m11168();
                    if (AbstractC2021.f6743 > 0) {
                        m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                        i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                        i9 = -611565322;
                    } else {
                        m6981 = C0630.m2566("ܺ۟") ^ i7;
                        i8 = ((m6981 ^ i6) * (-16031)) ^ (-1410556834);
                        i9 = -920787452;
                    }
                case -919390483:
                case 1198565586:
                    if (C7106.f21815 != 0) {
                        m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                        i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                        i9 = -611565322;
                    } else {
                        m6981 = C2105.m6981("ۛۚ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-25213)) ^ (-1631284227);
                        i9 = -1145394644;
                    }
                case -897340969:
                case 75463352:
                    i4 = 62243;
                    m6981 = (C2105.m6981("᩻ۢ") + i6) * (-61);
                    i8 = ((m6981 ^ i7) * 14353) ^ 815223834;
                    i9 = -638178332;
                case -457365051:
                case 1332753113:
                    if (C22628.m50615() != 0) {
                        m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                        i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                        i9 = -611565322;
                    } else {
                        m6981 = C0630.m2566("ᩳᩴ") ^ i6;
                        i8 = ((m6981 ^ i7) * (-26403)) ^ 573531207;
                        i9 = 1797994904;
                    }
                case -289884560:
                case 1553159805:
                    int i11 = 310816900 + i3;
                    if (i2 - (i11 + i11) <= 0) {
                        m6981 = (C2105.m6981("ۖۢ") ^ i7) * 115;
                        i8 = ((m6981 ^ i6) * 23133) ^ 1690893888;
                        i9 = -2049721593;
                    } else {
                        m6981 = (i6 - C2105.m6981("᩶֫")) * (-115);
                        i8 = ((m6981 ^ i7) * 18915) ^ 43304317;
                        i9 = 2118122218;
                    }
                case -112791892:
                case 1158405959:
                    C0382.m1848();
                    break;
                case 185703535:
                case 1374597324:
                    if (C1294.f4556 >= 0) {
                        m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                        i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                        i9 = -611565322;
                    } else {
                        m6981 = (C2105.m6981("ۧۗ") + i7) * 27;
                        i8 = ((m6981 ^ i6) * 27583) ^ (-483036869);
                        i9 = -225902868;
                    }
                case 478873379:
                case 807624663:
                    C1916.m6302(interfaceC13049.mo25853(i, C4117.m12355(sArr, 1, 3, i4)));
                    break;
                case 826263696:
                case 2126496342:
                    C1773.m5908();
                    if (C11340.f33930 >= 0) {
                        m6981 = C0630.m2566("ܺ۟") ^ i7;
                        i8 = ((m6981 ^ i6) * (-16031)) ^ (-1410556834);
                        i9 = -920787452;
                    } else {
                        m6981 = (C2105.m6981("᩻᩶") + i6) * (-21);
                        i8 = ((m6981 ^ i7) * (-12587)) ^ (-1339848587);
                        i9 = -2127716105;
                    }
                case 1317465962:
                case 1871730255:
                    s = f8314[0];
                    if (C3746.f11829 <= 0) {
                        m6981 = (C0630.m2566("ᩳ۫") ^ i6) * 25;
                        i8 = ((m6981 ^ i7) * (-5285)) ^ (-2025114897);
                        i9 = -1452130313;
                    } else {
                        m6981 = (C2105.m6981("۬ۧ") + i6) * (-87);
                        i8 = ((m6981 ^ i7) * (-5487)) ^ (-1897119509);
                        i9 = 235400042;
                    }
                default:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("ۗۡ") ^ i7;
                        i8 = ((m6981 ^ i6) * (-6209)) ^ 178730205;
                        i9 = -689878191;
                    } else {
                        m6981 = (i6 - C0630.m2566("ܿ۫")) * (-81);
                        i8 = ((m6981 ^ i7) * 32307) ^ (-583263236);
                        i9 = -611565322;
                    }
            }
            return;
        }
    }

    public C2634(int[] iArr) {
        this.f8315 = iArr;
    }
}
