package l;

import android.content.DialogInterface;
import bin.mt.plus.Main;
import com.umeng.commonsdk.statistics.UMErrorCode;
import moe.shizuku.server.IShizukuService;

/* compiled from: JAJI */
/* renamed from: l.ۘۖ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C3661 extends AbstractC7548 {

    /* renamed from: ᩻ۨۙ, reason: not valid java name and contains not printable characters */
    private static final short[] f11548 = {5693, 26301, -28903, -26532, 28105, -18037, -17702, -27558, -19013, 27357, -25263, -16829, 25074, 5591, 25311, 23745, 23030};

    /* renamed from: ܳ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ActivityC22006 f11549;

    /* renamed from: ᩻, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ String f11550;

    /* JADX WARN: Code restructure failed: missing block: B:16:0x007a, code lost:
    
        if (l.ServiceConnectionC3453.f10921 < 0) goto L30;
     */
    /* JADX WARN: Code restructure failed: missing block: B:5:0x0053, code lost:
    
        if (l.RunnableC0588.f2309 >= 0) goto L65;
     */
    @Override // l.AbstractC7548
    /* renamed from: ۧ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo1008() {
        /*
            Method dump skipped, instructions count: 770
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C3661.mo1008():void");
    }

    public C3661(ActivityC22006 activityC22006, String str) {
        int i = 155197047;
        int i2 = C1294.f4556;
        int i3 = C3537.f11231;
        this.f11549 = activityC22006;
        this.f11550 = str;
        int m2566 = C0630.m2566("ܶ᩵") ^ i2;
        int i4 = ((m2566 ^ i3) * 19083) ^ (-1716569269);
        int i5 = -604252357;
        while (true) {
            i = (m2566 ^ i5) ^ (i4 & (((i ^ i3) * 14543) >> 31));
            switch (i) {
                case -878186629:
                case -522435018:
                    C3663.m11168();
                    C1773.m5908();
                    throw new RuntimeException();
                case -871483894:
                case -111325785:
                    C0237.m1481();
                    if (C2520.m8026()) {
                        m2566 = C2105.m6981("ۚ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * (-25841)) ^ 1158215371;
                        i5 = 2054205038;
                    } else {
                        m2566 = C0630.m2566("᩸ܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8543)) ^ (-692929704);
                        i5 = -921056027;
                    }
                case -713506238:
                case -517188749:
                    C1047.m3599();
                    C0798.m2998();
                    m2566 = C2105.m6981("ᩴ۟") ^ i3;
                    i4 = ((m2566 ^ i2) * 26905) ^ (-1118007753);
                    i5 = 438163930;
                case -457117308:
                case -450375892:
                    return;
                case -359153298:
                case 1962121455:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (i2 - C0630.m2566("֨֫")) * (-67);
                        i4 = ((m2566 ^ i3) * (-16399)) ^ (-1721937866);
                        i5 = -1212890531;
                    } else {
                        m2566 = C2105.m6981("ۗܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17029)) ^ 1935180768;
                        i5 = 1244635710;
                    }
                case 413399831:
                case 924161846:
                    if (ViewOnClickListenerC1958.m6429() < 0) {
                        m2566 = C2105.m6981("ᩴ۟") ^ i3;
                        i4 = ((m2566 ^ i2) * 26905) ^ (-1118007753);
                        i5 = 438163930;
                    } else {
                        m2566 = C2105.m6981("ۚ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * (-25841)) ^ 1158215371;
                        i5 = 2054205038;
                    }
                default:
                    C1005.m3501();
                    if (C0964.m3413()) {
                        m2566 = (i3 - C2105.m6981("᩻ܳ")) * (-91);
                        i4 = ((m2566 ^ i2) * 6477) ^ 1353592240;
                        i5 = -1929137251;
                    } else {
                        m2566 = C0630.m2566("᩸ܰ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-8543)) ^ (-692929704);
                        i5 = -921056027;
                    }
            }
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1006() {
        int m6981;
        int i;
        int i2;
        int i3;
        ActivityC22006 activityC22006;
        short[] sArr;
        int m69812;
        int i4;
        int m2566;
        int i5;
        int i6;
        int i7;
        ActivityC22006 activityC220062;
        short[] sArr2;
        short[] sArr3;
        int i8;
        int i9;
        final C3661 c3661 = this;
        int i10 = C0714.f2697;
        int i11 = AbstractC2021.f6743;
        int m25662 = C0630.m2566("֡ܿ") ^ i10;
        int i12 = ((m25662 ^ i11) * 6819) ^ 1351670450;
        final String str = null;
        Object[] objArr = null;
        DialogInterface.OnClickListener onClickListener = null;
        String str2 = null;
        short[] sArr4 = null;
        short[] sArr5 = null;
        int i13 = m25662 ^ (-2145226975);
        int i14 = 0;
        int i15 = 0;
        int i16 = 0;
        int i17 = 0;
        short s = 0;
        short s2 = 0;
        int i18 = 0;
        ActivityC22006 activityC220063 = null;
        int i19 = 1991683010;
        C19258 c19258 = null;
        String str3 = null;
        int i20 = 0;
        String str4 = null;
        while (true) {
            i19 = i13 ^ (i12 & (((i19 ^ i11) * (-3103)) >> 31));
            switch (i19) {
                case -2120706317:
                case -2080042963:
                    int i21 = i18;
                    activityC22006 = activityC220063;
                    sArr = sArr5;
                    Object[] objArr2 = new Object[i21];
                    objArr2[0] = str;
                    if (C1128.f4106 <= 0) {
                        i3 = i21;
                        objArr = objArr2;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    } else {
                        int m69813 = C2105.m6981("ܰᩴ") ^ i11;
                        i12 = ((m69813 ^ i10) * (-25785)) ^ (-131062170);
                        i9 = m69813 ^ (-1645538838);
                        objArr = objArr2;
                        sArr5 = sArr;
                        i18 = i21;
                        i13 = i9;
                        activityC220063 = activityC22006;
                    }
                case -2071437338:
                case 482218891:
                    if (C1773.f6144 > 0) {
                        m6981 = (C2105.m6981("ۙۙ") ^ i10) * (-103);
                        i = ((m6981 ^ i11) * (-3467)) ^ 616969878;
                        i2 = -872683351;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    } else {
                        int i22 = i18;
                        sArr3 = sArr5;
                        i8 = i22;
                        int m69814 = (C2105.m6981("᩸۟") ^ i11) * 7;
                        i13 = m69814 ^ (-1141658149);
                        i12 = ((m69814 ^ i10) * (-2185)) ^ (-334705702);
                        short[] sArr6 = sArr3;
                        i18 = i8;
                        sArr5 = sArr6;
                    }
                case -1864470723:
                case -884906195:
                    activityC22006 = activityC220063;
                    i14 = C2105.m6981(C1128.m3841(f11548, 1, 3, i17));
                    if (C7811.f24123 >= 0) {
                        i3 = i18;
                        i15 = 2097905165;
                        sArr = sArr5;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    } else {
                        int m25663 = C0630.m2566("ۧܰ") ^ i11;
                        i13 = m25663 ^ 1594658084;
                        activityC220063 = activityC22006;
                        i12 = ((m25663 ^ i10) * (-24063)) ^ (-1847182019);
                        i15 = 2097905165;
                    }
                case -1863967566:
                case 1449822887:
                    i16 = C0630.m2566(C3911.m11919(sArr4, 4, 3, i17));
                    i20 = 2130656528;
                    if (C3537.f11231 < 0) {
                        m6981 = C2105.m6981("ۡ᩺") ^ i11;
                        i = ((m6981 ^ i10) * 27229) ^ 859585478;
                        i2 = 1233023121;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
                    m6981 = (i10 - C2105.m6981("ۛᩳ")) * 77;
                    i = ((m6981 ^ i11) * 25183) ^ (-1992431757);
                    i2 = -784537174;
                    i13 = m6981 ^ i2;
                    i12 = i;
                case -1828343095:
                case -543527251:
                    i3 = i18;
                    activityC22006 = activityC220063;
                    sArr = sArr5;
                    short s3 = s2;
                    int i23 = s3 + 7959;
                    if ((s2 * s) - (i23 * i23) > 0) {
                        m2566 = C0630.m2566("᩹ۖ") ^ i11;
                        i12 = ((m2566 ^ i10) * 30017) ^ 1550258089;
                        i5 = -23321606;
                    } else {
                        m2566 = C0630.m2566("ܿ᩵") ^ i10;
                        i12 = ((m2566 ^ i11) * (-28525)) ^ 1675837678;
                        i5 = -1456856778;
                    }
                    i6 = m2566 ^ i5;
                    s2 = s3;
                    activityC220063 = activityC22006;
                    sArr5 = sArr;
                    i18 = i3;
                    i13 = i6;
                    c3661 = this;
                case -1472882940:
                case 1959968270:
                    i7 = i18;
                    activityC220062 = activityC220063;
                    sArr2 = sArr5;
                    i17 = 46682;
                    int m69815 = C2105.m6981("᩵ܽ") ^ i10;
                    activityC220063 = activityC220062;
                    int i24 = i7;
                    i13 = m69815 ^ (-1577192421);
                    i12 = ((m69815 ^ i11) * 9587) ^ (-1279406128);
                    sArr5 = sArr2;
                    i18 = i24;
                case -1381831407:
                case 2101117528:
                    C1294.m4380(c19258, C2105.m6981(str3) ^ 2126745260, null);
                    if (!C2167.m7155()) {
                        m6981 = C0630.m2566("֡ᩳ") ^ i10;
                        i = ((m6981 ^ i11) * (-30143)) ^ 242221429;
                        i2 = -1984926042;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
                    m6981 = (i10 - C2105.m6981("ۛᩳ")) * 77;
                    i = ((m6981 ^ i11) * 25183) ^ (-1992431757);
                    i2 = -784537174;
                    i13 = m6981 ^ i2;
                    i12 = i;
                case -1195851267:
                case 1226319155:
                    C0382.m1848();
                    C4117.m12364();
                    i3 = i18;
                    activityC22006 = activityC220063;
                    sArr = sArr5;
                    m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                    i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                    i4 = 1436709847;
                    i6 = m69812 ^ i4;
                    activityC220063 = activityC22006;
                    sArr5 = sArr;
                    i18 = i3;
                    i13 = i6;
                    c3661 = this;
                case -1062589846:
                case -447717401:
                    C3746.m11369();
                    if (C5695.m16023() >= 0) {
                        i3 = i18;
                        activityC22006 = activityC220063;
                        sArr = sArr5;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    } else {
                        m6981 = (C2105.m6981("ۙۙ") ^ i10) * (-103);
                        i = ((m6981 ^ i11) * (-3467)) ^ 616969878;
                        i2 = -872683351;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
                case -753081173:
                case 703325996:
                    C21923.m49329();
                    C1047.m3599();
                    break;
                case -484856506:
                case 533991595:
                    C0382.m1849(c19258, i16 ^ i20);
                    C3019.m9252(c19258, str4);
                    sArr5 = f11548;
                    if (C1773.f6144 > 0) {
                        m6981 = C0630.m2566("᩹ۙ") ^ i10;
                        i = ((m6981 ^ i11) * 25297) ^ (-1700677187);
                        i2 = -1976059727;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
                    m6981 = (C2105.m6981("ۙۙ") ^ i10) * (-103);
                    i = ((m6981 ^ i11) * (-3467)) ^ 616969878;
                    i2 = -872683351;
                    i13 = m6981 ^ i2;
                    i12 = i;
                case -135054114:
                case 1669345607:
                    C5695.m16017(c19258, C0630.m2566(str2) ^ 2126327785, onClickListener);
                    C3683.m11213(c19258);
                    break;
                case -64912657:
                case 75209004:
                    str3 = C1128.m3841(sArr5, 7, 3, i17);
                    if (RunnableC3474.f10992 <= 0) {
                        i3 = i18;
                        activityC22006 = activityC220063;
                        sArr = sArr5;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    } else {
                        m6981 = (C2105.m6981("۬ܳ") ^ i11) * 7;
                        i = ((m6981 ^ i10) * (-29063)) ^ 518949232;
                        i2 = -217394483;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
                case 31174224:
                case 242073730:
                    i3 = i18;
                    activityC22006 = activityC220063;
                    sArr = sArr5;
                    s2 = f11548[0];
                    s = 31836;
                    if (RunnableC3474.f10992 > 0) {
                        m69812 = (i11 - C2105.m6981("ܰۡ")) * 63;
                        i12 = ((m69812 ^ i10) * (-18225)) ^ (-133647143);
                        i4 = -1060800409;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    }
                    m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                    i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                    i4 = 1436709847;
                    i6 = m69812 ^ i4;
                    activityC220063 = activityC22006;
                    sArr5 = sArr;
                    i18 = i3;
                    i13 = i6;
                    c3661 = this;
                case 134200393:
                case 1352879440:
                    onClickListener = new DialogInterface.OnClickListener(c3661) { // from class: l.ۖۖ᩷

                        /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
                        public final /* synthetic */ C3661 f7323;

                        {
                            int i25 = -256530739;
                            int i26 = C0714.f2697;
                            int i27 = C3537.f11231;
                            int m69816 = (i26 - C2105.m6981("ۧ֨")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                            int i28 = ((m69816 ^ i27) * (-29827)) ^ (-1242735597);
                            int i29 = 1617768592;
                            while (true) {
                                i25 = ((((i25 ^ i27) * 32025) >> 31) & i28) ^ (m69816 ^ i29);
                                switch (i25) {
                                    case -2111803411:
                                    case 347364119:
                                        if (C4159.f13567) {
                                            m69816 = C2105.m6981("ۢ۟") ^ i26;
                                            i28 = ((m69816 ^ i27) * 26623) ^ (-1054494979);
                                            i29 = -1749172988;
                                        } else {
                                            m69816 = (C0630.m2566("᩻۬") ^ i27) * (-41);
                                            i28 = ((m69816 ^ i26) * 28849) ^ (-521338512);
                                            i29 = 954615642;
                                        }
                                    case -1943523777:
                                    case 1102095119:
                                        if (C5695.m16023() >= 0) {
                                            m69816 = (C2105.m6981("۬ܳ") ^ i27) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                            i28 = ((m69816 ^ i26) * 14451) ^ (-258860107);
                                            i29 = -1647154306;
                                        } else {
                                            m69816 = (C2105.m6981("֫᩻") + i26) * 81;
                                            i28 = ((m69816 ^ i27) * 24487) ^ (-1864967629);
                                            i29 = 248305779;
                                        }
                                    case -1939394436:
                                    case 1198053484:
                                        if (C1420.f5096 <= 0) {
                                            m69816 = (i27 - C0630.m2566("ۢۛ")) * 25;
                                            i28 = ((m69816 ^ i26) * 28797) ^ (-616490028);
                                            i29 = -153837674;
                                        } else {
                                            m69816 = (i26 - C2105.m6981("᩵֫")) * (-87);
                                            i28 = ((m69816 ^ i27) * (-26123)) ^ (-1636215797);
                                            i29 = 1896618374;
                                        }
                                    case -1896005213:
                                    case -892897011:
                                        if (C3911.f12484 >= 0) {
                                            m69816 = (i27 - C0630.m2566("ۢۛ")) * 25;
                                            i28 = ((m69816 ^ i26) * 28797) ^ (-616490028);
                                            i29 = -153837674;
                                        } else {
                                            m69816 = (C0630.m2566("ۨ᩵") ^ i26) * (-43);
                                            i28 = ((m69816 ^ i27) * 13983) ^ 546147534;
                                            i29 = -1985126146;
                                        }
                                    case -1858143954:
                                    case 1555174214:
                                        if (C3746.f11829 <= 0) {
                                            m69816 = (C0630.m2566("ۖۨ") + i26) * 73;
                                            i28 = ((m69816 ^ i27) * (-3595)) ^ 1646871434;
                                            i29 = 1853325099;
                                        } else {
                                            m69816 = (C2105.m6981("ܰۤ") + i26) * 93;
                                            i28 = ((m69816 ^ i27) * (-1183)) ^ 1216469152;
                                            i29 = 743554676;
                                        }
                                    case -1621208935:
                                    case 50402942:
                                        if (C1504.f5354) {
                                            m69816 = (i27 - C0630.m2566("ۢۛ")) * 25;
                                            i28 = ((m69816 ^ i26) * 28797) ^ (-616490028);
                                            i29 = -153837674;
                                        } else {
                                            m69816 = C2105.m6981("ۜۢ") ^ i27;
                                            i28 = ((m69816 ^ i26) * (-31275)) ^ (-706615521);
                                            i29 = 1402583073;
                                        }
                                    case -1171414954:
                                    case 312273595:
                                        return;
                                    case -746576044:
                                    case -199953135:
                                        this.f7323 = c3661;
                                        if (C4159.m12565() >= 0) {
                                            m69816 = (C2105.m6981("۬ܳ") ^ i27) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                            i28 = ((m69816 ^ i26) * 14451) ^ (-258860107);
                                            i29 = -1647154306;
                                        } else {
                                            m69816 = C0630.m2566("֡ۙ") ^ i27;
                                            i28 = ((m69816 ^ i26) * (-20791)) ^ 475070569;
                                            i29 = 461291551;
                                        }
                                    case -734455677:
                                    case 2020621610:
                                        if (C1916.m6308() >= 0) {
                                            m69816 = (C2105.m6981("۬ܳ") ^ i27) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                            i28 = ((m69816 ^ i26) * 14451) ^ (-258860107);
                                            i29 = -1647154306;
                                        } else {
                                            m69816 = (i27 - C0630.m2566("֡ᩴ")) * 69;
                                            i28 = ((m69816 ^ i26) * (-28863)) ^ (-645389826);
                                            i29 = 181212687;
                                        }
                                    case -717562279:
                                    case -319330101:
                                        if (C4263.f13799 <= 0) {
                                            m69816 = (C0630.m2566("᩻۬") ^ i27) * (-41);
                                            i28 = ((m69816 ^ i26) * 28849) ^ (-521338512);
                                            i29 = 954615642;
                                        } else {
                                            m69816 = C2105.m6981("᩶֨") ^ i27;
                                            i28 = ((m69816 ^ i26) * 27503) ^ (-1098328730);
                                            i29 = 1805096430;
                                        }
                                    case -88365300:
                                    case 180555223:
                                        C3683.m11222();
                                        m69816 = (C2105.m6981("۬ܳ") ^ i27) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                        i28 = ((m69816 ^ i26) * 14451) ^ (-258860107);
                                        i29 = -1647154306;
                                    case 160162862:
                                    case 183817756:
                                        C2105.m6982();
                                        if (C4117.f13076 <= 0) {
                                            m69816 = (C2105.m6981("۬ܳ") ^ i27) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                                            i28 = ((m69816 ^ i26) * 14451) ^ (-258860107);
                                            i29 = -1647154306;
                                        } else {
                                            m69816 = (C0630.m2566("ۖۨ") + i26) * 73;
                                            i28 = ((m69816 ^ i27) * (-3595)) ^ 1646871434;
                                            i29 = 1853325099;
                                        }
                                    case 435321636:
                                    case 982749263:
                                        if (C4263.m12819() >= 0) {
                                            m69816 = (C0630.m2566("ۖۨ") + i26) * 73;
                                            i28 = ((m69816 ^ i27) * (-3595)) ^ 1646871434;
                                            i29 = 1853325099;
                                        } else {
                                            m69816 = C0630.m2566("ܽۘ") ^ i27;
                                            i28 = ((m69816 ^ i26) * 23347) ^ (-1199498953);
                                            i29 = -2051549045;
                                        }
                                    case 815870258:
                                    case 1917040477:
                                        C0050.m940();
                                        throw new RuntimeException();
                                    case 1372282743:
                                    case 1788796215:
                                        C21923.m49329();
                                        if (C0714.f2697 < 0) {
                                            m69816 = (C0630.m2566("ۖۨ") + i26) * 73;
                                            i28 = ((m69816 ^ i27) * (-3595)) ^ 1646871434;
                                            i29 = 1853325099;
                                        } else {
                                            m69816 = (i27 - C0630.m2566("ۢۛ")) * 25;
                                            i28 = ((m69816 ^ i26) * 28797) ^ (-616490028);
                                            i29 = -153837674;
                                        }
                                    default:
                                        if (C3663.f11553) {
                                            m69816 = (C0630.m2566("ۖۨ") + i26) * 73;
                                            i28 = ((m69816 ^ i27) * (-3595)) ^ 1646871434;
                                            i29 = 1853325099;
                                        } else {
                                            m69816 = C0630.m2566("᩵ᩳ") ^ i26;
                                            i28 = ((m69816 ^ i27) * (-7451)) ^ (-1168508828);
                                            i29 = 1517636608;
                                        }
                                }
                            }
                        }

                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i25) {
                            String str5 = null;
                            int i26 = -1166433130;
                            int i27 = C0422.f1886;
                            int i28 = C7811.f24123;
                            int m25664 = (C0630.m2566("۟ܺ") ^ i28) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                            int i29 = ((m25664 ^ i27) * (-7849)) ^ (-1125451724);
                            int i30 = -1619912006;
                            while (true) {
                                i26 = ((((i26 ^ i27) * 25827) >> 31) & i29) ^ (m25664 ^ i30);
                                switch (i26) {
                                    case -2082197485:
                                    case -798139595:
                                        ServiceConnectionC3453.m10564();
                                        if (C1711.f5919) {
                                            m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                            i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                            i30 = -744732489;
                                        } else {
                                            m25664 = C0630.m2566("۫ۨ") ^ i28;
                                            i29 = ((m25664 ^ i27) * (-13395)) ^ (-1244149080);
                                            i30 = -212966202;
                                        }
                                    case -2062675674:
                                    case -1233501367:
                                        if (C1047.f3863 >= 0) {
                                            m25664 = (i27 - C0630.m2566("᩶ۚ")) * (-55);
                                            i29 = ((m25664 ^ i28) * 19601) ^ 491550952;
                                            i30 = 1720250343;
                                        } else {
                                            m25664 = C2105.m6981("ۘ֨") ^ i28;
                                            i29 = ((m25664 ^ i27) * (-23517)) ^ 194207989;
                                            i30 = -801930157;
                                        }
                                    case -1831695675:
                                    case 117201369:
                                        if (C1005.f3721) {
                                            m25664 = C2105.m6981("֡ܳ") ^ i27;
                                            i29 = ((m25664 ^ i28) * (-9929)) ^ (-114940051);
                                            i30 = 667206122;
                                        } else {
                                            m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                            i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                            i30 = -744732489;
                                        }
                                    case -1499101305:
                                    case 1007245379:
                                        if (RunnableC1937.f6483 >= 0) {
                                            m25664 = (C0630.m2566("᩻᩶") ^ i28) * 65;
                                            i29 = ((m25664 ^ i27) * 29409) ^ (-1442873765);
                                            i30 = -21280215;
                                        } else {
                                            m25664 = (C2105.m6981("۟ᩳ") ^ i27) * (-29);
                                            i29 = ((m25664 ^ i28) * 10999) ^ 775225170;
                                            i30 = -458704455;
                                        }
                                    case -1117887460:
                                    case -907686138:
                                        str5 = str;
                                        if (C1294.m4372() <= 0) {
                                            m25664 = (i27 - C0630.m2566("᩶ۚ")) * (-55);
                                            i29 = ((m25664 ^ i28) * 19601) ^ 491550952;
                                            i30 = 1720250343;
                                        } else {
                                            m25664 = (C0630.m2566("ܿܰ") + i28) * (-75);
                                            i29 = ((m25664 ^ i27) * 3313) ^ 1919531767;
                                            i30 = 825360295;
                                        }
                                    case -1062297502:
                                    case -329975960:
                                        if (C4263.f13799 > 0) {
                                            m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                            i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                            i30 = -744732489;
                                        } else {
                                            m25664 = (i27 - C2105.m6981("ܿᩳ")) * (-119);
                                            i29 = ((m25664 ^ i28) * 25803) ^ 1233768690;
                                            i30 = -2078342667;
                                        }
                                    case -1011020607:
                                    case -284969377:
                                        Main.m63(this.f7323.f11549, str5);
                                        break;
                                    case -881577471:
                                    case -584268381:
                                        C1711.m5736();
                                        break;
                                    case -506609122:
                                    case -63342453:
                                        if (C7811.m20844() != 0) {
                                            m25664 = (C0630.m2566("᩻᩶") ^ i28) * 65;
                                            i29 = ((m25664 ^ i27) * 29409) ^ (-1442873765);
                                            i30 = -21280215;
                                        } else {
                                            m25664 = (i28 - C2105.m6981("ۙ᩺")) * 59;
                                            i29 = ((m25664 ^ i27) * 3345) ^ 193865431;
                                            i30 = -1528563867;
                                        }
                                    case -479705942:
                                    case 1884362991:
                                        if (C0422.f1886 <= 0) {
                                            m25664 = (i27 - C0630.m2566("᩶ۚ")) * (-55);
                                            i29 = ((m25664 ^ i28) * 19601) ^ 491550952;
                                            i30 = 1720250343;
                                        } else {
                                            m25664 = (i28 - C2105.m6981("ᩴܿ")) * 77;
                                            i29 = ((m25664 ^ i27) * (-22733)) ^ (-500905973);
                                            i30 = -1007556395;
                                        }
                                    case -370873000:
                                    case 1060058969:
                                        if (RunnableC0588.f2309 >= 0) {
                                            m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                            i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                            i30 = -744732489;
                                        } else {
                                            m25664 = C0630.m2566("۬ۘ") ^ i27;
                                            i29 = ((m25664 ^ i28) * (-14789)) ^ (-615332805);
                                            i30 = -455940378;
                                        }
                                    case 30133260:
                                    case 328214211:
                                        if (RunnableC1937.f6483 >= 0) {
                                            m25664 = (i27 - C0630.m2566("᩶ۚ")) * (-55);
                                            i29 = ((m25664 ^ i28) * 19601) ^ 491550952;
                                            i30 = 1720250343;
                                        } else {
                                            m25664 = C2105.m6981("ۖۚ") ^ i28;
                                            i29 = ((m25664 ^ i27) * (-3349)) ^ 689970250;
                                            i30 = 589468998;
                                        }
                                    case 405281989:
                                    case 1199794201:
                                        if (C0798.m2998() != 0) {
                                            m25664 = C0630.m2566("۫ۨ") ^ i28;
                                            i29 = ((m25664 ^ i27) * (-13395)) ^ (-1244149080);
                                            i30 = -212966202;
                                        } else {
                                            m25664 = (i27 - C0630.m2566("ܶۢ")) * (-89);
                                            i29 = ((m25664 ^ i28) * 20825) ^ (-1859796069);
                                            i30 = 1159067376;
                                        }
                                    case 573886899:
                                    case 1640208580:
                                        if (C2105.f7037 != 0) {
                                            m25664 = (C0630.m2566("᩻᩶") ^ i28) * 65;
                                            i29 = ((m25664 ^ i27) * 29409) ^ (-1442873765);
                                            i30 = -21280215;
                                        } else {
                                            m25664 = (C2105.m6981("ܳܽ") + i27) * 91;
                                            i29 = ((m25664 ^ i28) * 12315) ^ 917037183;
                                            i30 = -1415339546;
                                        }
                                    case 1119780060:
                                    case 1794526283:
                                        C7106.m19120();
                                        m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                        i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                        i30 = -744732489;
                                    default:
                                        if (C3245.m9925() == 0) {
                                            m25664 = C0630.m2566("ᩴ֫") ^ i27;
                                            i29 = ((m25664 ^ i28) * 17729) ^ (-1923332461);
                                            i30 = -744732489;
                                        } else {
                                            m25664 = (C0630.m2566("᩻᩶") ^ i28) * 65;
                                            i29 = ((m25664 ^ i27) * 29409) ^ (-1442873765);
                                            i30 = -21280215;
                                        }
                                }
                                return;
                            }
                        }
                    };
                    str2 = C22628.m50602(f11548, 10, 3, i17);
                    if (C0382.f1805) {
                        m6981 = C0630.m2566("ۨۧ") ^ i10;
                        i = ((m6981 ^ i11) * 21637) ^ 2135031548;
                        i2 = 2042427964;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    } else {
                        i3 = i18;
                        activityC22006 = activityC220063;
                        sArr = sArr5;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    }
                case 161931150:
                case 812839940:
                    activityC22006 = activityC220063;
                    Object[] objArr3 = objArr;
                    str4 = ServiceConnectionC3453.m10566(activityC22006, i14 ^ i15, objArr3);
                    int i25 = DialogInterfaceC0206.f1451;
                    c19258 = new C19258(activityC22006);
                    short[] sArr7 = f11548;
                    if (C0422.m1963()) {
                        int m69816 = (i10 - C2105.m6981("֨۠")) * (-73);
                        i12 = ((m69816 ^ i11) * 7279) ^ (-665379131);
                        i9 = m69816 ^ (-79454463);
                        objArr = objArr3;
                        sArr4 = sArr7;
                        i13 = i9;
                        activityC220063 = activityC22006;
                    } else {
                        objArr = objArr3;
                        activityC220063 = activityC22006;
                        sArr4 = sArr7;
                        int i222 = i18;
                        sArr3 = sArr5;
                        i8 = i222;
                        int m698142 = (C2105.m6981("᩸۟") ^ i11) * 7;
                        i13 = m698142 ^ (-1141658149);
                        i12 = ((m698142 ^ i10) * (-2185)) ^ (-334705702);
                        short[] sArr62 = sArr3;
                        i18 = i8;
                        sArr5 = sArr62;
                    }
                case 660979773:
                case 1877244107:
                    i7 = i18;
                    activityC220062 = activityC220063;
                    sArr2 = sArr5;
                    i17 = 60761;
                    int m698152 = C2105.m6981("᩵ܽ") ^ i10;
                    activityC220063 = activityC220062;
                    int i242 = i7;
                    i13 = m698152 ^ (-1577192421);
                    i12 = ((m698152 ^ i11) * 9587) ^ (-1279406128);
                    sArr5 = sArr2;
                    i18 = i242;
                case 800183662:
                case 1525038140:
                    sArr3 = sArr5;
                    ActivityC22006 activityC220064 = c3661.f11549;
                    str = c3661.f11550;
                    activityC220064.f70544 = str;
                    if (C3683.f11629 >= 0) {
                        activityC220063 = activityC220064;
                        i8 = 1;
                        int m6981422 = (C2105.m6981("᩸۟") ^ i11) * 7;
                        i13 = m6981422 ^ (-1141658149);
                        i12 = ((m6981422 ^ i10) * (-2185)) ^ (-334705702);
                        short[] sArr622 = sArr3;
                        i18 = i8;
                        sArr5 = sArr622;
                    } else {
                        int m25664 = C0630.m2566("ۨ۫") ^ i10;
                        i13 = m25664 ^ 265769453;
                        activityC220063 = activityC220064;
                        i12 = ((m25664 ^ i11) * 18265) ^ (-79409333);
                        sArr5 = sArr3;
                        i18 = 1;
                    }
                default:
                    if (C0714.f2697 < 0) {
                        i3 = i18;
                        activityC22006 = activityC220063;
                        sArr = sArr5;
                        m69812 = (C2105.m6981("ܰۤ") + i11) * 93;
                        i12 = ((m69812 ^ i10) * (-9151)) ^ 2103899105;
                        i4 = 1436709847;
                        i6 = m69812 ^ i4;
                        activityC220063 = activityC22006;
                        sArr5 = sArr;
                        i18 = i3;
                        i13 = i6;
                        c3661 = this;
                    } else {
                        m6981 = (C2105.m6981("֨ۚ") ^ i11) * 49;
                        i = ((m6981 ^ i10) * (-17217)) ^ 1871665354;
                        i2 = -544395310;
                        i13 = m6981 ^ i2;
                        i12 = i;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ᩳ */
    public final void mo1010() {
        C0237.m1487(this);
    }

    @Override // l.AbstractC7548
    /* renamed from: ܿ */
    public final void mo1009() {
        ActivityC22006 activityC22006 = null;
        AbstractC15440 abstractC15440 = null;
        String[] strArr = null;
        AbstractC15440 abstractC154402 = null;
        int i = 891884323;
        int i2 = RunnableC3474.f10992;
        int i3 = C2167.f7158;
        int m6981 = C2105.m6981("ܺ᩶") ^ i2;
        int i4 = ((m6981 ^ i3) * (-14333)) ^ 1757244712;
        int i5 = 1658875736;
        while (true) {
            i = ((((i ^ i3) * (-13825)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2009554625:
                case 1278676263:
                    strArr = new String[0];
                    if (C1047.m3599() >= 0) {
                        m6981 = C0630.m2566("᩹ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9321) ^ 1143715785;
                        i5 = -2045547342;
                    } else {
                        m6981 = C0630.m2566("ܶܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * 7453) ^ (-673276977);
                        i5 = 379917689;
                    }
                case -1968234940:
                case 51009673:
                    activityC22006 = this.f11549;
                    if (C1047.f3863 >= 0) {
                        m6981 = C0630.m2566("᩸ۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16997)) ^ (-130392077);
                        i5 = 1223143584;
                    } else {
                        m6981 = (C0630.m2566("ܶۨ") ^ i3) * 19;
                        i4 = ((m6981 ^ i2) * (-29235)) ^ 641777268;
                        i5 = -901624986;
                    }
                case -1702774687:
                case -344101904:
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("᩹ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9321) ^ 1143715785;
                        i5 = -2045547342;
                    } else {
                        m6981 = (C2105.m6981("᩶ܶ") ^ i3) * (-103);
                        i4 = ((m6981 ^ i2) * 9915) ^ (-439890851);
                        i5 = 1312442070;
                    }
                case -1482775109:
                case -869553540:
                    C1128.m3851();
                    break;
                case -1436490939:
                case -1285463310:
                    if (C3245.f10203 <= 0) {
                        m6981 = (C0630.m2566("ܳ᩺") ^ i2) * 39;
                        i4 = ((m6981 ^ i3) * (-27017)) ^ (-1289027289);
                        i5 = -1230233560;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۨۛ")) * (-99);
                        i4 = ((m6981 ^ i2) * (-26165)) ^ (-546443726);
                        i5 = 379044916;
                    }
                case -1307080572:
                case -1061594400:
                    if (C1005.m3501()) {
                        m6981 = C0630.m2566("ۜۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-31291)) ^ (-852949183);
                        i5 = 200373629;
                    } else {
                        m6981 = (C0630.m2566("ܳ᩺") ^ i2) * 39;
                        i4 = ((m6981 ^ i3) * (-27017)) ^ (-1289027289);
                        i5 = -1230233560;
                    }
                case -1078536472:
                case -569918296:
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("᩵ۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * 26977) ^ (-496642869);
                        i5 = -965258479;
                    } else {
                        m6981 = (C0630.m2566("ۖ۫") ^ i2) * (-23);
                        i4 = ((m6981 ^ i3) * 14815) ^ 590656435;
                        i5 = -1451860903;
                    }
                case -806125598:
                case 1417538355:
                    abstractC154402 = C0382.m1845(this.f11550, strArr);
                    if (C5695.f17556 >= 0) {
                        m6981 = C0630.m2566("᩵ۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * 26977) ^ (-496642869);
                        i5 = -965258479;
                    } else {
                        m6981 = C0630.m2566("ܽ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * 7083) ^ 2117391544;
                        i5 = 570191193;
                    }
                case -448070797:
                case 1434873039:
                    abstractC15440 = activityC22006.f70540;
                    if (C0798.m2998() != 0) {
                        m6981 = C0630.m2566("᩹ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9321) ^ 1143715785;
                        i5 = -2045547342;
                    } else {
                        m6981 = (C0630.m2566("۫ۡ") + i2) * 71;
                        i4 = ((m6981 ^ i3) * 4271) ^ (-1333786363);
                        i5 = -1604006678;
                    }
                case -403006818:
                case 274946893:
                    ServiceConnectionC3453.m10564();
                    if (C4263.f13799 > 0) {
                        m6981 = C0630.m2566("ܺۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11589)) ^ 1945006213;
                        i5 = -1165325026;
                    } else {
                        m6981 = C0630.m2566("᩸ۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-16997)) ^ (-130392077);
                        i5 = 1223143584;
                    }
                case -349458598:
                case 1882666803:
                    if (C1005.f3721) {
                        m6981 = C0630.m2566("ۘ۟") ^ i2;
                        i4 = ((m6981 ^ i3) * 20299) ^ 860033348;
                        i5 = -564346814;
                    } else {
                        m6981 = (C0630.m2566("ܳ᩺") ^ i2) * 39;
                        i4 = ((m6981 ^ i3) * (-27017)) ^ (-1289027289);
                        i5 = -1230233560;
                    }
                case -62591511:
                case 1543622062:
                    if (C2520.m8026()) {
                        m6981 = C0630.m2566("᩵ۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * 26977) ^ (-496642869);
                        i5 = -965258479;
                    } else {
                        m6981 = C0630.m2566("ܺۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11589)) ^ 1945006213;
                        i5 = -1165325026;
                    }
                case 462294508:
                case 1675421668:
                    C1504.m5179();
                    m6981 = C0630.m2566("᩵ۜ") ^ i2;
                    i4 = ((m6981 ^ i3) * 26977) ^ (-496642869);
                    i5 = -965258479;
                case 739462782:
                case 1780179804:
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("᩹ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9321) ^ 1143715785;
                        i5 = -2045547342;
                    } else {
                        m6981 = C2105.m6981("ܰۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * 21725) ^ 2042623956;
                        i5 = 1781992288;
                    }
                case 1075201979:
                case 1975026671:
                    abstractC15440.m36499(abstractC154402, (C17558) null);
                    break;
                default:
                    if (C0050.m940() > 0) {
                        m6981 = C0630.m2566("ܺۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11589)) ^ 1945006213;
                        i5 = -1165325026;
                    } else {
                        m6981 = (C0630.m2566("ܳ᩺") ^ i2) * 39;
                        i4 = ((m6981 ^ i3) * (-27017)) ^ (-1289027289);
                        i5 = -1230233560;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC7548
    /* renamed from: ֫ */
    public final void mo1007(Exception exc) {
        ActivityC22006 activityC22006 = null;
        int i = 884802336;
        int i2 = C5695.f17556;
        int i3 = C3683.f11629;
        int m6981 = (C2105.m6981("ܽۨ") ^ i3) * (-99);
        int i4 = ((m6981 ^ i2) * (-23707)) ^ 354963194;
        int i5 = 744635511;
        while (true) {
            i = ((((i ^ i2) * 2773) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2122765547:
                case -262167567:
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = C0630.m2566("۟ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11009)) ^ 1139265244;
                        i5 = -919282275;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۘܰ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m6981 ^ i3) * 1191) ^ (-1760534640);
                        i5 = 635312465;
                    }
                case -2031879277:
                case -219953717:
                    if (C1047.f3863 >= 0) {
                        m6981 = (C0630.m2566("ܽܽ") ^ i2) * (-21);
                        i4 = ((m6981 ^ i3) * (-13379)) ^ (-475045194);
                        i5 = 1773655304;
                    } else {
                        m6981 = C0630.m2566("֡ۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 1305) ^ 1246191575;
                        i5 = 673847348;
                    }
                case -1982512716:
                case -1447054782:
                    C0050.m940();
                    m6981 = (C0630.m2566("ܽܽ") ^ i2) * (-21);
                    i4 = ((m6981 ^ i3) * (-13379)) ^ (-475045194);
                    i5 = 1773655304;
                case -1854764434:
                case -1783027251:
                    if (RunnableC1108.f4040) {
                        m6981 = C2105.m6981("۠ۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * 16671) ^ (-334383155);
                        i5 = -848318434;
                    } else {
                        m6981 = (C0630.m2566("ܽ᩸") ^ i3) * (-127);
                        i4 = ((m6981 ^ i2) * 2989) ^ (-1882823575);
                        i5 = 1085670343;
                    }
                case -1637896692:
                case 1613978653:
                    activityC22006 = this.f11549;
                    if (C0237.f1507 != 0) {
                        m6981 = (C0630.m2566("ܽ᩸") ^ i3) * (-127);
                        i4 = ((m6981 ^ i2) * 2989) ^ (-1882823575);
                        i5 = 1085670343;
                    } else {
                        m6981 = C0630.m2566("ᩴ֡") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29101)) ^ 1782161664;
                        i5 = -921832009;
                    }
                case -1481763042:
                case 1138635193:
                    if (C1047.m3599() >= 0) {
                        m6981 = C0630.m2566("۟ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11009)) ^ 1139265244;
                        i5 = -919282275;
                    } else {
                        m6981 = C2105.m6981("ᩳܳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 29315) ^ 1660957983;
                        i5 = -606009671;
                    }
                case -987919100:
                case 2092582982:
                    if (C2272.m7503()) {
                        m6981 = C0630.m2566("ۘܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2357)) ^ 1545278877;
                        i5 = 2102549250;
                    } else {
                        m6981 = C0630.m2566("֫᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-23785)) ^ (-686710325);
                        i5 = 599439279;
                    }
                case -683819922:
                case 1322414559:
                    if (C22628.f73083 <= 0) {
                        m6981 = C0630.m2566("۟ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11009)) ^ 1139265244;
                        i5 = -919282275;
                    } else {
                        m6981 = (C2105.m6981("ۤۛ") ^ i2) * (-99);
                        i4 = ((m6981 ^ i3) * 3001) ^ 1995405062;
                        i5 = -768870962;
                    }
                case 167293112:
                case 971550203:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("۟ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11009)) ^ 1139265244;
                        i5 = -919282275;
                    } else {
                        m6981 = (C0630.m2566("ۖۤ") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * 23333) ^ 1537952475;
                        i5 = -1657484088;
                    }
                case 282045858:
                case 612785493:
                    if (C0714.f2697 >= 0) {
                        m6981 = C0630.m2566("ۘܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2357)) ^ 1545278877;
                        i5 = 2102549250;
                    } else {
                        m6981 = C0630.m2566("᩹֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-32575)) ^ 767725927;
                        i5 = -1114243054;
                    }
                case 376742690:
                case 1225980845:
                    if (C5695.f17556 >= 0) {
                        m6981 = C0630.m2566("ۘܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2357)) ^ 1545278877;
                        i5 = 2102549250;
                    } else {
                        m6981 = (C0630.m2566("ۤ۫") ^ i2) * 123;
                        i4 = ((m6981 ^ i3) * (-26465)) ^ (-374052261);
                        i5 = 184922683;
                    }
                case 607775821:
                case 1897176120:
                    ServiceConnectionC3453.m10561(activityC22006, exc, null);
                    break;
                case 852831720:
                case 1035192233:
                    C0422.m1963();
                    if (C1294.f4556 >= 0) {
                        m6981 = (C0630.m2566("ܽܽ") ^ i2) * (-21);
                        i4 = ((m6981 ^ i3) * (-13379)) ^ (-475045194);
                        i5 = 1773655304;
                    } else {
                        m6981 = C0630.m2566("ۘܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2357)) ^ 1545278877;
                        i5 = 2102549250;
                    }
                case 919936462:
                case 1806981151:
                    if (C7106.f21815 != 0) {
                        m6981 = (i2 - C0630.m2566("ۘܰ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m6981 ^ i3) * 1191) ^ (-1760534640);
                        i5 = 635312465;
                    } else {
                        m6981 = (C0630.m2566("ۛ᩵") + i3) * (-109);
                        i4 = ((m6981 ^ i2) * 497) ^ 1532453;
                        i5 = -251461625;
                    }
                case 1426840520:
                case 1536529652:
                    C2520.m8026();
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (C0630.m2566("ܽܽ") ^ i2) * (-21);
                        i4 = ((m6981 ^ i3) * (-13379)) ^ (-475045194);
                        i5 = 1773655304;
                    } else {
                        m6981 = C0630.m2566("۟ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11009)) ^ 1139265244;
                        i5 = -919282275;
                    }
                default:
                    C1047.m3599();
                    break;
            }
            return;
        }
    }
}
