package l;

import android.animation.Animator;
import android.graphics.Bitmap;
import android.view.ViewGroup;
import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: L2RS */
/* renamed from: l.ۙᩳ᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class C4820 implements Animator.AnimatorListener {

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C17939 f15242;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewGroup f15243;

    @Override // android.animation.Animator.AnimatorListener
    public final void onAnimationCancel(Animator animator) {
    }

    @Override // android.animation.Animator.AnimatorListener
    public final void onAnimationRepeat(Animator animator) {
    }

    @Override // android.animation.Animator.AnimatorListener
    public final void onAnimationStart(Animator animator) {
    }

    public C4820(C17939 c17939, ViewGroup viewGroup) {
        int i = -1631088837;
        int i2 = C3245.f10203;
        int i3 = C0050.f910;
        int m6981 = (C2105.m6981("ܺ᩶") + i3) * (-111);
        int i4 = ((m6981 ^ i2) * 27049) ^ 1187943466;
        int i5 = 166008278;
        while (true) {
            i = ((((i ^ i2) * (-22641)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2125093181:
                case -991728796:
                    if (C3432.m10477() <= 0) {
                        m6981 = C0630.m2566("۟ۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26329)) ^ (-1377870989);
                        i5 = -717193486;
                    } else {
                        m6981 = (i3 - C2105.m6981("۠۫")) * 119;
                        i4 = ((m6981 ^ i2) * (-20195)) ^ 1228450661;
                        i5 = -1149957528;
                    }
                case -2058154210:
                case -1916572798:
                    if (C4075.m12263() <= 0) {
                        m6981 = C0630.m2566("۟ۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26329)) ^ (-1377870989);
                        i5 = -717193486;
                    } else {
                        m6981 = C0630.m2566("ܺۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14103)) ^ (-1029636560);
                        i5 = -598528599;
                    }
                case -1723421476:
                case -1204945341:
                    C1005.m3501();
                    if (C7811.m20844() != 0) {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    } else {
                        m6981 = (C0630.m2566("ۤܶ") + i3) * (-45);
                        i4 = ((m6981 ^ i2) * 30213) ^ 2047904619;
                        i5 = -2001532569;
                    }
                case -1560517668:
                case 168091843:
                    if (C0964.m3413()) {
                        m6981 = (C0630.m2566("ܽ᩶") + i3) * 91;
                        i4 = ((m6981 ^ i2) * (-23449)) ^ (-1918580880);
                        i5 = -770119620;
                    } else {
                        m6981 = (C0630.m2566("ۛ۟") ^ i2) * (-95);
                        i4 = ((m6981 ^ i3) * (-1027)) ^ (-707964067);
                        i5 = 1907600741;
                    }
                case -1367977846:
                case -30764241:
                    if (RunnableC3474.m10630()) {
                        m6981 = (i2 - C0630.m2566("ۗ᩺")) * (-111);
                        i4 = ((m6981 ^ i3) * 18273) ^ (-1714332582);
                        i5 = 4039523;
                    } else {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    }
                case -1136721028:
                case 2048828769:
                    this.f15242 = c17939;
                    if (C1294.f4556 >= 0) {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    } else {
                        m6981 = (i2 - C0630.m2566("֫ܰ")) * 5;
                        i4 = ((m6981 ^ i3) * 17263) ^ 1672448405;
                        i5 = 2018001442;
                    }
                case -886088024:
                case -16293179:
                    this.f15243 = viewGroup;
                    return;
                case -759811918:
                case 234338006:
                    if (C2126.m7040()) {
                        m6981 = (C2105.m6981("ܶۗ") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 22671) ^ 896033777;
                        i5 = -462724678;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܺܽ")) * (-43);
                        i4 = ((m6981 ^ i2) * (-12405)) ^ (-362024876);
                        i5 = 1009616506;
                    }
                case -736926291:
                case 270543556:
                    if (C7106.m19120() <= 0) {
                        m6981 = C0630.m2566("۟ۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26329)) ^ (-1377870989);
                        i5 = -717193486;
                    } else {
                        m6981 = (C2105.m6981("۠۟") + i3) * 75;
                        i4 = ((m6981 ^ i2) * 25575) ^ (-1330841675);
                        i5 = -1503892622;
                    }
                case -492849121:
                case 1163654121:
                    C4616.m13552();
                    C11340.m28031();
                    throw new RuntimeException();
                case -147194503:
                case 1968851274:
                    C2272.m7503();
                    if (C11340.f33930 < 0) {
                        m6981 = (C0630.m2566("ۛ۟") ^ i2) * (-95);
                        i4 = ((m6981 ^ i3) * (-1027)) ^ (-707964067);
                        i5 = 1907600741;
                    } else {
                        m6981 = (C2105.m6981("ܶۗ") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 22671) ^ 896033777;
                        i5 = -462724678;
                    }
                case 487750896:
                case 2092621436:
                    if (C2126.m7040()) {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    } else {
                        m6981 = C0630.m2566("ۜۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 12083) ^ (-512596223);
                        i5 = 201733950;
                    }
                case 509608320:
                case 1812330016:
                    if (C0422.m1963()) {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    } else {
                        m6981 = (C0630.m2566("ۛ۟") ^ i2) * (-95);
                        i4 = ((m6981 ^ i3) * (-1027)) ^ (-707964067);
                        i5 = 1907600741;
                    }
                case 671851388:
                case 780121129:
                    if (C7811.m20844() != 0) {
                        m6981 = (C2105.m6981("᩹ۧ") ^ i3) * (-67);
                        i4 = ((m6981 ^ i2) * 3141) ^ 1166484759;
                        i5 = -2138324112;
                    } else {
                        m6981 = C2105.m6981("֨᩹") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25813)) ^ 1675646522;
                        i5 = 1902559000;
                    }
                case 1611143425:
                case 1846608043:
                    C3245.m9925();
                    C2520.m8026();
                    m6981 = (C0630.m2566("ۛ۟") ^ i2) * (-95);
                    i4 = ((m6981 ^ i3) * (-1027)) ^ (-707964067);
                    i5 = 1907600741;
                default:
                    if (C1420.f5096 <= 0) {
                        m6981 = (C0630.m2566("ۤܶ") + i3) * (-45);
                        i4 = ((m6981 ^ i2) * 30213) ^ 2047904619;
                        i5 = -2001532569;
                    } else {
                        m6981 = (i2 - C2105.m6981("ܶ۠")) * (-55);
                        i4 = ((m6981 ^ i3) * 26385) ^ (-2082817582);
                        i5 = 424289453;
                    }
            }
        }
    }

    @Override // android.animation.Animator.AnimatorListener
    public final void onAnimationEnd(Animator animator) {
        Bitmap bitmap = null;
        C17939 c17939 = null;
        ViewGroup viewGroup = null;
        int i = 629994940;
        int i2 = C3432.f10845;
        int i3 = C11340.f33930;
        int m6981 = C2105.m6981("᩸ܺ") ^ i2;
        int i4 = ((m6981 ^ i3) * (-24191)) ^ 976927746;
        int i5 = 902464678;
        while (true) {
            i = ((((i ^ i3) * (-28211)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2132941748:
                case -119566184:
                    if (C0382.m1848()) {
                        m6981 = C0630.m2566("ܳܳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9427) ^ (-714842048);
                        i5 = -869184390;
                    } else {
                        m6981 = C2105.m6981("ۘۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15625) ^ 822222618;
                        i5 = 1278823889;
                    }
                case -1970052357:
                case 216105434:
                    C7811.m20844();
                    if (C3683.f11629 >= 0) {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    } else {
                        m6981 = C0630.m2566("ܳܳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9427) ^ (-714842048);
                        i5 = -869184390;
                    }
                case -1859399897:
                case -114438661:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = (C2105.m6981("ۡ᩻") + i2) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i3) * (-29429)) ^ 348316907;
                        i5 = 1236385279;
                    } else {
                        m6981 = C2105.m6981("ۧۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-12133)) ^ 1261593247;
                        i5 = -1744867899;
                    }
                case -1803882913:
                case 1816391317:
                    c17939 = this.f15242;
                    c17939.setImageBitmap(bitmap);
                    if (C3432.f10845 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩺֫")) * 43;
                        i4 = ((m6981 ^ i3) * (-29623)) ^ (-396889368);
                        i5 = -478995386;
                    } else {
                        m6981 = (i2 - C0630.m2566("᩸ܰ")) * (-105);
                        i4 = ((m6981 ^ i3) * 22727) ^ 404761970;
                        i5 = 1320857456;
                    }
                case -1673122819:
                case 1253037040:
                    bitmap = null;
                    if (C4117.f13076 <= 0) {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۖᩴ")) * (-95);
                        i4 = ((m6981 ^ i3) * (-5439)) ^ (-830109060);
                        i5 = 1504726869;
                    }
                case -1450135375:
                case -1307578560:
                    if (C0798.f2919) {
                        m6981 = C0630.m2566("ܳܳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9427) ^ (-714842048);
                        i5 = -869184390;
                    } else {
                        m6981 = C0630.m2566("֫᩹") ^ i3;
                        i4 = ((m6981 ^ i2) * 31407) ^ (-482016685);
                        i5 = -2081900663;
                    }
                case -1349588996:
                case 499979470:
                    C0050.m940();
                    if (ViewOnClickListenerC1958.m6429() < 0) {
                        m6981 = (C2105.m6981("ۡ᩻") + i2) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i3) * (-29429)) ^ 348316907;
                        i5 = 1236385279;
                    } else {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    }
                case -1007817634:
                case 127138268:
                    if (C3537.f11231 >= 0) {
                        m6981 = (C2105.m6981("ۡ᩻") + i2) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i3) * (-29429)) ^ 348316907;
                        i5 = 1236385279;
                    } else {
                        m6981 = (C0630.m2566("ܺ᩻") + i3) * 73;
                        i4 = ((m6981 ^ i2) * 7997) ^ 1837476648;
                        i5 = 843280805;
                    }
                case -722501168:
                case -182213826:
                    C1128.m3851();
                    C5695.m16023();
                    m6981 = (C2105.m6981("ۡ᩻") + i2) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                    i4 = ((m6981 ^ i3) * (-29429)) ^ 348316907;
                    i5 = 1236385279;
                case -601343772:
                case -468424608:
                    if (C1047.f3863 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩺֫")) * 43;
                        i4 = ((m6981 ^ i3) * (-29623)) ^ (-396889368);
                        i5 = -478995386;
                    } else {
                        m6981 = (C2105.m6981("ۖ᩹") + i3) * 61;
                        i4 = ((m6981 ^ i2) * 12173) ^ (-1534822974);
                        i5 = -991169261;
                    }
                case -559818451:
                case 2090745084:
                    C3746.m11369();
                    C0630.m2564();
                    break;
                case -399413906:
                case 1472354971:
                    if (C5695.f17556 >= 0) {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    } else {
                        m6981 = C0630.m2566("ۨܰ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16267) ^ 243994736;
                        i5 = 1765588612;
                    }
                case 710570192:
                case 1138071064:
                    if (C1420.f5096 <= 0) {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    } else {
                        m6981 = C0630.m2566("ܶ᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * 8259) ^ (-2141093186);
                        i5 = 1996049782;
                    }
                case 1410298233:
                case 1414892278:
                    viewGroup.setDrawingCacheEnabled(false);
                    break;
                case 1477446894:
                case 2032529714:
                    if (C4117.f13076 <= 0) {
                        m6981 = (i3 - C2105.m6981("ᩳᩳ")) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * (-28901)) ^ (-241800014);
                        i5 = -1833697748;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩺") ^ i3) * 51;
                        i4 = ((m6981 ^ i2) * (-28919)) ^ 966878478;
                        i5 = -352007288;
                    }
                default:
                    viewGroup = this.f15243;
                    viewGroup.removeView(c17939);
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ܳܳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 9427) ^ (-714842048);
                        i5 = -869184390;
                    } else {
                        m6981 = C2105.m6981("۫ۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 24017) ^ 619554571;
                        i5 = -2139131750;
                    }
            }
            return;
        }
    }
}
