package l;

import java.util.AbstractCollection;
import java.util.ArrayList;
import java.util.Collection;

/* compiled from: P7RQ */
/* renamed from: l.ۛܽ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C6189 extends C14851 {
    @Override // l.C14851
    /* renamed from: ۧ */
    public final InterfaceC18380 mo1229() {
        return new C12539();
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static InterfaceC5471 m17108(C7524 c7524, String str, String str2) {
        Collection collection = null;
        int i = 0;
        CharSequence charSequence = null;
        ArrayList arrayList = null;
        int i2 = -913032888;
        int i3 = C4263.f13799;
        int i4 = C5695.f17556;
        int m2566 = (C0630.m2566("ۜ᩵") ^ i3) * 67;
        int i5 = ((m2566 ^ i4) * 411) ^ 1162822279;
        int i6 = 929253154;
        while (true) {
            i2 = ((((i2 ^ i4) * 18569) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -2094753295:
                case 1577272986:
                    if (C1916.m6308() >= 0) {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    } else {
                        m2566 = C0630.m2566("ۨۜ") ^ i4;
                        i5 = ((m2566 ^ i3) * 9131) ^ (-303972387);
                        i6 = -1519094855;
                    }
                case -2030139016:
                case 1729448059:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = (C2105.m6981("ܶܺ") ^ i4) * 7;
                        i5 = ((m2566 ^ i3) * (-23165)) ^ (-899081942);
                        i6 = 1085783666;
                    } else {
                        m2566 = (i4 - C0630.m2566("۠ᩳ")) * (-89);
                        i5 = ((m2566 ^ i3) * 28299) ^ 203779282;
                        i6 = 367485299;
                    }
                case -2025241317:
                case 2015838119:
                    i = 0;
                    charSequence = (CharSequence) C21923.m49339(collection, 0);
                    if (C3432.f10845 >= 0) {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    } else {
                        m2566 = (C2105.m6981("ۗ֡") + i3) * (-55);
                        i5 = ((m2566 ^ i4) * 31111) ^ (-164724246);
                        i6 = 1204540328;
                    }
                case -2016430262:
                case 1617166035:
                    if (C1294.m4369(C0050.m947(charSequence), str)) {
                        m2566 = (C2105.m6981("ۜ᩹") + i4) * (-111);
                        i5 = ((m2566 ^ i3) * 16309) ^ 923786037;
                        i6 = -1291029642;
                    } else {
                        m2566 = (C0630.m2566("ۤ۫") ^ i3) * (-75);
                        i5 = ((m2566 ^ i4) * (-11987)) ^ (-637102096);
                        i6 = -472302101;
                    }
                case -1847514055:
                case -322537670:
                    if (C5695.f17556 >= 0) {
                        m2566 = (C0630.m2566("ܶۤ") + i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-30741)) ^ 1168421498;
                        i6 = -1281896381;
                    } else {
                        m2566 = C0630.m2566("ۡۢ") ^ i3;
                        i5 = ((m2566 ^ i4) * (-16391)) ^ 29665536;
                        i6 = 590160358;
                    }
                case -1749205054:
                case -1016537157:
                    arrayList = new ArrayList(collection);
                    arrayList.set(i, str2);
                    if (C3019.m9255() <= 0) {
                        m2566 = (i3 - C0630.m2566("ۧ᩻")) * (-23);
                        i5 = ((m2566 ^ i4) * 22095) ^ (-1646978229);
                        i6 = 1757969171;
                    } else {
                        m2566 = C2105.m6981("ܿ֫") ^ i3;
                        i5 = ((m2566 ^ i4) * 15663) ^ 155187778;
                        i6 = 593945715;
                    }
                case -1647416657:
                case 964023297:
                    collection = c7524.mo3565();
                    if (C1128.m3846((AbstractCollection) collection)) {
                        m2566 = (C0630.m2566("ۤ۫") ^ i3) * (-75);
                        i5 = ((m2566 ^ i4) * (-11987)) ^ (-637102096);
                        i6 = -472302101;
                    } else {
                        m2566 = (C2105.m6981("ۛᩴ") + i4) * 81;
                        i5 = ((m2566 ^ i3) * (-6221)) ^ (-858102700);
                        i6 = -1980392117;
                    }
                case -1644174066:
                case 1194259262:
                    C0050.m940();
                    C0382.m1848();
                    m2566 = (C0630.m2566("ܶۤ") + i3) * (-115);
                    i5 = ((m2566 ^ i4) * (-30741)) ^ 1168421498;
                    i6 = -1281896381;
                case -1126842360:
                case 389688087:
                    if (C3019.m9255() > 0) {
                        return new C13273(c7524.mo3566(), C1773.m5918(c7524), c7524.mo3568(), arrayList);
                    }
                    m2566 = (i4 - C2105.m6981("᩷ۢ")) * 57;
                    i5 = ((m2566 ^ i3) * 15479) ^ (-1236750732);
                    i6 = -392244847;
                case -911855651:
                case -276041436:
                    C1420.m4913();
                    return null;
                case 3068179:
                case 2102903699:
                    if (C0483.f2088 >= 0) {
                        m2566 = (i3 - C0630.m2566("ۧ᩻")) * (-23);
                        i5 = ((m2566 ^ i4) * 22095) ^ (-1646978229);
                        i6 = 1757969171;
                    } else {
                        m2566 = C2105.m6981("۬ܺ") ^ i3;
                        i5 = ((m2566 ^ i4) * 6515) ^ 1580960413;
                        i6 = 1767602603;
                    }
                case 92940053:
                case 940781117:
                    C0798.m2998();
                    if (C0382.m1848()) {
                        m2566 = (C2105.m6981("ܶܺ") ^ i4) * 7;
                        i5 = ((m2566 ^ i3) * (-23165)) ^ (-899081942);
                        i6 = 1085783666;
                    } else {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    }
                case 234936193:
                case 393336047:
                    if (C3663.m11168() >= 0) {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    } else {
                        m2566 = (i4 - C2105.m6981("ۧ۬")) * 57;
                        i5 = ((m2566 ^ i3) * 23003) ^ (-350131506);
                        i6 = -1404909583;
                    }
                case 587570375:
                case 2025395425:
                    RunnableC1937.m6387();
                    if (C1047.f3863 < 0) {
                        m2566 = (C0630.m2566("ܶۤ") + i3) * (-115);
                        i5 = ((m2566 ^ i4) * (-30741)) ^ 1168421498;
                        i6 = -1281896381;
                    } else {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    }
                case 805950291:
                case 1560776013:
                    if (C0483.f2088 >= 0) {
                        m2566 = (i3 - C0630.m2566("ۧ᩻")) * (-23);
                        i5 = ((m2566 ^ i4) * 22095) ^ (-1646978229);
                        i6 = 1757969171;
                    } else {
                        m2566 = C2105.m6981("ۙۚ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-1469)) ^ (-2120082535);
                        i6 = 1808364046;
                    }
                case 1009897591:
                case 1178444890:
                    if (C3019.m9255() > 0) {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۧ᩻")) * (-23);
                        i5 = ((m2566 ^ i4) * 22095) ^ (-1646978229);
                        i6 = 1757969171;
                    }
                case 1212387098:
                case 1553699870:
                    if (C2272.m7503()) {
                        m2566 = C2105.m6981("ܽۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7109) ^ 1761522729;
                        i6 = -1441188781;
                    } else {
                        m2566 = (C0630.m2566("ۗ᩺") ^ i3) * 9;
                        i5 = ((m2566 ^ i4) * (-31909)) ^ 1814567903;
                        i6 = 1185032506;
                    }
                default:
                    return c7524;
            }
        }
    }

    @Override // l.C14851
    /* renamed from: ᩷, reason: not valid java name and contains not printable characters */
    public final InterfaceC18380 mo17109(C16696 c16696) {
        return new C10423(c16696);
    }
}
