package l;

/* compiled from: 51RP */
/* renamed from: l.ۛ᩵ۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C6263 implements InterfaceC4227 {

    /* renamed from: ۬ܺۡ, reason: not valid java name and contains not printable characters */
    private static final short[] f19398 = {1645, -7052, -7057, -7085, -7052, -7054, -7063, -7058, -7065, -7128, -7122, -7122, -7122, -7127, 1152, 18115, 18132, 18117, 18147, 18132, 18117, 18116, 18115, 18143, 18162, 18142, 18133, 18132, 18059, 18065, 18128, 18130, 18130, 18132, 18114, 18114, 18158, 18117, 18142, 18138, 18132, 18143, 9003, 11391, -13440};

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f19399;

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C19111 f19400;

    /* JADX WARN: Code restructure failed: missing block: B:107:0x00b0, code lost:
    
        if (l.C4263.f13799 > 0) goto L15;
     */
    /* JADX WARN: Code restructure failed: missing block: B:64:0x00d9, code lost:
    
        if (l.C2126.f7087 == false) goto L35;
     */
    /* JADX WARN: Code restructure failed: missing block: B:91:0x0096, code lost:
    
        if (l.C2958.f9394 >= 0) goto L15;
     */
    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo3455(org.json.JSONObject r31) {
        /*
            Method dump skipped, instructions count: 1534
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C6263.mo3455(org.json.JSONObject):void");
    }

    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    public final void mo3453() {
        C19111 c19111 = null;
        int i = -2028530818;
        int i2 = C4075.f12947;
        int i3 = C3537.f11231;
        int m6981 = (i2 - C2105.m6981("᩷᩹")) * 5;
        int i4 = ((m6981 ^ i3) * 16225) ^ 310290855;
        int i5 = 334305176;
        while (true) {
            i = ((((i ^ i3) * (-23269)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1894744068:
                case -1131925758:
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("ۢۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-29729)) ^ 585467063;
                        i5 = 939341805;
                    } else {
                        m6981 = (C2105.m6981("ܽ۫") ^ i2) * (-121);
                        i4 = ((m6981 ^ i3) * 26485) ^ (-1652901340);
                        i5 = -181906168;
                    }
                case -1838652405:
                case 277563355:
                    if (C3683.f11629 < 0) {
                        m6981 = C2105.m6981("ۢۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-29729)) ^ 585467063;
                        i5 = 939341805;
                    } else {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    }
                case -1806486629:
                case 94155739:
                    c19111.m44041();
                    break;
                case -1731140276:
                case -282318962:
                    break;
                case -1654438081:
                case -871873801:
                    ViewOnClickListenerC1958.m6429();
                    if (C0483.f2088 >= 0) {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    } else {
                        m6981 = (C0630.m2566("᩷֫") ^ i2) * (-67);
                        i4 = ((m6981 ^ i3) * (-29833)) ^ (-1972024406);
                        i5 = 1080544839;
                    }
                case -1253621090:
                case 1967137166:
                    if (C3746.f11829 <= 0) {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    } else {
                        m6981 = C2105.m6981("ۜܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-13897)) ^ 1839489170;
                        i5 = -796766694;
                    }
                case -1168385706:
                case -151895819:
                    c19111 = this.f19400;
                    if (C1128.f4106 <= 0) {
                        m6981 = C0630.m2566("ۛ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10497)) ^ (-489171935);
                        i5 = -2092452936;
                    } else {
                        m6981 = C2105.m6981("᩸ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-19291)) ^ 712536011;
                        i5 = 275431305;
                    }
                case -1043298132:
                case -47979914:
                    if (C4263.f13799 <= 0) {
                        m6981 = C0630.m2566("ۛ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10497)) ^ (-489171935);
                        i5 = -2092452936;
                    } else {
                        m6981 = C2105.m6981("ۤۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 13659) ^ (-231173635);
                        i5 = 1150052883;
                    }
                case -671871002:
                case 251595063:
                    if (C0630.m2564()) {
                        m6981 = (i3 - C0630.m2566("᩹ۖ")) * 65;
                        i4 = ((m6981 ^ i2) * (-15595)) ^ 1266158769;
                        i5 = -1572256974;
                    } else {
                        m6981 = C2105.m6981("ܰܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 12417) ^ (-384535444);
                        i5 = 1588172214;
                    }
                case -493866631:
                case -101050566:
                    if (c19111.m44040()) {
                        m6981 = (C2105.m6981("֨᩶") + i2) * (-19);
                        i4 = ((m6981 ^ i3) * 5177) ^ (-615542266);
                        i5 = 2046711778;
                    } else {
                        m6981 = C0630.m2566("֡֨") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2111)) ^ 1512379445;
                        i5 = 1172999158;
                    }
                case -467757752:
                case 20683150:
                    if (C7106.f21815 != 0) {
                        m6981 = C0630.m2566("ۛ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10497)) ^ (-489171935);
                        i5 = -2092452936;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۗ֫")) * 123;
                        i4 = ((m6981 ^ i3) * (-28521)) ^ 327073993;
                        i5 = 2057498230;
                    }
                case -431691874:
                case 1856171996:
                    C3911.m11924();
                    break;
                case -427324719:
                case 1718163649:
                    if (C22628.f73083 <= 0) {
                        m6981 = C2105.m6981("ۢۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-29729)) ^ 585467063;
                        i5 = 939341805;
                    } else {
                        m6981 = C0630.m2566("ۨܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 6069) ^ (-1764301967);
                        i5 = -68125205;
                    }
                case -337421613:
                case 1987960826:
                    C2520.m8026();
                    m6981 = C2105.m6981("ۢۛ") ^ i3;
                    i4 = ((m6981 ^ i2) * (-29729)) ^ 585467063;
                    i5 = 939341805;
                case -43372611:
                case 1392398578:
                    C1773.m5908();
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    } else {
                        m6981 = (i3 - C0630.m2566("᩹ۖ")) * 65;
                        i4 = ((m6981 ^ i2) * (-15595)) ^ 1266158769;
                        i5 = -1572256974;
                    }
                case 709471465:
                case 1346027450:
                    if (C2958.f9394 >= 0) {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    } else {
                        m6981 = (C0630.m2566("᩺ۡ") ^ i2) * (-83);
                        i4 = ((m6981 ^ i3) * 17279) ^ 1283466294;
                        i5 = 480130869;
                    }
                case 1694679974:
                case 2040538642:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ۛ᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10497)) ^ (-489171935);
                        i5 = -2092452936;
                    } else {
                        m6981 = (C2105.m6981("ᩴۚ") + i3) * (-31);
                        i4 = ((m6981 ^ i2) * 4827) ^ (-682654360);
                        i5 = 796140462;
                    }
                default:
                    if (C1773.f6144 <= 0) {
                        m6981 = C0630.m2566("ܽܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18873)) ^ (-868324617);
                        i5 = -31053438;
                    } else {
                        m6981 = C2105.m6981("֨᩸") ^ i2;
                        i4 = ((m6981 ^ i3) * (-18451)) ^ 144260362;
                        i5 = 1859932889;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:28:0x005a, code lost:
    
        if (l.C7811.m20844() != 0) goto L68;
     */
    /* JADX WARN: Code restructure failed: missing block: B:33:0x0060, code lost:
    
        if (l.C7811.f24123 < 0) goto L25;
     */
    /* JADX WARN: Code restructure failed: missing block: B:37:0x0068, code lost:
    
        if (l.C2105.f7037 == 0) goto L25;
     */
    @Override // l.InterfaceC4227
    /* renamed from: ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo3454(l.C19750 r21) {
        /*
            Method dump skipped, instructions count: 852
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C6263.mo3454(l.᩵᩹ۘ):void");
    }

    public C6263(AbstractActivityC3346 abstractActivityC3346, C19111 c19111) {
        int i = -824026352;
        int i2 = RunnableC0588.f2309;
        int i3 = C2520.f8000;
        int m2566 = C0630.m2566("ۗ۫") ^ i2;
        int i4 = ((m2566 ^ i3) * (-11793)) ^ 269636473;
        int i5 = -1829614784;
        while (true) {
            i = ((((i ^ i3) * (-28647)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1877758621:
                case 185167387:
                    this.f19400 = c19111;
                    if (C2126.m7040()) {
                        m2566 = (C0630.m2566("ۡۘ") ^ i2) * 5;
                        i4 = ((m2566 ^ i3) * (-8575)) ^ (-1291018234);
                        i5 = 220950122;
                    } else {
                        m2566 = C0630.m2566("ۖ᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17499)) ^ 1563858107;
                        i5 = 53603027;
                    }
                case -1805470562:
                case 1622857833:
                    if (C4616.f14690 <= 0) {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    } else {
                        m2566 = C0630.m2566("۠ܽ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-14035)) ^ 336738126;
                        i5 = 1595630375;
                    }
                case -1764985965:
                case -121138630:
                    C3746.m11369();
                    if (C3245.m9925() == 0) {
                        m2566 = (i2 - C2105.m6981("۬᩵")) * (-49);
                        i4 = ((m2566 ^ i3) * 19715) ^ 1244589797;
                        i5 = 55750353;
                    } else {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    }
                case -1697973479:
                case -974929036:
                    if (C4263.f13799 <= 0) {
                        m2566 = (i2 - C0630.m2566("ᩳᩴ")) * 49;
                        i4 = ((m2566 ^ i3) * (-11587)) ^ 1272943584;
                        i5 = 1311531944;
                    } else {
                        m2566 = C2105.m6981("ۡۡ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17961)) ^ 2112701494;
                        i5 = 1639129236;
                    }
                case -1129613675:
                case 437799425:
                    C2520.m8026();
                    m2566 = (i2 - C2105.m6981("۬᩵")) * (-49);
                    i4 = ((m2566 ^ i3) * 19715) ^ 1244589797;
                    i5 = 55750353;
                case -958381867:
                case 1305064885:
                    if (C0964.f3626 != 0) {
                        m2566 = (C0630.m2566("ۡۘ") ^ i2) * 5;
                        i4 = ((m2566 ^ i3) * (-8575)) ^ (-1291018234);
                        i5 = 220950122;
                    } else {
                        m2566 = C0630.m2566("ۗ᩶") ^ i3;
                        i4 = ((m2566 ^ i2) * (-30495)) ^ 1662335819;
                        i5 = -1882493551;
                    }
                case -699362996:
                case 2044386447:
                    if (C7106.f21815 != 0) {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    } else {
                        m2566 = C2105.m6981("ۢᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32485) ^ (-1463183096);
                        i5 = -581585388;
                    }
                case -389083481:
                case 317121679:
                    this.f19399 = abstractActivityC3346;
                    return;
                case -367577888:
                case 1138698043:
                    if (C0050.f910 >= 0) {
                        m2566 = (i2 - C0630.m2566("ᩳᩴ")) * 49;
                        i4 = ((m2566 ^ i3) * (-11587)) ^ 1272943584;
                        i5 = 1311531944;
                    } else {
                        m2566 = C0630.m2566("ۡۤ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-9063)) ^ 1691360891;
                        i5 = -1669877997;
                    }
                case -362219532:
                case 917867590:
                    C1916.m6308();
                    if (C0483.m2121()) {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    } else {
                        m2566 = (C0630.m2566("ۡۘ") ^ i2) * 5;
                        i4 = ((m2566 ^ i3) * (-8575)) ^ (-1291018234);
                        i5 = 220950122;
                    }
                case 74402746:
                case 1597128181:
                    if (RunnableC3474.m10630()) {
                        m2566 = C2105.m6981("᩶ܿ") ^ i2;
                        i4 = ((m2566 ^ i3) * 14215) ^ (-625130531);
                        i5 = 1336431978;
                    } else {
                        m2566 = (i2 - C0630.m2566("ᩳᩴ")) * 49;
                        i4 = ((m2566 ^ i3) * (-11587)) ^ 1272943584;
                        i5 = 1311531944;
                    }
                case 93097119:
                case 527763196:
                    if (C2958.f9394 >= 0) {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    } else {
                        m2566 = C0630.m2566("ۧۖ") ^ i3;
                        i4 = ((m2566 ^ i2) * 11701) ^ 787546931;
                        i5 = -350302990;
                    }
                case 131103258:
                case 1291221820:
                    if (C4263.f13799 <= 0) {
                        m2566 = (i2 - C0630.m2566("ᩳᩴ")) * 49;
                        i4 = ((m2566 ^ i3) * (-11587)) ^ 1272943584;
                        i5 = 1311531944;
                    } else {
                        m2566 = (C2105.m6981("ۢۛ") + i2) * 67;
                        i4 = ((m2566 ^ i3) * (-23249)) ^ 1567692924;
                        i5 = -1511881953;
                    }
                case 175223864:
                case 214752498:
                    if (C2958.f9394 < 0) {
                        m2566 = C0630.m2566("ᩳᩳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-4979)) ^ 1172169419;
                        i5 = 923594913;
                    } else {
                        m2566 = C0630.m2566("۫᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 6945) ^ 375134847;
                        i5 = 493374250;
                    }
                case 1458672017:
                case 1645805835:
                    if (C2167.f7158 >= 0) {
                        m2566 = (i2 - C0630.m2566("ᩳᩴ")) * 49;
                        i4 = ((m2566 ^ i3) * (-11587)) ^ 1272943584;
                        i5 = 1311531944;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۘۖ")) * 97;
                        i4 = ((m2566 ^ i2) * (-6571)) ^ 1341735883;
                        i5 = -288581748;
                    }
                default:
                    C3663.m11168();
                    throw new RuntimeException();
            }
        }
    }
}
