package l;

import bin.mt.plus.Main;
import com.google.android.material.slider.BaseSlider;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.io.Serializable;
import moe.shizuku.server.IShizukuService;

/* compiled from: 760C */
/* renamed from: l.ۜ۬ܽ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public class C6786 extends AbstractC6138 {

    /* renamed from: ۧܳᩴ, reason: not valid java name and contains not printable characters */
    private static final short[] f21062 = {2003, -25656, -25657, -25662, -25653, -3284, 5482, -4980, -15716, -15007, 702, 6115, 29547, 29540, 29537, 29544, 29548, 29567, 29546, 29560, 29536, 29544, 29539, 29561, 29542, 29544, 29544, 29565, 29516, 29565, 29542, 29534, 29540, 29546, 29519, 29537, 29538, 29550, 29542, 29522, 29567, 29475, 29561, 29536, 29565, 297, -27683, 22869, 26753, 31282, 24798, 31883};

    /* renamed from: ۖ֫, reason: not valid java name and contains not printable characters */
    public AbstractC15440 f21063;

    /* renamed from: ۘ֫, reason: not valid java name and contains not printable characters */
    public AbstractC15440 f21064;

    /* renamed from: ܺ֫, reason: not valid java name and contains not printable characters */
    public C11020 f21065;

    @Override // l.AbstractC3817
    /* renamed from: ۠ */
    public final C11813 mo2779() {
        return C23777.f76962;
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x004e, code lost:
    
        if (l.C3683.f11629 >= 0) goto L49;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x0054, code lost:
    
        if (l.RunnableC1937.f6483 >= 0) goto L49;
     */
    /* JADX WARN: Code restructure failed: missing block: B:20:0x005d, code lost:
    
        if (l.C0237.f1507 != 0) goto L53;
     */
    @Override // l.AbstractC3817
    /* renamed from: ᩷ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo2782() {
        /*
            Method dump skipped, instructions count: 796
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C6786.mo2782():void");
    }

    @Override // l.AbstractC3817
    /* renamed from: ۢ */
    public final C17222 mo2780() {
        int i;
        String str;
        short[] sArr;
        short s;
        int i2;
        int m2566;
        int i3;
        int i4;
        int i5;
        int i6;
        int m6981;
        int i7;
        int i8;
        String str2;
        int m69812;
        int i9;
        int i10;
        int m25662;
        int i11;
        C6786 c6786 = this;
        int i12 = C4075.f12947;
        int i13 = C3019.f9544;
        int m69813 = (C2105.m6981("ۚᩴ") + i13) * (-109);
        int i14 = ((m69813 ^ i12) * (-9947)) ^ 1878535986;
        C11667 c11667 = null;
        AbstractC15440 abstractC15440 = null;
        short[] sArr2 = null;
        short[] sArr3 = null;
        int i15 = m69813 ^ 1308705320;
        int i16 = 0;
        int i17 = 0;
        int i18 = 0;
        int i19 = 0;
        short s2 = 0;
        int i20 = 0;
        int i21 = 0;
        int i22 = 0;
        int i23 = 0;
        String str3 = null;
        int i24 = 2045620574;
        Serializable serializable = null;
        String str4 = null;
        AbstractC15440 abstractC154402 = null;
        C23719 c23719 = null;
        int i25 = 0;
        boolean z = false;
        while (true) {
            i24 = i15 ^ (i14 & (((i24 ^ i12) * (-23279)) >> 31));
            switch (i24) {
                case -2092004326:
                case 1336763432:
                    c23719 = new C23719(c6786);
                    str4 = C4075.m12252(f21062, 39, 2, i17);
                    if (c11667 != null) {
                        m6981 = C2105.m6981("ۘ۟") ^ i13;
                        i7 = ((m6981 ^ i12) * (-30125)) ^ (-1884968622);
                        i8 = 1859874558;
                    } else {
                        m6981 = C0630.m2566("ᩴ۫") ^ i12;
                        i7 = ((m6981 ^ i13) * 31733) ^ (-760400829);
                        i8 = -437220937;
                    }
                    i15 = m6981 ^ i8;
                    i14 = i7;
                case -2089141239:
                case -1175221402:
                    abstractC15440 = abstractC154402.m36520(C22628.m50602(f21062, 41, 4, i17));
                    if (C0382.f1805) {
                        m6981 = C0630.m2566("ۘ᩻") ^ i12;
                        i7 = ((m6981 ^ i13) * 9629) ^ 289270565;
                        i8 = -588270288;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    }
                    m6981 = (C0630.m2566("۫ܳ") ^ i12) * (-101);
                    i7 = ((m6981 ^ i13) * 29013) ^ 1641484177;
                    i8 = -1625070792;
                    i15 = m6981 ^ i8;
                    i14 = i7;
                case -1613507626:
                case 242370458:
                    i = i25;
                    sArr = sArr2;
                    s2 = f21062[11];
                    if (C1005.f3721) {
                        m25662 = C0630.m2566("ۗ۬") ^ i12;
                        i14 = ((m25662 ^ i13) * (-7309)) ^ 823423731;
                        i11 = -1444305821;
                        i2 = m25662 ^ i11;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    }
                    m25662 = C2105.m6981("֡֨") ^ i13;
                    i14 = ((m25662 ^ i12) * 18205) ^ 2045438978;
                    i11 = -1093030319;
                    i2 = m25662 ^ i11;
                    sArr2 = sArr;
                    i25 = i;
                    i15 = i2;
                    c6786 = this;
                case -1582644295:
                case -513091190:
                    i = i25;
                    str = str3;
                    sArr = sArr2;
                    i17 = 58531;
                    m2566 = C0630.m2566("ۢۧ") ^ i13;
                    i3 = ((m2566 ^ i12) * 24569) ^ (-137269633);
                    i4 = -945970703;
                    i2 = m2566 ^ i4;
                    str3 = str;
                    i14 = i3;
                    sArr2 = sArr;
                    i25 = i;
                    i15 = i2;
                    c6786 = this;
                case -1562495220:
                case 1540179661:
                    sArr = sArr2;
                    serializable = c6786.m11529(C1773.m5917(sArr, i18, 8, i17));
                    if (C3911.f12484 >= 0) {
                        i = i25;
                        m25662 = C2105.m6981("֡֨") ^ i13;
                        i14 = ((m25662 ^ i12) * 18205) ^ 2045438978;
                        i11 = -1093030319;
                        i2 = m25662 ^ i11;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    } else {
                        int m25663 = (C0630.m2566("ۖ֨") + i12) * 115;
                        sArr2 = sArr;
                        i5 = i25;
                        i15 = m25663 ^ (-326778685);
                        i14 = ((m25663 ^ i13) * 2861) ^ 434073104;
                        i25 = i5;
                    }
                case -1543146061:
                case 267749869:
                    i = i25;
                    str = str3;
                    sArr = sArr2;
                    i17 = 29453;
                    m2566 = C0630.m2566("ۢۧ") ^ i13;
                    i3 = ((m2566 ^ i12) * 24569) ^ (-137269633);
                    i4 = -945970703;
                    i2 = m2566 ^ i4;
                    str3 = str;
                    i14 = i3;
                    sArr2 = sArr;
                    i25 = i;
                    i15 = i2;
                    c6786 = this;
                case -1393871640:
                case 1494146009:
                    C21923.m49329();
                    C1504.m5179();
                    i = i25;
                    str2 = str3;
                    m69812 = C2105.m6981("ۛۡ") ^ i13;
                    i9 = ((m69812 ^ i12) * 2775) ^ 1472842760;
                    i10 = -484875263;
                    i6 = m69812 ^ i10;
                    str3 = str2;
                    i14 = i9;
                    i5 = i;
                    i15 = i6;
                    i25 = i5;
                case -1384211918:
                case 143449279:
                    i = i25;
                    str = str3;
                    sArr = sArr2;
                    i21 = i20 * i20;
                    i22 = s2 * s2;
                    i23 = 51022449;
                    if (C0237.m1481() >= 0) {
                        s = s2;
                        int m69814 = C2105.m6981("ۨܽ") ^ i13;
                        s2 = s;
                        int i26 = ((m69814 ^ i12) * 8119) ^ 1787431507;
                        i6 = m69814 ^ (-144548158);
                        str3 = str;
                        sArr2 = sArr;
                        i14 = i26;
                        c6786 = this;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    } else {
                        m2566 = C0630.m2566("ۗۖ") ^ i13;
                        i3 = ((m2566 ^ i12) * (-18187)) ^ 391018338;
                        i4 = -906007365;
                        i2 = m2566 ^ i4;
                        str3 = str;
                        i14 = i3;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    }
                case -1378942883:
                case 898878491:
                    c6786.f21065 = (C11020) serializable;
                    if (C2520.f8000 >= 0) {
                        i = i25;
                        s = s2;
                        str = str3;
                        sArr = sArr2;
                        int m698142 = C2105.m6981("ۨܽ") ^ i13;
                        s2 = s;
                        int i262 = ((m698142 ^ i12) * 8119) ^ 1787431507;
                        i6 = m698142 ^ (-144548158);
                        str3 = str;
                        sArr2 = sArr;
                        i14 = i262;
                        c6786 = this;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    } else {
                        m6981 = (C2105.m6981("ܽܰ") + i13) * (-21);
                        i7 = ((m6981 ^ i12) * 8329) ^ 533050238;
                        i8 = 842467835;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    }
                case -1281640006:
                case -437874651:
                    c11667 = m11533();
                    sArr3 = f21062;
                    i19 = 24;
                    i25 = 15;
                    if (C2167.f7158 >= 0) {
                        sArr = sArr2;
                        int m69815 = C2105.m6981("᩺ۗ") ^ i12;
                        i14 = ((m69815 ^ i13) * 16489) ^ 1824338814;
                        i15 = m69815 ^ (-1336636484);
                        c6786 = this;
                        sArr2 = sArr;
                    } else {
                        m6981 = C0630.m2566("۠ᩳ") ^ i13;
                        i7 = ((m6981 ^ i12) * (-22905)) ^ 11676160;
                        i8 = -1231353174;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    }
                case -987932361:
                case 1400411014:
                    C4616.m13552();
                    if (C1420.f5096 > 0) {
                        i = i25;
                        str2 = str3;
                        m69812 = C2105.m6981("ۛۡ") ^ i13;
                        i9 = ((m69812 ^ i12) * 2775) ^ 1472842760;
                        i10 = -484875263;
                        i6 = m69812 ^ i10;
                        str3 = str2;
                        i14 = i9;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    } else {
                        sArr = sArr2;
                        int m698152 = C2105.m6981("᩺ۗ") ^ i12;
                        i14 = ((m698152 ^ i13) * 16489) ^ 1824338814;
                        i15 = m698152 ^ (-1336636484);
                        c6786 = this;
                        sArr2 = sArr;
                    }
                case -951631980:
                case -70181325:
                    c6786.mo11538(i16);
                    AbstractC15440 m36491 = abstractC154402.m36491(str4);
                    c6786.f21063 = m36491;
                    C10025.m25198(c6786.f21064, m36491, c11667, c6786);
                    m6981 = C0630.m2566("֫ܿ") ^ i13;
                    i7 = ((m6981 ^ i12) * (-2569)) ^ 1848608088;
                    i8 = -255644367;
                    i15 = m6981 ^ i8;
                    i14 = i7;
                case -767780034:
                case 708637764:
                    i = i25;
                    sArr = sArr2;
                    str3 = C0422.m1955(f21062, 12, 4, i17);
                    if (C0964.f3626 != 0) {
                        i25 = i;
                        int m6981522 = C2105.m6981("᩺ۗ") ^ i12;
                        i14 = ((m6981522 ^ i13) * 16489) ^ 1824338814;
                        i15 = m6981522 ^ (-1336636484);
                        c6786 = this;
                        sArr2 = sArr;
                    } else {
                        m25662 = (i13 - C2105.m6981("۠ܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i14 = ((m25662 ^ i12) * 17519) ^ 2098565118;
                        i11 = -944775893;
                        i2 = m25662 ^ i11;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    }
                case -686664407:
                case 492966453:
                    return m11545();
                case -680033228:
                case 1985733445:
                    return C1420.m4912();
                case -478862508:
                case 1530555593:
                    z = C3245.m9933(c6786, C11340.m28025(sArr3, i19, i25, i17));
                    if (C2105.f7037 != 0) {
                        i = i25;
                        sArr = sArr2;
                        m25662 = C2105.m6981("֡֨") ^ i13;
                        i14 = ((m25662 ^ i12) * 18205) ^ 2045438978;
                        i11 = -1093030319;
                        i2 = m25662 ^ i11;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    } else {
                        m6981 = C2105.m6981("ܽ۫") ^ i12;
                        i7 = ((m6981 ^ i13) * (-21233)) ^ 247237832;
                        i8 = -940141890;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    }
                case -130716847:
                case 1421101643:
                    c6786.f21064 = abstractC15440;
                    i16 = 0;
                    C20898.m47739(abstractC154402, abstractC15440, false, c6786.f21065, c23719);
                    if (C0714.m2807(this)) {
                        m6981 = (C0630.m2566("ۚۙ") + i13) * 9;
                        i7 = ((m6981 ^ i12) * 23715) ^ (-1368566100);
                        i8 = 753823202;
                    } else {
                        m6981 = (i12 - C2105.m6981("᩹֨")) * 93;
                        i7 = ((m6981 ^ i13) * (-28933)) ^ (-250486448);
                        i8 = 1085174609;
                    }
                    i15 = m6981 ^ i8;
                    i14 = i7;
                case 113038997:
                case 610156436:
                    i = i25;
                    str = str3;
                    sArr = sArr2;
                    int i27 = i22 + i23;
                    if (i21 - (i27 + i27) <= 0) {
                        m2566 = (i12 - C2105.m6981("᩶ۙ")) * (-3);
                        i3 = ((m2566 ^ i13) * 30507) ^ (-1672383611);
                        i4 = -1023603118;
                    } else {
                        m2566 = C2105.m6981("֡ۙ") ^ i12;
                        i3 = ((m2566 ^ i13) * (-14601)) ^ (-153719517);
                        i4 = 1764850954;
                    }
                    i2 = m2566 ^ i4;
                    str3 = str;
                    i14 = i3;
                    sArr2 = sArr;
                    i25 = i;
                    i15 = i2;
                    c6786 = this;
                case 246953623:
                case 851339293:
                    ViewOnClickListenerC1958.m6429();
                    return null;
                case 448989799:
                case 1142476655:
                    if (C3019.f9544 < 0) {
                        m6981 = (C0630.m2566("۫ܳ") ^ i12) * (-101);
                        i7 = ((m6981 ^ i13) * 29013) ^ 1641484177;
                        i8 = -1625070792;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    } else {
                        i = i25;
                        sArr = sArr2;
                        m25662 = C2105.m6981("֡֨") ^ i13;
                        i14 = ((m25662 ^ i12) * 18205) ^ 2045438978;
                        i11 = -1093030319;
                        i2 = m25662 ^ i11;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    }
                case 565342030:
                case 1702829562:
                    i = i25;
                    str = str3;
                    sArr = sArr2;
                    s = s2;
                    int i28 = s + 7143;
                    if (C3245.f10203 <= 0) {
                        i20 = i28;
                        int m6981422 = C2105.m6981("ۨܽ") ^ i13;
                        s2 = s;
                        int i2622 = ((m6981422 ^ i12) * 8119) ^ 1787431507;
                        i6 = m6981422 ^ (-144548158);
                        str3 = str;
                        sArr2 = sArr;
                        i14 = i2622;
                        c6786 = this;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    } else {
                        s2 = s;
                        int m69816 = C2105.m6981("᩶ۖ") ^ i13;
                        str3 = str;
                        i14 = ((m69816 ^ i12) * (-31025)) ^ (-656718347);
                        i2 = m69816 ^ (-449941905);
                        i20 = i28;
                        sArr2 = sArr;
                        i25 = i;
                        i15 = i2;
                        c6786 = this;
                    }
                case 909087408:
                case 1839768216:
                    AbstractC15440 m364912 = abstractC154402.m36491(str4);
                    c6786.f21063 = m364912;
                    C20898.m47739(abstractC154402, m364912, z, c6786.f21065, c23719);
                    m6981 = C0630.m2566("֫ܿ") ^ i13;
                    i7 = ((m6981 ^ i12) * (-2569)) ^ 1848608088;
                    i8 = -255644367;
                    i15 = m6981 ^ i8;
                    i14 = i7;
                case 940351993:
                case 1759573946:
                    C0422.m1963();
                    if (C0422.f1886 > 0) {
                        i = i25;
                        str2 = str3;
                        m69812 = C2105.m6981("ۛۡ") ^ i13;
                        i9 = ((m69812 ^ i12) * 2775) ^ 1472842760;
                        i10 = -484875263;
                        i6 = m69812 ^ i10;
                        str3 = str2;
                        i14 = i9;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    } else {
                        m6981 = (C0630.m2566("۫ܳ") ^ i12) * (-101);
                        i7 = ((m6981 ^ i13) * 29013) ^ 1641484177;
                        i8 = -1625070792;
                        i15 = m6981 ^ i8;
                        i14 = i7;
                    }
                default:
                    i = i25;
                    str2 = str3;
                    abstractC154402 = c6786.m11515(str2);
                    sArr2 = f21062;
                    i18 = 16;
                    if (C4159.m12565() < 0) {
                        m69812 = (C2105.m6981("ۤܿ") ^ i12) * (-87);
                        i9 = ((m69812 ^ i13) * 22235) ^ 206391464;
                        i10 = 169043191;
                        i6 = m69812 ^ i10;
                        str3 = str2;
                        i14 = i9;
                        i5 = i;
                        i15 = i6;
                        i25 = i5;
                    }
                    m69812 = C2105.m6981("ۛۡ") ^ i13;
                    i9 = ((m69812 ^ i12) * 2775) ^ 1472842760;
                    i10 = -484875263;
                    i6 = m69812 ^ i10;
                    str3 = str2;
                    i14 = i9;
                    i5 = i;
                    i15 = i6;
                    i25 = i5;
            }
        }
    }

    @Override // l.AbstractC3817
    /* renamed from: ֫ */
    public final void mo2777(Main main, C16560 c16560, C16560 c165602, C17222 c17222) {
        int i = -2068182829;
        int i2 = C3683.f11629;
        int i3 = C2958.f9394;
        int m6981 = C2105.m6981("֡۫") ^ i2;
        int i4 = ((m6981 ^ i3) * 25379) ^ (-2146621704);
        int i5 = -1559884406;
        while (true) {
            i = ((((i ^ i3) * 14289) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2041110531:
                case -1063080464:
                    if (C1047.m3599() >= 0) {
                        m6981 = (C2105.m6981("۫ܶ") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i3) * 8997) ^ 1090213392;
                        i5 = 372525432;
                    } else {
                        m6981 = (C2105.m6981("ܳ᩶") + i2) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m6981 ^ i3) * (-27619)) ^ (-18964039);
                        i5 = 1975913021;
                    }
                case -1887645036:
                case -895613723:
                    break;
                case -1669684283:
                case 1468102925:
                    if (C3245.m9925() != 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = (C0630.m2566("᩵֫") ^ i3) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                        i4 = ((m6981 ^ i2) * 8471) ^ (-2018534873);
                        i5 = -65628758;
                    }
                case -1576150376:
                case -8896090:
                    C3245.m9925();
                    m6981 = (C2105.m6981("۫ܶ") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                    i4 = ((m6981 ^ i3) * 8997) ^ 1090213392;
                    i5 = 372525432;
                case -1457875796:
                case -1255733650:
                    if (C5695.f17556 < 0) {
                        m6981 = (C2105.m6981("۫ܶ") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i3) * 8997) ^ 1090213392;
                        i5 = 372525432;
                    } else {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    }
                case -1417210131:
                case -1313239569:
                    if (C3432.f10845 >= 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = (C0630.m2566("ܽ֨") ^ i2) * 7;
                        i4 = ((m6981 ^ i3) * (-18027)) ^ 1795421139;
                        i5 = 1327894499;
                    }
                case -1212435731:
                case 1094532447:
                    if (C1294.f4556 >= 0) {
                        m6981 = (C2105.m6981("ۜ᩹") ^ i3) * (-55);
                        i4 = ((m6981 ^ i2) * (-30901)) ^ 1568928351;
                        i5 = -528385740;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۘܺ")) * (-81);
                        i4 = ((m6981 ^ i2) * (-2305)) ^ (-276077784);
                        i5 = -608610602;
                    }
                case -1209561740:
                case -851976189:
                    if (C2105.f7037 != 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = C0630.m2566("ᩴܰ") ^ i2;
                        i4 = ((m6981 ^ i3) * 31369) ^ 874895695;
                        i5 = 2036849004;
                    }
                case -1205032081:
                case -1046334305:
                    if (C3019.m9258(c17222)) {
                        m6981 = C0630.m2566("ۛ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29329)) ^ 1426801203;
                        i5 = -1527958546;
                    } else {
                        m6981 = C0630.m2566("ۧܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-14933)) ^ (-1595258446);
                        i5 = 1069286209;
                    }
                case -896595505:
                case -249862798:
                    if (C2272.f7362) {
                        m6981 = (C0630.m2566("ۛ۟") ^ i2) * (-35);
                        i4 = ((m6981 ^ i3) * (-20545)) ^ (-1049307174);
                        i5 = -1760486983;
                    } else {
                        m6981 = C0630.m2566("᩶ܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2053)) ^ (-1085276176);
                        i5 = 881055090;
                    }
                case -527165271:
                case 112750043:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = (C2105.m6981("۫ܶ") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i3) * 8997) ^ 1090213392;
                        i5 = 372525432;
                    } else {
                        m6981 = (i3 - C0630.m2566("᩸᩷")) * 21;
                        i4 = ((m6981 ^ i2) * 10373) ^ (-754331427);
                        i5 = 1712700812;
                    }
                case 110511868:
                case 2143679624:
                    if (C2167.m7155()) {
                        m6981 = (C0630.m2566("᩺ۙ") ^ i3) * (-97);
                        i4 = ((m6981 ^ i2) * 23157) ^ (-2091038730);
                        i5 = 191844108;
                    } else {
                        m6981 = (C2105.m6981("۫ܶ") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i3) * 8997) ^ 1090213392;
                        i5 = 372525432;
                    }
                case 246587035:
                case 356971764:
                    if (C3019.m9255() > 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = (C2105.m6981("ۜ᩹") ^ i3) * (-55);
                        i4 = ((m6981 ^ i2) * (-30901)) ^ 1568928351;
                        i5 = -528385740;
                    }
                case 356226488:
                case 554892307:
                    if (C3746.f11829 <= 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = (C2105.m6981("᩸ۜ") ^ i2) * 123;
                        i4 = ((m6981 ^ i3) * 12707) ^ (-1657228485);
                        i5 = -1227636784;
                    }
                case 411261939:
                case 552442696:
                    RunnableC0588.m2444(c16560, C1005.m3496(this.f21063));
                    c16560.m39015();
                    m6981 = C0630.m2566("ۧܺ") ^ i3;
                    i4 = ((m6981 ^ i2) * (-14933)) ^ (-1595258446);
                    i5 = 1069286209;
                case 751561572:
                case 1349131516:
                    if (m11542(c16560)) {
                        m6981 = (C2105.m6981("᩵᩵") + i3) * 29;
                        i4 = ((m6981 ^ i2) * 27431) ^ (-213616607);
                        i5 = -440455053;
                    } else {
                        m6981 = C0630.m2566("ۧܺ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-14933)) ^ (-1595258446);
                        i5 = 1069286209;
                    }
                case 1452478784:
                case 2105790196:
                    if (C1047.m3599() >= 0) {
                        m6981 = (C0630.m2566("᩺ۙ") ^ i3) * (-97);
                        i4 = ((m6981 ^ i2) * 23157) ^ (-2091038730);
                        i5 = 191844108;
                    } else {
                        m6981 = (i2 - C0630.m2566("ܽܳ")) * (-91);
                        i4 = ((m6981 ^ i3) * (-13223)) ^ (-949501351);
                        i5 = -452262303;
                    }
                case 1566495182:
                case 2094634523:
                    RunnableC1937.m6387();
                    break;
                default:
                    if (C0630.f2410 <= 0) {
                        m6981 = (C0630.m2566("ۗ᩸") + i2) * (-79);
                        i4 = ((m6981 ^ i3) * 731) ^ (-1750660131);
                        i5 = 1990840232;
                    } else {
                        m6981 = (C2105.m6981("ۖ֫") + i3) * (-123);
                        i4 = ((m6981 ^ i2) * (-20997)) ^ (-805941242);
                        i5 = -142949588;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC3817
    /* renamed from: ۧ */
    public final void mo2781(C17222 c17222) {
        AbstractC15440 abstractC15440 = null;
        AbstractC15440 abstractC154402 = null;
        int i = 763439287;
        int i2 = C7811.f24123;
        int i3 = C4616.f14690;
        int m6981 = C2105.m6981("ۤۤ") ^ i2;
        int i4 = ((m6981 ^ i3) * (-31515)) ^ (-203454120);
        int i5 = 1480707106;
        while (true) {
            i = ((((i ^ i3) * 26073) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2013883655:
                case -1526995598:
                    if (C1504.f5354) {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    } else {
                        m6981 = (C0630.m2566("ۛ᩻") ^ i3) * (-77);
                        i4 = ((m6981 ^ i2) * 19261) ^ 1366426983;
                        i5 = -2140612020;
                    }
                case -1526118157:
                case 535941710:
                    if (C3245.m9925() != 0) {
                        m6981 = (C0630.m2566("ᩴۡ") + i3) * 95;
                        i4 = ((m6981 ^ i2) * 5503) ^ (-12141964);
                        i5 = 112249516;
                    } else {
                        m6981 = C2105.m6981("۟ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * 32129) ^ 515766331;
                        i5 = 353106946;
                    }
                case -1398620243:
                case -229670766:
                    if (C2105.f7037 != 0) {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    } else {
                        m6981 = C0630.m2566("᩷۠") ^ i2;
                        i4 = ((m6981 ^ i3) * 13301) ^ 1371649624;
                        i5 = -1016996834;
                    }
                case -1206912514:
                case -374221339:
                    if (C1128.f4106 <= 0) {
                        m6981 = (C2105.m6981("֫ۜ") ^ i2) * 31;
                        i4 = ((m6981 ^ i3) * 9867) ^ 416261617;
                        i5 = 2119272056;
                    } else {
                        m6981 = C0630.m2566("֨֡") ^ i3;
                        i4 = ((m6981 ^ i2) * (-26063)) ^ (-1098176482);
                        i5 = 732152355;
                    }
                case -785102687:
                case 352528918:
                    C0422.m1956();
                    break;
                case -682789980:
                case 1223998788:
                    if (C1294.f4556 >= 0) {
                        m6981 = (C2105.m6981("۫᩷") + i3) * (-21);
                        i4 = ((m6981 ^ i2) * (-17161)) ^ 2107728537;
                        i5 = -929007232;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۧۙ")) * 123;
                        i4 = ((m6981 ^ i3) * (-12675)) ^ (-645657684);
                        i5 = 13690256;
                    }
                case -639970548:
                case 1628994752:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("۟۬") ^ i2;
                        i4 = ((m6981 ^ i3) * 25721) ^ 1263541556;
                        i5 = -402446483;
                    } else {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    }
                case -327000661:
                case -321206364:
                    if (C0382.f1805) {
                        m6981 = (C2105.m6981("ۘۘ") ^ i3) * (-73);
                        i4 = ((m6981 ^ i2) * 27173) ^ 1231199934;
                        i5 = -346386930;
                    } else {
                        m6981 = (C0630.m2566("ᩴۡ") + i3) * 95;
                        i4 = ((m6981 ^ i2) * 5503) ^ (-12141964);
                        i5 = 112249516;
                    }
                case -248421151:
                case 199635170:
                    AbstractC2021.m6569(abstractC15440);
                    m6981 = C0630.m2566("ۢ۟") ^ i2;
                    i4 = ((m6981 ^ i3) * 21973) ^ (-815100555);
                    i5 = 1623478747;
                case 49321670:
                case 1279851070:
                    AbstractC2021.m6569(abstractC154402);
                    m6981 = (C2105.m6981("᩶ܰ") ^ i2) * 19;
                    i4 = ((m6981 ^ i3) * (-18933)) ^ (-1306238260);
                    i5 = 780199891;
                case 96729966:
                case 1922179600:
                    if (C1005.m3501()) {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    } else {
                        m6981 = (C0630.m2566("ᩴۡ") + i3) * 95;
                        i4 = ((m6981 ^ i2) * 5503) ^ (-12141964);
                        i5 = 112249516;
                    }
                case 123633298:
                case 1563971281:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = C0630.m2566("᩷۠") ^ i2;
                        i4 = ((m6981 ^ i3) * 13301) ^ 1371649624;
                        i5 = -1016996834;
                    } else {
                        m6981 = (C2105.m6981("ۨۚ") + i2) * (-89);
                        i4 = ((m6981 ^ i3) * (-25255)) ^ (-1305210856);
                        i5 = -836477557;
                    }
                case 190086889:
                case 1509112263:
                    if (AbstractC2021.m6574()) {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    } else {
                        m6981 = C2105.m6981("ۡۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11439)) ^ 324542007;
                        i5 = 1850720164;
                    }
                case 219719706:
                case 2114183962:
                    if (C22628.f73083 <= 0) {
                        m6981 = C2105.m6981("ۘ֫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                        i5 = 193211229;
                    } else {
                        m6981 = C0630.m2566("ܳᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-6293)) ^ (-1390541580);
                        i5 = -504667300;
                    }
                case 463157588:
                case 1047799445:
                    abstractC15440 = this.f21064;
                    if (abstractC15440 != null) {
                        m6981 = C2105.m6981("ۨۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-3247)) ^ (-15841884);
                        i5 = 761082578;
                    } else {
                        m6981 = C0630.m2566("ۢ۟") ^ i2;
                        i4 = ((m6981 ^ i3) * 21973) ^ (-815100555);
                        i5 = 1623478747;
                    }
                case 759114830:
                case 1751226255:
                    C1420.m4913();
                    break;
                case 782560258:
                case 1343971259:
                    if (RunnableC1937.m6387() != 0) {
                        m6981 = (C0630.m2566("ᩴۡ") + i3) * 95;
                        i4 = ((m6981 ^ i2) * 5503) ^ (-12141964);
                        i5 = 112249516;
                    } else {
                        m6981 = C0630.m2566("ܽᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 21515) ^ 1012325939;
                        i5 = 568679045;
                    }
                case 907849360:
                case 2123650471:
                    if (C3537.m10745(c17222)) {
                        m6981 = (C2105.m6981("᩶ܰ") ^ i2) * 19;
                        i4 = ((m6981 ^ i3) * (-18933)) ^ (-1306238260);
                        i5 = 780199891;
                    } else {
                        m6981 = C2105.m6981("ۧۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24357)) ^ 255350542;
                        i5 = 1148819000;
                    }
                case 1656919080:
                case 1860707403:
                    abstractC154402 = this.f21063;
                    if (abstractC154402 != null) {
                        m6981 = C0630.m2566("ܽۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-25449)) ^ (-1046324112);
                        i5 = -1291799362;
                    } else {
                        m6981 = (C2105.m6981("᩶ܰ") ^ i2) * 19;
                        i4 = ((m6981 ^ i3) * (-18933)) ^ (-1306238260);
                        i5 = 780199891;
                    }
                case 1717194143:
                case 2053540967:
                    C3537.m10746();
                    m6981 = C2105.m6981("ۘ֫") ^ i3;
                    i4 = ((m6981 ^ i2) * (-11411)) ^ 1598439941;
                    i5 = 193211229;
                default:
                    if (C3537.f11231 >= 0) {
                        m6981 = C0630.m2566("᩷۠") ^ i2;
                        i4 = ((m6981 ^ i3) * 13301) ^ 1371649624;
                        i5 = -1016996834;
                    } else {
                        m6981 = (C2105.m6981("֫ۜ") ^ i2) * 31;
                        i4 = ((m6981 ^ i3) * 9867) ^ 416261617;
                        i5 = 2119272056;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:39:0x006a, code lost:
    
        if (l.C1916.f6442 != false) goto L33;
     */
    /* JADX WARN: Code restructure failed: missing block: B:43:0x0070, code lost:
    
        if (l.RunnableC1937.f6483 >= 0) goto L60;
     */
    /* JADX WARN: Code restructure failed: missing block: B:48:0x0076, code lost:
    
        if (l.C2167.f7158 >= 0) goto L60;
     */
    @Override // l.AbstractC3817
    /* renamed from: ۘ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.lang.CharSequence mo2778() {
        /*
            Method dump skipped, instructions count: 816
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C6786.mo2778():java.lang.CharSequence");
    }
}
