package l;

import bin.mt.plus.Main;

/* compiled from: T5MS */
/* renamed from: l.ۢۗܽ, reason: contains not printable characters */
/* loaded from: classes.dex */
public class C9321 extends AbstractC6138 {

    /* renamed from: ᩵ۤ۬, reason: not valid java name and contains not printable characters */
    private static final short[] f28270;

    /* renamed from: ۖ֫, reason: not valid java name and contains not printable characters */
    public AbstractC15440 f28271;

    /* renamed from: ۘ֫, reason: not valid java name and contains not printable characters */
    public boolean f28272 = true;

    /* renamed from: ܺ֫, reason: not valid java name and contains not printable characters */
    public C19697 f28273;

    /* renamed from: ᩴ֫, reason: not valid java name and contains not printable characters */
    public AbstractC15440 f28274;

    static {
        ApplicationC12518.m30701(84);
        f28270 = new short[]{5235, 12302, 12313, 12303, 12307, 12297, 12302, 12319, 12313, 12303, 12370, 12317, 12302, 12303, 12319, -21145, 22932, 18333, 12349, 12306, 12312, 12302, 12307, 12309, 12312, 12337, 12317, 12306, 12309, 12314, 12313, 12303, 12296, 12370, 12292, 12305, 12304, 12319, 12304, 12317, 12303, 12303, 12313, 12303, 12370, 12312, 12313, 12292, 12302, 12313, 12303, 12307, 12297, 12302, 12319, 12313, 12303, 12370, 12317, 12302, 12303, 12319, 12380, 12306, 12307, 12296, 12380, 12314, 12307, 12297, 12306, 12312, 12371, 12312, 12317, 12296, 12317, 17468, 25034, 18032, 12370, 12292, 12305, 12304, 12348, 5909, 18015, 18000, 18005, 18012, 15280, 13437, -9567, 4774, 4958, -14416, 3573, 29345, 29358, 29355, 29346, 29358, 29347, 29346, 29353, 29363, 29358, 29345, 29374, 29332, 29362, 29345, 29345, 29358, 29375, 29365, 29346, 29353, 29350, 29354, 29346, 29314, 29353, 29363, 29365, 29358, 29346, 29364, 29356, 29346, 29346, 29367, 29318, 29367, 29356, 29332, 29358, 29344, 29317, 29355, 29352, 29348, 29356, 29336, 29350, 29353, 29363, 29358, 29417, 29363, 29354, 29367, 29362, 29358, 29347, 3040, 11720, -9596, -4568, 9959, 16325, -1846};
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    private native void m23997(AbstractC15440 abstractC15440, AbstractC15440 abstractC154402, boolean z, boolean z2, boolean z3, InterfaceC17081 interfaceC17081);

    @Override // l.AbstractC3817
    /* renamed from: ۢ */
    public native C17222 mo2780();

    @Override // l.AbstractC3817
    /* renamed from: ۧ */
    public final void mo2781(C17222 c17222) {
        AbstractC15440 abstractC15440 = null;
        AbstractC15440 abstractC154402 = null;
        C19697 c19697 = null;
        int i = 1328508542;
        int i2 = C0714.f2697;
        int i3 = C4075.f12947;
        int m2566 = C0630.m2566("ۨܿ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-30907)) ^ 1200964795;
        int i5 = 612552608;
        while (true) {
            i = ((((i ^ i3) * (-11067)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2127179920:
                case 1488487392:
                    if (C4075.m12263() <= 0) {
                        m2566 = (C2105.m6981("ۡ۬") + i3) * (-119);
                        i4 = ((m2566 ^ i2) * 19455) ^ (-782815668);
                        i5 = -186981086;
                    } else {
                        m2566 = (C0630.m2566("֡᩺") + i2) * 23;
                        i4 = ((m2566 ^ i3) * 4793) ^ 1787499301;
                        i5 = 2130795300;
                    }
                case -2106857272:
                case 506807837:
                    RunnableC3474.m10626(abstractC154402);
                    m2566 = C2105.m6981("᩺ܶ") ^ i3;
                    i4 = ((m2566 ^ i2) * 11959) ^ 86991704;
                    i5 = 328368448;
                case -2079970229:
                case 2005527816:
                    abstractC154402 = this.f28271;
                    if (abstractC154402 != null) {
                        m2566 = (C2105.m6981("ۧ᩵") ^ i3) * 53;
                        i4 = ((m2566 ^ i2) * (-21293)) ^ 1939413340;
                        i5 = 623967411;
                    } else {
                        m2566 = C2105.m6981("᩺ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 11959) ^ 86991704;
                        i5 = 328368448;
                    }
                case -1812366982:
                case -1446650051:
                    C0050.m936();
                    break;
                case -1776168151:
                case 1314061695:
                    if (C2958.f9394 >= 0) {
                        m2566 = (C0630.m2566("ۢ᩹") ^ i2) * (-33);
                        i4 = ((m2566 ^ i3) * 13299) ^ (-2014229968);
                        i5 = 1605996059;
                    } else {
                        m2566 = (C2105.m6981("ۚ᩻") ^ i3) * 93;
                        i4 = ((m2566 ^ i2) * (-19101)) ^ (-574381208);
                        i5 = -774687659;
                    }
                case -1681216668:
                case 467172995:
                    abstractC15440 = this.f28274;
                    if (abstractC15440 != null) {
                        m2566 = (i3 - C0630.m2566("᩸ۨ")) * 13;
                        i4 = ((m2566 ^ i2) * (-26407)) ^ 1603286362;
                        i5 = -1268309209;
                    } else {
                        m2566 = C2105.m6981("᩹۠") ^ i2;
                        i4 = ((m2566 ^ i3) * (-31049)) ^ (-1637557474);
                        i5 = 650231140;
                    }
                case -1467114242:
                case 2071809230:
                    c19697 = this.f28273;
                    if (c19697 != null) {
                        m2566 = C2105.m6981("ܽۚ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-20041)) ^ 1551451150;
                        i5 = 2074984707;
                    } else {
                        m2566 = C2105.m6981("᩹۟") ^ i2;
                        i4 = ((m2566 ^ i3) * 30365) ^ 1447812432;
                        i5 = 498424033;
                    }
                case -1429403414:
                case 661298955:
                    if (C3537.f11231 >= 0) {
                        m2566 = C2105.m6981("۟۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13797)) ^ (-721283852);
                        i5 = 1011492130;
                    } else {
                        m2566 = C0630.m2566("ۖۗ") ^ i3;
                        i4 = ((m2566 ^ i2) * 24773) ^ 747317169;
                        i5 = -1548561604;
                    }
                case -1428123140:
                case -536975973:
                    if (C0050.m940() <= 0) {
                        m2566 = (C2105.m6981("۫֨") + i2) * (-59);
                        i4 = ((m2566 ^ i3) * 3805) ^ 178426667;
                        i5 = -1985510767;
                    } else {
                        m2566 = C0630.m2566("ۧۧ") ^ i2;
                        i4 = ((m2566 ^ i3) * 5649) ^ (-374580957);
                        i5 = 409867732;
                    }
                case -1416602512:
                case -910208297:
                    if (C1128.f4106 <= 0) {
                        m2566 = C2105.m6981("۫ܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-11777)) ^ 1361231447;
                        i5 = -47660129;
                    } else {
                        m2566 = (i3 - C0630.m2566("ᩴ֫")) * 35;
                        i4 = ((m2566 ^ i2) * (-23357)) ^ 1630682931;
                        i5 = 1272727336;
                    }
                case -1344842934:
                case -1170881997:
                    C7811.m20844();
                    if (C7811.f24123 < 0) {
                        m2566 = (C0630.m2566("ۢ᩹") ^ i2) * (-33);
                        i4 = ((m2566 ^ i3) * 13299) ^ (-2014229968);
                        i5 = 1605996059;
                    } else {
                        m2566 = C2105.m6981("۟۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13797)) ^ (-721283852);
                        i5 = 1011492130;
                    }
                case -1308236590:
                case 659452958:
                    if (C0422.f1886 > 0) {
                        m2566 = (C0630.m2566("ۢ᩹") ^ i2) * (-33);
                        i4 = ((m2566 ^ i3) * 13299) ^ (-2014229968);
                        i5 = 1605996059;
                    } else {
                        m2566 = (C2105.m6981("ۡ۬") + i3) * (-119);
                        i4 = ((m2566 ^ i2) * 19455) ^ (-782815668);
                        i5 = -186981086;
                    }
                case -1238614562:
                case 2119914857:
                    if (C1916.f6442) {
                        m2566 = C2105.m6981("ۢܳ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-6689)) ^ 1955738978;
                        i5 = 905410328;
                    } else {
                        m2566 = C2105.m6981("۟۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13797)) ^ (-721283852);
                        i5 = 1011492130;
                    }
                case -1112753583:
                case -800114401:
                    if (RunnableC1108.f4040) {
                        m2566 = C0630.m2566("᩺ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * 9791) ^ 1818098930;
                        i5 = -520372963;
                    } else {
                        m2566 = (C2105.m6981("۫֨") + i2) * (-59);
                        i4 = ((m2566 ^ i3) * 3805) ^ 178426667;
                        i5 = -1985510767;
                    }
                case -671493235:
                case -110951876:
                    if (C4117.m12364() != 0) {
                        m2566 = (C2105.m6981("۫֨") + i2) * (-59);
                        i4 = ((m2566 ^ i3) * 3805) ^ 178426667;
                        i5 = -1985510767;
                    } else {
                        m2566 = C0630.m2566("᩸᩵") ^ i2;
                        i4 = ((m2566 ^ i3) * 16167) ^ (-977576657);
                        i5 = 635177104;
                    }
                case -669776190:
                case -270611541:
                    if (C3019.m9258(c17222)) {
                        m2566 = C2105.m6981("᩺ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 11959) ^ 86991704;
                        i5 = 328368448;
                    } else {
                        m2566 = C2105.m6981("ܺ᩸") ^ i2;
                        i4 = ((m2566 ^ i3) * (-23413)) ^ 890228170;
                        i5 = -104460949;
                    }
                case -234347957:
                case 1857526943:
                    if (C2520.m8026()) {
                        m2566 = C2105.m6981("۟۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13797)) ^ (-721283852);
                        i5 = 1011492130;
                    } else {
                        m2566 = C2105.m6981("ۗۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * 32023) ^ (-1687711859);
                        i5 = 1604458676;
                    }
                case -201967642:
                case 1281076896:
                    RunnableC1937.m6375(c19697);
                    m2566 = C2105.m6981("᩹۟") ^ i2;
                    i4 = ((m2566 ^ i3) * 30365) ^ 1447812432;
                    i5 = 498424033;
                case -133636371:
                case 1503763575:
                    C7811.m20844();
                    C1773.m5908();
                    break;
                case -47376753:
                case 1772009913:
                    C1711.m5736();
                    C0964.m3413();
                    m2566 = (C0630.m2566("ۢ᩹") ^ i2) * (-33);
                    i4 = ((m2566 ^ i3) * 13299) ^ (-2014229968);
                    i5 = 1605996059;
                case 736696357:
                case 2063886208:
                    if (C3663.m11168() >= 0) {
                        m2566 = C2105.m6981("۫ܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-11777)) ^ 1361231447;
                        i5 = -47660129;
                    } else {
                        m2566 = C2105.m6981("᩻ۜ") ^ i2;
                        i4 = ((m2566 ^ i3) * 8665) ^ 1405534979;
                        i5 = 1370637383;
                    }
                case 1227891768:
                case 1477623919:
                    RunnableC3474.m10626(abstractC15440);
                    m2566 = C2105.m6981("᩹۠") ^ i2;
                    i4 = ((m2566 ^ i3) * (-31049)) ^ (-1637557474);
                    i5 = 650231140;
                default:
                    if (RunnableC1937.m6387() == 0) {
                        m2566 = (C2105.m6981("ۡ۬") + i3) * (-119);
                        i4 = ((m2566 ^ i2) * 19455) ^ (-782815668);
                        i5 = -186981086;
                    } else {
                        m2566 = (C2105.m6981("۫֨") + i2) * (-59);
                        i4 = ((m2566 ^ i3) * 3805) ^ 178426667;
                        i5 = -1985510767;
                    }
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:32:0x005b, code lost:
    
        if (l.C21923.f70183 != 0) goto L22;
     */
    /* JADX WARN: Code restructure failed: missing block: B:36:0x0062, code lost:
    
        if (l.C4159.m12565() >= 0) goto L15;
     */
    /* JADX WARN: Code restructure failed: missing block: B:38:0x006d, code lost:
    
        r0 = (r18 - l.C0630.m2566("۠֨")) * 73;
        r10 = ((r0 ^ r19) * 5115) ^ 698483495;
        r21 = 1958260351;
     */
    /* JADX WARN: Code restructure failed: missing block: B:41:0x006a, code lost:
    
        if (l.C0483.f2088 < 0) goto L22;
     */
    @Override // l.AbstractC3817
    /* renamed from: ۘ֫ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final java.lang.CharSequence mo2778() {
        /*
            Method dump skipped, instructions count: 824
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C9321.mo2778():java.lang.CharSequence");
    }

    @Override // l.AbstractC3817
    /* renamed from: ۠ */
    public final C11813 mo2779() {
        return C23777.f76962;
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x0053, code lost:
    
        if (l.C1005.f3721 != false) goto L38;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x005e, code lost:
    
        if (l.C7106.m19120() > 0) goto L18;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x0063, code lost:
    
        if (l.RunnableC3474.f10992 <= 0) goto L18;
     */
    @Override // l.AbstractC3817
    /* renamed from: ᩷ */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void mo2782() {
        /*
            Method dump skipped, instructions count: 794
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.C9321.mo2782():void");
    }

    @Override // l.AbstractC3817
    /* renamed from: ֫ */
    public final void mo2777(Main main, C16560 c16560, C16560 c165602, C17222 c17222) {
        int i = 1060514374;
        int i2 = C3911.f12484;
        int i3 = C1047.f3863;
        int m2566 = (C0630.m2566("ۛ֡") ^ i2) * (-107);
        int i4 = ((m2566 ^ i3) * 19477) ^ (-621725371);
        int i5 = -275407173;
        while (true) {
            i = ((((i ^ i3) * 15599) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2135653834:
                case -1397575054:
                    if (C3537.m10745(c17222)) {
                        m2566 = (C0630.m2566("ۢ֫") + i3) * 55;
                        i4 = ((m2566 ^ i2) * 11179) ^ 435849227;
                        i5 = 406551022;
                    } else {
                        m2566 = (i2 - C2105.m6981("ۛۨ")) * (-61);
                        i4 = ((m2566 ^ i3) * (-2909)) ^ 1015668236;
                        i5 = 6083793;
                    }
                case -2040030574:
                case 693531088:
                    C1128.m3851();
                    if (C21923.f70183 == 0) {
                        m2566 = (C2105.m6981("᩶ۗ") + i2) * 119;
                        i4 = ((m2566 ^ i3) * (-25013)) ^ 369486097;
                        i5 = 1655106906;
                    } else {
                        m2566 = (C0630.m2566("۟ܿ") ^ i3) * (-29);
                        i4 = ((m2566 ^ i2) * 29567) ^ 592769573;
                        i5 = 206716411;
                    }
                case -1860171756:
                case 1282070127:
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("۟ܿ") ^ i3) * (-29);
                        i4 = ((m2566 ^ i2) * 29567) ^ 592769573;
                        i5 = 206716411;
                    } else {
                        m2566 = (C2105.m6981("ܽ᩺") + i2) * (-23);
                        i4 = ((m2566 ^ i3) * 9833) ^ (-1584678684);
                        i5 = 1348852385;
                    }
                case -1663768134:
                case -545932078:
                    C0714.m2805();
                    C4159.m12565();
                    break;
                case -1486975414:
                case 243674314:
                    if (C2126.m7040()) {
                        m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                        i5 = 484360262;
                    } else {
                        m2566 = C0630.m2566("᩷۫") ^ i3;
                        i4 = ((m2566 ^ i2) * 13681) ^ (-359414568);
                        i5 = 2094074057;
                    }
                case -1439088658:
                case 409501968:
                    if (C0483.f2088 >= 0) {
                        m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                        i5 = 484360262;
                    } else {
                        m2566 = C0630.m2566("ۗۤ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-17993)) ^ (-1030651019);
                        i5 = -1768102597;
                    }
                case -1173818716:
                case 300208355:
                    if (C1504.f5354) {
                        m2566 = C2105.m6981("ۧۢ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-18183)) ^ (-1043985647);
                        i5 = 1779696688;
                    } else {
                        m2566 = (C0630.m2566("۫ܶ") ^ i3) * 21;
                        i4 = ((m2566 ^ i2) * (-9843)) ^ 1341438461;
                        i5 = 1786658649;
                    }
                case -1054910153:
                case -182625376:
                    if (C1005.f3721) {
                        m2566 = (C2105.m6981("᩶ۗ") + i2) * 119;
                        i4 = ((m2566 ^ i3) * (-25013)) ^ 369486097;
                        i5 = 1655106906;
                    } else {
                        m2566 = C2105.m6981("ۧۢ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-18183)) ^ (-1043985647);
                        i5 = 1779696688;
                    }
                case -750738475:
                case 844420612:
                    if (C4075.f12947 >= 0) {
                        m2566 = C2105.m6981("ܿ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17337)) ^ (-654387344);
                        i5 = 1619286725;
                    } else {
                        m2566 = C2105.m6981("᩺ۛ") ^ i2;
                        i4 = ((m2566 ^ i3) * 7197) ^ (-17511091);
                        i5 = 1246932934;
                    }
                case -535100540:
                case -240503052:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C2105.m6981("ܿ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17337)) ^ (-654387344);
                        i5 = 1619286725;
                    } else {
                        m2566 = C0630.m2566("ۘۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-22397)) ^ (-1838026075);
                        i5 = -1087633299;
                    }
                case -412295806:
                case -327260164:
                    ViewOnClickListenerC1958.m6429();
                    if (C4616.f14690 <= 0) {
                        m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                        i5 = 484360262;
                    } else {
                        m2566 = (C2105.m6981("᩶ۗ") + i2) * 119;
                        i4 = ((m2566 ^ i3) * (-25013)) ^ 369486097;
                        i5 = 1655106906;
                    }
                case -258475853:
                case 385081661:
                    if (C3537.f11231 >= 0) {
                        m2566 = C2105.m6981("ۧۢ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-18183)) ^ (-1043985647);
                        i5 = 1779696688;
                    } else {
                        m2566 = (C0630.m2566("ۨ᩵") ^ i2) * (-65);
                        i4 = ((m2566 ^ i3) * 27675) ^ 1540436197;
                        i5 = -903889786;
                    }
                case -139815200:
                case 934403392:
                    C22628.m50615();
                    C1294.m4372();
                    m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                    i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                    i5 = 484360262;
                case 41121411:
                case 1993985249:
                    C3683.m11221(c16560, C11340.m28023(this.f28271));
                    c16560.m39015();
                    m2566 = (i2 - C2105.m6981("ۛۨ")) * (-61);
                    i4 = ((m2566 ^ i3) * (-2909)) ^ 1015668236;
                    i5 = 6083793;
                case 318800866:
                case 2093171088:
                    if (m11542(c16560)) {
                        m2566 = C2105.m6981("۟۟") ^ i2;
                        i4 = ((m2566 ^ i3) * (-7969)) ^ 1231074694;
                        i5 = -460289162;
                    } else {
                        m2566 = (i2 - C2105.m6981("ۛۨ")) * (-61);
                        i4 = ((m2566 ^ i3) * (-2909)) ^ 1015668236;
                        i5 = 6083793;
                    }
                case 467942079:
                case 1933416045:
                    if (C2958.f9394 >= 0) {
                        m2566 = C2105.m6981("ܿ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * (-17337)) ^ (-654387344);
                        i5 = 1619286725;
                    } else {
                        m2566 = (C0630.m2566("֡ۖ") ^ i3) * 55;
                        i4 = ((m2566 ^ i2) * (-13497)) ^ (-1443072264);
                        i5 = 525438884;
                    }
                case 712218223:
                case 2075939648:
                    if (C2958.m9034() <= 0) {
                        m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                        i5 = 484360262;
                    } else {
                        m2566 = C2105.m6981("ۤܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * 29931) ^ 1651726151;
                        i5 = -2130868906;
                    }
                case 1713274764:
                case 2088631706:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = (C0630.m2566("֨֫") + i3) * (-19);
                        i4 = ((m2566 ^ i2) * 8133) ^ 703012901;
                        i5 = 484360262;
                    } else {
                        m2566 = C2105.m6981("۟ۧ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-12333)) ^ 2132881276;
                        i5 = 1102934967;
                    }
            }
            return;
        }
    }

    @Override // l.AbstractC3817
    /* renamed from: ᩹֫ */
    public final boolean mo11562() {
        return this.f28272;
    }
}
