package l;

import android.view.View;

/* compiled from: 72SJ */
/* renamed from: l.ۢۧ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C9554 implements Comparable {

    /* renamed from: ۗ, reason: not valid java name and contains not printable characters */
    public View f28970;

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public C10235 f28971;

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public String f28972;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public C1893 f28973;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public C10235 f28974;

    public /* synthetic */ C9554(int i) {
        this();
    }

    @Override // java.lang.Comparable
    public final int compareTo(Object obj) {
        C9554 c9554 = null;
        int i = 85872903;
        int i2 = C3019.f9544;
        int i3 = C0483.f2088;
        int m2566 = C0630.m2566("֫۟") ^ i3;
        int i4 = ((m2566 ^ i2) * 3123) ^ (-1656672093);
        int i5 = -1758525817;
        while (true) {
            i = ((((i ^ i2) * 13013) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2077859744:
                case -1863149965:
                    C1504.m5179();
                    if (C1128.f4106 > 0) {
                        m2566 = (i3 - C0630.m2566("ᩳܰ")) * (-99);
                        i4 = ((m2566 ^ i2) * 28979) ^ (-1953301115);
                        i5 = -612680152;
                    } else {
                        m2566 = C2105.m6981("ۚᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-9095)) ^ 565179791;
                        i5 = -1056845708;
                    }
                case -2023590499:
                case -1195471147:
                    C1047.m3599();
                    if (C3911.m11924() > 0) {
                        m2566 = C0630.m2566("۟۫") ^ i2;
                        i4 = ((m2566 ^ i3) * 23093) ^ (-1761471295);
                        i5 = -1414954241;
                    } else {
                        m2566 = C2105.m6981("֨᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * 2589) ^ (-649249362);
                        i5 = 1527119793;
                    }
                case -1903624424:
                case -1849717803:
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = (i3 - C0630.m2566("۫ܶ")) * (-89);
                        i4 = ((m2566 ^ i2) * 13655) ^ 1029042400;
                        i5 = -709187651;
                    } else {
                        m2566 = C2105.m6981("ܿۤ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-26803)) ^ (-1158119917);
                        i5 = 810928206;
                    }
                case -1651731803:
                case -277448248:
                    if (C22628.f73083 <= 0) {
                        m2566 = C0630.m2566("۟۫") ^ i2;
                        i4 = ((m2566 ^ i3) * 23093) ^ (-1761471295);
                        i5 = -1414954241;
                    } else {
                        m2566 = (C2105.m6981("ᩴۙ") ^ i2) * (-107);
                        i4 = ((m2566 ^ i3) * 31711) ^ (-857069725);
                        i5 = 459256832;
                    }
                case -1651555617:
                case 1654066237:
                    if (C0964.f3626 != 0) {
                        m2566 = (i3 - C0630.m2566("ᩳܰ")) * (-99);
                        i4 = ((m2566 ^ i2) * 28979) ^ (-1953301115);
                        i5 = -612680152;
                    } else {
                        m2566 = C2105.m6981("ۘ᩷") ^ i2;
                        i4 = ((m2566 ^ i3) * 9779) ^ 2087883849;
                        i5 = 2082401466;
                    }
                case -1651492176:
                case 748730206:
                    if (C7106.m19120() > 0) {
                        m2566 = C0630.m2566("۟۫") ^ i2;
                        i4 = ((m2566 ^ i3) * 23093) ^ (-1761471295);
                        i5 = -1414954241;
                    } else {
                        m2566 = (i3 - C0630.m2566("ᩳܰ")) * (-99);
                        i4 = ((m2566 ^ i2) * 28979) ^ (-1953301115);
                        i5 = -612680152;
                    }
                case -1380248100:
                case -1214213575:
                    if (C0630.m2564()) {
                        m2566 = C2105.m6981("ۚᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-9095)) ^ 565179791;
                        i5 = -1056845708;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۨۧ")) * (-125);
                        i4 = ((m2566 ^ i2) * 2601) ^ (-1111179859);
                        i5 = 759593991;
                    }
                case -1063003591:
                case 1844356902:
                    AbstractC2021.m6574();
                    C0798.m2998();
                    m2566 = C0630.m2566("۟۫") ^ i2;
                    i4 = ((m2566 ^ i3) * 23093) ^ (-1761471295);
                    i5 = -1414954241;
                case -711886122:
                case 1557594520:
                    return this.f28973.compareTo(c9554.f28973);
                case -300153678:
                case 1386980099:
                    if (C5695.f17556 >= 0) {
                        m2566 = (i3 - C0630.m2566("۫ܶ")) * (-89);
                        i4 = ((m2566 ^ i2) * 13655) ^ 1029042400;
                        i5 = -709187651;
                    } else {
                        m2566 = (C2105.m6981("ۖۘ") ^ i2) * 25;
                        i4 = ((m2566 ^ i3) * 6115) ^ (-2125269151);
                        i5 = 1448481759;
                    }
                case -106560202:
                case 1208804880:
                    if (C21923.m49329()) {
                        m2566 = C2105.m6981("ۚᩴ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-9095)) ^ 565179791;
                        i5 = -1056845708;
                    } else {
                        m2566 = (C0630.m2566("ۡۘ") + i3) * (-81);
                        i4 = ((m2566 ^ i2) * (-11385)) ^ 1952970187;
                        i5 = 925337285;
                    }
                case -78183351:
                case 1174982883:
                    C3911.m11924();
                    C7106.m19120();
                    return 0;
                case 229918970:
                case 560764171:
                    if (C3432.m10477() <= 0) {
                        m2566 = C2105.m6981("֨᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * 2589) ^ (-649249362);
                        i5 = 1527119793;
                    } else {
                        m2566 = C0630.m2566("ۗܿ") ^ i2;
                        i4 = ((m2566 ^ i3) * 27619) ^ 35232201;
                        i5 = -1255881362;
                    }
                case 910889774:
                case 998381643:
                    c9554 = (C9554) obj;
                    if (C4263.f13799 <= 0) {
                        m2566 = (i3 - C0630.m2566("۫ܶ")) * (-89);
                        i4 = ((m2566 ^ i2) * 13655) ^ 1029042400;
                        i5 = -709187651;
                    } else {
                        m2566 = C2105.m6981("ۡᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-12041)) ^ (-606722567);
                        i5 = -1317640230;
                    }
                case 1485150166:
                case 2077775054:
                    if (C1711.f5919) {
                        m2566 = C2105.m6981("֨᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * 2589) ^ (-649249362);
                        i5 = 1527119793;
                    } else {
                        m2566 = C0630.m2566("ܰۘ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-29021)) ^ (-468049369);
                        i5 = -442631081;
                    }
                default:
                    if (C1128.m3851() <= 0) {
                        m2566 = (i3 - C0630.m2566("۫ܶ")) * (-89);
                        i4 = ((m2566 ^ i2) * 13655) ^ 1029042400;
                        i5 = -709187651;
                    } else {
                        m2566 = (C0630.m2566("۬֨") ^ i3) * (-119);
                        i4 = ((m2566 ^ i2) * 25297) ^ 898803602;
                        i5 = 1882304409;
                    }
            }
        }
    }

    public C9554() {
    }
}
