package l;

/* compiled from: C2R7 */
/* renamed from: l.ۢᩴ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class C9781 implements InterfaceC2570 {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ ViewOnClickListenerC2040 f29575;

    @Override // l.InterfaceC2570
    public final void onPageScrollStateChanged(int i) {
    }

    @Override // l.InterfaceC2570
    public final void onPageScrolled(int i, float f, int i2) {
    }

    @Override // l.InterfaceC2570
    public final void onPageSelected(int i) {
        int i2 = 0;
        ViewOnClickListenerC2040 viewOnClickListenerC2040 = null;
        int i3 = -688676810;
        int i4 = C4117.f13076;
        int i5 = C2520.f8000;
        int m2566 = (C0630.m2566("֡ܳ") + i4) * 33;
        int i6 = ((m2566 ^ i5) * 2067) ^ 964401966;
        int i7 = 575264334;
        while (true) {
            i3 = ((((i3 ^ i5) * (-1909)) >> 31) & i6) ^ (m2566 ^ i7);
            switch (i3) {
                case -2068300460:
                case 1641038184:
                    if (C3245.f10203 <= 0) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = (C0630.m2566("۫۟") ^ i4) * (-39);
                        i6 = ((m2566 ^ i5) * (-15085)) ^ (-841127463);
                        i7 = -527736205;
                    }
                case -1877809426:
                case -779748181:
                    i2 = -1;
                    if (C21923.m49329()) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = C0630.m2566("ۗۙ") ^ i5;
                        i6 = ((m2566 ^ i4) * (-12971)) ^ 816704442;
                        i7 = -1188149847;
                    }
                case -1741694625:
                case 135862481:
                    if (C5695.f17556 >= 0) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = C2105.m6981("ᩳ֡") ^ i4;
                        i6 = ((m2566 ^ i5) * (-14817)) ^ 1976894097;
                        i7 = -1105539763;
                    }
                case -1713374679:
                case -1080292498:
                    if (C2958.f9394 >= 0) {
                        m2566 = C2105.m6981("ۢᩳ") ^ i5;
                        i6 = ((m2566 ^ i4) * 23337) ^ 2031392387;
                        i7 = 1887317854;
                    } else {
                        m2566 = C2105.m6981("᩸᩷") ^ i5;
                        i6 = ((m2566 ^ i4) * 2903) ^ (-973917245);
                        i7 = 1237828534;
                    }
                case -1501053424:
                case -294985149:
                    if (C3683.f11629 >= 0) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = C2105.m6981("ۢᩳ") ^ i5;
                        i6 = ((m2566 ^ i4) * 23337) ^ 2031392387;
                        i7 = 1887317854;
                    }
                case -1318750720:
                case 847927071:
                    viewOnClickListenerC2040 = this.f29575;
                    if (C0382.f1805) {
                        m2566 = (C2105.m6981("᩵᩸") + i4) * (-11);
                        i6 = ((m2566 ^ i5) * (-24749)) ^ 1770567015;
                        i7 = -2077277586;
                    } else {
                        m2566 = (C0630.m2566("ۘܿ") ^ i5) * 31;
                        i6 = ((m2566 ^ i4) * 15447) ^ 1706854837;
                        i7 = 112505198;
                    }
                case -1054950468:
                case -636664151:
                    viewOnClickListenerC2040.f6835 = i2;
                    viewOnClickListenerC2040.f6829 = -2;
                    break;
                case -1033878243:
                case -63735094:
                    if (C2105.f7037 != 0) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = C0630.m2566("۬ۙ") ^ i4;
                        i6 = ((m2566 ^ i5) * 7997) ^ (-1756783832);
                        i7 = 1590714139;
                    }
                case -837365394:
                case 544697736:
                    C2105.m6982();
                    C3432.m10477();
                    break;
                case -388993436:
                case 1359077078:
                    if (C4075.m12263() <= 0) {
                        m2566 = (C0630.m2566("۫۟") ^ i4) * (-39);
                        i6 = ((m2566 ^ i5) * (-15085)) ^ (-841127463);
                        i7 = -527736205;
                    } else {
                        m2566 = (C2105.m6981("᩻ᩳ") ^ i5) * 35;
                        i6 = ((m2566 ^ i4) * 19225) ^ (-1095665863);
                        i7 = 1599132671;
                    }
                case -356565207:
                case 1219994971:
                    if (C4616.m13552() != 0) {
                        m2566 = C2105.m6981("ۢᩳ") ^ i5;
                        i6 = ((m2566 ^ i4) * 23337) ^ 2031392387;
                        i7 = 1887317854;
                    } else {
                        m2566 = (i4 - C2105.m6981("᩸ۜ")) * (-99);
                        i6 = ((m2566 ^ i5) * 21653) ^ 1574061144;
                        i7 = 740304143;
                    }
                case -100598230:
                case -69596965:
                    if (C21923.m49329()) {
                        m2566 = (C2105.m6981("᩶ۘ") ^ i4) * (-15);
                        i6 = ((m2566 ^ i5) * (-14185)) ^ 1943872523;
                        i7 = -1947154339;
                    } else {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    }
                case 308120887:
                case 1502757454:
                    if (C3019.m9255() <= 0) {
                        m2566 = C2105.m6981("᩵ۛ") ^ i5;
                        i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                        i7 = 1169236540;
                    } else {
                        m2566 = C0630.m2566("֨ۡ") ^ i4;
                        i6 = ((m2566 ^ i5) * 32527) ^ (-1126197043);
                        i7 = -502450373;
                    }
                case 451239871:
                case 1567165464:
                    if (C22628.f73083 <= 0) {
                        m2566 = (C0630.m2566("ۘܿ") ^ i5) * 31;
                        i6 = ((m2566 ^ i4) * 15447) ^ 1706854837;
                        i7 = 112505198;
                    } else {
                        m2566 = (C0630.m2566("ۜ۠") + i5) * (-9);
                        i6 = ((m2566 ^ i4) * 25819) ^ (-239112112);
                        i7 = -962018877;
                    }
                case 668822408:
                case 694225068:
                    ServiceConnectionC3453.m10564();
                    C0714.m2805();
                    m2566 = C2105.m6981("᩵ۛ") ^ i5;
                    i6 = ((m2566 ^ i4) * 8051) ^ 957348073;
                    i7 = 1169236540;
                default:
                    if (RunnableC3474.f10992 <= 0) {
                        m2566 = (C2105.m6981("᩶ۘ") ^ i4) * (-15);
                        i6 = ((m2566 ^ i5) * (-14185)) ^ 1943872523;
                        i7 = -1947154339;
                    } else {
                        m2566 = C0630.m2566("ܰܽ") ^ i5;
                        i6 = ((m2566 ^ i4) * 7307) ^ 471792813;
                        i7 = 876094775;
                    }
            }
            return;
        }
    }

    public C9781(ViewOnClickListenerC2040 viewOnClickListenerC2040) {
        this.f29575 = viewOnClickListenerC2040;
    }
}
