package l;

import android.content.DialogInterface;

/* compiled from: F1FO */
/* renamed from: l.ۜۘۡ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final /* synthetic */ class DialogInterfaceOnCancelListenerC6514 implements DialogInterface.OnCancelListener {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ boolean f20107;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f20108;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f20109;

    public /* synthetic */ DialogInterfaceOnCancelListenerC6514(DialogInterfaceC0206 dialogInterfaceC0206, boolean z) {
        int i = 702757748;
        int i2 = C1294.f4556;
        int i3 = RunnableC3474.f10992;
        this.f20108 = 0;
        int m6981 = C2105.m6981("ܽ֫") ^ i2;
        int i4 = ((m6981 ^ i3) * 15593) ^ 1554633002;
        int i5 = 1904925397;
        while (true) {
            i = ((((i ^ i3) * 29669) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1812186721:
                case -506865463:
                    this.f20107 = z;
                    return;
                case -1799247196:
                case -990623489:
                    C4117.m12364();
                    throw new RuntimeException();
                case -1623545735:
                case -1091885776:
                    RunnableC1108.m3790();
                    m6981 = (C2105.m6981("ۚۘ") + i2) * 95;
                    i4 = ((m6981 ^ i3) * 5727) ^ 1777551165;
                    i5 = 1615683411;
                case -1269321135:
                case -679150946:
                    C3245.m9925();
                    if (C4117.f13076 <= 0) {
                        m6981 = (C2105.m6981("ۡۡ") + i3) * 35;
                        i4 = ((m6981 ^ i2) * 4999) ^ 1436302505;
                        i5 = 275821654;
                    } else {
                        m6981 = C0630.m2566("֫ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13841)) ^ (-1684375161);
                        i5 = -1726549617;
                    }
                case -823377513:
                case 1777216220:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("᩸ۙ") ^ i3;
                        i4 = ((m6981 ^ i2) * 23713) ^ (-668078949);
                        i5 = 1113315155;
                    } else {
                        m6981 = (i3 - C2105.m6981("۫ۢ")) * (-59);
                        i4 = ((m6981 ^ i2) * 1343) ^ (-1154729740);
                        i5 = -1198430544;
                    }
                case -662648455:
                case 294129311:
                    if (C1504.f5354) {
                        m6981 = C0630.m2566("۬ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-31699)) ^ (-1255809041);
                        i5 = -19875668;
                    } else {
                        m6981 = C0630.m2566("ۙۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-2951)) ^ 903730576;
                        i5 = -13730428;
                    }
                case -579072223:
                case 184115656:
                    if (C3537.m10746() <= 0) {
                        m6981 = (i3 - C2105.m6981("۫ۢ")) * (-59);
                        i4 = ((m6981 ^ i2) * 1343) ^ (-1154729740);
                        i5 = -1198430544;
                    } else {
                        m6981 = (C0630.m2566("᩷᩺") + i3) * 31;
                        i4 = ((m6981 ^ i2) * 30425) ^ (-2129769019);
                        i5 = -899843089;
                    }
                case -561870096:
                case -351921390:
                    this.f20109 = dialogInterfaceC0206;
                    if (C2167.m7155()) {
                        m6981 = C0630.m2566("۬ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-31699)) ^ (-1255809041);
                        i5 = -19875668;
                    } else {
                        m6981 = (C0630.m2566("᩺֡") + i2) * 5;
                        i4 = ((m6981 ^ i3) * 26997) ^ (-1108981836);
                        i5 = 181043885;
                    }
                case -243051275:
                case 866830804:
                    if (C1047.f3863 >= 0) {
                        m6981 = (i3 - C2105.m6981("۫ۢ")) * (-59);
                        i4 = ((m6981 ^ i2) * 1343) ^ (-1154729740);
                        i5 = -1198430544;
                    } else {
                        m6981 = (C2105.m6981("᩵ܰ") + i3) * (-115);
                        i4 = ((m6981 ^ i2) * (-14933)) ^ 468928040;
                        i5 = -546439607;
                    }
                case -178055101:
                case 598876575:
                    if (C22628.f73083 <= 0) {
                        m6981 = C0630.m2566("֫ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13841)) ^ (-1684375161);
                        i5 = -1726549617;
                    } else {
                        m6981 = (C0630.m2566("ۡۧ") + i2) * 31;
                        i4 = ((m6981 ^ i3) * (-32707)) ^ (-531754039);
                        i5 = 1170341332;
                    }
                case 51406752:
                case 1643196535:
                    if (C0382.f1805) {
                        m6981 = (i3 - C2105.m6981("᩺᩷")) * 25;
                        i4 = ((m6981 ^ i2) * (-2399)) ^ 313967344;
                        i5 = 1098324327;
                    } else {
                        m6981 = (C2105.m6981("ۡۡ") + i3) * 35;
                        i4 = ((m6981 ^ i2) * 4999) ^ 1436302505;
                        i5 = 275821654;
                    }
                case 797012104:
                case 2011777563:
                    if (C1420.f5096 <= 0) {
                        m6981 = C0630.m2566("۬ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-31699)) ^ (-1255809041);
                        i5 = -19875668;
                    } else {
                        m6981 = C0630.m2566("֡ۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-20967)) ^ 1338764993;
                        i5 = 1586190264;
                    }
                case 1282263673:
                case 1344671873:
                    if (C2520.f8000 >= 0) {
                        m6981 = C0630.m2566("֫ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13841)) ^ (-1684375161);
                        i5 = -1726549617;
                    } else {
                        m6981 = C0630.m2566("ۚۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-10183)) ^ (-2019494170);
                        i5 = -611770984;
                    }
                case 1416895427:
                case 1954640123:
                    if (C21923.m49329()) {
                        m6981 = (i3 - C2105.m6981("۫ۢ")) * (-59);
                        i4 = ((m6981 ^ i2) * 1343) ^ (-1154729740);
                        i5 = -1198430544;
                    } else {
                        m6981 = C0630.m2566("ۡۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 13701) ^ 440679558;
                        i5 = -233428956;
                    }
                case 1644092876:
                case 1934132049:
                    C3432.m10477();
                    if (C1005.m3501()) {
                        m6981 = (C2105.m6981("ۚۘ") + i2) * 95;
                        i4 = ((m6981 ^ i3) * 5727) ^ 1777551165;
                        i5 = 1615683411;
                    } else {
                        m6981 = C0630.m2566("۬ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-31699)) ^ (-1255809041);
                        i5 = -19875668;
                    }
                default:
                    C1711.m5736();
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("۬ۤ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-31699)) ^ (-1255809041);
                        i5 = -19875668;
                    } else {
                        m6981 = (C2105.m6981("ۡۡ") + i3) * 35;
                        i4 = ((m6981 ^ i2) * 4999) ^ 1436302505;
                        i5 = 275821654;
                    }
            }
        }
    }

    public /* synthetic */ DialogInterfaceOnCancelListenerC6514(boolean z, String str) {
        int i = -2023427507;
        int i2 = C2958.f9394;
        int i3 = C3019.f9544;
        this.f20108 = 1;
        int m6981 = (C2105.m6981("ۗ᩹") ^ i2) * 27;
        int i4 = ((m6981 ^ i3) * (-4575)) ^ 1549034107;
        int i5 = 492857191;
        while (true) {
            i = ((((i ^ i3) * 23665) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2081781349:
                case -1098235917:
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("᩶֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                        i5 = 1001729340;
                    } else {
                        m6981 = C2105.m6981("֡ۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-719)) ^ (-1564715914);
                        i5 = 103227203;
                    }
                case -2071221897:
                case 1270935888:
                    if (C4159.f13567) {
                        m6981 = C0630.m2566("ۙۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-20777)) ^ 1973555924;
                        i5 = -407463712;
                    } else {
                        m6981 = C0630.m2566("ܳۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27137)) ^ 1995609299;
                        i5 = 2134863270;
                    }
                case -1977790151:
                case -1565290117:
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("᩶֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                        i5 = 1001729340;
                    } else {
                        m6981 = C2105.m6981("֫᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13639)) ^ (-1274614543);
                        i5 = -905248844;
                    }
                case -1591302518:
                case 496525773:
                    if (C1294.m4372() <= 0) {
                        m6981 = C2105.m6981("֡ۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-719)) ^ (-1564715914);
                        i5 = 103227203;
                    } else {
                        m6981 = (C0630.m2566("ۗۛ") + i2) * (-81);
                        i4 = ((m6981 ^ i3) * 25459) ^ (-257971594);
                        i5 = -1552932598;
                    }
                case -1505235978:
                case 366698487:
                    if (C3432.f10845 >= 0) {
                        m6981 = C0630.m2566("ܿᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-27955)) ^ 845991039;
                        i5 = 1395346711;
                    } else {
                        m6981 = (C2105.m6981("ۤ۟") ^ i2) * (-3);
                        i4 = ((m6981 ^ i3) * (-31025)) ^ 134047149;
                        i5 = 882112071;
                    }
                case -1346393137:
                case 1355657237:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ܳۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27137)) ^ 1995609299;
                        i5 = 2134863270;
                    } else {
                        m6981 = C0630.m2566("ᩳܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * 19153) ^ (-1399571557);
                        i5 = 1273321755;
                    }
                case -1005483515:
                case 714284683:
                    if (C0050.f910 >= 0) {
                        m6981 = C0630.m2566("᩶֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                        i5 = 1001729340;
                    } else {
                        m6981 = C0630.m2566("۫ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-12149)) ^ 1541034782;
                        i5 = 1520282867;
                    }
                case -974288399:
                case 1973772494:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = C0630.m2566("ܳۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27137)) ^ 1995609299;
                        i5 = 2134863270;
                    } else {
                        m6981 = (i2 - C2105.m6981("۟ۡ")) * (-105);
                        i4 = ((m6981 ^ i3) * (-10081)) ^ (-1245019766);
                        i5 = -242929996;
                    }
                case -939845296:
                case 1652722060:
                    this.f20107 = z;
                    if (C7106.f21815 != 0) {
                        m6981 = C0630.m2566("ܳۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27137)) ^ 1995609299;
                        i5 = 2134863270;
                    } else {
                        m6981 = (C2105.m6981("ۡܳ") + i3) * (-125);
                        i4 = ((m6981 ^ i2) * (-31213)) ^ (-1552994387);
                        i5 = 866486307;
                    }
                case -859589345:
                case 1408164790:
                    if (C1711.m5736() <= 0) {
                        m6981 = C0630.m2566("᩶֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                        i5 = 1001729340;
                    } else {
                        m6981 = (C0630.m2566("֡֡") + i3) * (-99);
                        i4 = ((m6981 ^ i2) * 13405) ^ (-1428283404);
                        i5 = -542345695;
                    }
                case -829108642:
                case 787477117:
                    C0237.m1481();
                    throw new RuntimeException();
                case -343530542:
                case 1823900290:
                    RunnableC3474.m10630();
                    m6981 = C0630.m2566("᩶֫") ^ i2;
                    i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                    i5 = 1001729340;
                case 41275938:
                case 336207227:
                    if (C21923.f70183 != 0) {
                        m6981 = C0630.m2566("ܳۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27137)) ^ 1995609299;
                        i5 = 2134863270;
                    } else {
                        m6981 = (C0630.m2566("᩸ۛ") + i2) * 3;
                        i4 = ((m6981 ^ i3) * (-10459)) ^ 92158849;
                        i5 = -1749696163;
                    }
                case 169331213:
                case 192238255:
                    this.f20109 = str;
                    return;
                case 1059647240:
                case 2146286613:
                    C1773.m5908();
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("᩶֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 27561) ^ 959077441;
                        i5 = 1001729340;
                    } else {
                        m6981 = C0630.m2566("ܿᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-27955)) ^ 845991039;
                        i5 = 1395346711;
                    }
                default:
                    if (C0483.m2121()) {
                        m6981 = (C2105.m6981("ܿۖ") + i3) * 109;
                        i4 = ((m6981 ^ i2) * 5017) ^ 910545963;
                        i5 = 867313942;
                    } else {
                        m6981 = C2105.m6981("֫᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13639)) ^ (-1274614543);
                        i5 = -905248844;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:6:0x002f, code lost:
    
        if (l.C21923.f70183 != 0) goto L57;
     */
    @Override // android.content.DialogInterface.OnCancelListener
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onCancel(android.content.DialogInterface r12) {
        /*
            Method dump skipped, instructions count: 766
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.DialogInterfaceOnCancelListenerC6514.onCancel(android.content.DialogInterface):void");
    }
}
