package l;

import android.content.DialogInterface;
import com.umeng.commonsdk.statistics.UMErrorCode;
import moe.shizuku.server.IShizukuService;

/* compiled from: H1R6 */
/* renamed from: l.ۧۚۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class DialogInterfaceOnDismissListenerC10790 implements DialogInterface.OnDismissListener {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f32450;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f32451;

    public /* synthetic */ DialogInterfaceOnDismissListenerC10790(AbstractActivityC3346 abstractActivityC3346, int i) {
        int i2 = -127101628;
        int i3 = C0050.f910;
        int i4 = C1047.f3863;
        this.f32450 = i;
        this.f32451 = abstractActivityC3346;
        int m6981 = (C2105.m6981("۫ᩳ") + i4) * 109;
        int i5 = ((m6981 ^ i3) * (-20979)) ^ 1424224558;
        int i6 = -1901197148;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * 16451) >> 31));
            switch (i2) {
                case -1657381053:
                case 1771518766:
                    C3245.m9925();
                    C5695.m16023();
                    throw new RuntimeException();
                case -1305548583:
                case 1881118281:
                    if (C3245.f10203 <= 0) {
                        m6981 = (i4 - C2105.m6981("ۘ᩷")) * 79;
                        i5 = ((m6981 ^ i3) * (-1817)) ^ 710041893;
                        i6 = 1360995696;
                    } else {
                        m6981 = (C0630.m2566("ܿ۬") ^ i3) * 55;
                        i5 = ((m6981 ^ i4) * 543) ^ (-1708062887);
                        i6 = 42557692;
                    }
                case -1080739592:
                case 351473727:
                    C3245.m9925();
                    C0798.m2998();
                    m6981 = C2105.m6981("ܶ۟") ^ i4;
                    i5 = ((m6981 ^ i3) * (-20255)) ^ 1074031494;
                    i6 = -454043602;
                case -847090857:
                case 865196716:
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ܶ۟") ^ i4;
                        i5 = ((m6981 ^ i3) * (-20255)) ^ 1074031494;
                        i6 = -454043602;
                    } else {
                        m6981 = (i4 - C2105.m6981("۠۠")) * (-71);
                        i5 = ((m6981 ^ i3) * (-3725)) ^ (-872712039);
                        i6 = -687828002;
                    }
                case -594108402:
                case 831336953:
                    C11340.m28031();
                    if (C4616.f14690 <= 0) {
                        m6981 = (i4 - C2105.m6981("۠۠")) * (-71);
                        i5 = ((m6981 ^ i3) * (-3725)) ^ (-872712039);
                        i6 = -687828002;
                    } else {
                        m6981 = C2105.m6981("ۚۜ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-12827)) ^ 1398805787;
                        i6 = -818668379;
                    }
                case -301524142:
                case 1159823478:
                    return;
                default:
                    C2520.m8026();
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ۧܽ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-23477)) ^ 1144921387;
                        i6 = 540237939;
                    } else {
                        m6981 = C2105.m6981("ۚۜ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-12827)) ^ 1398805787;
                        i6 = -818668379;
                    }
            }
        }
    }

    @Override // android.content.DialogInterface.OnDismissListener
    public final void onDismiss(DialogInterface dialogInterface) {
        int i = 1328800123;
        int i2 = C3911.f12484;
        int i3 = C3245.f10203;
        int m2566 = C0630.m2566("ۙۖ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-29703)) ^ 1718038473;
        int i5 = 1786619097;
        while (true) {
            i = ((((i ^ i3) * 23889) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1936400505:
                case -1283862225:
                    C1773.m5908();
                    ViewOnClickListenerC1958.m6429();
                    m2566 = C2105.m6981("ۧ֡") ^ i2;
                    i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                    i5 = 545831842;
                case -1935779375:
                case 1714195576:
                    if (C1047.f3863 >= 0) {
                        m2566 = C2105.m6981("᩶᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-27145)) ^ (-1912489631);
                        i5 = -545729882;
                    } else {
                        m2566 = C2105.m6981("ܳ۫") ^ i3;
                        i4 = ((m2566 ^ i2) * 25031) ^ 776336372;
                        i5 = 1147103754;
                    }
                case -1812184304:
                case -1451650105:
                    if (C2958.f9394 >= 0) {
                        m2566 = C2105.m6981("۬֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 17601) ^ 1384012529;
                        i5 = -2147328027;
                    } else {
                        m2566 = (C2105.m6981("ܰ֫") + i2) * (-83);
                        i4 = ((m2566 ^ i3) * 26505) ^ 1720838846;
                        i5 = 199118123;
                    }
                case -1805614541:
                case 956338095:
                    if (C4159.f13567) {
                        m2566 = C2105.m6981("᩵֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 1187) ^ 1460450711;
                        i5 = -2067918983;
                    } else {
                        m2566 = C2105.m6981("ۧ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                        i5 = 545831842;
                    }
                case -1759865585:
                case 1929011042:
                    switch (this.f32450) {
                        case 0:
                            m2566 = C2105.m6981("ۗۧ") ^ i3;
                            i4 = ((m2566 ^ i2) * (-23673)) ^ (-867677183);
                            i5 = -4797435;
                            break;
                        default:
                            m2566 = C0630.m2566("ܳ᩵") ^ i2;
                            i4 = ((m2566 ^ i3) * 26125) ^ 1711701999;
                            i5 = -1477113016;
                            break;
                    }
                case -1568941134:
                case -1146594687:
                    C0237.m1481();
                    if (C0382.f1805) {
                        m2566 = C2105.m6981("ۧ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                        i5 = 545831842;
                    } else {
                        m2566 = C0630.m2566("۠ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10767) ^ 576643938;
                        i5 = -1984275776;
                    }
                case -1497076025:
                case 1669306033:
                    if (C2167.f7158 >= 0) {
                        m2566 = C2105.m6981("۬֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 17601) ^ 1384012529;
                        i5 = -2147328027;
                    } else {
                        m2566 = (C0630.m2566("᩸ܰ") + i2) * (-55);
                        i4 = ((m2566 ^ i3) * 12301) ^ (-1939209836);
                        i5 = 377136023;
                    }
                case -1427412157:
                case 1092015359:
                    C2272.m7505(this.f32451);
                    break;
                case -1413226754:
                case 1782035225:
                    C0382.m1848();
                    if (C3663.m11168() < 0) {
                        m2566 = C2105.m6981("ۧ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                        i5 = 545831842;
                    } else {
                        m2566 = C2105.m6981("᩶᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-27145)) ^ (-1912489631);
                        i5 = -545729882;
                    }
                case -1237418947:
                case 802086523:
                    if (C4075.f12947 >= 0) {
                        m2566 = C2105.m6981("᩶᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-27145)) ^ (-1912489631);
                        i5 = -545729882;
                    } else {
                        m2566 = (C2105.m6981("ᩳ۫") + i3) * 23;
                        i4 = ((m2566 ^ i2) * 3543) ^ (-2024965706);
                        i5 = 471098339;
                    }
                case -966048211:
                case 1352662066:
                    C3663.m11168();
                    C1047.m3599();
                    break;
                case 86333731:
                case 109389686:
                    if (C4263.m12819() >= 0) {
                        m2566 = (C2105.m6981("ۨܺ") ^ i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-19431)) ^ 1226385639;
                        i5 = -59784395;
                    } else {
                        m2566 = (C2105.m6981("ܳܳ") + i2) * (-91);
                        i4 = ((m2566 ^ i3) * (-18105)) ^ 1915346177;
                        i5 = -1992906706;
                    }
                case 535304863:
                case 966310518:
                    if (C1420.m4913()) {
                        m2566 = (C2105.m6981("ۨܺ") ^ i3) * (-19);
                        i4 = ((m2566 ^ i2) * (-19431)) ^ 1226385639;
                        i5 = -59784395;
                    } else {
                        m2566 = C2105.m6981("ۧ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                        i5 = 545831842;
                    }
                case 793518323:
                case 1750219130:
                    if (C3683.f11629 >= 0) {
                        m2566 = C0630.m2566("۠ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10767) ^ 576643938;
                        i5 = -1984275776;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۖܶ")) * 75;
                        i4 = ((m2566 ^ i2) * (-6833)) ^ 1480811476;
                        i5 = -1968113912;
                    }
                case 797547533:
                case 1713820794:
                    if (C1916.f6442) {
                        m2566 = (i2 - C0630.m2566("ۧܶ")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * 3201) ^ (-1643312021);
                        i5 = -901286791;
                    } else {
                        m2566 = C2105.m6981("۬֫") ^ i3;
                        i4 = ((m2566 ^ i2) * 17601) ^ 1384012529;
                        i5 = -2147328027;
                    }
                case 943244377:
                case 1080283212:
                    if (C3683.f11629 >= 0) {
                        m2566 = C2105.m6981("ۧ֡") ^ i2;
                        i4 = ((m2566 ^ i3) * 17571) ^ (-730053622);
                        i5 = 545831842;
                    } else {
                        m2566 = (i3 - C2105.m6981("᩷֨")) * 25;
                        i4 = ((m2566 ^ i2) * 12093) ^ (-560721186);
                        i5 = -907512756;
                    }
                case 1708735047:
                case 1849382913:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = C0630.m2566("۠ܶ") ^ i3;
                        i4 = ((m2566 ^ i2) * 10767) ^ 576643938;
                        i5 = -1984275776;
                    } else {
                        m2566 = (C0630.m2566("᩺ᩴ") + i2) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m2566 ^ i3) * (-28387)) ^ 661150384;
                        i5 = 1569656077;
                    }
                default:
                    ViewOnClickListenerC5850.m16381((ViewOnClickListenerC5850) this.f32451);
                    break;
            }
            return;
        }
    }
}
