package l;

import android.content.DialogInterface;
import bin.mt.plus.Main;
import com.alipay.sdk.m.y.q;
import org.bouncycastle.math.ec.custom.sec.SecP224K1Field;

/* compiled from: V6B4 */
/* renamed from: l.᩶֨᩷, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final /* synthetic */ class DialogInterfaceOnClickListenerC19848 implements DialogInterface.OnClickListener {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f64113;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f64114;

    public /* synthetic */ DialogInterfaceOnClickListenerC19848(AbstractActivityC3346 abstractActivityC3346, C20986 c20986) {
        int i = 931164949;
        int i2 = RunnableC1937.f6483;
        int i3 = C4117.f13076;
        this.f64113 = 1;
        int m6981 = C2105.m6981("ܶ۟") ^ i2;
        int i4 = ((m6981 ^ i3) * (-19107)) ^ (-2117087989);
        int i5 = -395467817;
        while (true) {
            i = ((((i ^ i3) * 31343) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1774134991:
                case 780635678:
                    if (C3432.f10845 >= 0) {
                        m6981 = (i2 - C2105.m6981("ۢܰ")) * 51;
                        i4 = ((m6981 ^ i3) * 453) ^ 1801888309;
                        i5 = -1026422687;
                    } else {
                        m6981 = C2105.m6981("֡᩻") ^ i3;
                        i4 = ((m6981 ^ i2) * (-15797)) ^ 164226244;
                        i5 = 1361367950;
                    }
                case -1716623543:
                case 655975588:
                    C4616.m13552();
                    if (C1916.f6442) {
                        m6981 = (i2 - C2105.m6981("ۢܰ")) * 51;
                        i4 = ((m6981 ^ i3) * 453) ^ 1801888309;
                        i5 = -1026422687;
                    } else {
                        m6981 = C2105.m6981("᩸᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * 9471) ^ (-1557337315);
                        i5 = 728815400;
                    }
                case -841279192:
                case 899797193:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("ۢ᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11521)) ^ 2463885;
                        i5 = 2018442090;
                    } else {
                        m6981 = C2105.m6981("᩸᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * 9471) ^ (-1557337315);
                        i5 = 728815400;
                    }
                case -756314763:
                case 1063598335:
                    RunnableC1108.m3790();
                    if (C2126.m7040()) {
                        m6981 = C0630.m2566("᩸ۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 7305) ^ 2042144402;
                        i5 = 543942368;
                    } else {
                        m6981 = C2105.m6981("᩸᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * 9471) ^ (-1557337315);
                        i5 = 728815400;
                    }
                case -376852855:
                case 748744243:
                    return;
                case -104117791:
                case 2109342349:
                    if (C4117.f13076 > 0) {
                        m6981 = (C2105.m6981("ۚۧ") + i2) * (-107);
                        i4 = ((m6981 ^ i3) * (-20995)) ^ (-1921619441);
                        i5 = 1947497037;
                    } else {
                        m6981 = C0630.m2566("᩸ۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 7305) ^ 2042144402;
                        i5 = 543942368;
                    }
                case 84998858:
                case 133005779:
                    if (C3245.f10203 <= 0) {
                        m6981 = C0630.m2566("᩸ۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 7305) ^ 2042144402;
                        i5 = 543942368;
                    } else {
                        m6981 = (C0630.m2566("᩵ᩴ") + i2) * 31;
                        i4 = ((m6981 ^ i3) * (-9453)) ^ (-1411397931);
                        i5 = -1253458714;
                    }
                case 232394516:
                case 558259009:
                    if (C1047.f3863 >= 0) {
                        m6981 = C2105.m6981("֡ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27349) ^ (-1060869362);
                        i5 = -1225126188;
                    } else {
                        m6981 = (i2 - C2105.m6981("۫ۤ")) * (-101);
                        i4 = ((m6981 ^ i3) * (-14837)) ^ 1663354373;
                        i5 = 1154586690;
                    }
                case 269105128:
                case 1990280984:
                    RunnableC0588.m2441();
                    C0050.m940();
                    m6981 = (C2105.m6981("ۚۧ") + i2) * (-107);
                    i4 = ((m6981 ^ i3) * (-20995)) ^ (-1921619441);
                    i5 = 1947497037;
                case 532101041:
                case 1981175220:
                    if (ServiceConnectionC3453.m10564() <= 0) {
                        m6981 = (C2105.m6981("ۚۧ") + i2) * (-107);
                        i4 = ((m6981 ^ i3) * (-20995)) ^ (-1921619441);
                        i5 = 1947497037;
                    } else {
                        m6981 = C0630.m2566("ᩳ᩶") ^ i3;
                        i4 = ((m6981 ^ i2) * 25257) ^ 1426396050;
                        i5 = 1811573380;
                    }
                case 607709771:
                case 2039388820:
                    this.f64114 = abstractActivityC3346;
                    if (C1420.f5096 <= 0) {
                        m6981 = C2105.m6981("֡ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27349) ^ (-1060869362);
                        i5 = -1225126188;
                    } else {
                        m6981 = C2105.m6981("ۙۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-17401)) ^ 316198140;
                        i5 = -1502576720;
                    }
                case 913334101:
                case 1903321614:
                    C1916.m6308();
                    throw new RuntimeException();
                case 1026604608:
                case 1486639564:
                    if (C4159.f13567) {
                        m6981 = (C2105.m6981("֡ۘ") + i2) * (-27);
                        i4 = ((m6981 ^ i3) * SecP224K1Field.PInv33) ^ 2050033628;
                        i5 = 1970141420;
                    } else {
                        m6981 = C2105.m6981("֡ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27349) ^ (-1060869362);
                        i5 = -1225126188;
                    }
                case 1134717082:
                case 1510043927:
                    if (C3432.m10477() <= 0) {
                        m6981 = C0630.m2566("᩸ۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 7305) ^ 2042144402;
                        i5 = 543942368;
                    } else {
                        m6981 = C2105.m6981("ۛۡ") ^ i2;
                        i4 = ((m6981 ^ i3) * 20177) ^ (-1163197554);
                        i5 = -1673983144;
                    }
                case 1761090475:
                case 1906177117:
                    if (C3432.f10845 >= 0) {
                        m6981 = C2105.m6981("֡ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 27349) ^ (-1060869362);
                        i5 = -1225126188;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۖ᩹")) * q.h;
                        i4 = ((m6981 ^ i2) * 17319) ^ (-551132641);
                        i5 = 475952558;
                    }
                default:
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = C2105.m6981("᩸᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * 9471) ^ (-1557337315);
                        i5 = 728815400;
                    } else {
                        m6981 = C2105.m6981("ۜܰ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24015)) ^ 1617317631;
                        i5 = 1043421912;
                    }
            }
        }
    }

    public /* synthetic */ DialogInterfaceOnClickListenerC19848(Main main) {
        int i = 1077445940;
        int i2 = C0483.f2088;
        int i3 = C1047.f3863;
        this.f64113 = 0;
        int m6981 = (C2105.m6981("ܺ۬") ^ i3) * (-121);
        int i4 = ((m6981 ^ i2) * (-15415)) ^ 2118634842;
        int i5 = -551353402;
        while (true) {
            i = ((((i ^ i2) * (-4235)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2120115187:
                case 37470307:
                    RunnableC1108.m3790();
                    C0714.m2805();
                    m6981 = (C0630.m2566("۟ۢ") + i2) * (-89);
                    i4 = ((m6981 ^ i3) * 18925) ^ 1217750105;
                    i5 = 1357319434;
                case -2112122201:
                case 924570988:
                    C11340.m28031();
                    if (C1005.f3721) {
                        m6981 = (C0630.m2566("᩺᩷") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * 11055) ^ (-1620239961);
                        i5 = -1440803097;
                    } else {
                        m6981 = (C0630.m2566("۟ۢ") + i2) * (-89);
                        i4 = ((m6981 ^ i3) * 18925) ^ 1217750105;
                        i5 = 1357319434;
                    }
                case -1856969994:
                case 1187514513:
                    C2126.m7040();
                    if (C1504.m5179()) {
                        m6981 = C2105.m6981("ۚ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26307)) ^ 59254506;
                        i5 = 1563961979;
                    } else {
                        m6981 = (C0630.m2566("᩺᩷") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * 11055) ^ (-1620239961);
                        i5 = -1440803097;
                    }
                case -1398102955:
                case -767076242:
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("ۚ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26307)) ^ 59254506;
                        i5 = 1563961979;
                    } else {
                        m6981 = C0630.m2566("᩻۟") ^ i2;
                        i4 = ((m6981 ^ i3) * (-21967)) ^ (-572047827);
                        i5 = -1142894121;
                    }
                case -1374708102:
                case 1703228117:
                    if (C1773.f6144 <= 0) {
                        m6981 = (C0630.m2566("۟ۢ") + i2) * (-89);
                        i4 = ((m6981 ^ i3) * 18925) ^ 1217750105;
                        i5 = 1357319434;
                    } else {
                        m6981 = (C2105.m6981("ۡۤ") + i3) * 57;
                        i4 = ((m6981 ^ i2) * 13097) ^ (-299091309);
                        i5 = -1662617764;
                    }
                case -729276601:
                case 470664403:
                    if (C22628.f73083 <= 0) {
                        m6981 = (C0630.m2566("۟ۢ") + i2) * (-89);
                        i4 = ((m6981 ^ i3) * 18925) ^ 1217750105;
                        i5 = 1357319434;
                    } else {
                        m6981 = (C2105.m6981("ᩳ᩻") + i3) * 109;
                        i4 = ((m6981 ^ i2) * (-32091)) ^ 1970817770;
                        i5 = -855009771;
                    }
                case -627679490:
                case 1015917056:
                    RunnableC0588.m2441();
                    throw new RuntimeException();
                case -615068084:
                case 2020995783:
                    if (C3432.m10477() <= 0) {
                        m6981 = (C0630.m2566("᩺᩷") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * 11055) ^ (-1620239961);
                        i5 = -1440803097;
                    } else {
                        m6981 = C2105.m6981("ܺ۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 15299) ^ (-546402044);
                        i5 = 2065418190;
                    }
                case -592941132:
                case -259311128:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = (C0630.m2566("᩺᩷") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * 11055) ^ (-1620239961);
                        i5 = -1440803097;
                    } else {
                        m6981 = (C2105.m6981("ۢ᩸") ^ i2) * (-125);
                        i4 = ((m6981 ^ i3) * 29571) ^ (-859635719);
                        i5 = -1490753878;
                    }
                case -572156188:
                case 1978155948:
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("ۖۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28073)) ^ (-5759159);
                        i5 = -2099133710;
                    } else {
                        m6981 = (C2105.m6981("۫ܺ") ^ i3) * 41;
                        i4 = ((m6981 ^ i2) * 28397) ^ 1509066266;
                        i5 = -802208399;
                    }
                case -485732496:
                case -334071964:
                    if (C1047.f3863 >= 0) {
                        m6981 = C2105.m6981("ۖۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28073)) ^ (-5759159);
                        i5 = -2099133710;
                    } else {
                        m6981 = (i2 - C0630.m2566("ܺᩴ")) * 85;
                        i4 = ((m6981 ^ i3) * (-30127)) ^ (-467737260);
                        i5 = 215737140;
                    }
                case -469135089:
                case -16816005:
                    this.f64114 = main;
                    if (C11340.f33930 >= 0) {
                        m6981 = (C0630.m2566("᩺᩷") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * 11055) ^ (-1620239961);
                        i5 = -1440803097;
                    } else {
                        m6981 = C0630.m2566("ܶ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-1371)) ^ 1192652773;
                        i5 = -1429475412;
                    }
                case -161274815:
                case -138463007:
                    if (C2272.f7362) {
                        m6981 = C2105.m6981("ۖۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28073)) ^ (-5759159);
                        i5 = -2099133710;
                    } else {
                        m6981 = C0630.m2566("۟ᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * 1383) ^ 621845894;
                        i5 = 195798576;
                    }
                case 94357858:
                case 1573015091:
                    C3663.m11168();
                    if (C2126.m7040()) {
                        m6981 = C2105.m6981("ۚ᩹") ^ i2;
                        i4 = ((m6981 ^ i3) * (-26307)) ^ 59254506;
                        i5 = 1563961979;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۖܶ")) * (-51);
                        i4 = ((m6981 ^ i2) * 12729) ^ (-856972767);
                        i5 = -1752523804;
                    }
                case 447973193:
                case 2109873481:
                    return;
                default:
                    if (C3683.f11629 >= 0) {
                        m6981 = (i3 - C2105.m6981("ۖܶ")) * (-51);
                        i4 = ((m6981 ^ i2) * 12729) ^ (-856972767);
                        i5 = -1752523804;
                    } else {
                        m6981 = C0630.m2566("ᩴۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-26337)) ^ (-1380604969);
                        i5 = 594846193;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:16:0x01d3, code lost:
    
        r2 = l.C2105.m6981("ܰܺ") ^ r0;
        r3 = ((r2 ^ r1) * 23237) ^ (-1187646179);
        r4 = 528717237;
     */
    /* JADX WARN: Code restructure failed: missing block: B:26:0x00d7, code lost:
    
        r2 = l.C0630.m2566("֫֫") ^ r0;
        r3 = ((r2 ^ r1) * (-4207)) ^ 1542872256;
        r4 = -262275431;
     */
    /* JADX WARN: Code restructure failed: missing block: B:45:0x0159, code lost:
    
        r2 = l.C2105.m6981("᩵ܳ") ^ r1;
        r3 = ((r2 ^ r0) * (-24695)) ^ (-732654267);
        r4 = -2040273673;
     */
    @Override // android.content.DialogInterface.OnClickListener
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onClick(android.content.DialogInterface r7, int r8) {
        /*
            Method dump skipped, instructions count: 652
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.DialogInterfaceOnClickListenerC19848.onClick(android.content.DialogInterface, int):void");
    }
}
