package l;

import android.content.DialogInterface;
import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: 05ZQ */
/* renamed from: l.ܺۡܳ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final /* synthetic */ class DialogInterfaceOnClickListenerC15833 implements DialogInterface.OnClickListener {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f48926;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f48927;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f48928;

    public /* synthetic */ DialogInterfaceOnClickListenerC15833(int i, Object obj, Object obj2) {
        int i2 = 1977927164;
        int i3 = C3432.f10845;
        int i4 = C0483.f2088;
        this.f48927 = i;
        this.f48928 = obj;
        this.f48926 = obj2;
        int m6981 = (i3 - C2105.m6981("᩹ۨ")) * 27;
        int i5 = ((m6981 ^ i4) * 8885) ^ 1638681715;
        int i6 = 1905667824;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i4) * (-24613)) >> 31));
            switch (i2) {
                case -1612856632:
                case -597590836:
                    C2520.m8026();
                    C1294.m4372();
                    throw new RuntimeException();
                case -1570331496:
                case 783455825:
                    return;
                case -1303805091:
                case 468150036:
                    C4117.m12364();
                    if (C1916.f6442) {
                        m6981 = (C2105.m6981("ᩳۜ") + i4) * (-101);
                        i5 = ((m6981 ^ i3) * (-19611)) ^ 10757592;
                        i6 = 1779768652;
                    } else {
                        m6981 = (C2105.m6981("ܺ᩶") ^ i3) * 9;
                        i5 = ((m6981 ^ i4) * 15089) ^ 1811077609;
                        i6 = 1907460942;
                    }
                case -704191720:
                case -225854659:
                    C0483.m2121();
                    if (C0798.f2919) {
                        m6981 = (C0630.m2566("ᩳᩴ") + i4) * (-109);
                        i5 = ((m6981 ^ i3) * (-2413)) ^ (-413415099);
                        i6 = 1321566769;
                    } else {
                        m6981 = (C2105.m6981("ᩳۜ") + i4) * (-101);
                        i5 = ((m6981 ^ i3) * (-19611)) ^ 10757592;
                        i6 = 1779768652;
                    }
                case -300856876:
                case 553529743:
                    if (C1711.f5919) {
                        m6981 = (C2105.m6981("᩻ۙ") + i4) * 73;
                        i5 = ((m6981 ^ i3) * (-10195)) ^ (-247802648);
                        i6 = 2012836625;
                    } else {
                        m6981 = (C0630.m2566("ᩳᩴ") + i4) * (-109);
                        i5 = ((m6981 ^ i3) * (-2413)) ^ (-413415099);
                        i6 = 1321566769;
                    }
                case 738730170:
                case 1451881172:
                    C3746.m11369();
                    RunnableC0588.m2441();
                    m6981 = (C2105.m6981("ᩳۜ") + i4) * (-101);
                    i5 = ((m6981 ^ i3) * (-19611)) ^ 10757592;
                    i6 = 1779768652;
                default:
                    if (C0483.m2121()) {
                        m6981 = C0630.m2566("ܽۢ") ^ i3;
                        i5 = ((m6981 ^ i4) * 321) ^ (-1127694041);
                        i6 = -1683609028;
                    } else {
                        m6981 = C0630.m2566("ۢ᩹") ^ i3;
                        i5 = ((m6981 ^ i4) * 1821) ^ 1097261783;
                        i6 = 1527119147;
                    }
            }
        }
    }

    @Override // android.content.DialogInterface.OnClickListener
    public final void onClick(DialogInterface dialogInterface, int i) {
        C16560 c16560 = null;
        Object obj = null;
        InterfaceC17889 interfaceC17889 = null;
        C6306 c6306 = null;
        Object obj2 = null;
        int i2 = -591807060;
        int i3 = C3746.f11829;
        int i4 = C4616.f14690;
        int m2566 = C0630.m2566("۫᩸") ^ i3;
        int i5 = ((m2566 ^ i4) * 11939) ^ 1316745012;
        int i6 = 805900400;
        while (true) {
            i2 = ((((i2 ^ i4) * (-19493)) >> 31) & i5) ^ (m2566 ^ i6);
            switch (i2) {
                case -1893400675:
                case 517254127:
                    if (C11340.m28031()) {
                        m2566 = C0630.m2566("ܶ᩺") ^ i3;
                        i5 = ((m2566 ^ i4) * (-31645)) ^ 389148496;
                        i6 = 94933502;
                    } else {
                        m2566 = (i3 - C0630.m2566("֡᩺")) * 3;
                        i5 = ((m2566 ^ i4) * (-10351)) ^ 1681695233;
                        i6 = 277780949;
                    }
                case -1886540999:
                case -535721707:
                    RunnableC3474.m10630();
                    C2520.m8026();
                    break;
                case -1634104503:
                case 1836745376:
                    c16560 = (C16560) this.f48928;
                    obj = this.f48926;
                    if (C7106.f21815 != 0) {
                        m2566 = (i3 - C2105.m6981("ۗۡ")) * 69;
                        i5 = ((m2566 ^ i4) * 16699) ^ (-1384918721);
                        i6 = 1532487317;
                    } else {
                        m2566 = C2105.m6981("ۛ۟") ^ i3;
                        i5 = ((m2566 ^ i4) * 20349) ^ 1438208054;
                        i6 = -1749991275;
                    }
                case -1345664621:
                case 628511895:
                    c6306 = (C6306) this.f48928;
                    obj2 = this.f48926;
                    if (C0798.m2998() != 0) {
                        m2566 = (i3 - C2105.m6981("ۗۡ")) * 69;
                        i5 = ((m2566 ^ i4) * 16699) ^ (-1384918721);
                        i6 = 1532487317;
                    } else {
                        m2566 = (C2105.m6981("۫᩻") + i4) * (-11);
                        i5 = ((m2566 ^ i3) * 15649) ^ 431944705;
                        i6 = -2023999355;
                    }
                case -1246484972:
                case 1456515192:
                    if (C4616.f14690 <= 0) {
                        m2566 = (i3 - C0630.m2566("֡᩺")) * 3;
                        i5 = ((m2566 ^ i4) * (-10351)) ^ 1681695233;
                        i6 = 277780949;
                    } else {
                        m2566 = (C0630.m2566("ܳۡ") ^ i4) * 63;
                        i5 = ((m2566 ^ i3) * (-4463)) ^ 513189842;
                        i6 = -1454710315;
                    }
                case -1154652904:
                case 2071151957:
                    if (C2272.f7362) {
                        m2566 = (C2105.m6981("ۛۨ") + i4) * 93;
                        i5 = ((m2566 ^ i3) * 17789) ^ 1412000736;
                        i6 = -1660810912;
                    } else {
                        m2566 = (C0630.m2566("᩸᩶") ^ i4) * (-31);
                        i5 = ((m2566 ^ i3) * 23747) ^ (-1720160359);
                        i6 = -1083314638;
                    }
                case -1113060915:
                case -397085206:
                    if (C3019.m9255() <= 0) {
                        m2566 = (C0630.m2566("ۢ۫") ^ i4) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m2566 ^ i3) * (-32161)) ^ 620508971;
                        i6 = -1011412810;
                    } else {
                        m2566 = (C2105.m6981("֡᩶") + i4) * (-39);
                        i5 = ((m2566 ^ i3) * (-6371)) ^ (-634052070);
                        i6 = 127326338;
                    }
                case -786736654:
                case 559422311:
                    if (C0382.f1805) {
                        m2566 = C2105.m6981("ܰ۠") ^ i3;
                        i5 = ((m2566 ^ i4) * (-631)) ^ (-1928643600);
                        i6 = -571160499;
                    } else {
                        m2566 = (i3 - C0630.m2566("֡᩺")) * 3;
                        i5 = ((m2566 ^ i4) * (-10351)) ^ 1681695233;
                        i6 = 277780949;
                    }
                case -759223307:
                case 1230606529:
                    c6306.m34228((ActivityC17169) obj2);
                    break;
                case -616886577:
                case 516776448:
                    C0050.m940();
                    if (C21923.m49329()) {
                        m2566 = C2105.m6981("۫֨") ^ i3;
                        i5 = ((m2566 ^ i4) * 14175) ^ (-1924295998);
                        i6 = 727710844;
                    } else {
                        m2566 = (C2105.m6981("ۛۨ") + i4) * 93;
                        i5 = ((m2566 ^ i3) * 17789) ^ 1412000736;
                        i6 = -1660810912;
                    }
                case -486391246:
                case 1618726832:
                    C4616.m13552();
                    m2566 = (C2105.m6981("ۛۨ") + i4) * 93;
                    i5 = ((m2566 ^ i3) * 17789) ^ 1412000736;
                    i6 = -1660810912;
                case -434348814:
                case 178794975:
                    if (RunnableC1108.m3790()) {
                        m2566 = C2105.m6981("۫֨") ^ i3;
                        i5 = ((m2566 ^ i4) * 14175) ^ (-1924295998);
                        i6 = 727710844;
                    } else {
                        m2566 = C0630.m2566("ܿ᩷") ^ i3;
                        i5 = ((m2566 ^ i4) * (-23411)) ^ 1124647614;
                        i6 = -1903344105;
                    }
                case -388019251:
                case 875853432:
                    RunnableC1108.m3795(c16560, interfaceC17889, new C8073(c16560));
                    break;
                case -332110908:
                case -255105460:
                    if (C21923.f70183 != 0) {
                        m2566 = C2105.m6981("۫֨") ^ i3;
                        i5 = ((m2566 ^ i4) * 14175) ^ (-1924295998);
                        i6 = 727710844;
                    } else {
                        m2566 = C0630.m2566("᩸ۘ") ^ i3;
                        i5 = ((m2566 ^ i4) * 6111) ^ 924012342;
                        i6 = 1819427418;
                    }
                case -244788460:
                case 1627866271:
                    interfaceC17889 = (InterfaceC17889) obj;
                    if (RunnableC0588.m2441() >= 0) {
                        m2566 = (i3 - C0630.m2566("֡᩺")) * 3;
                        i5 = ((m2566 ^ i4) * (-10351)) ^ 1681695233;
                        i6 = 277780949;
                    } else {
                        m2566 = C2105.m6981("֡ۧ") ^ i4;
                        i5 = ((m2566 ^ i3) * 19779) ^ (-2103354308);
                        i6 = -832298901;
                    }
                case 604497425:
                case 1926810452:
                    C1420.m4913();
                    if (RunnableC3474.f10992 > 0) {
                        m2566 = C2105.m6981("۫֨") ^ i3;
                        i5 = ((m2566 ^ i4) * 14175) ^ (-1924295998);
                        i6 = 727710844;
                    } else {
                        m2566 = (C0630.m2566("ۢ۫") ^ i4) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m2566 ^ i3) * (-32161)) ^ 620508971;
                        i6 = -1011412810;
                    }
                case 1307515020:
                case 1668358943:
                    switch (this.f48927) {
                        case 0:
                            m2566 = C2105.m6981("۫ܳ") ^ i4;
                            i5 = ((m2566 ^ i3) * 8057) ^ (-1502035636);
                            i6 = 1270972872;
                            break;
                        default:
                            m2566 = C2105.m6981("ۙۛ") ^ i3;
                            i5 = ((m2566 ^ i4) * (-20359)) ^ 1020831051;
                            i6 = 1135593296;
                            break;
                    }
                default:
                    if (C3663.m11168() < 0) {
                        m2566 = (C2105.m6981("ۛۨ") + i4) * 93;
                        i5 = ((m2566 ^ i3) * 17789) ^ 1412000736;
                        i6 = -1660810912;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۗۡ")) * 69;
                        i5 = ((m2566 ^ i4) * 16699) ^ (-1384918721);
                        i6 = 1532487317;
                    }
            }
            return;
        }
    }
}
