package l;

import android.content.DialogInterface;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.util.List;

/* compiled from: 05ZQ */
/* renamed from: l.ۗۡܳ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final /* synthetic */ class DialogInterfaceOnClickListenerC3134 implements DialogInterface.OnClickListener {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f9804;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f9805;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f9806;

    public /* synthetic */ DialogInterfaceOnClickListenerC3134(int i, Object obj, Object obj2) {
        int i2 = -169551157;
        int i3 = C2167.f7158;
        int i4 = C3683.f11629;
        this.f9805 = i;
        this.f9806 = obj;
        this.f9804 = obj2;
        int m2566 = (C0630.m2566("֫֫") + i3) * (-49);
        int i5 = ((m2566 ^ i4) * (-3561)) ^ 685695676;
        int i6 = -485350364;
        while (true) {
            i2 = (m2566 ^ i6) ^ (i5 & (((i2 ^ i4) * 28085) >> 31));
            switch (i2) {
                case -2057416322:
                case -1578399309:
                    if (C0483.f2088 >= 0) {
                        m2566 = (C2105.m6981("᩹ۘ") + i4) * (-45);
                        i5 = ((m2566 ^ i3) * 9901) ^ (-1942617224);
                        i6 = -694815991;
                    } else {
                        m2566 = (C0630.m2566("ۖܺ") ^ i4) * 57;
                        i5 = ((m2566 ^ i3) * 24305) ^ 1098641536;
                        i6 = -1206981547;
                    }
                case -988873704:
                case 710017576:
                    C1294.m4372();
                    C3537.m10746();
                    m2566 = C0630.m2566("֨۠") ^ i3;
                    i5 = ((m2566 ^ i4) * (-22113)) ^ 2131270964;
                    i6 = -862068864;
                case -904258924:
                case 701984611:
                    return;
                case -630774705:
                case 1052680631:
                    if (AbstractC2021.f6743 <= 0) {
                        m2566 = C0630.m2566("֨۠") ^ i3;
                        i5 = ((m2566 ^ i4) * (-22113)) ^ 2131270964;
                        i6 = -862068864;
                    } else {
                        m2566 = C2105.m6981("᩶ۜ") ^ i4;
                        i5 = ((m2566 ^ i3) * 16287) ^ 2103743558;
                        i6 = -591630884;
                    }
                case 362820450:
                case 674797335:
                    if (C1504.f5354) {
                        m2566 = C2105.m6981("ۨۖ") ^ i3;
                        i5 = ((m2566 ^ i4) * 1111) ^ 924850595;
                        i6 = 475573456;
                    } else {
                        m2566 = C0630.m2566("֨۠") ^ i3;
                        i5 = ((m2566 ^ i4) * (-22113)) ^ 2131270964;
                        i6 = -862068864;
                    }
                case 365684126:
                case 1913167431:
                    RunnableC1937.m6387();
                    throw new RuntimeException();
                default:
                    C0237.m1481();
                    if (C2520.f8000 < 0) {
                        m2566 = C2105.m6981("᩶ۜ") ^ i4;
                        i5 = ((m2566 ^ i3) * 16287) ^ 2103743558;
                        i6 = -591630884;
                    } else {
                        m2566 = (C0630.m2566("ۤۗ") ^ i3) * 85;
                        i5 = ((m2566 ^ i4) * 19707) ^ 381819684;
                        i6 = 387321230;
                    }
            }
        }
    }

    @Override // android.content.DialogInterface.OnClickListener
    public final void onClick(DialogInterface dialogInterface, int i) {
        final C16560 c16560 = null;
        Object obj = null;
        InterfaceC17889 interfaceC17889 = null;
        AbstractC20546 abstractC20546 = null;
        Object obj2 = null;
        C0421 c0421 = null;
        Object obj3 = null;
        int[] iArr = null;
        int i2 = 259507246;
        int i3 = AbstractC2021.f6743;
        int i4 = C2958.f9394;
        int m6981 = (C2105.m6981("᩹ᩳ") + i4) * (-17);
        int i5 = ((m6981 ^ i3) * 23867) ^ 940655578;
        int i6 = 2100126536;
        while (true) {
            i2 = ((((i2 ^ i3) * (-8873)) >> 31) & i5) ^ (m6981 ^ i6);
            switch (i2) {
                case -2101997832:
                case 1903072380:
                    AbstractC20546.m47039(abstractC20546, (List) obj2, i);
                    break;
                case -1939539357:
                case 1266453490:
                    break;
                case -1902302217:
                case 1411942905:
                    C4616.m13552();
                    if (C3663.m11168() < 0) {
                        m6981 = C0630.m2566("᩸۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 10681) ^ (-793088979);
                        i6 = -1360688382;
                    } else {
                        m6981 = C2105.m6981("ᩳܽ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-28067)) ^ (-1811546022);
                        i6 = -1125963148;
                    }
                case -1825680923:
                case -668470116:
                    if (C2272.f7362) {
                        m6981 = (C0630.m2566("᩸ܶ") + i3) * 89;
                        i5 = ((m6981 ^ i4) * 30141) ^ 1585462683;
                        i6 = -1074463030;
                    } else {
                        m6981 = (C2105.m6981("֫᩸") ^ i4) * (-39);
                        i5 = ((m6981 ^ i3) * 9409) ^ (-2070438237);
                        i6 = 272983404;
                    }
                case -1810855511:
                case 400771059:
                    if (i != 1) {
                        m6981 = (C0630.m2566("᩻ۗ") ^ i3) * 41;
                        i5 = ((m6981 ^ i4) * 6827) ^ (-685892653);
                        i6 = 534369764;
                    } else {
                        m6981 = (C2105.m6981("᩷᩺") ^ i4) * (-109);
                        i5 = ((m6981 ^ i3) * 24493) ^ (-739029407);
                        i6 = -2065745982;
                    }
                case -1718677836:
                case -1588275488:
                    C2272.m7514(c16560, interfaceC17889, new InterfaceC18862() { // from class: l.ۢۡܳ
                        @Override // l.InterfaceC18862
                        /* renamed from: ۧ */
                        public final void mo6267(AbstractC15440 abstractC15440) {
                            C8699.m22483(C16560.this, abstractC15440);
                        }
                    });
                    m6981 = (C0630.m2566("۫ۡ") ^ i4) * 55;
                    i5 = ((m6981 ^ i3) * 11037) ^ (-464701131);
                    i6 = 640372756;
                case -1650501805:
                case 1104166302:
                    ViewOnClickListenerC1958.m6429();
                    if (C4159.f13567) {
                        m6981 = (i4 - C0630.m2566("ܿۖ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m6981 ^ i3) * 5621) ^ (-959196431);
                        i6 = -1117685033;
                    } else {
                        m6981 = C0630.m2566("᩸۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 10681) ^ (-793088979);
                        i6 = -1360688382;
                    }
                case -1648370927:
                case -1139628414:
                    c16560 = (C16560) this.f9806;
                    obj = this.f9804;
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = (C0630.m2566("᩸ܶ") + i3) * 89;
                        i5 = ((m6981 ^ i4) * 30141) ^ 1585462683;
                        i6 = -1074463030;
                    } else {
                        m6981 = C2105.m6981("᩷ۗ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-4511)) ^ (-2059775816);
                        i6 = -1196920987;
                    }
                case -1553512394:
                case 765926982:
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = (C0630.m2566("᩸ܶ") + i3) * 89;
                        i5 = ((m6981 ^ i4) * 30141) ^ 1585462683;
                        i6 = -1074463030;
                    } else {
                        m6981 = (C2105.m6981("ܶۙ") ^ i4) * (-119);
                        i5 = ((m6981 ^ i3) * 2543) ^ (-64068225);
                        i6 = -1080146436;
                    }
                case -1411106589:
                case 768293362:
                    iArr = (int[]) obj3;
                    if (C0964.m3413()) {
                        m6981 = (C2105.m6981("ۢܳ") + i4) * (-97);
                        i5 = ((m6981 ^ i3) * (-23365)) ^ 1666602064;
                        i6 = -552322151;
                    } else {
                        m6981 = C0630.m2566("ܿ᩵") ^ i4;
                        i5 = ((m6981 ^ i3) * 25231) ^ (-998650316);
                        i6 = -1952235711;
                    }
                case -1299452056:
                case 291825006:
                    if (C0964.m3413()) {
                        m6981 = C0630.m2566("ܳۛ") ^ i3;
                        i5 = ((m6981 ^ i4) * 73) ^ 1359363098;
                        i6 = -1679411350;
                    } else {
                        m6981 = (C0630.m2566("᩸ܶ") + i3) * 89;
                        i5 = ((m6981 ^ i4) * 30141) ^ 1585462683;
                        i6 = -1074463030;
                    }
                case -1215686970:
                case 1715820172:
                    switch (this.f9805) {
                        case 0:
                            m6981 = C2105.m6981("ܳۜ") ^ i3;
                            i5 = ((m6981 ^ i4) * 19283) ^ 812051700;
                            i6 = -887770469;
                            break;
                        case 1:
                            m6981 = C0630.m2566("ۨ᩶") ^ i3;
                            i5 = ((m6981 ^ i4) * (-24017)) ^ (-209886401);
                            i6 = -1281136552;
                            break;
                        default:
                            m6981 = (C0630.m2566("ۛۨ") ^ i3) * 49;
                            i5 = ((m6981 ^ i4) * 15263) ^ (-780443393);
                            i6 = 1571991325;
                            break;
                    }
                case -1033657791:
                case 1464030824:
                    c0421.accept(iArr[0]);
                    break;
                case -983934857:
                case 1787554041:
                    if (C4263.f13799 <= 0) {
                        m6981 = (i4 - C0630.m2566("ܿۖ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m6981 ^ i3) * 5621) ^ (-959196431);
                        i6 = -1117685033;
                    } else {
                        m6981 = C2105.m6981("ܰۜ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-11665)) ^ (-964464649);
                        i6 = -1647593104;
                    }
                case -979955296:
                case -17560589:
                    if (i != 2) {
                        m6981 = (C2105.m6981("ܰ᩵") + i3) * (-31);
                        i5 = ((m6981 ^ i4) * (-8175)) ^ 2113374244;
                        i6 = -1395721117;
                    } else {
                        m6981 = (C0630.m2566("ܰۛ") + i4) * (-75);
                        i5 = ((m6981 ^ i3) * (-17129)) ^ (-1185902490);
                        i6 = -16109420;
                    }
                case -886509933:
                case 1630837227:
                    c0421 = (C0421) this.f9806;
                    obj3 = this.f9804;
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("᩸۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 10681) ^ (-793088979);
                        i6 = -1360688382;
                    } else {
                        m6981 = (C0630.m2566("ۡ᩶") ^ i4) * (-101);
                        i5 = ((m6981 ^ i3) * 219) ^ 739554022;
                        i6 = 1682583652;
                    }
                case -882781345:
                case 1432433504:
                    if (C1711.f5919) {
                        m6981 = C2105.m6981("ᩳܽ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-28067)) ^ (-1811546022);
                        i6 = -1125963148;
                    } else {
                        m6981 = C0630.m2566("ۡ֨") ^ i4;
                        i5 = ((m6981 ^ i3) * (-25507)) ^ (-1633613513);
                        i6 = -662364618;
                    }
                case -850632991:
                case 1035038727:
                    if (C0714.f2697 >= 0) {
                        m6981 = (i4 - C0630.m2566("ܿۖ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m6981 ^ i3) * 5621) ^ (-959196431);
                        i6 = -1117685033;
                    } else {
                        m6981 = (C2105.m6981("ۙ᩻") ^ i3) * (-43);
                        i5 = ((m6981 ^ i4) * (-16941)) ^ 371855455;
                        i6 = -498074640;
                    }
                case -822398784:
                case 771003307:
                    if (i != 3) {
                        m6981 = (C0630.m2566("۫ۡ") ^ i4) * 55;
                        i5 = ((m6981 ^ i3) * 11037) ^ (-464701131);
                        i6 = 640372756;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۡۤ")) * (-79);
                        i5 = ((m6981 ^ i4) * (-25555)) ^ 1710938687;
                        i6 = -668029996;
                    }
                case -818696404:
                case -452389035:
                    abstractC20546 = (AbstractC20546) this.f9806;
                    obj2 = this.f9804;
                    if (C3683.f11629 >= 0) {
                        m6981 = C0630.m2566("ܿ᩵") ^ i4;
                        i5 = ((m6981 ^ i3) * 25231) ^ (-998650316);
                        i6 = -1952235711;
                    } else {
                        m6981 = (C2105.m6981("ܶܽ") ^ i4) * 55;
                        i5 = ((m6981 ^ i3) * 251) ^ 202430213;
                        i6 = 686619592;
                    }
                case -779314114:
                case 1444897271:
                    RunnableC1108.m3795(c16560, interfaceC17889, new C14873(3, c16560));
                    m6981 = (C0630.m2566("۫ۡ") ^ i4) * 55;
                    i5 = ((m6981 ^ i3) * 11037) ^ (-464701131);
                    i6 = 640372756;
                case -493974640:
                case 1272709736:
                    C19568.m45015(c16560, interfaceC17889);
                    m6981 = (C0630.m2566("۫ۡ") ^ i4) * 55;
                    i5 = ((m6981 ^ i3) * 11037) ^ (-464701131);
                    i6 = 640372756;
                case -492749858:
                case 1300860594:
                    interfaceC17889 = (InterfaceC17889) obj;
                    dialogInterface.dismiss();
                    if (i != 0) {
                        m6981 = (i3 - C2105.m6981("ۖۧ")) * 39;
                        i5 = ((m6981 ^ i4) * 26545) ^ (-56032029);
                        i6 = -1479930185;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۗ۬")) * 97;
                        i5 = ((m6981 ^ i4) * 2877) ^ (-1761605939);
                        i6 = 885252702;
                    }
                case -364208419:
                case -33229311:
                    RunnableC0588.m2441();
                    m6981 = C0630.m2566("᩸۫") ^ i4;
                    i5 = ((m6981 ^ i3) * 10681) ^ (-793088979);
                    i6 = -1360688382;
                case 252658084:
                case 1539599078:
                    C3911.m11924();
                    break;
                case 286074858:
                case 2122391232:
                    if (C7811.f24123 >= 0) {
                        m6981 = C0630.m2566("᩸۫") ^ i4;
                        i5 = ((m6981 ^ i3) * 10681) ^ (-793088979);
                        i6 = -1360688382;
                    } else {
                        m6981 = (C0630.m2566("᩸ܶ") + i3) * 89;
                        i5 = ((m6981 ^ i4) * 30141) ^ 1585462683;
                        i6 = -1074463030;
                    }
                default:
                    C19568.m45007(c16560, interfaceC17889, ActivityC16315.class);
                    m6981 = (C0630.m2566("۫ۡ") ^ i4) * 55;
                    i5 = ((m6981 ^ i3) * 11037) ^ (-464701131);
                    i6 = 640372756;
            }
            return;
        }
    }
}
