package l;

import android.app.Activity;
import android.graphics.SurfaceTexture;

/* compiled from: E4FN */
/* renamed from: l.ܳ֨ۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC14191 implements Runnable {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f42841;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f42842;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f42843;

    @Override // java.lang.Runnable
    public final void run() {
        Activity activity = null;
        Object obj = null;
        C0405 c0405 = null;
        Object obj2 = null;
        C20005 c20005 = null;
        Object obj3 = null;
        ActivityC17169 activityC17169 = null;
        Object obj4 = null;
        int i = 1703940674;
        int i2 = C2520.f8000;
        int i3 = C5695.f17556;
        int m6981 = C2105.m6981("۬ۤ") ^ i2;
        int i4 = ((m6981 ^ i3) * (-2361)) ^ (-1968663092);
        int i5 = -443301784;
        while (true) {
            i = ((((i ^ i3) * (-29473)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2093227798:
                case -599831865:
                    obj = this.f42841;
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ܰ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28789)) ^ 2091813366;
                        i5 = 1566952725;
                    } else {
                        m6981 = C0630.m2566("۟۟") ^ i3;
                        i4 = ((m6981 ^ i2) * (-17915)) ^ 910168854;
                        i5 = 1975707492;
                    }
                case -2003112297:
                case -660963370:
                    obj3 = this.f42841;
                    if (C0964.f3626 != 0) {
                        m6981 = C0630.m2566("ۖ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 21865) ^ 664461229;
                        i5 = 1054184540;
                    } else {
                        m6981 = (C0630.m2566("۠᩻") ^ i3) * (-13);
                        i4 = ((m6981 ^ i2) * 16387) ^ (-2122185805);
                        i5 = 1823168109;
                    }
                case -1736366903:
                case 879433642:
                    C20005.m46137(c20005, (SurfaceTexture) obj3);
                    break;
                case -1728766765:
                case 1847262890:
                    C2405.m7788(activity, (InterfaceC9461) obj);
                    break;
                case -1593783271:
                case 1658048681:
                    C0405.m1904(c0405, (C3519) obj2);
                    break;
                case -1425492674:
                case -681152709:
                    if (C1420.f5096 <= 0) {
                        m6981 = C0630.m2566("ۖ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 21865) ^ 664461229;
                        i5 = 1054184540;
                    } else {
                        m6981 = C0630.m2566("ۚܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15443) ^ (-1565816807);
                        i5 = -907983355;
                    }
                case -1336798198:
                case 197449029:
                    C0382.m1848();
                    if (C7811.f24123 < 0) {
                        m6981 = C0630.m2566("ۚܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15443) ^ (-1565816807);
                        i5 = -907983355;
                    } else {
                        m6981 = C2105.m6981("ܳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-18243)) ^ 569625166;
                        i5 = 978433736;
                    }
                case -1330207913:
                case 2018502522:
                    if (C4075.m12263() <= 0) {
                        m6981 = C2105.m6981("ܰ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28789)) ^ 2091813366;
                        i5 = 1566952725;
                    } else {
                        m6981 = C2105.m6981("᩷֫") ^ i2;
                        i4 = ((m6981 ^ i3) * 8883) ^ 1690955578;
                        i5 = 1691769283;
                    }
                case -1250839956:
                case 1904656126:
                    C22628.m50615();
                    break;
                case -1082356088:
                case -25878793:
                    activityC17169 = (ActivityC17169) this.f42843;
                    if (AbstractC2021.m6574()) {
                        m6981 = C0630.m2566("ۖ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 21865) ^ 664461229;
                        i5 = 1054184540;
                    } else {
                        m6981 = (i2 - C0630.m2566("ۧۨ")) * (-73);
                        i4 = ((m6981 ^ i3) * (-1217)) ^ 1231957428;
                        i5 = -1313109384;
                    }
                case -753910544:
                case 1816371915:
                    c20005 = (C20005) this.f42843;
                    if (C21923.m49329()) {
                        m6981 = C2105.m6981("ܰ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28789)) ^ 2091813366;
                        i5 = 1566952725;
                    } else {
                        m6981 = C0630.m2566("᩺ۜ") ^ i2;
                        i4 = ((m6981 ^ i3) * 18233) ^ 1357927576;
                        i5 = 54336865;
                    }
                case -566593368:
                case 340644831:
                    C22628.m50615();
                    C4117.m12364();
                    m6981 = C0630.m2566("ۖ᩺") ^ i2;
                    i4 = ((m6981 ^ i3) * 21865) ^ 664461229;
                    i5 = 1054184540;
                case -417805109:
                case 2078587067:
                    c0405 = (C0405) this.f42843;
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = C0630.m2566("ۚܺ") ^ i2;
                        i4 = ((m6981 ^ i3) * 15443) ^ (-1565816807);
                        i5 = -907983355;
                    } else {
                        m6981 = C0630.m2566("ۘۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-26503)) ^ (-1828876235);
                        i5 = -79947969;
                    }
                case -277763197:
                case 2022813868:
                    if (C3683.f11629 >= 0) {
                        m6981 = C0630.m2566("ۛۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28407)) ^ 228046761;
                        i5 = 856523666;
                    } else {
                        m6981 = (C2105.m6981("ۜۗ") + i3) * (-107);
                        i4 = ((m6981 ^ i2) * 8337) ^ 482004835;
                        i5 = 1520590800;
                    }
                case 369880471:
                case 707445950:
                    obj2 = this.f42841;
                    if (C2105.f7037 != 0) {
                        m6981 = C2105.m6981("ܰ᩸") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28789)) ^ 2091813366;
                        i5 = 1566952725;
                    } else {
                        m6981 = C2105.m6981("ᩳ۬") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28823)) ^ (-410559014);
                        i5 = -378265052;
                    }
                case 415794197:
                case 1849152836:
                    switch (this.f42842) {
                        case 0:
                            m6981 = C0630.m2566("᩸ᩴ") ^ i2;
                            i4 = ((m6981 ^ i3) * 25987) ^ (-2081181831);
                            i5 = -630596695;
                            break;
                        case 1:
                            m6981 = (C2105.m6981("ᩴۨ") + i2) * 19;
                            i4 = ((m6981 ^ i3) * 29067) ^ 1002800469;
                            i5 = -1168051565;
                            break;
                        case 2:
                            m6981 = C0630.m2566("ۧᩴ") ^ i3;
                            i4 = ((m6981 ^ i2) * 23891) ^ 247693201;
                            i5 = -2123074831;
                            break;
                        default:
                            m6981 = C2105.m6981("ۧ᩵") ^ i2;
                            i4 = ((m6981 ^ i3) * (-31811)) ^ (-1499308282);
                            i5 = 886617778;
                            break;
                    }
                case 557657137:
                case 1111840241:
                    C11340.m28031();
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = C0630.m2566("ۖ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * 21865) ^ 664461229;
                        i5 = 1054184540;
                    } else {
                        m6981 = C0630.m2566("ۛۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28407)) ^ 228046761;
                        i5 = 856523666;
                    }
                case 1372478721:
                case 1607859461:
                    activity = (Activity) this.f42843;
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C2105.m6981("ܳ᩷") ^ i3;
                        i4 = ((m6981 ^ i2) * (-18243)) ^ 569625166;
                        i5 = 978433736;
                    } else {
                        m6981 = C2105.m6981("ܽᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2579)) ^ 1822428188;
                        i5 = -1787281925;
                    }
                case 1678418062:
                case 1772980655:
                    ((C12366) obj4).m30037(activityC17169, activityC17169.f52602);
                    break;
                default:
                    obj4 = this.f42841;
                    if (C11340.f33930 >= 0) {
                        m6981 = C0630.m2566("ۛۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28407)) ^ 228046761;
                        i5 = 856523666;
                    } else {
                        m6981 = C0630.m2566("ܰۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-9931)) ^ (-654478442);
                        i5 = -1992465055;
                    }
            }
            return;
        }
    }

    public /* synthetic */ RunnableC14191(int i, Object obj, Object obj2) {
        int i2 = -2127730887;
        int i3 = C22628.f73083;
        int i4 = RunnableC1937.f6483;
        this.f42842 = i;
        this.f42843 = obj;
        this.f42841 = obj2;
        int m2566 = (C0630.m2566("ۧᩴ") + i3) * (-51);
        int i5 = ((m2566 ^ i4) * (-16885)) ^ (-523521992);
        int i6 = -1947847599;
        while (true) {
            i2 = (m2566 ^ i6) ^ (i5 & (((i2 ^ i4) * 15211) >> 31));
            switch (i2) {
                case -1383635705:
                case -931950783:
                    if (C7811.f24123 >= 0) {
                        m2566 = (C2105.m6981("᩵ۗ") + i4) * (-97);
                        i5 = ((m2566 ^ i3) * 13757) ^ (-1338606453);
                        i6 = -1234147662;
                    } else {
                        m2566 = C0630.m2566("ۢ۫") ^ i3;
                        i5 = ((m2566 ^ i4) * 15137) ^ (-913986784);
                        i6 = -365653969;
                    }
                case -799637898:
                case 18838502:
                    if (C0964.f3626 != 0) {
                        m2566 = (C2105.m6981("ۢ᩻") ^ i3) * (-39);
                        i5 = ((m2566 ^ i4) * 32573) ^ (-375429559);
                        i6 = -678152768;
                    } else {
                        m2566 = (i3 - C2105.m6981("ۜܿ")) * 39;
                        i5 = ((m2566 ^ i4) * (-23373)) ^ (-735200327);
                        i6 = 1451443403;
                    }
                case -710547555:
                case 723547295:
                    C2105.m6982();
                    C7106.m19120();
                    throw new RuntimeException();
                case -539538811:
                case 857199653:
                    return;
                case -486509084:
                case -194520111:
                    if (C4117.f13076 <= 0) {
                        m2566 = C2105.m6981("ۚۘ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-25439)) ^ (-597888427);
                        i6 = -1161596789;
                    } else {
                        m2566 = (C2105.m6981("ۢ᩻") ^ i3) * (-39);
                        i5 = ((m2566 ^ i4) * 32573) ^ (-375429559);
                        i6 = -678152768;
                    }
                case 500387306:
                case 1901650083:
                    C3911.m11924();
                    C2105.m6982();
                    m2566 = C2105.m6981("ۚۘ") ^ i4;
                    i5 = ((m2566 ^ i3) * (-25439)) ^ (-597888427);
                    i6 = -1161596789;
                default:
                    if (C0714.f2697 >= 0) {
                        m2566 = (C2105.m6981("ۢ᩻") ^ i3) * (-39);
                        i5 = ((m2566 ^ i4) * 32573) ^ (-375429559);
                        i6 = -678152768;
                    } else {
                        m2566 = C2105.m6981("᩵۠") ^ i4;
                        i5 = ((m2566 ^ i3) * 14699) ^ 2088458019;
                        i6 = 1927320005;
                    }
            }
        }
    }
}
