package l;

import bin.mt.plus.Main;
import com.umeng.commonsdk.statistics.UMErrorCode;

/* compiled from: V6B4 */
/* renamed from: l.ۜ۠᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final /* synthetic */ class RunnableC6648 implements Runnable {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f20620;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f20621;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f20622;

    public /* synthetic */ RunnableC6648(int i, AbstractActivityC3346 abstractActivityC3346, Object obj) {
        int i2 = -1016775105;
        int i3 = C3432.f10845;
        int i4 = C1294.f4556;
        this.f20621 = i;
        this.f20622 = abstractActivityC3346;
        this.f20620 = obj;
        int m2566 = (i4 - C0630.m2566("᩻۬")) * (-5);
        int i5 = ((m2566 ^ i3) * 27883) ^ (-1710283436);
        int i6 = 675761972;
        while (true) {
            i2 = (m2566 ^ i6) ^ (i5 & (((i2 ^ i3) * 26863) >> 31));
            switch (i2) {
                case -2126380594:
                case 4658647:
                    if (C0798.f2919) {
                        m2566 = (C0630.m2566("᩹ۙ") + i4) * (-55);
                        i5 = ((m2566 ^ i3) * 2351) ^ 1481057212;
                        i6 = -1340738588;
                    } else {
                        m2566 = (i4 - C2105.m6981("ۢܿ")) * (-77);
                        i5 = ((m2566 ^ i3) * (-17811)) ^ (-1261460611);
                        i6 = -1081349755;
                    }
                case -1700200596:
                case -1130114294:
                    if (C1420.f5096 <= 0) {
                        m2566 = C0630.m2566("֫ۧ") ^ i4;
                        i5 = ((m2566 ^ i3) * 28013) ^ (-921665136);
                        i6 = -1939225648;
                    } else {
                        m2566 = C0630.m2566("֡ۙ") ^ i3;
                        i5 = ((m2566 ^ i4) * 26897) ^ 893526058;
                        i6 = -1849952790;
                    }
                case -1639770616:
                case -450332209:
                    C1504.m5179();
                    RunnableC3474.m10630();
                    m2566 = (C0630.m2566("᩹ۙ") + i4) * (-55);
                    i5 = ((m2566 ^ i3) * 2351) ^ 1481057212;
                    i6 = -1340738588;
                case -730142809:
                case 1196659646:
                    C3911.m11924();
                    C3245.m9925();
                    throw new RuntimeException();
                case 226832998:
                case 480960552:
                    if (C3746.f11829 > 0) {
                        m2566 = (i4 - C2105.m6981("ۢܿ")) * (-77);
                        i5 = ((m2566 ^ i3) * (-17811)) ^ (-1261460611);
                        i6 = -1081349755;
                    } else {
                        m2566 = C0630.m2566("ᩴ֫") ^ i3;
                        i5 = ((m2566 ^ i4) * 12309) ^ (-1652873507);
                        i6 = -1253017784;
                    }
                case 615455642:
                case 1307708091:
                    return;
                default:
                    if (C3663.m11168() < 0) {
                        m2566 = (C0630.m2566("᩹ۙ") + i4) * (-55);
                        i5 = ((m2566 ^ i3) * 2351) ^ 1481057212;
                        i6 = -1340738588;
                    } else {
                        m2566 = (C2105.m6981("ۚۘ") + i3) * 7;
                        i5 = ((m2566 ^ i4) * 28667) ^ (-660755499);
                        i6 = -281109278;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        int i = 0;
        Object obj = null;
        AbstractActivityC3346 abstractActivityC3346 = null;
        Main main = null;
        Runnable runnable = null;
        boolean z = false;
        int i2 = 230987254;
        int i3 = C2520.f8000;
        int i4 = C4117.f13076;
        int m6981 = (C2105.m6981("ۘۖ") + i4) * 89;
        int i5 = ((m6981 ^ i3) * (-2053)) ^ 440816958;
        int i6 = 1458587152;
        while (true) {
            i2 = ((((i2 ^ i3) * 20029) >> 31) & i5) ^ (m6981 ^ i6);
            switch (i2) {
                case -2113666805:
                case -419447458:
                    ((RunnableC9949) runnable).run();
                    m6981 = (C2105.m6981("ۨۡ") ^ i3) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                    i5 = ((m6981 ^ i4) * 2773) ^ (-1450797767);
                    i6 = 1608709190;
                case -2072734672:
                case 1601122691:
                    break;
                case -1932762357:
                case 441469509:
                    if (C3432.m10477() <= 0) {
                        m6981 = C0630.m2566("ۧܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                        i6 = 695177803;
                    } else {
                        m6981 = (C2105.m6981("ܺ֫") + i4) * 65;
                        i5 = ((m6981 ^ i3) * 22599) ^ (-829630025);
                        i6 = -1298850892;
                    }
                case -1845097489:
                case 957872543:
                    if (C3432.f10845 >= 0) {
                        m6981 = C2105.m6981("ۙۡ") ^ i3;
                        i5 = ((m6981 ^ i4) * 22603) ^ (-1414354847);
                        i6 = 967375324;
                    } else {
                        m6981 = C2105.m6981("᩶۟") ^ i4;
                        i5 = ((m6981 ^ i3) * 10697) ^ 22172778;
                        i6 = -1051430218;
                    }
                case -1841999223:
                case 926973847:
                    if (C1420.m4913()) {
                        m6981 = (C2105.m6981("֡ۙ") ^ i4) * (-65);
                        i5 = ((m6981 ^ i3) * 745) ^ (-1317380896);
                        i6 = -1400119998;
                    } else {
                        m6981 = (C2105.m6981("ܺۖ") ^ i4) * (-69);
                        i5 = ((m6981 ^ i3) * (-16699)) ^ 1109723136;
                        i6 = -1411755620;
                    }
                case -1754098242:
                case 1406535279:
                    C17709.m41435((ViewOnClickListenerC19121) abstractActivityC3346, (C17709) obj);
                    break;
                case -1751198920:
                case 476676472:
                    if (C3537.f11231 >= 0) {
                        m6981 = (C2105.m6981("֡ۙ") ^ i4) * (-65);
                        i5 = ((m6981 ^ i3) * 745) ^ (-1317380896);
                        i6 = -1400119998;
                    } else {
                        m6981 = C2105.m6981("ᩳ۬") ^ i3;
                        i5 = ((m6981 ^ i4) * (-3023)) ^ (-2095492263);
                        i6 = -84336310;
                    }
                case -1614485016:
                case -1307776352:
                    if (RunnableC1937.f6483 < 0) {
                        m6981 = C0630.m2566("ۧܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                        i6 = 695177803;
                    } else {
                        m6981 = C0630.m2566("ۖۧ") ^ i3;
                        i5 = ((m6981 ^ i4) * 3391) ^ 1786342149;
                        i6 = 1295061755;
                    }
                case -1590537947:
                case -963313538:
                    C2105.m6982();
                    m6981 = C0630.m2566("ۧܽ") ^ i4;
                    i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                    i6 = 695177803;
                case -1302349993:
                case 2141640154:
                    RunnableC0588.m2441();
                    break;
                case -1259462716:
                case 812327749:
                    if (C3019.m9255() <= 0) {
                        m6981 = C0630.m2566("ۧܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                        i6 = 695177803;
                    } else {
                        m6981 = (i3 - C2105.m6981("ܳ᩹")) * (-93);
                        i5 = ((m6981 ^ i4) * (-13201)) ^ (-2071685075);
                        i6 = 448041741;
                    }
                case -1238699376:
                case -693730892:
                    C7925.m21215(main, z, false, runnable);
                    m6981 = (C2105.m6981("ۨۡ") ^ i3) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                    i5 = ((m6981 ^ i4) * 2773) ^ (-1450797767);
                    i6 = 1608709190;
                case -1175103304:
                case 1372718502:
                    main = (Main) abstractActivityC3346;
                    runnable = (Runnable) obj;
                    if (RunnableC1108.m3790()) {
                        m6981 = (C2105.m6981("֡ۙ") ^ i4) * (-65);
                        i5 = ((m6981 ^ i3) * 745) ^ (-1317380896);
                        i6 = -1400119998;
                    } else {
                        m6981 = (C2105.m6981("ܿۛ") + i3) * (-111);
                        i5 = ((m6981 ^ i4) * 11705) ^ (-392595161);
                        i6 = 1519684721;
                    }
                case -1140879892:
                case 1122197775:
                    if (C1420.f5096 <= 0) {
                        m6981 = C0630.m2566("ۧܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                        i6 = 695177803;
                    } else {
                        m6981 = (C0630.m2566("ۛ᩵") ^ i3) * 19;
                        i5 = ((m6981 ^ i4) * 16285) ^ (-1814627545);
                        i6 = 1785635197;
                    }
                case -1022733900:
                case -901183695:
                    int i7 = C11182.f33563;
                    z = true;
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (C2105.m6981("֡ۙ") ^ i4) * (-65);
                        i5 = ((m6981 ^ i3) * 745) ^ (-1317380896);
                        i6 = -1400119998;
                    } else {
                        m6981 = C2105.m6981("ܶ۬") ^ i3;
                        i5 = ((m6981 ^ i4) * (-30479)) ^ 1730472465;
                        i6 = 1032772786;
                    }
                case -948406124:
                case 1902040007:
                    obj = this.f20620;
                    abstractActivityC3346 = this.f20622;
                    switch (i) {
                        case 0:
                            m6981 = (i4 - C2105.m6981("ܽܿ")) * 37;
                            i5 = ((m6981 ^ i3) * (-18181)) ^ (-620457919);
                            i6 = 854886145;
                            break;
                        default:
                            m6981 = (C0630.m2566("᩷۫") + i3) * 87;
                            i5 = ((m6981 ^ i4) * 19905) ^ (-1166199506);
                            i6 = 634337399;
                            break;
                    }
                case 2979364:
                case 1157750366:
                    if (main.isDestroyed()) {
                        m6981 = (C0630.m2566("ۗۧ") + i4) * (-83);
                        i5 = ((m6981 ^ i3) * (-6019)) ^ 1865839158;
                        i6 = 983850325;
                    } else {
                        m6981 = C0630.m2566("ۘ᩸") ^ i4;
                        i5 = ((m6981 ^ i3) * 8621) ^ (-1053974126);
                        i6 = -1782372941;
                    }
                case 700205217:
                case 1012735865:
                    int i8 = Main.f30;
                    if (C4117.m12349(main)) {
                        m6981 = (C0630.m2566("ۗۧ") + i4) * (-83);
                        i5 = ((m6981 ^ i3) * (-6019)) ^ 1865839158;
                        i6 = 983850325;
                    } else {
                        m6981 = (C2105.m6981("ܺ۬") ^ i4) * 37;
                        i5 = ((m6981 ^ i3) * 30033) ^ 399168087;
                        i6 = -1959555475;
                    }
                case 1059814057:
                case 1607039431:
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = (i4 - C0630.m2566("ᩴۡ")) * 19;
                        i5 = ((m6981 ^ i3) * (-25915)) ^ 1374319327;
                        i6 = 473672617;
                    } else {
                        m6981 = (i4 - C2105.m6981("ۚܺ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                        i5 = ((m6981 ^ i3) * 19583) ^ 267491661;
                        i6 = 2005642120;
                    }
                case 1130317054:
                case 1516309763:
                    C0798.m2998();
                    if (C5695.f17556 < 0) {
                        m6981 = C2105.m6981("ۙۡ") ^ i3;
                        i5 = ((m6981 ^ i4) * 22603) ^ (-1414354847);
                        i6 = 967375324;
                    } else {
                        m6981 = (i4 - C0630.m2566("ᩴۡ")) * 19;
                        i5 = ((m6981 ^ i3) * (-25915)) ^ 1374319327;
                        i6 = 473672617;
                    }
                case 1633777466:
                case 1820504423:
                    C7811.m20844();
                    if (C2105.f7037 != 0) {
                        m6981 = C0630.m2566("ۧܽ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-1174891156);
                        i6 = 695177803;
                    } else {
                        m6981 = C2105.m6981("ۙۡ") ^ i3;
                        i5 = ((m6981 ^ i4) * 22603) ^ (-1414354847);
                        i6 = 967375324;
                    }
                default:
                    i = this.f20621;
                    if (C3663.m11168() >= 0) {
                        m6981 = C2105.m6981("ۙۡ") ^ i3;
                        i5 = ((m6981 ^ i4) * 22603) ^ (-1414354847);
                        i6 = 967375324;
                    } else {
                        m6981 = (C0630.m2566("ۗ۟") ^ i3) * 77;
                        i5 = ((m6981 ^ i4) * 15177) ^ 2056111117;
                        i6 = 436857033;
                    }
            }
            return;
        }
    }
}
