package l;

import bin.mt.plus.Main;
import moe.shizuku.server.IShizukuService;

/* compiled from: V6B4 */
/* renamed from: l.۠֨᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC7852 implements Runnable {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f24341;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f24342;

    public /* synthetic */ RunnableC7852(AbstractActivityC3346 abstractActivityC3346, int i) {
        int i2 = 935299060;
        int i3 = RunnableC0588.f2309;
        int i4 = C5695.f17556;
        this.f24341 = i;
        this.f24342 = abstractActivityC3346;
        int m2566 = C0630.m2566("᩷ܽ") ^ i3;
        int i5 = ((m2566 ^ i4) * 24063) ^ 1097182423;
        int i6 = -1406590585;
        while (true) {
            i2 = (m2566 ^ i6) ^ (i5 & (((i2 ^ i4) * (-21005)) >> 31));
            switch (i2) {
                case -1782655237:
                case 902948238:
                    if (C4263.f13799 <= 0) {
                        m2566 = C0630.m2566("᩸ܳ") ^ i4;
                        i5 = ((m2566 ^ i3) * 7913) ^ (-743415001);
                        i6 = -1034799367;
                    } else {
                        m2566 = C2105.m6981("ۤ֫") ^ i4;
                        i5 = ((m2566 ^ i3) * 3535) ^ (-1667176221);
                        i6 = -1332854686;
                    }
                case -723836420:
                case -523485070:
                    C2167.m7155();
                    if (C3432.f10845 < 0) {
                        m2566 = (C0630.m2566("ܽ᩵") + i3) * (-111);
                        i5 = ((m2566 ^ i4) * (-13873)) ^ (-971277515);
                        i6 = -1129410607;
                    } else {
                        m2566 = C2105.m6981("ۢۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-5845)) ^ 555041324;
                        i6 = -145415757;
                    }
                case 204266208:
                case 1572453234:
                    return;
                case 442686929:
                case 1922738066:
                    C0237.m1481();
                    C2520.m8026();
                    m2566 = (C0630.m2566("ܽ᩵") + i3) * (-111);
                    i5 = ((m2566 ^ i4) * (-13873)) ^ (-971277515);
                    i6 = -1129410607;
                case 667100997:
                case 1449531908:
                    RunnableC3474.m10630();
                    if (C11340.m28031()) {
                        m2566 = C2105.m6981("ۧۗ") ^ i3;
                        i5 = ((m2566 ^ i4) * 8471) ^ (-22343402);
                        i6 = 2033672973;
                    } else {
                        m2566 = C2105.m6981("ۢۗ") ^ i4;
                        i5 = ((m2566 ^ i3) * (-5845)) ^ 555041324;
                        i6 = -145415757;
                    }
                case 795225365:
                case 1361106121:
                    if (C22628.m50615() != 0) {
                        m2566 = C2105.m6981("ۧۗ") ^ i3;
                        i5 = ((m2566 ^ i4) * 8471) ^ (-22343402);
                        i6 = 2033672973;
                    } else {
                        m2566 = (C0630.m2566("ۡ۠") + i3) * (-43);
                        i5 = ((m2566 ^ i4) * (-13745)) ^ (-1644627874);
                        i6 = 88355619;
                    }
                default:
                    C1005.m3501();
                    C4616.m13552();
                    throw new RuntimeException();
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        Main main = null;
        int i = -874599631;
        int i2 = C0050.f910;
        int i3 = C3683.f11629;
        int m2566 = C0630.m2566("᩷᩵") ^ i2;
        int i4 = ((m2566 ^ i3) * (-26245)) ^ (-630475806);
        int i5 = 65942840;
        while (true) {
            i = ((((i ^ i3) * (-28893)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -2115514191:
                case 49655499:
                    C4159.m12565();
                    break;
                case -1992379936:
                case -281906839:
                    if (C1504.f5354) {
                        m2566 = C2105.m6981("ܺ۬") ^ i3;
                        i4 = ((m2566 ^ i2) * 11035) ^ 235093853;
                        i5 = -2077750351;
                    } else {
                        m2566 = (C2105.m6981("ܿ᩸") + i3) * (-123);
                        i4 = ((m2566 ^ i2) * 7113) ^ 284017529;
                        i5 = -99341818;
                    }
                case -1751972725:
                case -1485684795:
                    if (C0630.f2410 <= 0) {
                        m2566 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1533)) ^ 148455730;
                        i5 = -740219383;
                    } else {
                        m2566 = C0630.m2566("ۢ᩻") ^ i2;
                        i4 = ((m2566 ^ i3) * (-27055)) ^ 587025860;
                        i5 = -1299711426;
                    }
                case -1383687303:
                case 1618020084:
                    if (C0964.f3626 != 0) {
                        m2566 = (C0630.m2566("۫۟") + i2) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * (-20165)) ^ (-1384117530);
                        i5 = -1540195534;
                    } else {
                        m2566 = C0630.m2566("᩷᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * (-9863)) ^ (-1595527893);
                        i5 = -703608905;
                    }
                case -1226569873:
                case 2138829537:
                    C1420.m4913();
                    C2272.m7503();
                    m2566 = (C0630.m2566("۫۟") + i2) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                    i4 = ((m2566 ^ i3) * (-20165)) ^ (-1384117530);
                    i5 = -1540195534;
                case -985747432:
                case 528105341:
                    if (C1916.f6442) {
                        m2566 = (i3 - C2105.m6981("᩸᩸")) * (-87);
                        i4 = ((m2566 ^ i2) * (-7809)) ^ 4074904;
                        i5 = -2070508270;
                    } else {
                        m2566 = C2105.m6981("ۚۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * 24329) ^ (-1267173139);
                        i5 = -1642932686;
                    }
                case -864815516:
                case 1419908965:
                    ((ViewOnClickListenerC7042) this.f24342).m19014();
                    break;
                case -440118993:
                case 1890528430:
                    if (C0382.f1805) {
                        m2566 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1533)) ^ 148455730;
                        i5 = -740219383;
                    } else {
                        m2566 = (i3 - C0630.m2566("ܰܶ")) * 95;
                        i4 = ((m2566 ^ i2) * (-29577)) ^ 538475760;
                        i5 = 149921238;
                    }
                case -12032339:
                case 1125171943:
                    switch (this.f24341) {
                        case 0:
                            m2566 = C0630.m2566("ۤۡ") ^ i2;
                            i4 = ((m2566 ^ i3) * (-12907)) ^ (-627372133);
                            i5 = -676001798;
                            break;
                        case 1:
                            m2566 = C2105.m6981("ۘ֨") ^ i2;
                            i4 = ((m2566 ^ i3) * (-30631)) ^ (-1175096074);
                            i5 = -1451112556;
                            break;
                        default:
                            m2566 = C0630.m2566("ۤ۫") ^ i3;
                            i4 = ((m2566 ^ i2) * 28281) ^ (-319693672);
                            i5 = 955575054;
                            break;
                    }
                case 68491040:
                case 722519756:
                    main = (Main) this.f24342;
                    if (C4075.f12947 >= 0) {
                        m2566 = C2105.m6981("ܺ۬") ^ i3;
                        i4 = ((m2566 ^ i2) * 11035) ^ 235093853;
                        i5 = -2077750351;
                    } else {
                        m2566 = (C0630.m2566("֡ܳ") + i3) * 5;
                        i4 = ((m2566 ^ i2) * (-26639)) ^ 2083611262;
                        i5 = -1024406523;
                    }
                case 73046558:
                case 451538480:
                    if (C0714.f2697 >= 0) {
                        m2566 = C2105.m6981("ܺ۬") ^ i3;
                        i4 = ((m2566 ^ i2) * 11035) ^ 235093853;
                        i5 = -2077750351;
                    } else {
                        m2566 = C2105.m6981("᩹ۙ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-9211)) ^ 35973943;
                        i5 = 328488866;
                    }
                case 94433351:
                case 1310853292:
                    if (C4159.f13567) {
                        m2566 = C0630.m2566("᩸᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * (-26863)) ^ (-634986697);
                        i5 = -416032252;
                    } else {
                        m2566 = (i3 - C0630.m2566("ܰܶ")) * 95;
                        i4 = ((m2566 ^ i2) * (-29577)) ^ 538475760;
                        i5 = 149921238;
                    }
                case 212004648:
                case 330781972:
                    if (C1504.f5354) {
                        m2566 = (i3 - C0630.m2566("ܰܶ")) * 95;
                        i4 = ((m2566 ^ i2) * (-29577)) ^ 538475760;
                        i5 = 149921238;
                    } else {
                        m2566 = (C0630.m2566("ۨܺ") ^ i2) * 11;
                        i4 = ((m2566 ^ i3) * (-9901)) ^ (-12796457);
                        i5 = -1150400537;
                    }
                case 227926527:
                case 1428423439:
                    ((ViewOnClickListenerC2040) this.f24342).m6695();
                    break;
                case 579553467:
                case 955791135:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-1533)) ^ 148455730;
                        i5 = -740219383;
                    } else {
                        m2566 = (C0630.m2566("۫᩻") + i2) * 85;
                        i4 = ((m2566 ^ i3) * (-10633)) ^ 40006611;
                        i5 = -61307158;
                    }
                case 793039957:
                case 1823334516:
                    if (C2272.f7362) {
                        m2566 = (i3 - C0630.m2566("ܰܶ")) * 95;
                        i4 = ((m2566 ^ i2) * (-29577)) ^ 538475760;
                        i5 = 149921238;
                    } else {
                        m2566 = (C0630.m2566("۫۟") + i2) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * (-20165)) ^ (-1384117530);
                        i5 = -1540195534;
                    }
                case 1022161282:
                case 1656164401:
                    RunnableC1108.m3790();
                    if (ServiceConnectionC3453.m10564() > 0) {
                        m2566 = (C0630.m2566("۫۟") + i2) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m2566 ^ i3) * (-20165)) ^ (-1384117530);
                        i5 = -1540195534;
                    } else {
                        m2566 = C2105.m6981("ܺ۬") ^ i3;
                        i4 = ((m2566 ^ i2) * 11035) ^ 235093853;
                        i5 = -2077750351;
                    }
                case 1225688028:
                case 2019099672:
                    if (C2520.f8000 >= 0) {
                        m2566 = C2105.m6981("ۚۢ") ^ i2;
                        i4 = ((m2566 ^ i3) * 24329) ^ (-1267173139);
                        i5 = -1642932686;
                    } else {
                        m2566 = (C0630.m2566("ۗۧ") + i3) * (-57);
                        i4 = ((m2566 ^ i2) * (-26453)) ^ 607085006;
                        i5 = 436606528;
                    }
                default:
                    main.m86();
                    break;
            }
            return;
        }
    }
}
