package l;

import android.app.Activity;
import com.alipay.sdk.m.y.q;

/* compiled from: E4FN */
/* renamed from: l.ۡ֨ۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC8548 implements Runnable {

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f26134;

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f26135;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f26136;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f26137;

    public /* synthetic */ RunnableC8548(Object obj, Object obj2, Object obj3, int i) {
        int i2 = 56211387;
        int i3 = C3245.f10203;
        int i4 = C11340.f33930;
        this.f26136 = i;
        this.f26137 = obj;
        this.f26135 = obj2;
        this.f26134 = obj3;
        int m6981 = C2105.m6981("ܺ᩺") ^ i4;
        int i5 = ((m6981 ^ i3) * 19639) ^ 928518606;
        int i6 = -1978645927;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * (-27311)) >> 31));
            switch (i2) {
                case -2012408665:
                case 1580900325:
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ۡ۬") ^ i4;
                        i5 = ((m6981 ^ i3) * (-12947)) ^ (-413158882);
                        i6 = -1767106811;
                    } else {
                        m6981 = (i4 - C0630.m2566("ۡ᩸")) * (-37);
                        i5 = ((m6981 ^ i3) * (-8087)) ^ (-342612511);
                        i6 = 370969186;
                    }
                case -1706436891:
                case 2089350318:
                    RunnableC1937.m6387();
                    if (C0964.m3413()) {
                        m6981 = C2105.m6981("᩺ۤ") ^ i3;
                        i5 = ((m6981 ^ i4) * (-32027)) ^ (-963548326);
                        i6 = 625475362;
                    } else {
                        m6981 = (i4 - C0630.m2566("۫ۚ")) * 75;
                        i5 = ((m6981 ^ i3) * (-10741)) ^ 1278433772;
                        i6 = 485171994;
                    }
                case -1647112673:
                case 1116138514:
                    if (C4263.f13799 > 0) {
                        m6981 = (i4 - C0630.m2566("۫ۚ")) * 75;
                        i5 = ((m6981 ^ i3) * (-10741)) ^ 1278433772;
                        i6 = 485171994;
                    } else {
                        m6981 = (C2105.m6981("ܰᩳ") ^ i3) * (-115);
                        i5 = ((m6981 ^ i4) * 21845) ^ (-1494002352);
                        i6 = -1481888055;
                    }
                case -457890173:
                case 1075213221:
                    return;
                case -172492807:
                case 619755366:
                    if (RunnableC1108.m3790()) {
                        m6981 = (i4 - C0630.m2566("۫ۚ")) * 75;
                        i5 = ((m6981 ^ i3) * (-10741)) ^ 1278433772;
                        i6 = 485171994;
                    } else {
                        m6981 = (C2105.m6981("ܰۡ") + i3) * 87;
                        i5 = ((m6981 ^ i4) * 10895) ^ (-35711962);
                        i6 = -888934703;
                    }
                case 404027604:
                case 888376181:
                    C3911.m11924();
                    m6981 = C2105.m6981("᩺ۤ") ^ i3;
                    i5 = ((m6981 ^ i4) * (-32027)) ^ (-963548326);
                    i6 = 625475362;
                default:
                    C4075.m12263();
                    C1504.m5179();
                    throw new RuntimeException();
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        String str = null;
        Object obj = null;
        Activity activity = null;
        C0405 c0405 = null;
        Object obj2 = null;
        C8353 c8353 = null;
        int i = 408490761;
        int i2 = ServiceConnectionC3453.f10921;
        int i3 = C3746.f11829;
        int m2566 = C0630.m2566("᩻ܽ") ^ i2;
        int i4 = ((m2566 ^ i3) * (-9321)) ^ (-354936128);
        int i5 = 2052860289;
        while (true) {
            i = ((((i ^ i3) * (-27665)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1881761772:
                case -791841954:
                    obj = this.f26135;
                    if (C2520.f8000 >= 0) {
                        m2566 = C0630.m2566("ܿ᩷") ^ i3;
                        i4 = ((m2566 ^ i2) * (-7611)) ^ (-1307704713);
                        i5 = -156434446;
                    } else {
                        m2566 = (C0630.m2566("᩺۬") ^ i2) * (-25);
                        i4 = ((m2566 ^ i3) * 5411) ^ 773497144;
                        i5 = -1416150280;
                    }
                case -1871361009:
                case -263245703:
                    if (C7106.m19120() > 0) {
                        m2566 = C2105.m6981("᩺ۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-661)) ^ (-1191836229);
                        i5 = -567836268;
                    } else {
                        m2566 = (C0630.m2566("᩶ܰ") + i2) * 61;
                        i4 = ((m2566 ^ i3) * (-5203)) ^ 1732870626;
                        i5 = -546210635;
                    }
                case -1855392286:
                case -1767317293:
                    switch (this.f26136) {
                        case 0:
                            m2566 = (C0630.m2566("᩺ۢ") ^ i2) * (-115);
                            i4 = ((m2566 ^ i3) * (-13143)) ^ (-1991907642);
                            i5 = -976632647;
                            break;
                        default:
                            m2566 = (i2 - C2105.m6981("۫᩸")) * (-33);
                            i4 = ((m2566 ^ i3) * 14679) ^ (-245720312);
                            i5 = -355794366;
                            break;
                    }
                case -1651260752:
                case 463671508:
                    if (C4075.m12263() <= 0) {
                        m2566 = C2105.m6981("᩺ۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-661)) ^ (-1191836229);
                        i5 = -567836268;
                    } else {
                        m2566 = C0630.m2566("᩺ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 3465) ^ (-82767901);
                        i5 = -1915826702;
                    }
                case -1629263521:
                case 1330414367:
                    c0405 = (C0405) this.f26137;
                    if (C2105.f7037 != 0) {
                        m2566 = (C0630.m2566("᩶ܰ") + i2) * 61;
                        i4 = ((m2566 ^ i3) * (-5203)) ^ 1732870626;
                        i5 = -546210635;
                    } else {
                        m2566 = C0630.m2566("֡ܽ") ^ i3;
                        i4 = ((m2566 ^ i2) * 9101) ^ (-641376639);
                        i5 = 1021589776;
                    }
                case -1599913181:
                case 1603963524:
                    C0798.m2998();
                    C3432.m10477();
                    break;
                case -1465132169:
                case -488099634:
                    if (C3019.f9544 < 0) {
                        m2566 = (C2105.m6981("ۚᩳ") + i2) * q.h;
                        i4 = ((m2566 ^ i3) * 24187) ^ (-692573593);
                        i5 = -367133407;
                    } else {
                        m2566 = C2105.m6981("᩺ۛ") ^ i3;
                        i4 = ((m2566 ^ i2) * (-661)) ^ (-1191836229);
                        i5 = -567836268;
                    }
                case -1191316784:
                case 947883223:
                    C4616.m13552();
                    m2566 = (C2105.m6981("ۚᩳ") + i2) * q.h;
                    i4 = ((m2566 ^ i3) * 24187) ^ (-692573593);
                    i5 = -367133407;
                case -992931905:
                case 967550569:
                    if (C0798.f2919) {
                        m2566 = (C2105.m6981("ۚᩳ") + i2) * q.h;
                        i4 = ((m2566 ^ i3) * 24187) ^ (-692573593);
                        i5 = -367133407;
                    } else {
                        m2566 = C0630.m2566("ܿ᩷") ^ i3;
                        i4 = ((m2566 ^ i2) * (-7611)) ^ (-1307704713);
                        i5 = -156434446;
                    }
                case -837632089:
                case 1855864486:
                    C0405.m1905(c0405, c8353, (C13396) this.f26134);
                    break;
                case -780701664:
                case -155331007:
                    if (C4075.f12947 >= 0) {
                        m2566 = (C0630.m2566("᩶ܰ") + i2) * 61;
                        i4 = ((m2566 ^ i3) * (-5203)) ^ 1732870626;
                        i5 = -546210635;
                    } else {
                        m2566 = C0630.m2566("۠᩺") ^ i3;
                        i4 = ((m2566 ^ i2) * (-22427)) ^ 505537935;
                        i5 = -79010353;
                    }
                case -648014244:
                case 12443445:
                    c8353 = (C8353) obj2;
                    if (C4263.f13799 <= 0) {
                        m2566 = (C2105.m6981("ۚᩳ") + i2) * q.h;
                        i4 = ((m2566 ^ i3) * 24187) ^ (-692573593);
                        i5 = -367133407;
                    } else {
                        m2566 = C2105.m6981("ۗܳ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-28767)) ^ (-883853752);
                        i5 = -2107043606;
                    }
                case -624933183:
                case 1511152179:
                    C2405.m7793(str, activity, (C10497) this.f26134);
                    break;
                case -607788324:
                case 1631192194:
                    if (C1773.m5908() <= 0) {
                        m2566 = C2105.m6981("᩶ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 15105) ^ (-177612601);
                        i5 = 673562955;
                    } else {
                        m2566 = C2105.m6981("ܰ۬") ^ i2;
                        i4 = ((m2566 ^ i3) * (-19881)) ^ (-289521009);
                        i5 = -682695875;
                    }
                case -444562595:
                case 1513997385:
                    obj2 = this.f26135;
                    if (RunnableC0588.m2441() >= 0) {
                        m2566 = C0630.m2566("ܿ᩷") ^ i3;
                        i4 = ((m2566 ^ i2) * (-7611)) ^ (-1307704713);
                        i5 = -156434446;
                    } else {
                        m2566 = C0630.m2566("ۚ֨") ^ i3;
                        i4 = ((m2566 ^ i2) * (-21149)) ^ (-1115224424);
                        i5 = 1717849566;
                    }
                case 65324689:
                case 1002042353:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m2566 = C0630.m2566("ܿ᩷") ^ i3;
                        i4 = ((m2566 ^ i2) * (-7611)) ^ (-1307704713);
                        i5 = -156434446;
                    } else {
                        m2566 = (C2105.m6981("ۙܿ") ^ i3) * 115;
                        i4 = ((m2566 ^ i2) * 8303) ^ 1987152045;
                        i5 = -1133793939;
                    }
                case 1271844929:
                case 1386208674:
                    str = (String) this.f26137;
                    if (C1047.f3863 >= 0) {
                        m2566 = (C0630.m2566("᩶ܰ") + i2) * 61;
                        i4 = ((m2566 ^ i3) * (-5203)) ^ 1732870626;
                        i5 = -546210635;
                    } else {
                        m2566 = (i3 - C0630.m2566("ᩳۘ")) * (-105);
                        i4 = ((m2566 ^ i2) * (-17967)) ^ (-722947855);
                        i5 = 613016225;
                    }
                default:
                    activity = (Activity) obj;
                    if (C4263.m12819() >= 0) {
                        m2566 = C2105.m6981("᩶ܺ") ^ i2;
                        i4 = ((m2566 ^ i3) * 15105) ^ (-177612601);
                        i5 = 673562955;
                    } else {
                        m2566 = (C2105.m6981("ۚ۟") + i3) * (-55);
                        i4 = ((m2566 ^ i2) * 29291) ^ (-1474613668);
                        i5 = 1038253115;
                    }
            }
            return;
        }
    }
}
