package l;

/* compiled from: E4FN */
/* renamed from: l.ܶ֨ۡ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final /* synthetic */ class RunnableC14897 implements Runnable {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f45450;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f45451;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f45452;

    public /* synthetic */ RunnableC14897(int i, Object obj, Object obj2) {
        int i2 = -10222730;
        int i3 = C11340.f33930;
        int i4 = RunnableC1937.f6483;
        this.f45451 = i;
        this.f45452 = obj;
        this.f45450 = obj2;
        int m6981 = C2105.m6981("ۛۨ") ^ i3;
        int i5 = ((m6981 ^ i4) * (-25289)) ^ 1777757857;
        int i6 = -1460480081;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i4) * (-12391)) >> 31));
            switch (i2) {
                case -2068436633:
                case -1091364339:
                    AbstractC2021.m6574();
                    if (RunnableC0588.f2309 >= 0) {
                        m6981 = C0630.m2566("֨ᩳ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-24901)) ^ 2085674810;
                        i6 = -64710857;
                    } else {
                        m6981 = (i3 - C2105.m6981("۬᩶")) * 51;
                        i5 = ((m6981 ^ i4) * 6739) ^ 918426459;
                        i6 = -1738559780;
                    }
                case -1868629462:
                case -461896914:
                    C0964.m3413();
                    if (C1420.f5096 <= 0) {
                        m6981 = (i3 - C2105.m6981("۬᩶")) * 51;
                        i5 = ((m6981 ^ i4) * 6739) ^ 918426459;
                        i6 = -1738559780;
                    } else {
                        m6981 = (C2105.m6981("ۛ᩸") ^ i4) * 71;
                        i5 = ((m6981 ^ i3) * 25923) ^ (-1545991555);
                        i6 = -223020090;
                    }
                case -597007062:
                case -128750299:
                    C1005.m3501();
                    C0483.m2121();
                    m6981 = C0630.m2566("֨ᩳ") ^ i4;
                    i5 = ((m6981 ^ i3) * (-24901)) ^ 2085674810;
                    i6 = -64710857;
                case -554485339:
                case 2117148821:
                    return;
                case -445150077:
                case 1841791446:
                    C3911.m11924();
                    throw new RuntimeException();
                case 542133042:
                case 2094541822:
                    if (RunnableC3474.f10992 <= 0) {
                        m6981 = C0630.m2566("ܰܽ") ^ i3;
                        i5 = ((m6981 ^ i4) * 11539) ^ (-1891301998);
                        i6 = -274954852;
                    } else {
                        m6981 = (C0630.m2566("ܺۛ") + i3) * (-101);
                        i5 = ((m6981 ^ i4) * (-17003)) ^ 915091257;
                        i6 = -1779411158;
                    }
                default:
                    if (C4159.f13567) {
                        m6981 = C2105.m6981("ۜ᩹") ^ i4;
                        i5 = ((m6981 ^ i3) * (-10765)) ^ 65339253;
                        i6 = 25020957;
                    } else {
                        m6981 = C0630.m2566("֨ᩳ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-24901)) ^ 2085674810;
                        i6 = -64710857;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
        Object obj = null;
        InterfaceC21573 interfaceC21573 = null;
        Object obj2 = null;
        C15580 c15580 = null;
        Object obj3 = null;
        int i = 1362080788;
        int i2 = RunnableC3474.f10992;
        int i3 = ServiceConnectionC3453.f10921;
        int m6981 = C2105.m6981("֡ۧ") ^ i2;
        int i4 = ((m6981 ^ i3) * 5729) ^ 1021142068;
        int i5 = 469512006;
        while (true) {
            i = ((((i ^ i3) * 21357) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1974160447:
                case 1013942591:
                    c15580 = (C15580) this.f45452;
                    if (C1773.f6144 <= 0) {
                        m6981 = C2105.m6981("ܰܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24569)) ^ 1833799216;
                        i5 = -298106541;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۤ᩶")) * (-75);
                        i4 = ((m6981 ^ i2) * (-21847)) ^ 493265527;
                        i5 = 1663625601;
                    }
                case -1837519648:
                case 833594025:
                    if (C3746.f11829 <= 0) {
                        m6981 = C0630.m2566("ۡᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21979)) ^ 154279510;
                        i5 = 262395230;
                    } else {
                        m6981 = (C2105.m6981("ۗۧ") + i2) * (-87);
                        i4 = ((m6981 ^ i3) * (-20509)) ^ 1543091344;
                        i5 = -597859291;
                    }
                case -1826159065:
                case -557016961:
                    C2405.m7802(viewOnClickListenerC5850, (C8673) obj);
                    break;
                case -1628829941:
                case -598193847:
                    interfaceC21573.mo46353((C1111) obj2);
                    break;
                case -1534130314:
                case -1004214762:
                    interfaceC21573 = (InterfaceC21573) this.f45452;
                    if (C0382.f1805) {
                        m6981 = (C0630.m2566("᩻ۢ") + i2) * 95;
                        i4 = ((m6981 ^ i3) * (-26819)) ^ (-1647906275);
                        i5 = -1210248297;
                    } else {
                        m6981 = C2105.m6981("ܰܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24569)) ^ 1833799216;
                        i5 = -298106541;
                    }
                case -1441306084:
                case -638113107:
                    if (C0382.f1805) {
                        m6981 = (C0630.m2566("ۡ֫") ^ i3) * 73;
                        i4 = ((m6981 ^ i2) * (-16137)) ^ 1654209510;
                        i5 = -181599251;
                    } else {
                        m6981 = C2105.m6981("ܽۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28199) ^ (-1450378997);
                        i5 = 363519493;
                    }
                case -1265235775:
                case -480981092:
                    C3432.m10477();
                    m6981 = C2105.m6981("ܰܳ") ^ i3;
                    i4 = ((m6981 ^ i2) * (-24569)) ^ 1833799216;
                    i5 = -298106541;
                case -943979518:
                case 46944800:
                    RunnableC1108.m3790();
                    break;
                case -716832683:
                case 2025362335:
                    ((AbstractC0204) obj3).mo1407(c15580);
                    break;
                case -615494768:
                case 1646289456:
                    C5695.m16023();
                    if (C1504.f5354) {
                        m6981 = C0630.m2566("ۡᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21979)) ^ 154279510;
                        i5 = 262395230;
                    } else {
                        m6981 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13411)) ^ (-1544794845);
                        i5 = 1104173276;
                    }
                case -562646105:
                case 540703334:
                    if (C3663.f11553) {
                        m6981 = C2105.m6981("ܰܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24569)) ^ 1833799216;
                        i5 = -298106541;
                    } else {
                        m6981 = C0630.m2566("ۡᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21979)) ^ 154279510;
                        i5 = 262395230;
                    }
                case -527920741:
                case 1878720266:
                    obj2 = this.f45450;
                    if (C4263.f13799 <= 0) {
                        m6981 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13411)) ^ (-1544794845);
                        i5 = 1104173276;
                    } else {
                        m6981 = (C2105.m6981("ۨۗ") ^ i3) * 65;
                        i4 = ((m6981 ^ i2) * (-19907)) ^ (-240048152);
                        i5 = -157689834;
                    }
                case -259422985:
                case 1712109587:
                    obj3 = this.f45450;
                    if (C2105.f7037 != 0) {
                        m6981 = C0630.m2566("ۡᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21979)) ^ 154279510;
                        i5 = 262395230;
                    } else {
                        m6981 = C0630.m2566("᩷ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-3379)) ^ (-249271280);
                        i5 = -1263536537;
                    }
                case -111293362:
                case 84985167:
                    C0798.m2998();
                    if (C0422.m1963()) {
                        m6981 = C2105.m6981("۠ۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-17219)) ^ (-2016741391);
                        i5 = 63599717;
                    } else {
                        m6981 = C0630.m2566("ۡᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-21979)) ^ 154279510;
                        i5 = 262395230;
                    }
                case 1028796111:
                case 1689572992:
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ۘ۫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-2711)) ^ (-1015148969);
                        i5 = 2019246743;
                    } else {
                        m6981 = C2105.m6981("ۜᩳ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-13411)) ^ (-1544794845);
                        i5 = 1104173276;
                    }
                case 1152120418:
                case 2048284557:
                    switch (this.f45451) {
                        case 0:
                            m6981 = (C2105.m6981("֫۠") ^ i3) * (-65);
                            i4 = ((m6981 ^ i2) * 18399) ^ (-392923170);
                            i5 = -1654260551;
                            break;
                        case 1:
                            m6981 = C2105.m6981("ۗ۬") ^ i2;
                            i4 = ((m6981 ^ i3) * 29537) ^ (-2076096440);
                            i5 = -983232466;
                            break;
                        default:
                            m6981 = C2105.m6981("ۛ۫") ^ i2;
                            i4 = ((m6981 ^ i3) * 14629) ^ (-1153935361);
                            i5 = -339827428;
                            break;
                    }
                case 1213349474:
                case 2065463414:
                    viewOnClickListenerC5850 = (ViewOnClickListenerC5850) this.f45452;
                    if (C4616.f14690 <= 0) {
                        m6981 = C2105.m6981("ܰܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24569)) ^ 1833799216;
                        i5 = -298106541;
                    } else {
                        m6981 = C0630.m2566("۬ۢ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-30711)) ^ 1370678602;
                        i5 = -208421829;
                    }
                case 1733398791:
                case 1804371808:
                    obj = this.f45450;
                    if (C3019.f9544 >= 0) {
                        m6981 = C2105.m6981("ܽۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28199) ^ (-1450378997);
                        i5 = 363519493;
                    } else {
                        m6981 = (C2105.m6981("ۗ᩶") ^ i3) * 83;
                        i4 = ((m6981 ^ i2) * (-1099)) ^ (-1718265496);
                        i5 = 181493154;
                    }
                default:
                    if (C1504.m5179()) {
                        m6981 = (i2 - C0630.m2566("۟۟")) * 115;
                        i4 = ((m6981 ^ i3) * 26407) ^ (-1356864000);
                        i5 = 635483578;
                    } else {
                        m6981 = C2105.m6981("ܽۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28199) ^ (-1450378997);
                        i5 = 363519493;
                    }
            }
            return;
        }
    }
}
