package l;

import android.app.Activity;
import java.util.ArrayList;
import moe.shizuku.server.IShizukuService;

/* compiled from: E4FN */
/* renamed from: l.ۘ֨ۡ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final /* synthetic */ class RunnableC3609 implements Runnable {

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f11437;

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f11438;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f11439;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f11440;

    public /* synthetic */ RunnableC3609(Object obj, Object obj2, Object obj3, int i) {
        int i2 = 1203934272;
        int i3 = C11340.f33930;
        int i4 = C5695.f17556;
        this.f11439 = i;
        this.f11440 = obj;
        this.f11438 = obj2;
        this.f11437 = obj3;
        int m6981 = C2105.m6981("ۘ۫") ^ i4;
        int i5 = ((m6981 ^ i3) * (-4709)) ^ 485717842;
        int i6 = -1992859171;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * 9011) >> 31));
            switch (i2) {
                case -1950059809:
                case 1870815901:
                    C1005.m3501();
                    throw new RuntimeException();
                case -1371165847:
                case 1893903032:
                    if (C3683.f11629 < 0) {
                        m6981 = C0630.m2566("ᩴۚ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-32197)) ^ (-1544890051);
                        i6 = -2101970900;
                    } else {
                        m6981 = (C2105.m6981("ۨ۬") ^ i3) * 9;
                        i5 = ((m6981 ^ i4) * (-7889)) ^ (-556687010);
                        i6 = -1654808424;
                    }
                case -1292225458:
                case -87540996:
                    return;
                case -977939241:
                case -838116278:
                    C1916.m6308();
                    m6981 = C0630.m2566("ᩴۚ") ^ i4;
                    i5 = ((m6981 ^ i3) * (-32197)) ^ (-1544890051);
                    i6 = -2101970900;
                case 158259943:
                case 1560174079:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C0630.m2566("ᩴۚ") ^ i4;
                        i5 = ((m6981 ^ i3) * (-32197)) ^ (-1544890051);
                        i6 = -2101970900;
                    } else {
                        m6981 = (i3 - C2105.m6981("֨᩺")) * 99;
                        i5 = ((m6981 ^ i4) * 18015) ^ 1846107434;
                        i6 = -973847628;
                    }
                case 625244515:
                case 1677761177:
                    if (C0382.f1805) {
                        m6981 = (C0630.m2566("ۚۙ") ^ i3) * (-57);
                        i5 = ((m6981 ^ i4) * 5143) ^ 273785756;
                        i6 = 950393257;
                    } else {
                        m6981 = (C2105.m6981("ᩴۧ") ^ i4) * (-39);
                        i5 = ((m6981 ^ i3) * (-28665)) ^ 1828149849;
                        i6 = 1934252653;
                    }
                default:
                    if (C1420.f5096 <= 0) {
                        m6981 = (i3 - C2105.m6981("֨᩺")) * 99;
                        i5 = ((m6981 ^ i4) * 18015) ^ 1846107434;
                        i6 = -973847628;
                    } else {
                        m6981 = (C0630.m2566("᩹֨") + i4) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        i5 = ((m6981 ^ i3) * (-23929)) ^ 1616678538;
                        i6 = 772618629;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        String str = null;
        Object obj = null;
        Activity activity = null;
        C15730 c15730 = null;
        Object obj2 = null;
        ArrayList arrayList = null;
        int i = -1586331150;
        int i2 = C2167.f7158;
        int i3 = C3683.f11629;
        int m6981 = (i2 - C2105.m6981("ۢ۬")) * (-127);
        int i4 = ((m6981 ^ i3) * 1761) ^ (-1177075752);
        int i5 = -160116614;
        while (true) {
            i = ((((i ^ i3) * 32289) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2032256782:
                case 907294264:
                    if (C0964.f3626 != 0) {
                        m6981 = (i2 - C0630.m2566("ۜ᩹")) * 27;
                        i4 = ((m6981 ^ i3) * (-6221)) ^ (-1542344113);
                        i5 = -1529519022;
                    } else {
                        m6981 = C2105.m6981("ۖۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11813)) ^ (-914396415);
                        i5 = 1358561416;
                    }
                case -1917425406:
                case -1025543850:
                    if (C0630.f2410 <= 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = (C2105.m6981("᩻ۖ") ^ i3) * (-65);
                        i4 = ((m6981 ^ i2) * 4459) ^ (-1408442771);
                        i5 = 282812738;
                    }
                case -1867984203:
                case -533667134:
                    C15730.m37133(c15730, arrayList, (C2450) this.f11437);
                    break;
                case -1854892993:
                case 523974666:
                    arrayList = (ArrayList) obj2;
                    if (C7106.f21815 != 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = C2105.m6981("ۘۢ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-20647)) ^ (-307074962);
                        i5 = 347600933;
                    }
                case -1553995152:
                case -1106984866:
                    c15730 = (C15730) this.f11440;
                    if (C3245.f10203 <= 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = C0630.m2566("֨۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 28807) ^ (-1661798562);
                        i5 = -2035413939;
                    }
                case -1535304796:
                case -627888341:
                    C1773.m5908();
                    if (C2520.m8026()) {
                        m6981 = (i2 - C0630.m2566("ۜ᩹")) * 27;
                        i4 = ((m6981 ^ i3) * (-6221)) ^ (-1542344113);
                        i5 = -1529519022;
                    } else {
                        m6981 = C0630.m2566("ܿ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 15731) ^ 1780281600;
                        i5 = 525937415;
                    }
                case -1472868106:
                case -104232443:
                    C2405.m7792(str, activity, (C5558) this.f11437);
                    break;
                case -1305661988:
                case -460532786:
                    if (C0630.f2410 <= 0) {
                        m6981 = C0630.m2566("ܿ۫") ^ i2;
                        i4 = ((m6981 ^ i3) * 15731) ^ 1780281600;
                        i5 = 525937415;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩹ۗ")) * 27;
                        i4 = ((m6981 ^ i3) * (-953)) ^ (-270000058);
                        i5 = 594076495;
                    }
                case -1243816120:
                case -1074779802:
                    if (C5695.m16023() >= 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = C2105.m6981("ܰ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-28975)) ^ 1145757247;
                        i5 = 461969600;
                    }
                case -1009295094:
                case -545441732:
                    activity = (Activity) obj;
                    if (C0964.f3626 != 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = C0630.m2566("ۨۗ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-14501)) ^ (-237909697);
                        i5 = 547347148;
                    }
                case -972078931:
                case 651286856:
                    C1711.m5736();
                    if (C2520.f8000 < 0) {
                        m6981 = (i2 - C0630.m2566("ۜ᩹")) * 27;
                        i4 = ((m6981 ^ i3) * (-6221)) ^ (-1542344113);
                        i5 = -1529519022;
                    } else {
                        m6981 = C0630.m2566("ܺۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * 1227) ^ 326587088;
                        i5 = 123878900;
                    }
                case -828380671:
                case -85520024:
                    obj = this.f11438;
                    if (C3746.f11829 <= 0) {
                        m6981 = (C0630.m2566("᩻ܽ") ^ i2) * 115;
                        i4 = ((m6981 ^ i3) * (-2137)) ^ (-43019699);
                        i5 = -1754650636;
                    } else {
                        m6981 = C2105.m6981("۬۟") ^ i3;
                        i4 = ((m6981 ^ i2) * 12621) ^ (-133044626);
                        i5 = 928021908;
                    }
                case -670494298:
                case 811958127:
                    switch (this.f11439) {
                        case 0:
                            m6981 = (i2 - C0630.m2566("ۨܳ")) * 23;
                            i4 = ((m6981 ^ i3) * 10793) ^ (-1100955534);
                            i5 = 1797431222;
                            break;
                        default:
                            m6981 = C2105.m6981("ܽܿ") ^ i2;
                            i4 = ((m6981 ^ i3) * (-31537)) ^ 1621542089;
                            i5 = 2047443444;
                            break;
                    }
                case -382885405:
                case 1915321240:
                    obj2 = this.f11438;
                    if (C4075.f12947 >= 0) {
                        m6981 = C2105.m6981("ۖۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11813)) ^ (-914396415);
                        i5 = 1358561416;
                    } else {
                        m6981 = C0630.m2566("֡ܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-10763)) ^ 461201622;
                        i5 = 1210494373;
                    }
                case -309319141:
                case 1548940329:
                    str = (String) this.f11440;
                    if (C1711.f5919) {
                        m6981 = C0630.m2566("ܺۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * 1227) ^ 326587088;
                        i5 = 123878900;
                    } else {
                        m6981 = (C0630.m2566("ۡܰ") ^ i3) * (-9);
                        i4 = ((m6981 ^ i2) * 9411) ^ (-1993622838);
                        i5 = -720184398;
                    }
                case -203089154:
                case 2071798730:
                    C3663.m11168();
                    C3537.m10746();
                    m6981 = (i2 - C0630.m2566("ۜ᩹")) * 27;
                    i4 = ((m6981 ^ i3) * (-6221)) ^ (-1542344113);
                    i5 = -1529519022;
                case 1221782433:
                case 1993795860:
                    C3245.m9925();
                    break;
                default:
                    if (C0050.f910 >= 0) {
                        m6981 = (i2 - C0630.m2566("ۜ᩹")) * 27;
                        i4 = ((m6981 ^ i3) * (-6221)) ^ (-1542344113);
                        i5 = -1529519022;
                    } else {
                        m6981 = C2105.m6981("۠᩺") ^ i3;
                        i4 = ((m6981 ^ i2) * (-15055)) ^ 2124124335;
                        i5 = 1266091793;
                    }
            }
            return;
        }
    }
}
