package l;

import android.app.Activity;
import com.google.android.material.slider.BaseSlider;

/* compiled from: E4FN */
/* renamed from: l.ܰ֨ۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC13486 implements Runnable {

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f40273;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f40274;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f40275;

    public /* synthetic */ RunnableC13486(int i, Object obj, Object obj2) {
        int i2 = 1901656855;
        int i3 = ServiceConnectionC3453.f10921;
        int i4 = C7811.f24123;
        this.f40274 = i;
        this.f40275 = obj;
        this.f40273 = obj2;
        int m6981 = C2105.m6981("ܺ᩸") ^ i4;
        int i5 = ((m6981 ^ i3) * 17609) ^ (-1481471919);
        int i6 = -1382105692;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * (-17943)) >> 31));
            switch (i2) {
                case -1492828771:
                case 477004445:
                    if (C1047.f3863 >= 0) {
                        m6981 = C2105.m6981("ۙܶ") ^ i3;
                        i5 = ((m6981 ^ i4) * 21007) ^ (-1483627266);
                        i6 = 506794540;
                    } else {
                        m6981 = C2105.m6981("ܰۡ") ^ i4;
                        i5 = ((m6981 ^ i3) * 31227) ^ 2027957410;
                        i6 = -440709171;
                    }
                case -1450711671:
                case -222151647:
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("᩶᩸") ^ i4;
                        i5 = ((m6981 ^ i3) * (-6361)) ^ 1626492365;
                        i6 = -1792975565;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۢۚ")) * (-13);
                        i5 = ((m6981 ^ i4) * 10739) ^ 2094206091;
                        i6 = 1061780365;
                    }
                case -969804805:
                case 1414229819:
                    return;
                case -935672923:
                case 1225726067:
                    C0630.m2564();
                    m6981 = C0630.m2566("᩻᩹") ^ i3;
                    i5 = ((m6981 ^ i4) * 8363) ^ (-1903274098);
                    i6 = -1426543565;
                case 211499838:
                case 1913378529:
                    if (C3663.f11553) {
                        m6981 = (i3 - C2105.m6981("ۢۚ")) * (-13);
                        i5 = ((m6981 ^ i4) * 10739) ^ 2094206091;
                        i6 = 1061780365;
                    } else {
                        m6981 = C0630.m2566("᩻᩹") ^ i3;
                        i5 = ((m6981 ^ i4) * 8363) ^ (-1903274098);
                        i6 = -1426543565;
                    }
                case 1175197213:
                case 2037152432:
                    C3911.m11924();
                    C4616.m13552();
                    throw new RuntimeException();
                default:
                    C0050.m940();
                    if (C3245.f10203 <= 0) {
                        m6981 = C0630.m2566("᩻᩹") ^ i3;
                        i5 = ((m6981 ^ i4) * 8363) ^ (-1903274098);
                        i6 = -1426543565;
                    } else {
                        m6981 = (i4 - C0630.m2566("ۡܳ")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i5 = ((m6981 ^ i3) * 1307) ^ (-783046516);
                        i6 = 548323256;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        Activity activity = null;
        Object obj = null;
        C16431 c16431 = null;
        Object obj2 = null;
        ViewOnLayoutChangeListenerC7738 viewOnLayoutChangeListenerC7738 = null;
        Object obj3 = null;
        int i = -1862310223;
        int i2 = C1128.f4106;
        int i3 = C1420.f5096;
        int m6981 = C2105.m6981("ۡۘ") ^ i2;
        int i4 = ((m6981 ^ i3) * (-30471)) ^ (-627624505);
        int i5 = -65894923;
        while (true) {
            i = ((((i ^ i3) * (-3785)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2143267377:
                case 940073791:
                    C2405.m7789(activity, (C10748) obj);
                    break;
                case -2140477610:
                case 1763747975:
                    obj = this.f40273;
                    if (C1294.m4372() <= 0) {
                        m6981 = (C2105.m6981("᩶᩸") + i3) * (-75);
                        i4 = ((m6981 ^ i2) * 25461) ^ 1436848177;
                        i5 = -1089525657;
                    } else {
                        m6981 = (i3 - C0630.m2566("֫ܰ")) * (-83);
                        i4 = ((m6981 ^ i2) * (-31011)) ^ 270553871;
                        i5 = 1031698556;
                    }
                case -2135274722:
                case -191472086:
                    switch (this.f40274) {
                        case 0:
                            m6981 = (C2105.m6981("ܰ֨") + i3) * 53;
                            i4 = ((m6981 ^ i2) * 14085) ^ (-532468230);
                            i5 = 488880238;
                            break;
                        case 1:
                            m6981 = C2105.m6981("ۨ֡") ^ i2;
                            i4 = ((m6981 ^ i3) * 19781) ^ 1998219515;
                            i5 = 780122170;
                            break;
                        default:
                            m6981 = C2105.m6981("ۚۨ") ^ i2;
                            i4 = ((m6981 ^ i3) * 4769) ^ (-506702992);
                            i5 = -169175464;
                            break;
                    }
                case -2018869844:
                case -1705504600:
                    if (C2520.f8000 >= 0) {
                        m6981 = C2105.m6981("ۖۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 873) ^ (-1429180605);
                        i5 = -544053589;
                    } else {
                        m6981 = (i2 - C0630.m2566("۟֫")) * (-71);
                        i4 = ((m6981 ^ i3) * 10163) ^ (-13306005);
                        i5 = -1065855294;
                    }
                case -1786180343:
                case 654009419:
                    c16431 = (C16431) this.f40275;
                    if (C3911.f12484 >= 0) {
                        m6981 = (C2105.m6981("᩶᩸") + i3) * (-75);
                        i4 = ((m6981 ^ i2) * 25461) ^ 1436848177;
                        i5 = -1089525657;
                    } else {
                        m6981 = C2105.m6981("ۡ᩻") ^ i2;
                        i4 = ((m6981 ^ i3) * 8533) ^ 1566659488;
                        i5 = -545419239;
                    }
                case -1651068759:
                case 2084232998:
                    if (C2167.f7158 >= 0) {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    } else {
                        m6981 = C2105.m6981("۠ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-9457)) ^ 1165335859;
                        i5 = 319063152;
                    }
                case -1623209323:
                case -671516565:
                    obj2 = this.f40273;
                    if (RunnableC1108.f4040) {
                        m6981 = (C0630.m2566("֨۬") + i3) * (-119);
                        i4 = ((m6981 ^ i2) * 24205) ^ 1441055376;
                        i5 = -2097928332;
                    } else {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    }
                case -1328381404:
                case -686376014:
                    C0630.m2564();
                    break;
                case -1256156111:
                case -457874305:
                    if (C1128.f4106 <= 0) {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    } else {
                        m6981 = (C2105.m6981("ۖ۬") + i2) * 95;
                        i4 = ((m6981 ^ i3) * (-1651)) ^ (-1834138257);
                        i5 = 1081126949;
                    }
                case -1240556440:
                case -440098220:
                    obj3 = this.f40273;
                    if (C2520.f8000 >= 0) {
                        m6981 = (C2105.m6981("᩶᩸") + i3) * (-75);
                        i4 = ((m6981 ^ i2) * 25461) ^ 1436848177;
                        i5 = -1089525657;
                    } else {
                        m6981 = (C2105.m6981("ۨ۫") ^ i3) * 119;
                        i4 = ((m6981 ^ i2) * 20115) ^ 278779105;
                        i5 = 1634483347;
                    }
                case -1003245572:
                case -43103522:
                    viewOnLayoutChangeListenerC7738 = (ViewOnLayoutChangeListenerC7738) this.f40275;
                    if (C3683.m11222()) {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    } else {
                        m6981 = C0630.m2566("ᩳۗ") ^ i3;
                        i4 = ((m6981 ^ i2) * 26259) ^ 340903796;
                        i5 = -1509080316;
                    }
                case -490479282:
                case 1306722968:
                    if (C0382.f1805) {
                        m6981 = (C0630.m2566("ܺ᩻") ^ i3) * 127;
                        i4 = ((m6981 ^ i2) * 27267) ^ 836496167;
                        i5 = 1173556500;
                    } else {
                        m6981 = (i2 - C0630.m2566("۟֫")) * (-71);
                        i4 = ((m6981 ^ i3) * 10163) ^ (-13306005);
                        i5 = -1065855294;
                    }
                case -477811550:
                case 1256872376:
                    ViewOnLayoutChangeListenerC7738.m20737(viewOnLayoutChangeListenerC7738, (String) obj3);
                    break;
                case 336427538:
                case 1283579756:
                    activity = (Activity) this.f40275;
                    if (C1294.f4556 >= 0) {
                        m6981 = (C2105.m6981("᩶᩸") + i3) * (-75);
                        i4 = ((m6981 ^ i2) * 25461) ^ 1436848177;
                        i5 = -1089525657;
                    } else {
                        m6981 = C0630.m2566("ۧۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-7519)) ^ 657528931;
                        i5 = 825072410;
                    }
                case 461396035:
                case 2088929977:
                    C1005.m3501();
                    if (C3746.m11369() < 0) {
                        m6981 = C2105.m6981("ۖۧ") ^ i2;
                        i4 = ((m6981 ^ i3) * 873) ^ (-1429180605);
                        i5 = -544053589;
                    } else {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    }
                case 525911298:
                case 1337574612:
                    if (C2520.f8000 >= 0) {
                        m6981 = (i2 - C0630.m2566("۟֫")) * (-71);
                        i4 = ((m6981 ^ i3) * 10163) ^ (-13306005);
                        i5 = -1065855294;
                    } else {
                        m6981 = (C0630.m2566("ۡ᩶") ^ i2) * (-25);
                        i4 = ((m6981 ^ i3) * 13151) ^ (-1846975593);
                        i5 = -909727099;
                    }
                case 694171245:
                case 967393330:
                    if (C0714.f2697 >= 0) {
                        m6981 = (C2105.m6981("ᩴ᩶") ^ i3) * (-89);
                        i4 = ((m6981 ^ i2) * (-24737)) ^ (-22260438);
                        i5 = -189580302;
                    } else {
                        m6981 = C0630.m2566("᩸ۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24777)) ^ (-100872609);
                        i5 = 208675875;
                    }
                case 1548141549:
                case 1676028926:
                    C1047.m3599();
                    m6981 = C2105.m6981("ۖۧ") ^ i2;
                    i4 = ((m6981 ^ i3) * 873) ^ (-1429180605);
                    i5 = -544053589;
                default:
                    C16431.m38712(c16431, (InterfaceC5982) obj2);
                    break;
            }
            return;
        }
    }
}
