package l;

import moe.shizuku.server.IShizukuService;
import org.json.JSONObject;

/* compiled from: T5M8 */
/* renamed from: l.֨ᩴۡ, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final /* synthetic */ class RunnableC1303 implements Runnable {

    /* renamed from: ܿ᩻۠, reason: not valid java name and contains not printable characters */
    private static final short[] f4669 = {7006, -23090, -23085, -23099, -23100, -23085, -23064, -23099, -23098, -23100, -23083, -23054, -23083, -23085, -23096, -23089, -23098, -23159, -23153, -23153, -23153, -23160};

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ long f4670;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ JSONObject f4671;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ String f4672;

    public /* synthetic */ RunnableC1303(JSONObject jSONObject, String str, long j) {
        int i = 174392920;
        int i2 = C3911.f12484;
        int i3 = C0050.f910;
        int m6981 = (C2105.m6981("ۙ᩶") + i3) * 35;
        int i4 = ((m6981 ^ i2) * (-19809)) ^ (-82566815);
        int i5 = -1926601317;
        while (true) {
            i = ((((i ^ i2) * 3283) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1992108842:
                case 854331784:
                    this.f4670 = j;
                    return;
                case -1877160238:
                case 1462461266:
                    if (C3019.f9544 >= 0) {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    } else {
                        m6981 = (C0630.m2566("ۤۜ") + i3) * (-105);
                        i4 = ((m6981 ^ i2) * (-20363)) ^ (-1261907874);
                        i5 = 145624101;
                    }
                case -1611634470:
                case 871206856:
                    if (C3537.f11231 >= 0) {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    } else {
                        m6981 = (C0630.m2566("ᩳ᩵") + i3) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i4 = ((m6981 ^ i2) * 2699) ^ 714181510;
                        i5 = -1811836513;
                    }
                case -1606840103:
                case -479630323:
                    C0422.m1963();
                    if (C0798.f2919) {
                        m6981 = C2105.m6981("᩶֨") ^ i2;
                        i4 = ((m6981 ^ i3) * 31367) ^ (-1415519563);
                        i5 = 946031622;
                    } else {
                        m6981 = C0630.m2566("֨ۘ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-24529)) ^ 1361376378;
                        i5 = -1712052171;
                    }
                case -1505727156:
                case 890615914:
                    if (C2958.f9394 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩻۫")) * (-125);
                        i4 = ((m6981 ^ i3) * 21971) ^ (-1714596200);
                        i5 = -1480331198;
                    } else {
                        m6981 = C0630.m2566("۟ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 5833) ^ 56604492;
                        i5 = -737153983;
                    }
                case -1394674345:
                case 1188470355:
                    if (C3019.f9544 >= 0) {
                        m6981 = C2105.m6981("֨᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 15351) ^ (-158641979);
                        i5 = -99085547;
                    } else {
                        m6981 = C2105.m6981("ۘ᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * 26207) ^ (-201260845);
                        i5 = -1287429405;
                    }
                case -1228212567:
                case 777476712:
                    if (C3911.m11924() <= 0) {
                        m6981 = C2105.m6981("֨᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 15351) ^ (-158641979);
                        i5 = -99085547;
                    } else {
                        m6981 = (i2 - C2105.m6981("۬ܺ")) * (-21);
                        i4 = ((m6981 ^ i3) * (-3787)) ^ 137012302;
                        i5 = 828850079;
                    }
                case -930491936:
                case -561818655:
                    C2105.m6982();
                    m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                    i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                    i5 = -1043859295;
                case -922173470:
                case 1041706418:
                    if (C3245.f10203 <= 0) {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    } else {
                        m6981 = (i3 - C2105.m6981("᩸᩹")) * (-11);
                        i4 = ((m6981 ^ i2) * (-21915)) ^ (-340106361);
                        i5 = 1675279489;
                    }
                case 127516803:
                case 1117687537:
                    this.f4671 = jSONObject;
                    this.f4672 = str;
                    if (C3911.m11924() <= 0) {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    } else {
                        m6981 = (C0630.m2566("ۖۜ") ^ i3) * 7;
                        i4 = ((m6981 ^ i2) * (-3537)) ^ 1414879601;
                        i5 = -1323316556;
                    }
                case 195608577:
                case 1557390145:
                    RunnableC1937.m6387();
                    throw new RuntimeException();
                case 486276303:
                case 1579931885:
                    if (RunnableC1108.f4040) {
                        m6981 = C2105.m6981("᩶֨") ^ i2;
                        i4 = ((m6981 ^ i3) * 31367) ^ (-1415519563);
                        i5 = 946031622;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    }
                case 1289295662:
                case 1463976736:
                    if (C4075.f12947 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩻۫")) * (-125);
                        i4 = ((m6981 ^ i3) * 21971) ^ (-1714596200);
                        i5 = -1480331198;
                    } else {
                        m6981 = C0630.m2566("ۚ۟") ^ i2;
                        i4 = ((m6981 ^ i3) * (-30389)) ^ 1821048315;
                        i5 = 2031326602;
                    }
                case 1436592744:
                case 1490188539:
                    if (C7811.f24123 >= 0) {
                        m6981 = (i3 - C2105.m6981("ۗۢ")) * (-123);
                        i4 = ((m6981 ^ i2) * (-11329)) ^ 1357384587;
                        i5 = -1043859295;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۤܳ")) * (-3);
                        i4 = ((m6981 ^ i2) * 3845) ^ 1964432509;
                        i5 = -1710231458;
                    }
                case 1699840846:
                case 1772077062:
                    if (C1711.f5919) {
                        m6981 = C2105.m6981("᩶֨") ^ i2;
                        i4 = ((m6981 ^ i3) * 31367) ^ (-1415519563);
                        i5 = 946031622;
                    } else {
                        m6981 = C2105.m6981("֨᩷") ^ i2;
                        i4 = ((m6981 ^ i3) * 15351) ^ (-158641979);
                        i5 = -99085547;
                    }
                default:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("֡᩶") ^ i2;
                        i4 = ((m6981 ^ i3) * 13445) ^ (-2000224490);
                        i5 = 1344870473;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩻۫")) * (-125);
                        i4 = ((m6981 ^ i3) * 21971) ^ (-1714596200);
                        i5 = -1480331198;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        short[] sArr;
        int m6981;
        int i;
        int i2;
        int m69812;
        int i3;
        int i4;
        int i5 = C1773.f6144;
        int i6 = C3245.f10203;
        int m2566 = (C0630.m2566("ܿ᩷") + i6) * (-115);
        int i7 = ((m2566 ^ i5) * 16823) ^ 959601588;
        short[] sArr2 = null;
        short[] sArr3 = null;
        short[] sArr4 = null;
        int i8 = m2566 ^ 374744818;
        int i9 = 0;
        short s = 0;
        int i10 = 0;
        int i11 = 0;
        short s2 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 0;
        char c = 0;
        int i15 = 0;
        int i16 = -789764318;
        int i17 = 0;
        String str = null;
        JSONObject jSONObject = null;
        String str2 = null;
        while (true) {
            i16 = i8 ^ (i7 & (((i16 ^ i5) * (-25119)) >> 31));
            switch (i16) {
                case -2060760348:
                case 1011592:
                    sArr = sArr4;
                    i15 = s * s;
                    i17 = 24770529;
                    if (!C0382.m1848()) {
                        m6981 = C0630.m2566("ܳܿ") ^ i6;
                        i = ((m6981 ^ i5) * 13765) ^ (-2025642188);
                        i2 = 255806909;
                        short[] sArr5 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr5;
                    }
                    m6981 = C2105.m6981("۠ۚ") ^ i5;
                    i = ((m6981 ^ i6) * (-31131)) ^ 2000573637;
                    i2 = 338900062;
                    short[] sArr52 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr52;
                case -1916973412:
                case -1789240462:
                    sArr = sArr4;
                    sArr2 = f4669;
                    c = 0;
                    if (ServiceConnectionC3453.f10921 < 0) {
                        m6981 = (C2105.m6981("ᩳ᩺") ^ i5) * (-9);
                        i = ((m6981 ^ i6) * 26491) ^ 246008922;
                        i2 = -327367007;
                        short[] sArr522 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr522;
                    }
                    m6981 = C2105.m6981("۠ۚ") ^ i5;
                    i = ((m6981 ^ i6) * (-31131)) ^ 2000573637;
                    i2 = 338900062;
                    short[] sArr5222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr5222;
                case -1673384935:
                case 1860004394:
                    str = C22628.m50614(jSONObject, str2);
                    sArr4 = f4669;
                    i9 = 8;
                    i10 = 14;
                    if (C3746.m11369() < 0) {
                        m69812 = C2105.m6981("ᩴ۟") ^ i6;
                        i3 = ((m69812 ^ i5) * (-16529)) ^ (-545146599);
                        i4 = -395019531;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    }
                    m69812 = C2105.m6981("ۘۤ") ^ i6;
                    i3 = ((m69812 ^ i5) * (-15991)) ^ 1611386140;
                    i4 = 633506866;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                case -1521879787:
                case 518830307:
                    RunnableC3474.m10630();
                    break;
                case -914867416:
                case -748890887:
                    sArr = sArr4;
                    i12 = 42401;
                    m6981 = (C2105.m6981("᩷᩺") ^ i5) * (-5);
                    i = ((m6981 ^ i6) * (-15753)) ^ (-1518872693);
                    i2 = -587304180;
                    short[] sArr52222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr52222;
                case -905045898:
                case 400976852:
                    C2126.m7031(str, ViewOnClickListenerC1958.m6435(sArr4, i9, i10, i12));
                    if (!C1711.f5919) {
                        sArr = sArr4;
                        String str3 = this.f4672;
                        if (C1128.f4106 > 0) {
                            C11340.m28020(new Thread(new RunnableC0597(str3, str, this.f4670)));
                            break;
                        }
                        m6981 = (C2105.m6981("ۡۘ") + i6) * (-33);
                        i = ((m6981 ^ i5) * 15693) ^ 1209750598;
                        i2 = -1458693021;
                        short[] sArr522222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr522222;
                    }
                    sArr = sArr4;
                    m6981 = C0630.m2566("ۡ᩻") ^ i5;
                    i = ((m6981 ^ i6) * (-25029)) ^ 2091937412;
                    i2 = 982779045;
                    short[] sArr5222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr5222222;
                case -893950053:
                case -535906151:
                    sArr = sArr4;
                    C5242 c5242 = C22470.f72770;
                    sArr3 = f4669;
                    i13 = 1;
                    if (C0964.f3626 != 0) {
                        sArr4 = sArr;
                        m69812 = C2105.m6981("ۘۤ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-15991)) ^ 1611386140;
                        i4 = 633506866;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        m6981 = (C0630.m2566("ۘ᩹") ^ i6) * 13;
                        i = ((m6981 ^ i5) * (-12537)) ^ 1531042302;
                        i2 = -507064087;
                        short[] sArr52222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr52222222;
                    }
                case -617292766:
                case -365327528:
                    sArr = sArr4;
                    int i18 = s + s2;
                    if (i11 - (i18 * i18) < 0) {
                        m6981 = C2105.m6981("۫۬") ^ i6;
                        i = ((m6981 ^ i5) * (-15791)) ^ (-484503906);
                        i2 = -788981859;
                    } else {
                        m6981 = (C2105.m6981("᩸ܽ") + i5) * 29;
                        i = ((m6981 ^ i6) * (-25717)) ^ (-73266596);
                        i2 = -1735587114;
                    }
                    short[] sArr522222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr522222222;
                case -226454892:
                case 1263087269:
                    sArr = sArr4;
                    i12 = 21162;
                    m6981 = (C2105.m6981("᩷᩺") ^ i5) * (-5);
                    i = ((m6981 ^ i6) * (-15753)) ^ (-1518872693);
                    i2 = -587304180;
                    short[] sArr5222222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr5222222222;
                case -362975:
                case 338266857:
                    if (C0630.m2564()) {
                        sArr = sArr4;
                        m6981 = C2105.m6981("۠ۚ") ^ i5;
                        i = ((m6981 ^ i6) * (-31131)) ^ 2000573637;
                        i2 = 338900062;
                        short[] sArr52222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr52222222222;
                    } else {
                        m69812 = (i5 - C0630.m2566("᩵֡")) * 77;
                        i3 = ((m69812 ^ i6) * (-20341)) ^ 1037229144;
                        i4 = 319990849;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    }
                case 103518312:
                case 129699670:
                    C0714.m2805();
                    if (C21923.f70183 != 0) {
                        m69812 = (i5 - C0630.m2566("᩵֡")) * 77;
                        i3 = ((m69812 ^ i6) * (-20341)) ^ 1037229144;
                        i4 = 319990849;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        sArr = sArr4;
                        m6981 = C0630.m2566("ۡ᩻") ^ i5;
                        i = ((m6981 ^ i6) * (-25029)) ^ 2091937412;
                        i2 = 982779045;
                        short[] sArr522222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr522222222222;
                    }
                case 252326853:
                case 482656709:
                    sArr = sArr4;
                    str2 = C2105.m6988(sArr3, i13, i14, i12);
                    jSONObject = this.f4671;
                    if (C1047.f3863 >= 0) {
                        sArr4 = sArr;
                        m69812 = C2105.m6981("ۘۤ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-15991)) ^ 1611386140;
                        i4 = 633506866;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        m6981 = (C2105.m6981("۠۟") + i5) * 67;
                        i = ((m6981 ^ i6) * (-13525)) ^ (-644918322);
                        i2 = -1484252410;
                        short[] sArr5222222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr5222222222222;
                    }
                case 565088375:
                case 568891612:
                    sArr = sArr4;
                    i14 = 7;
                    if (RunnableC3474.f10992 > 0) {
                        m6981 = C0630.m2566("ۛۢ") ^ i6;
                        i = ((m6981 ^ i5) * (-24469)) ^ (-1830581229);
                        i2 = 1052590794;
                        short[] sArr52222222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr52222222222222;
                    }
                    m6981 = C0630.m2566("ۡ᩻") ^ i5;
                    i = ((m6981 ^ i6) * (-25029)) ^ 2091937412;
                    i2 = 982779045;
                    short[] sArr522222222222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr522222222222222;
                case 657532866:
                case 965842095:
                    C22628.m50615();
                    m69812 = (i5 - C0630.m2566("᩵֡")) * 77;
                    i3 = ((m69812 ^ i6) * (-20341)) ^ 1037229144;
                    i4 = 319990849;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                case 759624633:
                case 1071168439:
                    sArr = sArr4;
                    int i19 = i15 + i17;
                    i11 = i19 + i19;
                    s2 = 4977;
                    if (C4117.f13076 > 0) {
                        m6981 = (C2105.m6981("۫ۢ") ^ i5) * 63;
                        i = ((m6981 ^ i6) * (-19933)) ^ 1887735743;
                        i2 = 1787355335;
                        short[] sArr5222222222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr5222222222222222;
                    }
                    m6981 = C0630.m2566("ۡ᩻") ^ i5;
                    i = ((m6981 ^ i6) * (-25029)) ^ 2091937412;
                    i2 = 982779045;
                    short[] sArr52222222222222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr52222222222222222;
                case 982421074:
                case 2021225443:
                    C4263.m12819();
                    if (C5695.f17556 >= 0) {
                        m69812 = (i5 - C0630.m2566("᩵֡")) * 77;
                        i3 = ((m69812 ^ i6) * (-20341)) ^ 1037229144;
                        i4 = 319990849;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        sArr = sArr4;
                        m6981 = (C2105.m6981("ۡۘ") + i6) * (-33);
                        i = ((m6981 ^ i5) * 15693) ^ 1209750598;
                        i2 = -1458693021;
                        short[] sArr522222222222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr522222222222222222;
                    }
                default:
                    sArr = sArr4;
                    s = sArr2[c];
                    if (C4263.f13799 > 0) {
                        m6981 = C2105.m6981("֨ܶ") ^ i6;
                        i = ((m6981 ^ i5) * (-11517)) ^ 470022236;
                        i2 = -1487756286;
                        short[] sArr5222222222222222222 = sArr;
                        i8 = m6981 ^ i2;
                        i7 = i;
                        sArr4 = sArr5222222222222222222;
                    }
                    m6981 = (C2105.m6981("ۡۘ") + i6) * (-33);
                    i = ((m6981 ^ i5) * 15693) ^ 1209750598;
                    i2 = -1458693021;
                    short[] sArr52222222222222222222 = sArr;
                    i8 = m6981 ^ i2;
                    i7 = i;
                    sArr4 = sArr52222222222222222222;
            }
            return;
        }
    }
}
