package l;

import android.app.Activity;
import moe.shizuku.server.IShizukuService;

/* compiled from: E4FN */
/* renamed from: l.۬֨ۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC12781 implements Runnable {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Activity f38390;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ InterfaceC9461 f38391;

    public /* synthetic */ RunnableC12781(Activity activity, InterfaceC9461 interfaceC9461) {
        int i = 633729502;
        int i2 = C5695.f17556;
        int i3 = C3245.f10203;
        int m6981 = (C2105.m6981("᩵ۖ") ^ i2) * (-27);
        int i4 = ((m6981 ^ i3) * 32557) ^ 2122007102;
        int i5 = 1484434338;
        while (true) {
            i = ((((i ^ i3) * (-17921)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2131881290:
                case -1103592830:
                    if (C3663.f11553) {
                        m6981 = (C2105.m6981("ܰ֫") + i2) * (-7);
                        i4 = ((m6981 ^ i3) * 24265) ^ 1236732036;
                        i5 = 731249885;
                    } else {
                        m6981 = (i3 - C0630.m2566("ܺۨ")) * 79;
                        i4 = ((m6981 ^ i2) * 12339) ^ (-782682960);
                        i5 = 1591072110;
                    }
                case -1896187921:
                case -1661711996:
                    if (C4075.f12947 >= 0) {
                        m6981 = (C0630.m2566("ۖ֡") ^ i3) * (-93);
                        i4 = ((m6981 ^ i2) * (-20167)) ^ 923680995;
                        i5 = -368925799;
                    } else {
                        m6981 = (C0630.m2566("ۡ᩶") + i3) * 101;
                        i4 = ((m6981 ^ i2) * 30313) ^ (-1956103581);
                        i5 = -92331106;
                    }
                case -1871624452:
                case -1206090085:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = (C0630.m2566("֫᩶") ^ i3) * 119;
                        i4 = ((m6981 ^ i2) * 1781) ^ 73673672;
                        i5 = 116662634;
                    } else {
                        m6981 = C0630.m2566("᩻ܶ") ^ i2;
                        i4 = ((m6981 ^ i3) * 31241) ^ 732383961;
                        i5 = -736451441;
                    }
                case -1814465776:
                case -1363530595:
                    C0798.m2998();
                    if (C11340.f33930 < 0) {
                        m6981 = (C2105.m6981("ܰ֫") + i2) * (-7);
                        i4 = ((m6981 ^ i3) * 24265) ^ 1236732036;
                        i5 = 731249885;
                    } else {
                        m6981 = (C2105.m6981("ۤܿ") + i2) * 5;
                        i4 = ((m6981 ^ i3) * (-30947)) ^ 1721640385;
                        i5 = 166650182;
                    }
                case -1733652027:
                case -1663361548:
                    if (C7811.f24123 >= 0) {
                        m6981 = (C2105.m6981("ۤܿ") + i2) * 5;
                        i4 = ((m6981 ^ i3) * (-30947)) ^ 1721640385;
                        i5 = 166650182;
                    } else {
                        m6981 = C0630.m2566("᩶ۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-13261)) ^ (-1542267704);
                        i5 = -1567329803;
                    }
                case -1632537070:
                case -248425972:
                    if (C1711.f5919) {
                        m6981 = (C2105.m6981("ۤܿ") + i2) * 5;
                        i4 = ((m6981 ^ i3) * (-30947)) ^ 1721640385;
                        i5 = 166650182;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩸ܿ")) * (-51);
                        i4 = ((m6981 ^ i3) * 14495) ^ (-441089975);
                        i5 = -1008272146;
                    }
                case -1543784884:
                case -1499379972:
                    this.f38390 = activity;
                    if (C4075.f12947 >= 0) {
                        m6981 = C0630.m2566("᩹᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-3315)) ^ (-692946392);
                        i5 = 2122084864;
                    } else {
                        m6981 = (C2105.m6981("֫۫") ^ i2) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m6981 ^ i3) * (-21261)) ^ (-1026535968);
                        i5 = -307628827;
                    }
                case -1461575009:
                case 687859937:
                    ViewOnClickListenerC1958.m6429();
                    m6981 = C0630.m2566("᩹᩵") ^ i3;
                    i4 = ((m6981 ^ i2) * (-3315)) ^ (-692946392);
                    i5 = 2122084864;
                case -1409740612:
                case -217839881:
                    C11340.m28031();
                    if (C1504.f5354) {
                        m6981 = (C0630.m2566("֫᩶") ^ i3) * 119;
                        i4 = ((m6981 ^ i2) * 1781) ^ 73673672;
                        i5 = 116662634;
                    } else {
                        m6981 = (C2105.m6981("ܰ֫") + i2) * (-7);
                        i4 = ((m6981 ^ i3) * 24265) ^ 1236732036;
                        i5 = 731249885;
                    }
                case -979181263:
                case 2121787242:
                    this.f38391 = interfaceC9461;
                    return;
                case -600871523:
                case 7789647:
                    C0964.m3413();
                    if (C22628.f73083 > 0) {
                        m6981 = C0630.m2566("᩹᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-3315)) ^ (-692946392);
                        i5 = 2122084864;
                    } else {
                        m6981 = (C2105.m6981("ܰ֫") + i2) * (-7);
                        i4 = ((m6981 ^ i3) * 24265) ^ 1236732036;
                        i5 = 731249885;
                    }
                case -200281062:
                case 1614893295:
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = (C0630.m2566("ۖ֡") ^ i3) * (-93);
                        i4 = ((m6981 ^ i2) * (-20167)) ^ 923680995;
                        i5 = -368925799;
                    } else {
                        m6981 = C0630.m2566("۟ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 6045) ^ 931293958;
                        i5 = 1973250638;
                    }
                case -97556101:
                case -33631800:
                    if (C3432.f10845 >= 0) {
                        m6981 = (C2105.m6981("ܰ֫") + i2) * (-7);
                        i4 = ((m6981 ^ i3) * 24265) ^ 1236732036;
                        i5 = 731249885;
                    } else {
                        m6981 = (C0630.m2566("֡ۧ") ^ i2) * 109;
                        i4 = ((m6981 ^ i3) * (-26883)) ^ (-1711740538);
                        i5 = -1196031162;
                    }
                case 247037790:
                case 959363267:
                    if (C0050.m940() <= 0) {
                        m6981 = C0630.m2566("᩹᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-3315)) ^ (-692946392);
                        i5 = 2122084864;
                    } else {
                        m6981 = (i3 - C0630.m2566("᩺ۛ")) * 21;
                        i4 = ((m6981 ^ i2) * (-19101)) ^ 311422354;
                        i5 = 578883167;
                    }
                case 296426139:
                case 1543923060:
                    C1294.m4372();
                    throw new RuntimeException();
                default:
                    if (C0964.f3626 != 0) {
                        m6981 = (C0630.m2566("ۖ֡") ^ i3) * (-93);
                        i4 = ((m6981 ^ i2) * (-20167)) ^ 923680995;
                        i5 = -368925799;
                    } else {
                        m6981 = (i3 - C2105.m6981("۟ۙ")) * 83;
                        i4 = ((m6981 ^ i2) * 15455) ^ 969566936;
                        i5 = 1399293280;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        C2405.m7817(this.f38390, C2405.m7782(), this.f38391);
    }
}
