package l;

import java.util.function.Consumer;
import moe.shizuku.server.IShizukuService;

/* compiled from: H3YF */
/* renamed from: l.۫ܿ᩷, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final /* synthetic */ class RunnableC12560 implements Runnable {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f37863;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f37864;

    public /* synthetic */ RunnableC12560(int i, Object obj) {
        int i2 = 1024465387;
        int i3 = C3911.f12484;
        int i4 = RunnableC0588.f2309;
        this.f37863 = i;
        this.f37864 = obj;
        int m6981 = C2105.m6981("᩺ۜ") ^ i4;
        int i5 = ((m6981 ^ i3) * (-10403)) ^ 126084235;
        int i6 = -969205916;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * 10415) >> 31));
            switch (i2) {
                case -1461684845:
                case -1181650759:
                    C2958.m9034();
                    C4263.m12819();
                    m6981 = C0630.m2566("᩹᩸") ^ i3;
                    i5 = ((m6981 ^ i4) * 1845) ^ 1155655612;
                    i6 = 1347557965;
                case -1229819065:
                case -477681710:
                    C2520.m8026();
                    throw new RuntimeException();
                case -895871739:
                case 1488383848:
                    C4263.m12819();
                    if (AbstractC2021.f6743 > 0) {
                        m6981 = (C2105.m6981("ۖᩴ") + i3) * (-3);
                        i5 = ((m6981 ^ i4) * (-1403)) ^ 1854439426;
                        i6 = -474761420;
                    } else {
                        m6981 = C0630.m2566("ۚ۠") ^ i3;
                        i5 = ((m6981 ^ i4) * (-2485)) ^ (-1524092513);
                        i6 = 1066994677;
                    }
                case -646252890:
                case 934920429:
                    if (C5695.f17556 < 0) {
                        m6981 = (C2105.m6981("ۖᩴ") + i3) * (-3);
                        i5 = ((m6981 ^ i4) * (-1403)) ^ 1854439426;
                        i6 = -474761420;
                    } else {
                        m6981 = C0630.m2566("ᩳᩴ") ^ i4;
                        i5 = ((m6981 ^ i3) * 15691) ^ 1702804719;
                        i6 = 1715096698;
                    }
                case -579667641:
                case 1441110919:
                    return;
                case -307528358:
                case 1606669161:
                    if (C22628.f73083 <= 0) {
                        m6981 = (i4 - C2105.m6981("᩻ܶ")) * 49;
                        i5 = ((m6981 ^ i3) * (-6001)) ^ 595601698;
                        i6 = 539721788;
                    } else {
                        m6981 = C0630.m2566("۠᩸") ^ i4;
                        i5 = ((m6981 ^ i3) * 14121) ^ 102144946;
                        i6 = -870413392;
                    }
                default:
                    if (C3432.m10477() <= 0) {
                        m6981 = C0630.m2566("᩹᩸") ^ i3;
                        i5 = ((m6981 ^ i4) * 1845) ^ 1155655612;
                        i6 = 1347557965;
                    } else {
                        m6981 = (C2105.m6981("ۖᩴ") + i3) * (-3);
                        i5 = ((m6981 ^ i4) * (-1403)) ^ 1854439426;
                        i6 = -474761420;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        ActivityC23143 activityC23143 = null;
        final C16688 c16688 = null;
        int i = -1970316604;
        int i2 = C0714.f2697;
        int i3 = C3537.f11231;
        int m6981 = C2105.m6981("ܶ᩺") ^ i3;
        int i4 = ((m6981 ^ i2) * (-27807)) ^ (-1027021068);
        int i5 = -1056861121;
        while (true) {
            i = ((((i ^ i2) * 11419) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2044917454:
                case -1205884536:
                    if (C4117.f13076 <= 0) {
                        m6981 = C2105.m6981("ۛۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23171)) ^ 260993890;
                        i5 = -1930959416;
                    } else {
                        m6981 = C2105.m6981("ܺۜ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-30903)) ^ 1422388335;
                        i5 = -961832987;
                    }
                case -1271148760:
                case -117687813:
                    activityC23143 = (ActivityC23143) this.f37864;
                    if (C3911.m11924() <= 0) {
                        m6981 = (C0630.m2566("ܿᩴ") ^ i3) * 51;
                        i4 = ((m6981 ^ i2) * (-11125)) ^ (-1256559726);
                        i5 = -1246925347;
                    } else {
                        m6981 = C2105.m6981("֫᩻") ^ i2;
                        i4 = ((m6981 ^ i3) * 8801) ^ (-1021644691);
                        i5 = 1178306475;
                    }
                case -1252202162:
                case 1608732483:
                    if (AbstractC2021.f6743 > 0) {
                        c16688.m34227(new Consumer() { // from class: l.ۧܰ᩷
                            @Override // java.util.function.Consumer
                            /* renamed from: accept */
                            public final void n(Object obj) {
                                C16688.m39225(C16688.this, (ActivityC17169) obj);
                            }

                            public /* synthetic */ Consumer andThen(Consumer consumer) {
                                return C23517.$default$andThen(this, consumer);
                            }
                        });
                        break;
                    }
                    m6981 = C0630.m2566("ᩴ۫") ^ i3;
                    i4 = ((m6981 ^ i2) * (-229)) ^ 316986805;
                    i5 = 529559734;
                case -1154731076:
                case 833567944:
                    if (C3432.f10845 >= 0) {
                        m6981 = (C0630.m2566("ܿᩴ") ^ i3) * 51;
                        i4 = ((m6981 ^ i2) * (-11125)) ^ (-1256559726);
                        i5 = -1246925347;
                    } else {
                        m6981 = C2105.m6981("ܿۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 10921) ^ (-145486160);
                        i5 = -58532197;
                    }
                case -931899514:
                case 782341868:
                    if (C11340.f33930 >= 0) {
                        m6981 = C0630.m2566("ᩴ۫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-229)) ^ 316986805;
                        i5 = 529559734;
                    } else {
                        m6981 = (C2105.m6981("ۧۜ") ^ i2) * (-109);
                        i4 = ((m6981 ^ i3) * 10233) ^ (-1931054315);
                        i5 = 521016063;
                    }
                case -836090357:
                case -178157730:
                    C7106.m19120();
                    if (RunnableC0588.m2441() >= 0) {
                        m6981 = C2105.m6981("ۛۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23171)) ^ 260993890;
                        i5 = -1930959416;
                    } else {
                        m6981 = (i3 - C0630.m2566("ۘ֫")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i4 = ((m6981 ^ i2) * 28803) ^ (-27339780);
                        i5 = 1982909245;
                    }
                case -752210561:
                case -85282361:
                    activityC23143.f74401.m39492();
                    break;
                case -739346031:
                case 1372497896:
                    C0630.m2564();
                    C0382.m1848();
                    m6981 = (C0630.m2566("ܿᩴ") ^ i3) * 51;
                    i4 = ((m6981 ^ i2) * (-11125)) ^ (-1256559726);
                    i5 = -1246925347;
                case -441722077:
                case 1468237216:
                    if (ViewOnClickListenerC1958.f6529 <= 0) {
                        m6981 = C0630.m2566("ᩴ۫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-229)) ^ 316986805;
                        i5 = 529559734;
                    } else {
                        m6981 = C2105.m6981("۫ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * 11665) ^ (-1782995633);
                        i5 = 1957000842;
                    }
                case -428832833:
                case 387087693:
                    if (C3663.f11553) {
                        m6981 = C2105.m6981("ۛۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23171)) ^ 260993890;
                        i5 = -1930959416;
                    } else {
                        m6981 = (C2105.m6981("֫۟") ^ i2) * (-27);
                        i4 = ((m6981 ^ i3) * 9033) ^ (-2127157188);
                        i5 = -1441052627;
                    }
                case -401937414:
                case 1820942608:
                    ((C16971) this.f37864).m39800();
                    break;
                case -343887626:
                case 280519281:
                    switch (this.f37863) {
                        case 0:
                            m6981 = (C2105.m6981("᩹ܳ") + i3) * (-47);
                            i4 = ((m6981 ^ i2) * 12829) ^ (-1670084506);
                            i5 = -900395444;
                            break;
                        case 1:
                            m6981 = (C2105.m6981("ᩳ᩸") + i3) * 41;
                            i4 = ((m6981 ^ i2) * (-1993)) ^ 115690134;
                            i5 = -1991212304;
                            break;
                        default:
                            m6981 = (i2 - C2105.m6981("ۗۧ")) * 89;
                            i4 = ((m6981 ^ i3) * 32757) ^ (-1141031599);
                            i5 = 364550069;
                            break;
                    }
                case 44573834:
                case 763761408:
                    C11340.m28031();
                    if (C1128.f4106 > 0) {
                        m6981 = (C0630.m2566("ܿᩴ") ^ i3) * 51;
                        i4 = ((m6981 ^ i2) * (-11125)) ^ (-1256559726);
                        i5 = -1246925347;
                    } else {
                        m6981 = C2105.m6981("ۘ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29611)) ^ 1980857120;
                        i5 = -545172649;
                    }
                case 123080916:
                case 388794076:
                    if (C0237.f1507 == 0) {
                        m6981 = C2105.m6981("ۘ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29611)) ^ 1980857120;
                        i5 = -545172649;
                    } else {
                        m6981 = C2105.m6981("ۛۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23171)) ^ 260993890;
                        i5 = -1930959416;
                    }
                case 511313143:
                case 1600976887:
                    c16688 = (C16688) this.f37864;
                    if (C0798.f2919) {
                        m6981 = C0630.m2566("ᩴ۫") ^ i3;
                        i4 = ((m6981 ^ i2) * (-229)) ^ 316986805;
                        i5 = 529559734;
                    } else {
                        m6981 = C2105.m6981("۠ܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * 11893) ^ (-559339912);
                        i5 = -1906663585;
                    }
                case 1523941618:
                case 2107714096:
                    C7811.m20844();
                    break;
                case 1532862768:
                case 1996901927:
                    if (C0483.f2088 >= 0) {
                        m6981 = C2105.m6981("ۘ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29611)) ^ 1980857120;
                        i5 = -545172649;
                    } else {
                        m6981 = (C2105.m6981("ܺܿ") ^ i3) * 93;
                        i4 = ((m6981 ^ i2) * (-2117)) ^ (-497913042);
                        i5 = -1952032817;
                    }
                default:
                    if (C3746.m11369() >= 0) {
                        m6981 = C2105.m6981("ۘ᩺") ^ i2;
                        i4 = ((m6981 ^ i3) * (-29611)) ^ 1980857120;
                        i5 = -545172649;
                    } else {
                        m6981 = C2105.m6981("ۧܳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25963)) ^ (-1147941843);
                        i5 = 1772517614;
                    }
            }
            return;
        }
    }
}
