package l;

import android.widget.Button;
import bin.mt.plus.Main;
import com.google.android.material.search.SearchView;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.io.IOException;
import java.io.InputStream;
import java.lang.ref.WeakReference;
import moe.shizuku.server.IShizukuService;

/* compiled from: V6B4 */
/* renamed from: l.᩷۠᩷, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final /* synthetic */ class RunnableC20760 implements Runnable {

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f67245;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f67246;

    public /* synthetic */ RunnableC20760(int i, Object obj) {
        int i2 = -1292716434;
        int i3 = C0483.f2088;
        int i4 = AbstractC2021.f6743;
        this.f67245 = i;
        this.f67246 = obj;
        int m6981 = (C2105.m6981("ۤۙ") ^ i4) * (-117);
        int i5 = ((m6981 ^ i3) * 25667) ^ 1710413032;
        int i6 = 616642598;
        while (true) {
            i2 = (m6981 ^ i6) ^ (i5 & (((i2 ^ i3) * 207) >> 31));
            switch (i2) {
                case -1984856654:
                case 775343242:
                    RunnableC3474.m10630();
                    C1504.m5179();
                    m6981 = C2105.m6981("᩹ܿ") ^ i4;
                    i5 = ((m6981 ^ i3) * 20329) ^ 14535696;
                    i6 = 986573829;
                case -1559518370:
                case -296556884:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C2105.m6981("᩹ܿ") ^ i4;
                        i5 = ((m6981 ^ i3) * 20329) ^ 14535696;
                        i6 = 986573829;
                    } else {
                        m6981 = C2105.m6981("᩻᩷") ^ i4;
                        i5 = ((m6981 ^ i3) * 17819) ^ 1259282421;
                        i6 = 245880312;
                    }
                case -1298945562:
                case 1477317927:
                    C1294.m4372();
                    if (C0382.m1848()) {
                        m6981 = C2105.m6981("᩹ܿ") ^ i4;
                        i5 = ((m6981 ^ i3) * 20329) ^ 14535696;
                        i6 = 986573829;
                    } else {
                        m6981 = (C2105.m6981("ۗܶ") + i3) * (-67);
                        i5 = ((m6981 ^ i4) * (-30121)) ^ (-1045649305);
                        i6 = -1213081808;
                    }
                case -151421671:
                case 1263655246:
                    return;
                case 351067620:
                case 2114548195:
                    if (C1128.m3851() > 0) {
                        m6981 = C2105.m6981("᩻᩷") ^ i4;
                        i5 = ((m6981 ^ i3) * 17819) ^ 1259282421;
                        i6 = 245880312;
                    } else {
                        m6981 = C2105.m6981("ۧ᩵") ^ i3;
                        i5 = ((m6981 ^ i4) * (-15051)) ^ (-1847422540);
                        i6 = 829505729;
                    }
                case 695058854:
                case 1818515552:
                    C22628.m50615();
                    throw new RuntimeException();
                default:
                    if (C1420.f5096 <= 0) {
                        m6981 = (C2105.m6981("ܰܿ") ^ i4) * (-17);
                        i5 = ((m6981 ^ i3) * 12045) ^ 475921740;
                        i6 = 708976720;
                    } else {
                        m6981 = (C2105.m6981("ۡ֡") + i3) * (-125);
                        i5 = ((m6981 ^ i4) * (-28909)) ^ 862275785;
                        i6 = -38970320;
                    }
            }
        }
    }

    @Override // java.lang.Runnable
    public final void run() {
        WeakReference weakReference = null;
        C16560 c16560 = null;
        InputStream inputStream = null;
        Button button = null;
        int i = -645003628;
        int i2 = C4616.f14690;
        int i3 = C1047.f3863;
        int m6981 = (i3 - C2105.m6981("ܽܶ")) * (-109);
        int i4 = ((m6981 ^ i2) * 23261) ^ (-1743346815);
        int i5 = -1907462614;
        while (true) {
            i = ((((i ^ i2) * (-20775)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -2079223101:
                case -1243836324:
                    C20478.m46907((C20478) this.f67246);
                    break;
                case -1765224885:
                case 1462293135:
                    if (C4616.f14690 <= 0) {
                        m6981 = (C2105.m6981("ۗ۠") + i2) * (-71);
                        i4 = ((m6981 ^ i3) * 22219) ^ 549494143;
                        i5 = 85652921;
                    } else {
                        m6981 = (C0630.m2566("ۡ۬") ^ i2) * 33;
                        i4 = ((m6981 ^ i3) * 24109) ^ 674598811;
                        i5 = 505724857;
                    }
                case -1747248312:
                case 1993698583:
                    if (C0714.m2805()) {
                        m6981 = (C2105.m6981("۬֨") + i3) * 75;
                        i4 = ((m6981 ^ i2) * (-26779)) ^ (-1386735273);
                        i5 = -459090660;
                    } else {
                        m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                        i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                        i5 = 517606872;
                    }
                case -1607089770:
                case 1261803544:
                    ((SearchView) this.f67246).lambda$requestFocusAndShowKeyboard$8();
                    break;
                case -1482951703:
                case 230633304:
                    C1504.m5172((DialogInterfaceC0206) this.f67246);
                    break;
                case -1420319404:
                case -220020126:
                    if (RunnableC1108.f4040) {
                        m6981 = C0630.m2566("᩸۫") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27021)) ^ (-295293063);
                        i5 = -1037814924;
                    } else {
                        m6981 = (C2105.m6981("ۗ۠") + i2) * (-71);
                        i4 = ((m6981 ^ i3) * 22219) ^ 549494143;
                        i5 = 85652921;
                    }
                case -1325219487:
                case 450931171:
                    C0483.m2121();
                    if (C3911.f12484 < 0) {
                        m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                        i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                        i5 = 517606872;
                    } else {
                        m6981 = (C2105.m6981("ۗ۠") + i2) * (-71);
                        i4 = ((m6981 ^ i3) * 22219) ^ 549494143;
                        i5 = 85652921;
                    }
                case -1127057781:
                case 289043235:
                    if (C4616.f14690 <= 0) {
                        m6981 = C0630.m2566("ܺܿ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11767)) ^ (-1073737012);
                        i5 = -53388531;
                    } else {
                        m6981 = C2105.m6981("ܶۡ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-15625)) ^ (-1796116273);
                        i5 = 1568003238;
                    }
                case -1030038382:
                case 914018820:
                    C1451.m4961((C1451) this.f67246);
                    break;
                case -996401581:
                case -347021385:
                    button.setClickable(true);
                    break;
                case -804440156:
                case 882367813:
                    Main.m76(weakReference);
                    break;
                case -692554864:
                case 905707415:
                    c16560.m39052();
                    if (C4616.m13552() != 0) {
                        m6981 = C0630.m2566("۫ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27087)) ^ (-1265413333);
                        i5 = -1749433615;
                    } else {
                        m6981 = C0630.m2566("ܿ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-20899)) ^ (-1000545169);
                        i5 = 2143116808;
                    }
                case -532684814:
                case 261165715:
                    if (C0050.f910 >= 0) {
                        m6981 = C0630.m2566("ܺܿ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11767)) ^ (-1073737012);
                        i5 = -53388531;
                    } else {
                        m6981 = (C0630.m2566("۟᩷") ^ i3) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                        i4 = ((m6981 ^ i2) * (-2301)) ^ (-1871301397);
                        i5 = -63252469;
                    }
                case -459483449:
                case 1081099344:
                    if (C3245.m9925() != 0) {
                        m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                        i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                        i5 = 517606872;
                    } else {
                        m6981 = (C2105.m6981("ܶ۠") ^ i2) * (-125);
                        i4 = ((m6981 ^ i3) * (-10495)) ^ 875833151;
                        i5 = -1438178699;
                    }
                case -451930573:
                case -371153539:
                    C4159.m12565();
                    C3432.m10477();
                    break;
                case -443313333:
                case 13700532:
                    c16560 = (C16560) this.f67246;
                    if (C4263.f13799 <= 0) {
                        m6981 = C2105.m6981("ܰۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10521)) ^ (-1171177012);
                        i5 = -272119501;
                    } else {
                        m6981 = C2105.m6981("ۤܶ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25829)) ^ (-924987650);
                        i5 = -1199364564;
                    }
                case 293721515:
                case 1418778648:
                    inputStream = (InputStream) this.f67246;
                    m6981 = (C0630.m2566("֫ۚ") + i3) * (-95);
                    i4 = ((m6981 ^ i2) * (-3529)) ^ 1778180086;
                    i5 = -1759533268;
                case 314547455:
                case 1152546712:
                    if (C2167.f7158 < 0) {
                        m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                        i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                        i5 = 517606872;
                    } else {
                        m6981 = C2105.m6981("ܰۨ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-10521)) ^ (-1171177012);
                        i5 = -272119501;
                    }
                case 394228322:
                case 1870056653:
                    button = (Button) this.f67246;
                    if (RunnableC1108.m3790()) {
                        m6981 = C0630.m2566("۫ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27087)) ^ (-1265413333);
                        i5 = -1749433615;
                    } else {
                        m6981 = C2105.m6981("ۘ۬") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25067)) ^ 1601860709;
                        i5 = 1239728174;
                    }
                case 745561977:
                case 1656695266:
                    C1773.m5908();
                    if (C0714.m2805()) {
                        m6981 = C0630.m2566("ܺܿ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-11767)) ^ (-1073737012);
                        i5 = -53388531;
                    } else {
                        m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                        i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                        i5 = 517606872;
                    }
                case 748049153:
                case 2077158218:
                    break;
                case 1019751764:
                case 1360864194:
                    weakReference = (WeakReference) this.f67246;
                    if (AbstractC2021.m6574()) {
                        m6981 = C0630.m2566("۫ۛ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-27087)) ^ (-1265413333);
                        i5 = -1749433615;
                    } else {
                        m6981 = C0630.m2566("۫ۚ") ^ i2;
                        i4 = ((m6981 ^ i3) * 13045) ^ (-1712263103);
                        i5 = 1349414552;
                    }
                case 1106413998:
                case 1493591881:
                    c16560.m39026().m39052();
                    break;
                case 1162024865:
                case 1906948385:
                    C4263.m12819();
                    C0630.m2564();
                    m6981 = (C0630.m2566("᩵᩶") ^ i2) * (-53);
                    i4 = ((m6981 ^ i3) * (-26133)) ^ 1204486168;
                    i5 = 517606872;
                case 1241915482:
                case 1597064235:
                    switch (this.f67245) {
                        case 0:
                            m6981 = C2105.m6981("۫ۜ") ^ i3;
                            i4 = ((m6981 ^ i2) * (-14319)) ^ (-742901522);
                            i5 = -597296134;
                            break;
                        case 1:
                            m6981 = (i2 - C2105.m6981("ۙ᩺")) * (-83);
                            i4 = ((m6981 ^ i3) * (-14573)) ^ (-1696725032);
                            i5 = -1275138879;
                            break;
                        case 2:
                            m6981 = (i3 - C2105.m6981("ۨۛ")) * (-33);
                            i4 = ((m6981 ^ i2) * (-20983)) ^ (-1282732891);
                            i5 = -1015888514;
                            break;
                        case 3:
                            m6981 = C2105.m6981("ܰ֨") ^ i3;
                            i4 = ((m6981 ^ i2) * 18619) ^ (-877217510);
                            i5 = 719524600;
                            break;
                        case 4:
                            m6981 = C2105.m6981("ܿܰ") ^ i2;
                            i4 = ((m6981 ^ i3) * (-25785)) ^ (-648322821);
                            i5 = 926608570;
                            break;
                        case 5:
                            m6981 = C0630.m2566("ۨܶ") ^ i2;
                            i4 = ((m6981 ^ i3) * (-18759)) ^ (-940013504);
                            i5 = 1238224707;
                            break;
                        case 6:
                            m6981 = (C0630.m2566("ܳ۫") + i3) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                            i4 = ((m6981 ^ i2) * 31545) ^ 1215946764;
                            i5 = -1516504024;
                            break;
                        default:
                            m6981 = (C0630.m2566("᩻ۗ") + i2) * (-31);
                            i4 = ((m6981 ^ i3) * (-13413)) ^ 1630834617;
                            i5 = -286389398;
                            break;
                    }
                default:
                    try {
                        RunnableC1108.m3785(inputStream);
                    } catch (IOException | RuntimeException unused) {
                    }
                    m6981 = C2105.m6981("ۛ֨") ^ i2;
                    i4 = ((m6981 ^ i3) * (-23963)) ^ 2117704031;
                    i5 = 170743788;
            }
            return;
        }
    }
}
