package l;

import android.graphics.drawable.Drawable;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;

/* compiled from: 82RX */
/* renamed from: l.ۗܽ᩷, reason: contains not printable characters */
/* loaded from: classes2.dex */
public final class ViewOnClickListenerC3367 extends AbstractC3255 implements View.OnClickListener {

    /* renamed from: ܽۧۢ, reason: not valid java name and contains not printable characters */
    private static final short[] f10652 = {7615, -8661, -11526, -13027, -14694, 10621, 9951, 7880, 5914, 8870, -14222, -14913, 5299, -9805, -15998, 7333};

    /* renamed from: ۗ, reason: not valid java name and contains not printable characters */
    public TextView f10653;

    /* renamed from: ۙ, reason: not valid java name and contains not printable characters */
    public TextView f10654;

    /* renamed from: ۬, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ C13244 f10655;

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public TextView f10656;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public C19099 f10657;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public ImageView f10658;

    @Override // android.view.View.OnClickListener
    public final void onClick(View view) {
        C13244 c13244 = null;
        AbstractActivityC3346 abstractActivityC3346 = null;
        String str = null;
        Drawable drawable = null;
        boolean z = false;
        int i = 1942890942;
        int i2 = C1294.f4556;
        int i3 = C1128.f4106;
        int m6981 = C2105.m6981("ᩴ֨") ^ i2;
        int i4 = ((m6981 ^ i3) * 12627) ^ (-820625301);
        int i5 = -89421694;
        while (true) {
            i = ((((i ^ i3) * 2811) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1802908331:
                case -822221283:
                    if (C3746.f11829 <= 0) {
                        m6981 = C2105.m6981("ܿܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * 24853) ^ (-1861780454);
                        i5 = 493256577;
                    } else {
                        m6981 = C2105.m6981("ۖۘ") ^ i2;
                        i4 = ((m6981 ^ i3) * 32499) ^ (-816027542);
                        i5 = 1085371292;
                    }
                case -1316499407:
                case 604580753:
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("֫ۤ") ^ i2;
                        i4 = ((m6981 ^ i3) * 4119) ^ (-433989124);
                        i5 = -1838666051;
                    } else {
                        m6981 = (C2105.m6981("֫ᩳ") + i3) * (-19);
                        i4 = ((m6981 ^ i2) * (-13185)) ^ 1187544836;
                        i5 = -1793337792;
                    }
                case -1301402038:
                case -931962001:
                    C3432.m10477();
                    if (C0483.m2121()) {
                        m6981 = (C2105.m6981("֫ᩳ") + i3) * (-19);
                        i4 = ((m6981 ^ i2) * (-13185)) ^ 1187544836;
                        i5 = -1793337792;
                    } else {
                        m6981 = (C2105.m6981("ᩳ᩻") + i2) * 109;
                        i4 = ((m6981 ^ i3) * 13001) ^ 1808763813;
                        i5 = -1127379568;
                    }
                case -1297875006:
                case -1277016873:
                    abstractActivityC3346 = c13244.f39637;
                    if (C0050.f910 >= 0) {
                        m6981 = C2105.m6981("ۧ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23713)) ^ 1936150244;
                        i5 = -1257903094;
                    } else {
                        m6981 = (i3 - C2105.m6981("֨᩸")) * (-99);
                        i4 = ((m6981 ^ i2) * (-22755)) ^ (-1850932863);
                        i5 = -450581663;
                    }
                case -1150293505:
                case 343685037:
                    z = false;
                    if (C22628.f73083 <= 0) {
                        m6981 = (C2105.m6981("֫ᩳ") + i3) * (-19);
                        i4 = ((m6981 ^ i2) * (-13185)) ^ 1187544836;
                        i5 = -1793337792;
                    } else {
                        m6981 = (C0630.m2566("ᩳ᩷") ^ i2) * (-51);
                        i4 = ((m6981 ^ i3) * (-18165)) ^ 932019388;
                        i5 = 1748016038;
                    }
                case -1143861165:
                case 1537107604:
                    C3019.m9255();
                    C7106.m19120();
                    break;
                case -885015184:
                case 95417873:
                    ViewOnClickListenerC1958.m6429();
                    if (C1916.m6308() < 0) {
                        m6981 = C0630.m2566("ܳ᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-27183)) ^ (-954227498);
                        i5 = 1394252030;
                    } else {
                        m6981 = (C2105.m6981("ᩳ᩻") + i2) * 109;
                        i4 = ((m6981 ^ i3) * 13001) ^ 1808763813;
                        i5 = -1127379568;
                    }
                case -580259168:
                case 1219302373:
                    ActivityC12581.m30822(abstractActivityC3346, str, drawable, z, null);
                    break;
                case -273080459:
                case 132553036:
                    if (C3245.f10203 <= 0) {
                        m6981 = C2105.m6981("ۧ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23713)) ^ 1936150244;
                        i5 = -1257903094;
                    } else {
                        m6981 = C2105.m6981("ۙۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-28017)) ^ 1216891788;
                        i5 = 806418504;
                    }
                case 13368495:
                case 680093809:
                    drawable = this.f10658.getDrawable();
                    if (C0964.f3626 != 0) {
                        m6981 = C2105.m6981("ۧ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23713)) ^ 1936150244;
                        i5 = -1257903094;
                    } else {
                        m6981 = C0630.m2566("᩸ᩳ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-18315)) ^ (-1174205526);
                        i5 = -1276600116;
                    }
                case 357415941:
                case 1029713423:
                    c13244 = this.f10655;
                    if (C3663.f11553) {
                        m6981 = C0630.m2566("ܳ᩵") ^ i3;
                        i4 = ((m6981 ^ i2) * (-27183)) ^ (-954227498);
                        i5 = 1394252030;
                    } else {
                        m6981 = (C0630.m2566("᩷ۚ") + i3) * (-113);
                        i4 = ((m6981 ^ i2) * (-7491)) ^ (-1001064637);
                        i5 = -1897359385;
                    }
                case 437094136:
                case 1074052762:
                    if (RunnableC3474.f10992 > 0) {
                        m6981 = (C2105.m6981("֫ᩳ") + i3) * (-19);
                        i4 = ((m6981 ^ i2) * (-13185)) ^ 1187544836;
                        i5 = -1793337792;
                    } else {
                        m6981 = C2105.m6981("ܿܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * 24853) ^ (-1861780454);
                        i5 = 493256577;
                    }
                case 831315169:
                case 949232802:
                    if (C1504.m5179()) {
                        m6981 = (i2 - C0630.m2566("ᩳ۠")) * (-79);
                        i4 = ((m6981 ^ i3) * 24139) ^ 301763186;
                        i5 = -649607569;
                    } else {
                        m6981 = (C2105.m6981("֫ᩳ") + i3) * (-19);
                        i4 = ((m6981 ^ i2) * (-13185)) ^ 1187544836;
                        i5 = -1793337792;
                    }
                case 886079239:
                case 1439809845:
                    C0714.m2805();
                    C4117.m12364();
                    m6981 = C0630.m2566("ܳ᩵") ^ i3;
                    i4 = ((m6981 ^ i2) * (-27183)) ^ (-954227498);
                    i5 = 1394252030;
                case 1343988345:
                case 1465994815:
                    str = C2126.m7033(this.f10657);
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        m6981 = C2105.m6981("ۧ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23713)) ^ 1936150244;
                        i5 = -1257903094;
                    } else {
                        m6981 = (i2 - C0630.m2566("۟ܺ")) * (-39);
                        i4 = ((m6981 ^ i3) * (-5789)) ^ 1518261494;
                        i5 = 1426469087;
                    }
                default:
                    if (C1504.f5354) {
                        m6981 = C2105.m6981("ۧ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-23713)) ^ 1936150244;
                        i5 = -1257903094;
                    } else {
                        m6981 = C2105.m6981("֡ۧ") ^ i3;
                        i4 = ((m6981 ^ i2) * (-25567)) ^ (-1120105875);
                        i5 = -965126989;
                    }
            }
            return;
        }
    }

    /* JADX WARN: 'super' call moved to the top of the method (can break code semantics) */
    public ViewOnClickListenerC3367(C13244 c13244, View view) {
        super(view);
        C13244 c132442;
        int i;
        int m2566;
        int i2;
        int m6981;
        int m69812;
        int i3;
        int i4;
        int i5 = C2520.f8000;
        int i6 = C4263.f13799;
        short s = f10652[0];
        if ((s * 38188) - ((s * s) + 364580836) > 0) {
            c132442 = c13244;
            i = 17430;
        } else {
            c132442 = c13244;
            i = 16671;
        }
        this.f10655 = c132442;
        int m25662 = C0630.m2566("ۧۢ") ^ i6;
        int i7 = ((m25662 ^ i5) * 20287) ^ (-1450414263);
        int i8 = m25662 ^ (-1402200461);
        String str = null;
        short[] sArr = null;
        int i9 = 0;
        TextView textView = null;
        int i10 = 0;
        int i11 = 0;
        int i12 = 0;
        int i13 = 0;
        int i14 = 0;
        View view2 = null;
        View view3 = null;
        int i15 = 1524744303;
        short[] sArr2 = null;
        int i16 = 0;
        while (true) {
            i15 = i8 ^ (i7 & (((i15 ^ i5) * (-17151)) >> 31));
            switch (i15) {
                case -2007060418:
                case -907190687:
                    i10 = C0630.m2566(C1128.m3841(sArr2, 7, 3, i));
                    i11 = 2121830931;
                    if (AbstractC2021.f6743 > 0) {
                        m2566 = C2105.m6981("᩹ᩴ") ^ i6;
                        i7 = ((m2566 ^ i5) * (-18409)) ^ (-675831094);
                        i2 = 1826168801;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C0630.m2566("ܿۤ") ^ i6;
                    i7 = ((m2566 ^ i5) * (-3071)) ^ (-1441890364);
                    i2 = 2091915861;
                    i8 = m2566 ^ i2;
                case -1966176012:
                case -705612011:
                    view3 = C11340.m28028(view, i9 ^ 2103579785);
                    if (C1005.f3721) {
                        m2566 = (C0630.m2566("᩻۫") + i5) * 101;
                        i7 = ((m2566 ^ i6) * (-30601)) ^ (-1812198028);
                        i2 = 22615835;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C0630.m2566("ܿۤ") ^ i6;
                    i7 = ((m2566 ^ i5) * (-3071)) ^ (-1441890364);
                    i2 = 2091915861;
                    i8 = m2566 ^ i2;
                case -1742867809:
                case 496413206:
                    AbstractC2021.m6574();
                    throw new RuntimeException();
                case -1741624448:
                case -392089136:
                    m6981 = C2105.m6981(C1005.m3502(f10652, 1, 3, i));
                    if (C0714.f2697 < 0) {
                        m69812 = C2105.m6981("ۡۨ") ^ i6;
                        i3 = ((m69812 ^ i5) * 10971) ^ (-1403857608);
                        i4 = -1097695749;
                        i9 = m6981;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    }
                    m69812 = C2105.m6981("ۛۙ") ^ i6;
                    i3 = ((m69812 ^ i5) * (-16875)) ^ (-1762384699);
                    i4 = 995991280;
                    i9 = m6981;
                    i8 = m69812 ^ i4;
                    i7 = i3;
                case -1512668114:
                case 1977743499:
                    view2 = C1005.m3507(view, C2105.m6981(str) ^ 2097398236);
                    if (C4159.f13567) {
                        m2566 = C2105.m6981("ᩳ۠") ^ i6;
                        i7 = ((m2566 ^ i5) * 1363) ^ 287824166;
                        i2 = 969288943;
                        i8 = m2566 ^ i2;
                    } else {
                        m6981 = i9;
                        m69812 = C2105.m6981("ۛۙ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-16875)) ^ (-1762384699);
                        i4 = 995991280;
                        i9 = m6981;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    }
                case -1433363388:
                case -722583587:
                    C5695.m16023();
                    if (RunnableC3474.f10992 > 0) {
                        m6981 = i9;
                        m69812 = C2105.m6981("ۛۙ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-16875)) ^ (-1762384699);
                        i4 = 995991280;
                        i9 = m6981;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        m2566 = (i6 - C0630.m2566("۬ۜ")) * 27;
                        i7 = ((m2566 ^ i5) * (-29061)) ^ (-528194848);
                        i2 = -2050904499;
                        i8 = m2566 ^ i2;
                    }
                case -1409712050:
                case -1066322053:
                    textView = (TextView) C1005.m3507(view, C2105.m6981(C0630.m2575(sArr, i13, i14, i)) ^ 2099136004);
                    if (C1047.f3863 < 0) {
                        m2566 = C0630.m2566("۬ܺ") ^ i5;
                        i7 = ((m2566 ^ i6) * (-32611)) ^ (-1236102982);
                        i2 = 1930235940;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = (i6 - C0630.m2566("۬ۜ")) * 27;
                    i7 = ((m2566 ^ i5) * (-29061)) ^ (-528194848);
                    i2 = -2050904499;
                    i8 = m2566 ^ i2;
                case -1258108641:
                case -837561818:
                    C3746.m11360((Button) C11340.m28028(view, i12 ^ i16), 8);
                    C2126.m7039(view, this);
                    return;
                case -230860455:
                case 1136965459:
                    sArr = f10652;
                    i13 = 10;
                    i14 = 3;
                    if (C1916.f6442) {
                        m2566 = (i5 - C2105.m6981("ܺ᩹")) * (-117);
                        i7 = ((m2566 ^ i6) * (-30027)) ^ 646953006;
                        i2 = -2049217047;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C0630.m2566("᩹ۙ") ^ i5;
                    i7 = ((m2566 ^ i6) * (-3211)) ^ 1987514789;
                    i2 = 330957131;
                    i8 = m2566 ^ i2;
                case -104961959:
                case 1485208018:
                    this.f10653 = (TextView) C11340.m28028(view, i10 ^ i11);
                    if (C4075.f12947 < 0) {
                        m2566 = (C2105.m6981("ᩴ֡") + i6) * 123;
                        i7 = ((m2566 ^ i5) * (-13303)) ^ 1620858385;
                        i2 = -605477618;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C0630.m2566("ܿۤ") ^ i6;
                    i7 = ((m2566 ^ i5) * (-3071)) ^ (-1441890364);
                    i2 = 2091915861;
                    i8 = m2566 ^ i2;
                case -45682235:
                case 1223480568:
                    C21923.m49329();
                    if (C1420.m4913()) {
                        m6981 = i9;
                        m69812 = C2105.m6981("ۛۙ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-16875)) ^ (-1762384699);
                        i4 = 995991280;
                        i9 = m6981;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    } else {
                        m2566 = C2105.m6981("ۚ۠") ^ i5;
                        i7 = ((m2566 ^ i6) * (-11249)) ^ (-336080129);
                        i2 = 557092694;
                        i8 = m2566 ^ i2;
                    }
                case 6378021:
                case 1009209361:
                    if (C4117.f13076 <= 0) {
                        m2566 = C0630.m2566("᩹ۙ") ^ i5;
                        i7 = ((m2566 ^ i6) * (-3211)) ^ 1987514789;
                        i2 = 330957131;
                        i8 = m2566 ^ i2;
                    } else {
                        m6981 = i9;
                        m69812 = C2105.m6981("ۛۙ") ^ i6;
                        i3 = ((m69812 ^ i5) * (-16875)) ^ (-1762384699);
                        i4 = 995991280;
                        i9 = m6981;
                        i8 = m69812 ^ i4;
                        i7 = i3;
                    }
                case 228146954:
                case 894191951:
                    this.f10654 = (TextView) view2;
                    sArr2 = f10652;
                    if (C0630.f2410 > 0) {
                        m2566 = (i5 - C2105.m6981("ܽܿ")) * (-91);
                        i7 = ((m2566 ^ i6) * (-11327)) ^ 1808294733;
                        i2 = -1789755685;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = (i6 - C0630.m2566("۬ۜ")) * 27;
                    i7 = ((m2566 ^ i5) * (-29061)) ^ (-528194848);
                    i2 = -2050904499;
                    i8 = m2566 ^ i2;
                case 251751558:
                case 1502955657:
                    AbstractC2021.m6574();
                    m2566 = C0630.m2566("᩹ۙ") ^ i5;
                    i7 = ((m2566 ^ i6) * (-3211)) ^ 1987514789;
                    i2 = 330957131;
                    i8 = m2566 ^ i2;
                case 403748143:
                case 1344418399:
                    this.f10658 = (ImageView) view3;
                    str = RunnableC1108.m3789(f10652, 4, 3, i);
                    if (C1128.f4106 > 0) {
                        m2566 = C2105.m6981("ܰۛ") ^ i5;
                        i7 = ((m2566 ^ i6) * (-21489)) ^ 231129148;
                        i2 = -28977804;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C2105.m6981("ۚ۠") ^ i5;
                    i7 = ((m2566 ^ i6) * (-11249)) ^ (-336080129);
                    i2 = 557092694;
                    i8 = m2566 ^ i2;
                default:
                    this.f10656 = textView;
                    i12 = C2105.m6981(C2105.m6988(f10652, 13, 3, i));
                    i16 = 2101808907;
                    if (C3245.f10203 > 0) {
                        m2566 = (C0630.m2566("᩻᩺") + i6) * 43;
                        i7 = ((m2566 ^ i5) * (-22885)) ^ 1183966714;
                        i2 = 35318923;
                        i8 = m2566 ^ i2;
                    }
                    m2566 = C0630.m2566("ܿۤ") ^ i6;
                    i7 = ((m2566 ^ i5) * (-3071)) ^ (-1441890364);
                    i2 = 2091915861;
                    i8 = m2566 ^ i2;
            }
        }
    }
}
