package l;

import android.content.DialogInterface;
import android.content.Intent;
import android.os.Bundle;
import android.text.SpannableString;
import android.text.style.AbsoluteSizeSpan;
import android.view.KeyEvent;
import android.view.View;
import android.widget.EditText;
import android.widget.TextView;
import com.alipay.sdk.m.y.q;
import com.google.android.material.behavior.HideBottomViewOnScrollBehavior;
import com.google.android.material.floatingactionbutton.FloatingActionButton;
import com.google.android.material.slider.BaseSlider;
import com.google.android.material.textfield.TextInputLayout;
import com.umeng.commonsdk.statistics.UMErrorCode;
import java.lang.ref.WeakReference;
import java.util.Map;
import moe.shizuku.server.IShizukuService;
import org.bouncycastle.crypto.digests.WhirlpoolDigest;
import org.bouncycastle.math.ec.rfc8032.Ed448;
import org.bouncycastle.math.ec.rfc8032.Scalar448;
import org.bouncycastle.pqc.crypto.snova.GF16Utils;
import org.bouncycastle.pqc.math.ntru.HRSS1373Polynomial;

/* compiled from: H1R6 */
/* renamed from: l.ۛۚۡ, reason: contains not printable characters */
/* loaded from: classes3.dex */
public final class ViewOnClickListenerC5850 extends AbstractActivityC3346 implements View.OnClickListener {

    /* renamed from: ۢۧ, reason: not valid java name and contains not printable characters */
    public static final /* synthetic */ int f17941 = 0;

    /* renamed from: ᩴᩴۜ, reason: not valid java name and contains not printable characters */
    private static final short[] f17942 = {9955, 6491, 6028, 11468, 7260, 11185, -6942, 15521, 2703, -5508, 216, 1217, -27931, -27929, -27914, -27951, -27914, -27920, -27925, -27924, -27931, -27990, -27988, -27988, -27988, -27989, -27938, -27930, -27991, -15206, -9100, -15482, 7498, -30812, 28620, -31276, -5611, -5587, -5534, -26855, 26752, -28444, 6850, 11800, 9086, -11044, -3513, 8880, -13232, 7525, 10206, 10185, 10207, 10204, 10179, 10178, 10207, 10185, -19826, 26667, 26690, 5482, -10708, -10693, -10707, -10706, -10703, -10704, -10707, -10693, -26168, 17531, -29660, -17824, 21089, 23328, 24009, -23190, -31916, 2923, -29035, -29054, -29036, -29033, -29048, -29047, -29036, -29054, 7938, -7092, -7661, -5590, -11082, -14, 5934, 524, 383, 6397, 30363, 30348, 30362, 30361, 30342, 30343, 30362, 30348, 11211, -690, 4776, 921, -6673, 5231, 30360, 30360, 30336, 30343, 30351, 30342, 30392, 30392, -2842, -6488, 11108, 1787, -8375, -9176, -8004, -4103, -5260, 14707, -17591, -17594, -17599, -17589, -17543, -17594, -17590, -17576, -17555, -17578, -17562, -17589, -17657, -17663, -17663, -17663, -17658, -12999, -4716, -5502, 15186, 15502, 13504, 15294, -6648, -5587, -6919, 16008, -6484, -5762, -7959, -4569, 15731, 13517, -7618, 8181, 26096, 21113, -28389, 23122, -28426, -26131, 4015, 3991, 4056, 29801, -27966, -24828, 7732, 14887, 3062, -9558, 8528, 270, 3615, 2305, 6920, -7247, 165, -3215, 3947, 10431, 7871, -11320, 15971, 13470, 3382, 5927, 5528, -6647, 5326, -1479, 6607, 6271, 26732, -31101, 24865, -30215, -23260, -29773, 24782, 32093, -26581, 9889, -26921, -26944, -26922, -26923, -26934, -26933, -26922, -26944, -14946, -6554, 6981, -5782, -5857, 982, 7844, -17237, -17220, -17238, -17239, -17226, -17225, -17238, -17220, 10997, -16061, -6321, -17232, -17225, -17217, -17226, -17257, -17232, -17222, -17230, -17225, -17224, -17228, -17220, -15064, -12321, -5200, 2663, 23264, 17896, 23435, 3801, 16591, 16584, 16576, 16585, 16616, 16591, 16581, 16589, 16584, 16583, 16587, 16579, 16599, 16599, -13568, -13422, -9659, 16591, 16584, 16576, 16585, 16631, 16631, 16593, 16606, 16591, 16584, 16576, 16585, 16625, 16638, 16591, 16584, 16576, 16585, 16619, 16595, 16586, 16594, 16591, 16618, 16585, 16577, 16591, 16584, 15538, 15802, -15859, -10038, 5503, 13147, 1748, 10810, -5704, -3426, 6391, -5767, 4480, 30926, 30913, 30918, 30924, 30974, 30913, 30925, 30943, 30954, 30929, 30945, 30924, 30848, 30854, 30854, 30854, 30849, -6085, 1796, -2570, 9968, 12024, -724, -1339, 6088, 3110, 521, -6099, -7781, 3006, 9227, -7856, 7159, 1258, 5745, 7768, -4256, -17, -2542, 660, -12066, -9273, -8190, 2059, 83, 3001, -7626, 674, -7006, -195, 1903, -29145, -29145, -3321, -11548, -1247, -3385, 7599, -10587, -10522, 2327, 1497, 4983, 2221, -4189, 1870, -24667, -24675, -24622, -4121, 7660, -3025, 5219, 4796, -12908, 1774, -12044, -1949, 2096, -9545, 12678, 12773, 5164, 20708, 20723, 20709, 20710, 20729, 20728, 20709, 20723, -15880, 1233, -8987, -14269, 11790, 2954, 20705, 20718, 20735, 20728, 20720, 20729, 20673, 20686, -10622, -9281, 3831, 4251, -23978, -23983, -23975, -23984, -23942, -23982, -23970, -23978, -23981, 10074, -2527, 16264, 4273, 32242, 5559, 4758, -6304, 3273, 10959, 3879, -7492, 13182, -4363, -8028, -4035, -1959, 32226, 32237, 32234, 32224, 32210, 32237, 32225, 32243, 32198, 32253, 32205, 32224, 32172, 32170, 32170, 32170, 32173, 9756, 12016, -2788, -5405, 6777, 5231, 2511, 2202, 10103, 4645, -1540, -1177, 8103, 2654, 4472, -5097, 8267, 1463, -3211, -4591, 6356, 5449, 12070, 495, -5105, 2836, 3901, -6917, 9416, 6374, 6289, -7186, 1467, 8118, -5175, 179, 5930, -5372, 4429, -1878, -1582, -253, 4708, -5194, 12262, 4349, 5901, 6052, 32227, 32225, 32240, 32215, 32240, 32246, 32237, 32234, 32227, 32172, 32170, 32170, 32170, 32173, 7551, -7769, 4082, 32245, 32245, 3965, 11852, 12840, 32243, 32252, 12064, 5322, -7529, 10517, 1701, 11886, 10752, 4215, 8536, 9553, 2099, 1798, 4299, 8162, 7227, 11350, 5828, -2360, -5166, -6942, -7834, -2169, 11951, -1802, 10226, -468, 10642, 6124, -6978, 6973, 5279, -7478, 1521, 32142, -1917, 2945, -828, -3043, 9156, -6923, -3941, 10570, 2484, 3613, 4318, 12988, -4560, -5395, 11782, 7151, -6960, 9513, 4894, -10030, -15912, 3567, -10930, 519, 10362, 3008, 14382, -14454, -10981, -13368, -15924, 316, 13764, 9368, 8398, 14064, 14816, 3340, 3907, 13877, 15527, 8985, 14208, -9675, 9374, -8955, 12890, 2953, -13876, 1282, 14659, -11166, -8480, 2214, -12003, 2829, 3067, 3970, 21092, 21110, 21115, 21029, -12468, -9504, 13308, 209, 15324, -10676, 1521, 15677, -10091, 9286, -8821, -16007, 9586, 1564, 11528, 15056, -13733, 10507, 21089, 21118, 21106, 21088, 21055, 21049, 21049, 21049, 21054, -11867, 13752, 313, -12352, -13071, 13864, -12236, 12754, 12549, -15138, -13522, 1590, 21092, 21119, 21112, 21088, 21078, 21108, 21091, 21118, 21089, 21106, 21074, 21114, 21110, 21118, 21115, 5451, -10662, -10659, -10681, -10666, -10659, -10681, 4845, -22559, -22534, -22531, -22555, -22561, -22553, -22530, -22554, -22533, -22562, -22531, -22539, -22533, -22532, -22559, -22534, -22531, -22555, -22591, -22537, -22559, -22559, -22533, -22531, -22532, -22570, -22537, -22556, -22533, -22543, -22537, -22559, 7570, 9624, 9662, 9640, 9663, 9600, 9634, 9663, 9640, 9612, 9646, 9657, 9636, 9659, 9636, 9657, 9652};

    /* renamed from: ۜۧ, reason: not valid java name and contains not printable characters */
    public TextView f17943;

    /* renamed from: ܳۧ, reason: not valid java name and contains not printable characters */
    public TextView f17944;

    /* renamed from: ܿۧ, reason: not valid java name and contains not printable characters */
    public TextView f17945;

    /* renamed from: ᩳۧ, reason: not valid java name and contains not printable characters */
    public TextView f17946;

    /* renamed from: ᩷ۧ, reason: not valid java name and contains not printable characters */
    public final C8817 f17947 = C8817.m22788();

    /* renamed from: ᩻ۧ, reason: not valid java name and contains not printable characters */
    public TextView f17948;

    @Override // l.AbstractActivityC3346
    /* renamed from: ۚ */
    public final String mo121() {
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = 0;
        short[] sArr2 = null;
        int i6 = 0;
        int i7 = 1309183760;
        int i8 = C1047.f3863;
        int i9 = C4075.f12947;
        int m6981 = (C2105.m6981("᩺ۢ") + i9) * 67;
        int i10 = ((m6981 ^ i8) * (-3449)) ^ (-1218977987);
        int i11 = -448452779;
        while (true) {
            i7 = ((((i7 ^ i8) * 6291) >> 31) & i10) ^ (m6981 ^ i11);
            switch (i7) {
                case -2112642993:
                case -1506853840:
                    if (C0798.m2998() == 0) {
                        m6981 = C0630.m2566("᩸ܺ") ^ i9;
                        i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                        i11 = -318259676;
                    } else {
                        m6981 = C0630.m2566("ܶ֫") ^ i8;
                        i10 = ((m6981 ^ i9) * 16055) ^ 312696989;
                        i11 = -2064876980;
                    }
                case -1892202235:
                case -912284483:
                    i5 = 39652;
                    m6981 = C2105.m6981("ܶ᩸") ^ i9;
                    i10 = ((m6981 ^ i8) * 5423) ^ (-848690670);
                    i11 = 1760033569;
                case -1890875494:
                case -1594031401:
                    s = sArr[c];
                    if (C0237.f1507 != 0) {
                        m6981 = C0630.m2566("᩸ܺ") ^ i9;
                        i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                        i11 = -318259676;
                    } else {
                        m6981 = (C0630.m2566("ܳۙ") ^ i9) * (-29);
                        i10 = ((m6981 ^ i8) * (-16429)) ^ 1493371408;
                        i11 = -104291007;
                    }
                case -1889906804:
                case 1006194435:
                    if (C1773.f6144 <= 0) {
                        m6981 = C0630.m2566("ܶ֫") ^ i8;
                        i10 = ((m6981 ^ i9) * 16055) ^ 312696989;
                        i11 = -2064876980;
                    } else {
                        m6981 = (i8 - C2105.m6981("᩵ۢ")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i10 = ((m6981 ^ i9) * 29415) ^ (-1201356582);
                        i11 = -1367334155;
                    }
                case -1847992181:
                case 447483544:
                    i2 = i * i;
                    i3 = s * s;
                    if (C2520.f8000 >= 0) {
                        m6981 = C0630.m2566("᩸ܺ") ^ i9;
                        i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                        i11 = -318259676;
                    } else {
                        m6981 = (i8 - C2105.m6981("ᩴ᩸")) * (-35);
                        i10 = ((m6981 ^ i9) * 23473) ^ 1681042218;
                        i11 = -563962755;
                    }
                case -1643373457:
                case 148922105:
                    if (C2126.f7087) {
                        m6981 = C0630.m2566("ܶ֫") ^ i8;
                        i10 = ((m6981 ^ i9) * 16055) ^ 312696989;
                        i11 = -2064876980;
                    } else {
                        m6981 = (i9 - C0630.m2566("ܶۡ")) * 45;
                        i10 = ((m6981 ^ i8) * (-3255)) ^ 665916895;
                        i11 = 659299988;
                    }
                case -1250430965:
                case -278549033:
                    i5 = 9677;
                    m6981 = C2105.m6981("ܶ᩸") ^ i9;
                    i10 = ((m6981 ^ i8) * 5423) ^ (-848690670);
                    i11 = 1760033569;
                case -1208873470:
                case 1952206491:
                    i = s + 15840;
                    if (C3245.f10203 <= 0) {
                        m6981 = (C2105.m6981("ۛܰ") + i9) * 81;
                        i10 = ((m6981 ^ i8) * (-4511)) ^ 917077003;
                        i11 = -1492809262;
                    } else {
                        m6981 = C2105.m6981("ᩳۚ") ^ i9;
                        i10 = ((m6981 ^ i8) * 4935) ^ 1143622313;
                        i11 = 427936660;
                    }
                case -906259660:
                case -524545797:
                    sArr2 = f17942;
                    i6 = 733;
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("ܰ֨") ^ i8;
                        i10 = ((m6981 ^ i9) * 22735) ^ 1340860528;
                        i11 = -1601374661;
                    } else {
                        m6981 = (C2105.m6981("ۛܰ") + i9) * 81;
                        i10 = ((m6981 ^ i8) * (-4511)) ^ 917077003;
                        i11 = -1492809262;
                    }
                case -795493187:
                case 901699618:
                    c = 732;
                    if (C4263.f13799 <= 0) {
                        m6981 = (C2105.m6981("ۛܰ") + i9) * 81;
                        i10 = ((m6981 ^ i8) * (-4511)) ^ 917077003;
                        i11 = -1492809262;
                    } else {
                        m6981 = (i8 - C0630.m2566("ۚܳ")) * 69;
                        i10 = ((m6981 ^ i9) * (-26863)) ^ (-496886779);
                        i11 = -2115811385;
                    }
                case -523553315:
                case 770971434:
                    return RunnableC1108.m3789(sArr2, i6, 16, i5);
                case -417393779:
                case 996756911:
                    C0630.m2564();
                    C1504.m5179();
                    m6981 = C0630.m2566("᩸ܺ") ^ i9;
                    i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                    i11 = -318259676;
                case 24962871:
                case 1441492949:
                    sArr = f17942;
                    if (C3911.f12484 >= 0) {
                        m6981 = C0630.m2566("ܶ֫") ^ i8;
                        i10 = ((m6981 ^ i9) * 16055) ^ 312696989;
                        i11 = -2064876980;
                    } else {
                        m6981 = C2105.m6981("᩹۬") ^ i8;
                        i10 = ((m6981 ^ i9) * 1619) ^ 1946833320;
                        i11 = -493174797;
                    }
                case 160733712:
                case 2048419793:
                    if (C1711.f5919) {
                        m6981 = (i9 - C2105.m6981("ۡۧ")) * (-41);
                        i10 = ((m6981 ^ i8) * 26705) ^ 1033104485;
                        i11 = -829262349;
                    } else {
                        m6981 = C2105.m6981("۬ۧ") ^ i8;
                        i10 = ((m6981 ^ i9) * 9303) ^ (-1178541625);
                        i11 = -434480208;
                    }
                case 355178947:
                case 1801618338:
                    if (C2520.f8000 < 0) {
                        m6981 = C0630.m2566("᩸ܺ") ^ i9;
                        i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                        i11 = -318259676;
                    } else {
                        m6981 = (i9 - C2105.m6981("ۡۧ")) * (-41);
                        i10 = ((m6981 ^ i8) * 26705) ^ 1033104485;
                        i11 = -829262349;
                    }
                case 697713029:
                case 1815755242:
                    int i12 = i3 + i4;
                    if (i2 - (i12 + i12) > 0) {
                        m6981 = (C0630.m2566("ۖ᩷") + i8) * 71;
                        i10 = ((m6981 ^ i9) * (-17519)) ^ 1921981958;
                        i11 = -183223877;
                    } else {
                        m6981 = C2105.m6981("ۤܶ") ^ i9;
                        i10 = ((m6981 ^ i8) * (-5735)) ^ (-2123136009);
                        i11 = 1026309377;
                    }
                case 983176063:
                case 2003329740:
                    i4 = 250905600;
                    if (C3245.m9925() != 0) {
                        m6981 = C2105.m6981("۬ۧ") ^ i8;
                        i10 = ((m6981 ^ i9) * 9303) ^ (-1178541625);
                        i11 = -434480208;
                    } else {
                        m6981 = (i8 - C2105.m6981("ۢ֡")) * 123;
                        i10 = ((m6981 ^ i9) * (-10245)) ^ (-395894371);
                        i11 = -1803855612;
                    }
                case 1477427064:
                case 1700762686:
                    C4075.m12263();
                    C0714.m2805();
                    return null;
                default:
                    if (RunnableC1937.f6483 >= 0) {
                        m6981 = C0630.m2566("᩸ܺ") ^ i9;
                        i10 = ((m6981 ^ i8) * 7425) ^ (-1747968715);
                        i11 = -318259676;
                    } else {
                        m6981 = (i9 - C2105.m6981("ܺۜ")) * 37;
                        i10 = ((m6981 ^ i8) * 31379) ^ 1796811306;
                        i11 = 978483714;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:22:0x0069, code lost:
    
        if (l.C3432.f10845 < 0) goto L20;
     */
    @Override // l.ActivityC23809, android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onNewIntent(android.content.Intent r20) {
        /*
            Method dump skipped, instructions count: 812
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.onNewIntent(android.content.Intent):void");
    }

    @Override // l.AbstractActivityC3346, l.ActivityC2124, l.ActivityC0737, l.ActivityC23809, l.ActivityC4927, android.app.Activity
    public final void onCreate(Bundle bundle) {
        TextView textView;
        int m6981;
        int i;
        int i2;
        short[] sArr;
        int i3;
        int m2566;
        int i4;
        int i5;
        int i6;
        int m69812;
        int i7;
        int i8;
        int i9 = C4263.f13799;
        int i10 = C2520.f8000;
        int m25662 = (C0630.m2566("֨᩸") + i9) * (-35);
        int i11 = ((m25662 ^ i10) * 26607) ^ (-911787093);
        TextView textView2 = null;
        String str = null;
        String str2 = null;
        short[] sArr2 = null;
        short[] sArr3 = null;
        int i12 = m25662 ^ (-703418668);
        int i13 = 0;
        int i14 = 0;
        int i15 = 0;
        int i16 = 0;
        boolean z = false;
        int i17 = 0;
        int i18 = 0;
        int i19 = 0;
        int i20 = 0;
        int i21 = 0;
        int i22 = 0;
        int i23 = 769110305;
        int i24 = 0;
        View view = null;
        String str3 = null;
        TextView textView3 = null;
        int i25 = 0;
        while (true) {
            i23 = i12 ^ (i11 & (((i23 ^ i10) * (-4133)) >> 31));
            switch (i23) {
                case -2085526014:
                case 2145770736:
                    RunnableC0588.m2441();
                    C0714.m2805();
                    break;
                case -2050284365:
                case -1890942964:
                    if (C1420.m4913()) {
                        textView = textView3;
                        m6981 = C2105.m6981("ۢ۫") ^ i9;
                        i = ((m6981 ^ i10) * (-28871)) ^ 1540781653;
                        i2 = -399139709;
                        i3 = m6981 ^ i2;
                        TextView textView4 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView4;
                    } else {
                        textView = textView3;
                        sArr = sArr2;
                        i6 = i13;
                        m69812 = C2105.m6981("ۖܿ") ^ i9;
                        i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                        i8 = -1209166845;
                        int i26 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i26;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    }
                case -2041129532:
                case 1676828281:
                    textView = textView3;
                    boolean m24405 = C9523.m24405();
                    i25 = C2105.m6981(ViewOnClickListenerC1958.m6435(f17942, 638, 3, i17)) ^ 2102766166;
                    if (m24405) {
                        m6981 = (i10 - C0630.m2566("᩷ᩳ")) * 69;
                        i = ((m6981 ^ i9) * (-6741)) ^ 1346921170;
                        i2 = 626826871;
                    } else {
                        m6981 = C2105.m6981("ۗܳ") ^ i10;
                        i = ((m6981 ^ i9) * (-16235)) ^ (-1585894948);
                        i2 = 2122468519;
                    }
                    i3 = m6981 ^ i2;
                    TextView textView42 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView42;
                case -2034051192:
                case 1111296621:
                    C4616.m13552();
                    if (ServiceConnectionC3453.f10921 < 0) {
                        textView = textView3;
                        sArr = sArr2;
                        i6 = i13;
                        m69812 = C2105.m6981("ۖܿ") ^ i9;
                        i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                        i8 = -1209166845;
                        int i262 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i262;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        m2566 = (C2105.m6981("ۙ۠") + i10) * (-117);
                        i4 = ((m2566 ^ i9) * (-3727)) ^ (-335502084);
                        i5 = 419078882;
                        i12 = m2566 ^ i5;
                        i11 = i4;
                    }
                case -1997650944:
                case -291474765:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    i17 = 60972;
                    m69812 = (i9 - C2105.m6981("ᩳۛ")) * 25;
                    i7 = ((m69812 ^ i10) * 6093) ^ 2098168949;
                    i8 = -2007715014;
                    int i2622 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i2622;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case -1990770197:
                case -1723607868:
                    textView = textView3;
                    C4159.m12564(C4263.m12813(this, C0630.m2566(str) ^ 2098637198), this);
                    int m25663 = 2119416825 ^ C0630.m2566(C2958.m9031(f17942, 631, 3, i17));
                    C4159.m12564(C4263.m12813(this, m25663), this);
                    if (C4263.m12818(ApplicationC20075.f65008, C0483.m2128(f17942, 634, 4, i17), true)) {
                        i16 = m25663;
                        m6981 = C0630.m2566("۟ۜ") ^ i9;
                        i = ((m6981 ^ i10) * (-10713)) ^ 1620447034;
                        i2 = -1307957455;
                        i3 = m6981 ^ i2;
                        TextView textView422 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView422;
                    } else {
                        int m25664 = C0630.m2566("ۢۤ") ^ i9;
                        textView3 = textView;
                        i12 = m25664 ^ (-1185034753);
                        i11 = ((m25664 ^ i10) * 21609) ^ (-894652823);
                        i16 = m25663;
                    }
                case -1929299819:
                case 2001002642:
                    textView = textView3;
                    C1128.m3853(C0964.m3409(this, i16), i15);
                    m6981 = C0630.m2566("۟ۜ") ^ i9;
                    i = ((m6981 ^ i10) * (-10713)) ^ 1620447034;
                    i2 = -1307957455;
                    i3 = m6981 ^ i2;
                    TextView textView4222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView4222;
                case -1795427238:
                case 401287307:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    super.onCreate(bundle);
                    C4263.m12813(this, C0630.m2566(C5695.m16034(f17942, 595, 3, i17)) ^ 2097756540);
                    C0964.m3409(this, C0630.m2566(C1128.m3841(f17942, 598, 3, i17)) ^ 2097889583);
                    if (C1047.m3599() < 0) {
                        m69812 = (i10 - C2105.m6981("۫֨")) * 81;
                        i7 = ((m69812 ^ i9) * 9141) ^ 438892136;
                        i8 = 1248834883;
                        int i26222 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i26222;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    }
                    m69812 = C2105.m6981("ۖܿ") ^ i9;
                    i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                    i8 = -1209166845;
                    int i262222 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i262222;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case -1658731162:
                case -755935400:
                    textView = textView3;
                    View m12813 = C4263.m12813(this, C2105.m6981(str2) ^ 2129740316);
                    C2126.m7031(m12813, str3);
                    this.f17946 = (TextView) m12813;
                    view = C0964.m3409(this, C0630.m2566(C0050.m948(f17942, 668, 3, i17)) ^ 2104370367);
                    if (C1420.f5096 > 0) {
                        m6981 = C0630.m2566("᩺ܳ") ^ i10;
                        i = ((m6981 ^ i9) * 21117) ^ (-1248458973);
                        i2 = 1334738298;
                        i3 = m6981 ^ i2;
                        TextView textView42222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView42222;
                    }
                    m6981 = C2105.m6981("ۢ۫") ^ i9;
                    i = ((m6981 ^ i10) * (-28871)) ^ 1540781653;
                    i2 = -399139709;
                    i3 = m6981 ^ i2;
                    TextView textView422222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView422222;
                case -1559876421:
                case 1465552731:
                    m16386(z);
                    textView = textView3;
                    m6981 = C0630.m2566("֡۟") ^ i9;
                    i = ((m6981 ^ i10) * (-10157)) ^ (-1410647049);
                    i2 = 1267527348;
                    i3 = m6981 ^ i2;
                    TextView textView4222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView4222222;
                case -1536770509:
                case 2144367298:
                    break;
                case -1510981468:
                case 1796980020:
                    textView = textView3;
                    C2126.m7039(C4263.m12813(this, i19 ^ i20), this);
                    C2126.m7039(C0964.m3409(this, C0630.m2566(C0483.m2128(f17942, 647, 3, i17)) ^ 2126781787), this);
                    sArr3 = f17942;
                    if (RunnableC3474.f10992 <= 0) {
                        sArr = sArr2;
                        i6 = i13;
                        m69812 = C2105.m6981("ۖܿ") ^ i9;
                        i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                        i8 = -1209166845;
                        int i2622222 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i2622222;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        m6981 = C0630.m2566("ۜܳ") ^ i9;
                        i = ((m6981 ^ i10) * (-6439)) ^ (-1208254155);
                        i2 = 512347606;
                        i3 = m6981 ^ i2;
                        TextView textView42222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView42222222;
                    }
                case -1446964625:
                case -278895830:
                    textView = textView3;
                    C1128.m3853(C4263.m12813(this, i14), i15);
                    m6981 = (i10 - C0630.m2566("ۚ᩹")) * 49;
                    i = ((m6981 ^ i9) * 4151) ^ (-1156811859);
                    i2 = -1963454809;
                    i3 = m6981 ^ i2;
                    TextView textView422222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView422222222;
                case -1392630662:
                case -597071390:
                    C2520.m8026();
                    if (C2958.f9394 < 0) {
                        m2566 = (C2105.m6981("ۙ۠") + i10) * (-117);
                        i4 = ((m2566 ^ i9) * (-3727)) ^ (-335502084);
                        i5 = 419078882;
                        i12 = m2566 ^ i5;
                        i11 = i4;
                    } else {
                        textView = textView3;
                        m6981 = (C2105.m6981("ܰ۬") + i10) * 7;
                        i = ((m6981 ^ i9) * (-23587)) ^ 1319431965;
                        i2 = 1464145400;
                        i3 = m6981 ^ i2;
                        TextView textView4222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView4222222222;
                    }
                case -1010218106:
                case 901179947:
                    C4075.m12263();
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    m69812 = C2105.m6981("ۖܿ") ^ i9;
                    i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                    i8 = -1209166845;
                    int i26222222 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i26222222;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case -1003909417:
                case 407356677:
                    textView = textView3;
                    C4159.m12575(view, str3);
                    this.f17945 = (TextView) view;
                    View m3409 = C0964.m3409(this, C0630.m2566(C2126.m7036(f17942, 671, 3, i17)) ^ 2130640833);
                    C4159.m12575(m3409, str3);
                    textView2 = (TextView) m3409;
                    if (C3537.m10746() > 0) {
                        m6981 = (C2105.m6981("ۘۛ") + i10) * (-71);
                        i = ((m6981 ^ i9) * (-21589)) ^ 1968319770;
                        i2 = 1016768557;
                        i3 = m6981 ^ i2;
                        TextView textView42222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView42222222222;
                    }
                    m6981 = (C2105.m6981("ܰ۬") + i10) * 7;
                    i = ((m6981 ^ i9) * (-23587)) ^ 1319431965;
                    i2 = 1464145400;
                    i3 = m6981 ^ i2;
                    TextView textView422222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView422222222222;
                case -735220343:
                case 662388146:
                    textView = textView3;
                    C1128.m3853(C0964.m3409(this, i13), i15);
                    m6981 = (i10 - C0630.m2566("ۚ᩹")) * 49;
                    i = ((m6981 ^ i9) * 4151) ^ (-1156811859);
                    i2 = -1963454809;
                    i3 = m6981 ^ i2;
                    TextView textView4222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView4222222222222;
                case -623454913:
                case -95655873:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    i17 = 21015;
                    m69812 = (i9 - C2105.m6981("ᩳۛ")) * 25;
                    i7 = ((m69812 ^ i10) * 6093) ^ 2098168949;
                    i8 = -2007715014;
                    int i262222222 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i262222222;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case -495131551:
                case 462671650:
                    if (C23196.m51465()) {
                        textView = textView3;
                        m6981 = C0630.m2566("֡۟") ^ i9;
                        i = ((m6981 ^ i10) * (-10157)) ^ (-1410647049);
                        i2 = 1267527348;
                        i3 = m6981 ^ i2;
                        TextView textView42222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView42222222222222;
                    } else {
                        m2566 = (C0630.m2566("֫ܽ") ^ i10) * 93;
                        i4 = ((m2566 ^ i9) * (-15845)) ^ 1215790114;
                        i5 = -308769515;
                        i12 = m2566 ^ i5;
                        i11 = i4;
                    }
                case -430862946:
                case 1321512578:
                    RunnableC1108.m3781(this);
                    break;
                case -316588219:
                case -259469994:
                    textView = textView3;
                    i13 = i24 ^ i18;
                    C2126.m7039(C0964.m3409(this, i13), this);
                    i14 = 2097672564 ^ C2105.m6981(C3245.m9934(f17942, 619, 3, i17));
                    C4159.m12564(C4263.m12813(this, i14), this);
                    i15 = 8;
                    if (C23196.m51457()) {
                        m6981 = (C0630.m2566("ۡ֡") ^ i9) * (-53);
                        i = ((m6981 ^ i10) * (-2423)) ^ 985189737;
                        i2 = -2130668041;
                    } else {
                        m6981 = (C2105.m6981("ۧܽ") + i9) * 33;
                        i = ((m6981 ^ i10) * (-1633)) ^ (-523690547);
                        i2 = 1808842647;
                    }
                    i3 = m6981 ^ i2;
                    TextView textView422222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView422222222222222;
                case -212967318:
                case 405862351:
                    C1047.m3599();
                    if (C1773.m5908() <= 0) {
                        textView = textView3;
                        sArr = sArr2;
                        i6 = i13;
                        m69812 = C2105.m6981("ۖܿ") ^ i9;
                        i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                        i8 = -1209166845;
                        int i2622222222 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i2622222222;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        textView = textView3;
                        m6981 = (i9 - C0630.m2566("᩻᩺")) * 61;
                        i = ((m6981 ^ i10) * 8973) ^ (-287255742);
                        i2 = -161389335;
                        i3 = m6981 ^ i2;
                        TextView textView4222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView4222222222222222;
                    }
                case -182034481:
                case -122252973:
                    textView = textView3;
                    C3746.m11360(C4263.m12813(this, i25), i15);
                    m6981 = C0630.m2566("ۧۘ") ^ i9;
                    i = ((m6981 ^ i10) * (-26463)) ^ (-1094421355);
                    i2 = 2060931050;
                    i3 = m6981 ^ i2;
                    TextView textView42222222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView42222222222222222;
                case -53011179:
                case 2039814898:
                    this.f17948 = textView2;
                    View m128132 = C4263.m12813(this, C2105.m6981(C0964.m3396(f17942, 674, 3, i17)) ^ 2101536773);
                    C2126.m7031(m128132, str3);
                    this.f17943 = (TextView) m128132;
                    RunnableC1937.m6377(textView3, RunnableC3474.m10627());
                    m16397();
                    C4263.m12821(new C15021(new WeakReference(this)));
                    textView = textView3;
                    z = false;
                    if (C4159.m12571(this).getBooleanExtra(C0630.m2575(f17942, 677, 15, i17), false)) {
                        m6981 = C2105.m6981("ܳ֨") ^ i9;
                        i = ((m6981 ^ i10) * (-25849)) ^ (-1671212580);
                        i2 = 802095839;
                        i3 = m6981 ^ i2;
                        TextView textView422222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView422222222222222222;
                    }
                    m6981 = C0630.m2566("֡۟") ^ i9;
                    i = ((m6981 ^ i10) * (-10157)) ^ (-1410647049);
                    i2 = 1267527348;
                    i3 = m6981 ^ i2;
                    TextView textView4222222222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView4222222222222222222;
                case 22570700:
                case 1286571923:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    short s = f17942[594];
                    if ((38458 * s) - ((s * s) + 369754441) > 0) {
                        m69812 = C0630.m2566("ܺᩴ") ^ i9;
                        i7 = ((m69812 ^ i10) * 8519) ^ 1594192409;
                        i8 = -620977695;
                    } else {
                        m69812 = (C2105.m6981("ۖܰ") + i10) * (-91);
                        i7 = ((m69812 ^ i9) * (-26717)) ^ (-617770454);
                        i8 = -2033700135;
                    }
                    int i26222222222 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i26222222222;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case 102963428:
                case 816091586:
                    textView = textView3;
                    C2126.m7039(C0964.m3409(this, C2105.m6981(C1420.m4902(f17942, 622, 3, i17)) ^ 2122250039), this);
                    C4159.m12564(C4263.m12813(this, C0630.m2566(C3683.m11225(f17942, 625, 3, i17)) ^ 2120117057), this);
                    str = C0798.m3005(f17942, 628, 3, i17);
                    if (C3663.f11553) {
                        sArr = sArr2;
                        i6 = i13;
                        m69812 = C2105.m6981("ۖܿ") ^ i9;
                        i7 = ((m69812 ^ i10) * (-20519)) ^ (-761251841);
                        i8 = -1209166845;
                        int i262222222222 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i262222222222;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        m6981 = (C2105.m6981("ܰ᩻") + i10) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i = ((m6981 ^ i9) * (-4125)) ^ 452044806;
                        i2 = 1266854255;
                        i3 = m6981 ^ i2;
                        TextView textView42222222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView42222222222222222222;
                    }
                case 176051863:
                case 1689389092:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    C9762 c9762 = (C9762) C4263.m12813(this, C2105.m6981(C3537.m10748(f17942, 601, 3, i17)) ^ 2119480481);
                    this.f10584 = c9762;
                    C2272.m7515(this, c9762);
                    C1773.m5915(this);
                    AbstractC2021.m6559(this.f10584, new View.OnClickListener() { // from class: l.֨֡ۡ
                        @Override // android.view.View.OnClickListener
                        public final void onClick(View view2) {
                            int i27 = 662222887;
                            int i28 = C3432.f10845;
                            int i29 = C0714.f2697;
                            int m69813 = (C2105.m6981("᩹ۜ") ^ i28) * (-65);
                            int i30 = ((m69813 ^ i29) * 2121) ^ (-1096896070);
                            int i31 = 735667615;
                            while (true) {
                                i27 = ((((i27 ^ i29) * 8061) >> 31) & i30) ^ (m69813 ^ i31);
                                switch (i27) {
                                    case -1805390140:
                                    case 766732062:
                                        RunnableC1937.m6387();
                                        if (C0964.m3413()) {
                                            m69813 = (C2105.m6981("ۖ᩶") + i28) * (-77);
                                            i30 = ((m69813 ^ i29) * (-29717)) ^ (-2136698290);
                                            i31 = -2092951407;
                                        } else {
                                            m69813 = C0630.m2566("ۗ᩹") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-7345)) ^ 162289074;
                                            i31 = 228084021;
                                        }
                                    case -1794925364:
                                    case -1528846350:
                                        if (C1128.f4106 <= 0) {
                                            m69813 = C0630.m2566("ۗ᩹") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-7345)) ^ 162289074;
                                            i31 = 228084021;
                                        } else {
                                            m69813 = C2105.m6981("ۜᩳ") ^ i28;
                                            i30 = ((m69813 ^ i29) * 21327) ^ (-1125398258);
                                            i31 = -1268331971;
                                        }
                                    case -1749869706:
                                    case -78498058:
                                        if (C1420.f5096 <= 0) {
                                            m69813 = C2105.m6981("֡᩷") ^ i29;
                                            i30 = ((m69813 ^ i28) * 26831) ^ 25744174;
                                            i31 = -1002387243;
                                        } else {
                                            m69813 = C0630.m2566("֨֫") ^ i29;
                                            i30 = ((m69813 ^ i28) * 3699) ^ 7824963;
                                            i31 = -169864417;
                                        }
                                    case -1222216334:
                                    case 24280578:
                                        if (C1504.f5354) {
                                            m69813 = C0630.m2566("ۗ᩹") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-7345)) ^ 162289074;
                                            i31 = 228084021;
                                        } else {
                                            m69813 = C0630.m2566("᩻ۢ") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-2475)) ^ 2072008617;
                                            i31 = -515449782;
                                        }
                                    case -1198719841:
                                    case 1598281556:
                                        C1916.m6308();
                                        if (C3245.f10203 <= 0) {
                                            m69813 = C2105.m6981("֡᩷") ^ i29;
                                            i30 = ((m69813 ^ i28) * 26831) ^ 25744174;
                                            i31 = -1002387243;
                                        } else {
                                            m69813 = (C2105.m6981("ۖ᩶") + i28) * (-77);
                                            i30 = ((m69813 ^ i29) * (-29717)) ^ (-2136698290);
                                            i31 = -2092951407;
                                        }
                                    case -899818915:
                                    case 825499454:
                                        if (C1005.f3721) {
                                            m69813 = (i28 - C0630.m2566("᩺ᩳ")) * 33;
                                            i30 = ((m69813 ^ i29) * (-11059)) ^ (-1275768064);
                                            i31 = 1319525802;
                                        } else {
                                            m69813 = C0630.m2566("ۗ᩹") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-7345)) ^ 162289074;
                                            i31 = 228084021;
                                        }
                                    case -898534912:
                                    case 2075114497:
                                        if (C3537.f11231 >= 0) {
                                            m69813 = (C2105.m6981("ۨۛ") ^ i28) * (-99);
                                            i30 = ((m69813 ^ i29) * (-11291)) ^ (-2049107944);
                                            i31 = -276804542;
                                        } else {
                                            m69813 = C0630.m2566("ۤܶ") ^ i29;
                                            i30 = ((m69813 ^ i28) * 8045) ^ 1878855525;
                                            i31 = 714105149;
                                        }
                                    case -893101745:
                                    case 378485261:
                                        C4616.m13552();
                                        if (RunnableC1108.f4040) {
                                            m69813 = (C2105.m6981("ۖ᩶") + i28) * (-77);
                                            i30 = ((m69813 ^ i29) * (-29717)) ^ (-2136698290);
                                            i31 = -2092951407;
                                        } else {
                                            m69813 = (C0630.m2566("ܰۗ") ^ i29) * (-121);
                                            i30 = ((m69813 ^ i28) * 9891) ^ (-2054192992);
                                            i31 = 676581330;
                                        }
                                    case -170408086:
                                    case 1033347653:
                                        if (C3019.m9255() <= 0) {
                                            m69813 = C2105.m6981("֡᩷") ^ i29;
                                            i30 = ((m69813 ^ i28) * 26831) ^ 25744174;
                                            i31 = -1002387243;
                                        } else {
                                            m69813 = (i28 - C2105.m6981("ܽ۬")) * 49;
                                            i30 = ((m69813 ^ i29) * 26461) ^ (-871458137);
                                            i31 = 1659172564;
                                        }
                                    case 198769289:
                                    case 412748624:
                                        C21923.m49329();
                                        C1047.m3599();
                                        m69813 = C2105.m6981("֡᩷") ^ i29;
                                        i30 = ((m69813 ^ i28) * 26831) ^ 25744174;
                                        i31 = -1002387243;
                                    case 272807254:
                                    case 1414642853:
                                        if (ServiceConnectionC3453.f10921 >= 0) {
                                            m69813 = C0630.m2566("ۗ᩹") ^ i28;
                                            i30 = ((m69813 ^ i29) * (-7345)) ^ 162289074;
                                            i31 = 228084021;
                                        } else {
                                            m69813 = C2105.m6981("ۘ᩺") ^ i29;
                                            i30 = ((m69813 ^ i28) * (-30143)) ^ (-287732963);
                                            i31 = -341086631;
                                        }
                                    case 429184101:
                                    case 1044824143:
                                        int i32 = ViewOnClickListenerC5850.f17941;
                                        if (C3432.f10845 >= 0) {
                                            m69813 = (C2105.m6981("ۨۛ") ^ i28) * (-99);
                                            i30 = ((m69813 ^ i29) * (-11291)) ^ (-2049107944);
                                            i31 = -276804542;
                                        } else {
                                            m69813 = (C2105.m6981("᩸᩶") ^ i29) * 93;
                                            i30 = ((m69813 ^ i28) * (-27615)) ^ 1902491685;
                                            i31 = 1496256789;
                                        }
                                    case 704472184:
                                    case 784929034:
                                        if (C1047.f3863 >= 0) {
                                            m69813 = (C0630.m2566("ܰۗ") ^ i29) * (-121);
                                            i30 = ((m69813 ^ i28) * 9891) ^ (-2054192992);
                                            i31 = 676581330;
                                        } else {
                                            m69813 = C2105.m6981("֨ۛ") ^ i28;
                                            i30 = ((m69813 ^ i29) * 1625) ^ (-1507710826);
                                            i31 = 1313266669;
                                        }
                                    case 1147857580:
                                    case 1709480678:
                                        if (C1711.f5919) {
                                            m69813 = (C2105.m6981("ۖ᩶") + i28) * (-77);
                                            i30 = ((m69813 ^ i29) * (-29717)) ^ (-2136698290);
                                            i31 = -2092951407;
                                        } else {
                                            m69813 = C0630.m2566("᩷۠") ^ i29;
                                            i30 = ((m69813 ^ i28) * 14795) ^ 170842491;
                                            i31 = -1277459695;
                                        }
                                    case 1242503742:
                                    case 1702647229:
                                        C0630.m2564();
                                        break;
                                    default:
                                        RunnableC1108.m3781(ViewOnClickListenerC5850.this);
                                        break;
                                }
                                return;
                            }
                        }
                    });
                    if (RunnableC1937.m6373()) {
                        m69812 = C0630.m2566("ܽۧ") ^ i9;
                        i7 = ((m69812 ^ i10) * 13385) ^ 181360512;
                        i8 = 1334036897;
                    } else {
                        m69812 = C0630.m2566("ۢ۠") ^ i10;
                        i7 = ((m69812 ^ i9) * (-18661)) ^ (-584875798);
                        i8 = -983516440;
                    }
                    int i2622222222222 = m69812 ^ i8;
                    textView3 = textView;
                    i12 = i2622222222222;
                    i11 = i7;
                    i13 = i6;
                    sArr2 = sArr;
                case 308236107:
                case 1317779987:
                    textView = textView3;
                    C4159.m12564(C0964.m3409(this, C2105.m6981(C0714.m2816(f17942, 641, 3, i17)) ^ 2119044355), this);
                    i19 = C0630.m2566(C2272.m7507(f17942, 644, 3, i17));
                    i20 = 2120087230;
                    if (C3537.f11231 >= 0) {
                        sArr = sArr2;
                        textView3 = textView;
                        i6 = i13;
                        int m25665 = C0630.m2566("ۤۨ") ^ i10;
                        i7 = ((m25665 ^ i9) * 14309) ^ (-450813571);
                        i12 = m25665 ^ 2028631226;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        m6981 = C2105.m6981("ᩴۡ") ^ i10;
                        i = ((m6981 ^ i9) * 1575) ^ (-395828089);
                        i2 = -524529779;
                        i3 = m6981 ^ i2;
                        TextView textView422222222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView422222222222222222222;
                    }
                case 509272815:
                case 718618409:
                    TextView textView5 = (TextView) C0964.m3409(this, C0630.m2566(C3019.m9250(sArr3, 650, 3, i17)) ^ 2126568458);
                    View m128133 = C4263.m12813(this, C2105.m6981(ViewOnClickListenerC1958.m6435(f17942, 653, 3, i17)) ^ 2123775431);
                    str3 = C2272.m7507(f17942, 656, 9, i17);
                    C4159.m12575(m128133, str3);
                    this.f17944 = (TextView) m128133;
                    String m9934 = C3245.m9934(f17942, 665, 3, i17);
                    if (C1047.m3599() >= 0) {
                        textView3 = textView5;
                        sArr = sArr2;
                        str2 = m9934;
                        i6 = i13;
                        int m256652 = C0630.m2566("ۤۨ") ^ i10;
                        i7 = ((m256652 ^ i9) * 14309) ^ (-450813571);
                        i12 = m256652 ^ 2028631226;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        int m69813 = C2105.m6981("᩶᩸") ^ i9;
                        i4 = ((m69813 ^ i10) * (-14803)) ^ (-155432360);
                        i12 = m69813 ^ (-1451318644);
                        textView3 = textView5;
                        str2 = m9934;
                        i11 = i4;
                    }
                case 980940216:
                case 1045711052:
                    textView = textView3;
                    C2126.m7039(C0964.m3409(this, i21 ^ i22), this);
                    C4159.m12564(C4263.m12813(this, C2105.m6981(C3245.m9934(f17942, 610, 3, i17)) ^ 2125579445), this);
                    sArr2 = f17942;
                    if (C0714.f2697 < 0) {
                        m6981 = (C2105.m6981("ۧ֨") + i9) * (-67);
                        i = ((m6981 ^ i10) * 26291) ^ (-1172150671);
                        i2 = 854792298;
                        i3 = m6981 ^ i2;
                        TextView textView4222222222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView4222222222222222222222;
                    }
                    m6981 = (i9 - C0630.m2566("᩻᩺")) * 61;
                    i = ((m6981 ^ i10) * 8973) ^ (-287255742);
                    i2 = -161389335;
                    i3 = m6981 ^ i2;
                    TextView textView42222222222222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView42222222222222222222222;
                case 1621040189:
                case 2035590927:
                    textView = textView3;
                    short[] sArr4 = sArr2;
                    C4159.m12564(C0964.m3409(this, C0630.m2566(C2126.m7036(sArr4, 613, 3, i17)) ^ 2121971176), this);
                    i24 = C0630.m2566(C0798.m3005(f17942, 616, 3, i17));
                    i18 = 2124912845;
                    if (C1294.f4556 >= 0) {
                        sArr2 = sArr4;
                        m6981 = (i9 - C0630.m2566("᩻᩺")) * 61;
                        i = ((m6981 ^ i10) * 8973) ^ (-287255742);
                        i2 = -161389335;
                        i3 = m6981 ^ i2;
                        TextView textView422222222222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView422222222222222222222222;
                    } else {
                        int m25666 = C0630.m2566("ۤۢ") ^ i10;
                        i = ((m25666 ^ i9) * (-27319)) ^ (-505381503);
                        i3 = m25666 ^ 2066536828;
                        sArr2 = sArr4;
                        TextView textView4222222222222222222222222 = textView;
                        i12 = i3;
                        i11 = i;
                        textView3 = textView4222222222222222222222222;
                    }
                case 1877798181:
                case 2078214083:
                    textView = textView3;
                    sArr = sArr2;
                    i6 = i13;
                    C2126.m7039(C0964.m3409(this, C0630.m2566(C1711.m5726(f17942, 604, 3, i17)) ^ 2097424851), this);
                    i21 = C2105.m6981(C0964.m3396(f17942, 607, 3, i17));
                    i22 = 2119122353;
                    if (C3432.f10845 >= 0) {
                        textView3 = textView;
                        int m2566522 = C0630.m2566("ۤۨ") ^ i10;
                        i7 = ((m2566522 ^ i9) * 14309) ^ (-450813571);
                        i12 = m2566522 ^ 2028631226;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    } else {
                        m69812 = (C0630.m2566("ܺ֫") ^ i10) * (-83);
                        i7 = ((m69812 ^ i9) * (-5651)) ^ 1458663105;
                        i8 = -2085426311;
                        int i26222222222222 = m69812 ^ i8;
                        textView3 = textView;
                        i12 = i26222222222222;
                        i11 = i7;
                        i13 = i6;
                        sArr2 = sArr;
                    }
                default:
                    textView = textView3;
                    C4159.m12564(C0964.m3409(this, i25), this);
                    m6981 = C0630.m2566("ۧۘ") ^ i9;
                    i = ((m6981 ^ i10) * (-26463)) ^ (-1094421355);
                    i2 = 2060931050;
                    i3 = m6981 ^ i2;
                    TextView textView42222222222222222222222222 = textView;
                    i12 = i3;
                    i11 = i;
                    textView3 = textView42222222222222222222222222;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x005d, code lost:
    
        if (l.C3019.f9544 >= 0) goto L40;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x0065, code lost:
    
        if (l.C3683.m11222() != false) goto L67;
     */
    /* JADX WARN: Code restructure failed: missing block: B:5:0x0057, code lost:
    
        if (l.C21923.f70183 != 0) goto L63;
     */
    @Override // l.AbstractActivityC3346, l.ActivityC0737, android.app.Activity
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onResume() {
        /*
            Method dump skipped, instructions count: 1028
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.onResume():void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:40:0x0078, code lost:
    
        if (l.C0422.f1886 > 0) goto L10;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16377(android.widget.EditText r19, android.widget.EditText r20, l.DialogInterfaceC0206 r21, l.ViewOnClickListenerC5850 r22, com.google.android.material.textfield.TextInputLayout r23, com.google.android.material.textfield.TextInputLayout r24) {
        /*
            Method dump skipped, instructions count: 1174
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16377(android.widget.EditText, android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* JADX INFO: Access modifiers changed from: private */
    /* renamed from: ۧ֫, reason: not valid java name and contains not printable characters */
    public final void m16397() {
        TextView textView;
        TextView textView2;
        TextView textView3;
        short[] sArr;
        Map map;
        TextView textView4;
        int m2566;
        int i;
        int i2;
        TextView textView5;
        TextView textView6;
        short[] sArr2;
        short[] sArr3;
        int m25662;
        int i3;
        int m6981;
        int i4;
        int i5;
        int i6;
        int m69812;
        int i7;
        int m25663;
        int i8;
        int i9;
        TextView textView7;
        int m69813;
        int i10;
        int m25664;
        int i11;
        int i12;
        int i13;
        ViewOnClickListenerC5850 viewOnClickListenerC5850 = this;
        int i14 = 93614898;
        int i15 = C2167.f7158;
        int i16 = RunnableC3474.f10992;
        int m69814 = C2105.m6981("֫۟") ^ i15;
        int i17 = ((m69814 ^ i16) * 8131) ^ 1052957627;
        int i18 = m69814 ^ 1162976278;
        String str = null;
        String str2 = null;
        String str3 = null;
        TextView textView8 = null;
        String str4 = null;
        short[] sArr4 = null;
        short[] sArr5 = null;
        int i19 = 0;
        TextView textView9 = null;
        boolean z = false;
        int i20 = 0;
        short s = 0;
        int i21 = 0;
        int i22 = 0;
        int i23 = 0;
        short s2 = 0;
        int i24 = 0;
        Map map2 = null;
        TextView textView10 = null;
        TextView textView11 = null;
        String str5 = null;
        int i25 = 0;
        int i26 = 0;
        Throwable th = null;
        TextView textView12 = null;
        String str6 = null;
        TextView textView13 = null;
        TextView textView14 = null;
        String str7 = null;
        boolean z2 = false;
        while (true) {
            i14 = i18 ^ (i17 & (((i14 ^ i16) * (-18715)) >> 31));
            switch (i14) {
                case -2135535686:
                case -1914867833:
                    textView = textView8;
                    str4 = C22628.m50602(f17942, 308, 3, i25);
                    if (C1128.f4106 <= 0) {
                        textView5 = textView12;
                        textView6 = textView10;
                        sArr2 = sArr4;
                        sArr3 = sArr5;
                        m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                        i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                        i3 = 1608315919;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    } else {
                        m2566 = C2105.m6981("ۨܿ") ^ i16;
                        i = ((m2566 ^ i15) * 171) ^ 447233247;
                        i2 = 726394712;
                        i18 = m2566 ^ i2;
                        i17 = i;
                        textView8 = textView;
                    }
                case -2087316930:
                case -753757166:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    i25 = 31114;
                    m25662 = C0630.m2566("ۖۢ") ^ i16;
                    i17 = ((m25662 ^ i15) * (-25093)) ^ (-615422495);
                    i3 = 296828990;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case -2060866464:
                case -1637460942:
                    C11340.m28031();
                    if (!C1504.m5179()) {
                        textView5 = textView12;
                        textView = textView8;
                        textView6 = textView10;
                        sArr2 = sArr4;
                        sArr3 = sArr5;
                        m25662 = (C2105.m6981("ۘ֡") ^ i16) * 85;
                        i17 = ((m25662 ^ i15) * 23661) ^ 1429674676;
                        i3 = 1156015482;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                    i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                    i3 = 1608315919;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case -1982795824:
                case -908947500:
                    textView5 = textView12;
                    textView = textView8;
                    C2105.m6978(textView14, i19);
                    m69813 = (C2105.m6981("᩺ۛ") ^ i16) * 21;
                    i4 = ((m69813 ^ i15) * 17913) ^ (-547937483);
                    i10 = -1472859175;
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1912342002:
                case -1188633995:
                    C21923.m49338(C1711.m5726(f17942, 260, 12, i25));
                    throw th;
                case -1897814368:
                case -652122801:
                    textView5 = textView12;
                    textView = textView8;
                    C1047.m3601(textView11, (CharSequence) map2.get(str));
                    textView6 = textView10;
                    m69812 = C0630.m2566("ۚۤ") ^ i15;
                    i4 = ((m69812 ^ i16) * (-5855)) ^ 255508144;
                    i7 = 406236201;
                    i6 = m69812 ^ i7;
                    textView10 = textView6;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1889078439:
                case 1293942189:
                    textView5 = textView12;
                    textView = textView8;
                    textView14 = viewOnClickListenerC5850.f17943;
                    if (textView14 != null) {
                        m69813 = (C2105.m6981("۬ۢ") + i16) * 43;
                        i4 = ((m69813 ^ i15) * 2149) ^ (-1650777977);
                        i10 = -1152962251;
                    } else {
                        m69813 = (C0630.m2566("᩸᩵") ^ i15) * 15;
                        i4 = ((m69813 ^ i16) * (-25975)) ^ 839313468;
                        i10 = -1803576643;
                    }
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1836132064:
                case 416291108:
                    C21923.m49338(str2);
                    throw th;
                case -1775483001:
                case -1766490193:
                    C1128.m3851();
                    if (C0050.f910 >= 0) {
                        textView5 = textView12;
                        textView = textView8;
                        m69813 = C2105.m6981("ۢۖ") ^ i15;
                        i4 = ((m69813 ^ i16) * (-13107)) ^ (-2052031071);
                        i10 = 1194329120;
                        i6 = m69813 ^ i10;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    } else {
                        m25664 = (C0630.m2566("۫᩻") ^ i15) * (-59);
                        i11 = ((m25664 ^ i16) * 905) ^ 908611759;
                        i12 = 880329661;
                        i18 = m25664 ^ i12;
                        i17 = i11;
                    }
                case -1769558579:
                case -361673192:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr3 = sArr5;
                    i20 = C0630.m2566(C0483.m2128(sArr3, 274, 3, i25));
                    i26 = 2098183002;
                    if (C1005.f3721) {
                        m6981 = C2105.m6981("ۧۢ") ^ i15;
                        i4 = ((m6981 ^ i16) * (-15455)) ^ (-1542585011);
                        i5 = 1711356743;
                        i6 = m6981 ^ i5;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    } else {
                        int m69815 = (C2105.m6981("۫᩷") + i16) * (-75);
                        i17 = ((m69815 ^ i15) * (-16689)) ^ 51815885;
                        i13 = m69815 ^ (-648391038);
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                case -1710964323:
                case 384158382:
                    textView2 = textView12;
                    textView = textView8;
                    textView3 = textView10;
                    sArr = sArr4;
                    int i27 = i24;
                    String m6573 = AbstractC2021.m6573(sArr, i27, 2, i25);
                    z = map2.containsKey(m6573);
                    sArr5 = f17942;
                    if (C3683.f11629 >= 0) {
                        i24 = i27;
                        str = m6573;
                        map = map2;
                        textView4 = textView9;
                        int m69816 = C2105.m6981("ۖ᩵") ^ i16;
                        Map map3 = map;
                        i17 = ((m69816 ^ i15) * 12581) ^ 2132480165;
                        sArr4 = sArr;
                        textView10 = textView3;
                        textView12 = textView2;
                        i18 = m69816 ^ (-582479573);
                        textView8 = textView;
                        textView9 = textView4;
                        map2 = map3;
                    } else {
                        int m25665 = C0630.m2566("ۧܿ") ^ i16;
                        i17 = ((m25665 ^ i15) * (-26797)) ^ (-199851812);
                        sArr4 = sArr;
                        i24 = i27;
                        str = m6573;
                        textView12 = textView2;
                        i18 = m25665 ^ (-143868584);
                        textView10 = textView3;
                        textView8 = textView;
                    }
                case -1680542239:
                case 48854506:
                    textView5 = textView12;
                    textView = textView8;
                    C1047.m3601(textView13, (CharSequence) map2.get(str3));
                    m69813 = (C2105.m6981("᩺ۛ") ^ i16) * 21;
                    i4 = ((m69813 ^ i15) * 17913) ^ (-547937483);
                    i10 = -1472859175;
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1680475357:
                case 1885034335:
                    TextView textView15 = textView12;
                    TextView textView16 = textView8;
                    TextView textView17 = textView10;
                    short[] sArr6 = sArr4;
                    short[] sArr7 = sArr5;
                    TextView textView18 = viewOnClickListenerC5850.f17944;
                    if (textView18 != null) {
                        int m69817 = (i16 - C2105.m6981("ܽ۫")) * (-9);
                        int i28 = ((m69817 ^ i15) * (-28355)) ^ (-1743961750);
                        sArr4 = sArr6;
                        sArr5 = sArr7;
                        textView10 = textView17;
                        textView8 = textView16;
                        textView12 = textView15;
                        i18 = m69817 ^ (-1225250283);
                        textView9 = textView18;
                        i17 = i28;
                        th = null;
                    } else {
                        int m25666 = (C0630.m2566("ᩳۙ") + i15) * (-109);
                        textView9 = textView18;
                        sArr4 = sArr6;
                        sArr5 = sArr7;
                        textView10 = textView17;
                        textView8 = textView16;
                        textView12 = textView15;
                        i17 = ((m25666 ^ i16) * 18809) ^ (-2051974118);
                        i18 = m25666 ^ (-87705718);
                        th = null;
                        viewOnClickListenerC5850 = this;
                    }
                case -1677220188:
                case 991527042:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    s = f17942[259];
                    if (C1773.m5908() > 0) {
                        m25662 = C0630.m2566("ۤۧ") ^ i15;
                        i17 = ((m25662 ^ i16) * (-27955)) ^ 255101874;
                        i3 = -38633379;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                    m25662 = (C2105.m6981("ۘ֡") ^ i16) * 85;
                    i17 = ((m25662 ^ i15) * 23661) ^ 1429674676;
                    i3 = 1156015482;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case -1626935611:
                case 943639740:
                    textView2 = textView12;
                    textView = textView8;
                    textView3 = textView10;
                    sArr = sArr4;
                    short[] sArr8 = sArr5;
                    textView4 = textView9;
                    RunnableC1937.m6377(textView4, C23196.m51463());
                    m16407();
                    map = C23196.m51450();
                    if (C7811.f24123 >= 0) {
                        sArr5 = sArr8;
                        int m698162 = C2105.m6981("ۖ᩵") ^ i16;
                        Map map32 = map;
                        i17 = ((m698162 ^ i15) * 12581) ^ 2132480165;
                        sArr4 = sArr;
                        textView10 = textView3;
                        textView12 = textView2;
                        i18 = m698162 ^ (-582479573);
                        textView8 = textView;
                        textView9 = textView4;
                        map2 = map32;
                    } else {
                        int m25667 = (C0630.m2566("֡ܽ") + i15) * 43;
                        i17 = ((m25667 ^ i16) * 19995) ^ (-719651011);
                        sArr4 = sArr;
                        sArr5 = sArr8;
                        textView8 = textView;
                        textView12 = textView2;
                        i18 = m25667 ^ (-1097095049);
                        textView9 = textView4;
                        map2 = map;
                        textView10 = textView3;
                    }
                case -1610293979:
                case -471738854:
                    textView = textView8;
                    boolean m51453 = C23196.m51453();
                    textView5 = textView12;
                    str6 = C3683.m11225(f17942, 291, 14, i25);
                    if (m51453) {
                        m69813 = (C0630.m2566("ۗۛ") + i16) * (-125);
                        i4 = ((m69813 ^ i15) * (-4557)) ^ (-522889578);
                        i10 = -1617006057;
                    } else {
                        m69813 = C0630.m2566("ᩳ֫") ^ i15;
                        i4 = ((m69813 ^ i16) * 10277) ^ 367141227;
                        i10 = -1911710836;
                    }
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1571638902:
                case 785262066:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    C2105.m6978(textView6, i19);
                    m69812 = C0630.m2566("ۚۤ") ^ i15;
                    i4 = ((m69812 ^ i16) * (-5855)) ^ 255508144;
                    i7 = 406236201;
                    i6 = m69812 ^ i7;
                    textView10 = textView6;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1443000281:
                case -580257517:
                    C22628.m50615();
                    if (C1504.f5354) {
                        m25664 = C0630.m2566("ᩳܶ") ^ i16;
                        i11 = ((m25664 ^ i15) * (-15655)) ^ 968441967;
                        i12 = -587069478;
                        i18 = m25664 ^ i12;
                        i17 = i11;
                    } else {
                        textView5 = textView12;
                        textView = textView8;
                        m69813 = C2105.m6981("ۢۖ") ^ i15;
                        i4 = ((m69813 ^ i16) * (-13107)) ^ (-2052031071);
                        i10 = 1194329120;
                        i6 = m69813 ^ i10;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    }
                case -1433097374:
                case -807736079:
                    C21923.m49338(str6);
                    throw th;
                case -1334787292:
                case 1657611421:
                    textView8 = viewOnClickListenerC5850.f17945;
                    if (textView8 != null) {
                        m25664 = (C0630.m2566("ܿܽ") ^ i15) * 61;
                        i11 = ((m25664 ^ i16) * 27351) ^ 2040224574;
                        i12 = 1226962338;
                    } else {
                        m25664 = (C0630.m2566("᩻ۚ") + i16) * (-21);
                        i11 = ((m25664 ^ i15) * 12967) ^ 400709853;
                        i12 = 950261461;
                    }
                    i18 = m25664 ^ i12;
                    i17 = i11;
                case -1317317263:
                case 205842129:
                    C22628.m50610(str6);
                    throw th;
                case -1130220839:
                case 324394968:
                    RunnableC1937.m6387();
                    if (C0382.f1805) {
                        textView = textView8;
                        m2566 = (C2105.m6981("ܿۢ") + i15) * 5;
                        i = ((m2566 ^ i16) * 10615) ^ 824776357;
                        i2 = -1036000087;
                        i18 = m2566 ^ i2;
                        i17 = i;
                        textView8 = textView;
                    } else {
                        m25664 = (C0630.m2566("۫᩻") ^ i15) * (-59);
                        i11 = ((m25664 ^ i16) * 905) ^ 908611759;
                        i12 = 880329661;
                        i18 = m25664 ^ i12;
                        i17 = i11;
                    }
                case -1125387948:
                case -1077348013:
                    if (C7811.f24123 < 0) {
                        textView5 = textView12;
                        textView = textView8;
                        textView6 = textView10;
                        sArr2 = sArr4;
                        sArr3 = sArr5;
                        m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                        i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                        i3 = 1608315919;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    } else {
                        textView5 = textView12;
                        textView = textView8;
                        m69813 = C2105.m6981("ۢۖ") ^ i15;
                        i4 = ((m69813 ^ i16) * (-13107)) ^ (-2052031071);
                        i10 = 1194329120;
                        i6 = m69813 ^ i10;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    }
                case -1084789830:
                case 645640615:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    i19 = i20 ^ i26;
                    str2 = C3911.m11919(f17942, 277, 6, i25);
                    if (z) {
                        m69812 = (i15 - C2105.m6981("ۖۨ")) * 89;
                        i4 = ((m69812 ^ i16) * (-13027)) ^ 98873174;
                        i7 = -159333983;
                    } else {
                        m69812 = (C2105.m6981("ܿ᩶") ^ i16) * (-11);
                        i4 = ((m69812 ^ i15) * 17437) ^ (-478286766);
                        i7 = 1031463159;
                    }
                    i6 = m69812 ^ i7;
                    textView10 = textView6;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1050608827:
                case 271769108:
                    textView5 = textView12;
                    textView = textView8;
                    str3 = C0050.m948(f17942, 283, 2, i25);
                    z2 = map2.containsKey(str3);
                    if (C1420.f5096 > 0) {
                        m69813 = (C2105.m6981("ᩴۜ") ^ i16) * 19;
                        i4 = ((m69813 ^ i15) * 29975) ^ 387321545;
                        i10 = 953014660;
                        i6 = m69813 ^ i10;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    }
                    m69813 = C2105.m6981("ۢۖ") ^ i15;
                    i4 = ((m69813 ^ i16) * (-13107)) ^ (-2052031071);
                    i10 = 1194329120;
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -1020190130:
                case -788624658:
                    textView5 = textView12;
                    textView = textView8;
                    textView13 = viewOnClickListenerC5850.f17943;
                    if (textView13 != null) {
                        m69813 = (C2105.m6981("ܶۙ") ^ i15) * 119;
                        i4 = ((m69813 ^ i16) * 29741) ^ 1222690925;
                        i10 = -1660972046;
                    } else {
                        m69813 = (C2105.m6981("ۜۗ") ^ i16) * 87;
                        i4 = ((m69813 ^ i15) * (-5137)) ^ 1737975228;
                        i10 = -2120743443;
                    }
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -966811570:
                case 1440689744:
                    C0050.m940();
                    C4075.m12263();
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                    i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                    i3 = 1608315919;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case -954874025:
                case -523684529:
                    C21923.m49338(str7);
                    throw th;
                case -935324638:
                case 618975480:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    i21 = s * s;
                    i22 = 199600384;
                    if (C1128.f4106 <= 0) {
                        sArr4 = sArr2;
                        int m698152 = (C2105.m6981("۫᩷") + i16) * (-75);
                        i17 = ((m698152 ^ i15) * (-16689)) ^ 51815885;
                        i13 = m698152 ^ (-648391038);
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    } else {
                        m25662 = (C0630.m2566("᩻ܺ") + i16) * (-77);
                        i17 = ((m25662 ^ i15) * 5079) ^ (-626633892);
                        i3 = -1109444396;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                case -920526728:
                case 414703790:
                    C0630.m2570(textView12, C2105.m6981(str5) ^ 2129884848);
                    return;
                case -594379370:
                case 2018142101:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    textView11 = viewOnClickListenerC5850.f17948;
                    if (textView11 != null) {
                        m69812 = (C2105.m6981("۟᩻") ^ i15) * 93;
                        i4 = ((m69812 ^ i16) * 18445) ^ 1116407932;
                        i7 = 759395069;
                    } else {
                        m69812 = C0630.m2566("ۗۙ") ^ i16;
                        i4 = ((m69812 ^ i15) * 32683) ^ (-1487067434);
                        i7 = 1486025342;
                    }
                    i6 = m69812 ^ i7;
                    textView10 = textView6;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -589996570:
                case 1465396786:
                    textView = textView8;
                    textView12 = viewOnClickListenerC5850.f17945;
                    if (textView12 != null) {
                        m2566 = (i16 - C0630.m2566("ۤۡ")) * 59;
                        i = ((m2566 ^ i15) * (-16595)) ^ 951225530;
                        i2 = -1153324588;
                    } else {
                        m2566 = C0630.m2566("ܶ᩶") ^ i15;
                        i = ((m2566 ^ i16) * 2729) ^ (-288059549);
                        i2 = 1747788631;
                    }
                    i18 = m2566 ^ i2;
                    i17 = i;
                    textView8 = textView;
                case -329886427:
                case 1060354177:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr3 = sArr5;
                    sArr4 = f17942;
                    i24 = 272;
                    if (C1420.m4913()) {
                        int m6981522 = (C2105.m6981("۫᩷") + i16) * (-75);
                        i17 = ((m6981522 ^ i15) * (-16689)) ^ 51815885;
                        i13 = m6981522 ^ (-648391038);
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    } else {
                        m6981 = C2105.m6981("᩺֨") ^ i16;
                        i4 = ((m6981 ^ i15) * (-6845)) ^ (-1527951652);
                        i5 = 1997290861;
                        i6 = m6981 ^ i5;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView7 = textView5;
                        i18 = i6;
                        i17 = i4;
                        textView12 = textView7;
                    }
                case -276905651:
                case 2089845659:
                    textView5 = textView12;
                    textView = textView8;
                    str7 = C3432.m10488(f17942, WhirlpoolDigest.REDUCTION_POLYNOMIAL, 6, i25);
                    if (z2) {
                        m69813 = (C0630.m2566("ܰ۬") + i16) * 95;
                        i4 = ((m69813 ^ i15) * (-18335)) ^ (-111808879);
                        i10 = -2037835495;
                    } else {
                        m69813 = (C0630.m2566("ܺ᩹") + i15) * (-105);
                        i4 = ((m69813 ^ i16) * 4777) ^ 1127467098;
                        i10 = -1777976322;
                    }
                    i6 = m69813 ^ i10;
                    textView8 = textView;
                    textView7 = textView5;
                    i18 = i6;
                    i17 = i4;
                    textView12 = textView7;
                case -141211915:
                case 2143550643:
                    TextView textView19 = textView12;
                    TextView textView20 = textView8;
                    TextView textView21 = viewOnClickListenerC5850.f17948;
                    if (textView21 != null) {
                        m25663 = C0630.m2566("᩶᩻") ^ i16;
                        i8 = ((m25663 ^ i15) * (-31847)) ^ (-1825858586);
                        i9 = 1327998618;
                    } else {
                        m25663 = (i15 - C0630.m2566("ۖܺ")) * (-109);
                        i8 = ((m25663 ^ i16) * (-29481)) ^ 1767862713;
                        i9 = -468878586;
                    }
                    textView10 = textView21;
                    i17 = i8;
                    textView8 = textView20;
                    textView7 = textView19;
                    i18 = m25663 ^ i9;
                    textView12 = textView7;
                case -58022172:
                case 1859481953:
                    C0964.m3413();
                    if (C1047.f3863 < 0) {
                        textView5 = textView12;
                        textView = textView8;
                        textView6 = textView10;
                        sArr3 = sArr5;
                        int m69815222 = (C2105.m6981("۫᩷") + i16) * (-75);
                        i17 = ((m69815222 ^ i15) * (-16689)) ^ 51815885;
                        i13 = m69815222 ^ (-648391038);
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                    i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                    i3 = 1608315919;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case 544298496:
                case 732643268:
                    textView = textView8;
                    str5 = C0237.m1483(f17942, 305, 3, i25);
                    if (C22628.f73083 > 0) {
                        m2566 = C2105.m6981("ۢ۬") ^ i15;
                        i = ((m2566 ^ i16) * (-8965)) ^ 1261013229;
                        i2 = 276279316;
                        i18 = m2566 ^ i2;
                        i17 = i;
                        textView8 = textView;
                    }
                    m2566 = (C2105.m6981("ܿۢ") + i15) * 5;
                    i = ((m2566 ^ i16) * 10615) ^ 824776357;
                    i2 = -1036000087;
                    i18 = m2566 ^ i2;
                    i17 = i;
                    textView8 = textView;
                case 598908063:
                case 748667851:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    int i29 = s + s2;
                    if ((i29 * i29) - i23 > 0) {
                        m25662 = C2105.m6981("ۡ᩹") ^ i15;
                        i17 = ((m25662 ^ i16) * 17381) ^ (-220484941);
                        i3 = 1522561440;
                    } else {
                        m25662 = C2105.m6981("᩵ۨ") ^ i16;
                        i17 = ((m25662 ^ i15) * 19349) ^ (-1975421800);
                        i3 = 579920333;
                    }
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case 679080040:
                case 1653921644:
                    C21923.m49338(str7);
                    throw th;
                case 905252233:
                case 1252128674:
                    C0630.m2570(textView8, C0630.m2566(str4) ^ 2102722594);
                    return;
                case 918041968:
                case 1479412738:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    int i30 = i21 + i22;
                    i23 = i30 + i30;
                    s2 = 14128;
                    if (C21923.f70183 == 0) {
                        m25662 = C2105.m6981("֡֫") ^ i15;
                        i17 = ((m25662 ^ i16) * 26771) ^ (-681104345);
                        i3 = -171312185;
                        i13 = m25662 ^ i3;
                        sArr4 = sArr2;
                        sArr5 = sArr3;
                        textView10 = textView6;
                        textView8 = textView;
                        textView12 = textView5;
                        i18 = i13;
                        viewOnClickListenerC5850 = this;
                    }
                    m25662 = (i15 - C0630.m2566("ۧۜ")) * 23;
                    i17 = ((m25662 ^ i16) * 18007) ^ (-1371320376);
                    i3 = 1608315919;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                case 964224305:
                case 1764828612:
                    C21923.m49338(str2);
                    throw th;
                case 1132009331:
                case 1768194451:
                    textView5 = textView12;
                    textView = textView8;
                    textView6 = textView10;
                    sArr2 = sArr4;
                    sArr3 = sArr5;
                    i25 = 16550;
                    m25662 = C0630.m2566("ۖۢ") ^ i16;
                    i17 = ((m25662 ^ i15) * (-25093)) ^ (-615422495);
                    i3 = 296828990;
                    i13 = m25662 ^ i3;
                    sArr4 = sArr2;
                    sArr5 = sArr3;
                    textView10 = textView6;
                    textView8 = textView;
                    textView12 = textView5;
                    i18 = i13;
                    viewOnClickListenerC5850 = this;
                default:
                    C1711.m5736();
                    ServiceConnectionC3453.m10564();
                    return;
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:56:0x0098, code lost:
    
        if (l.C0483.f2088 >= 0) goto L9;
     */
    /* JADX WARN: Type inference failed for: r8v106, types: [l.ۢۚۡ] */
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16401(android.widget.EditText r20, android.widget.EditText r21, final l.DialogInterfaceC0206 r22, final l.ViewOnClickListenerC5850 r23, com.google.android.material.textfield.TextInputLayout r24, final com.google.android.material.textfield.TextInputLayout r25) {
        /*
            Method dump skipped, instructions count: 1362
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16401(android.widget.EditText, android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m16382(C13136 c13136, View view, EditText editText, ViewOnClickListenerC5850 viewOnClickListenerC5850, C23881 c23881) {
        int m6981;
        int i;
        int i2;
        String str = null;
        int i3 = 0;
        short s = 0;
        int i4 = 0;
        short s2 = 0;
        int i5 = 0;
        int i6 = -1607481235;
        int i7 = C0050.f910;
        int i8 = C3683.f11629;
        int m2566 = (i8 - C0630.m2566("᩵ᩳ")) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
        int i9 = ((m2566 ^ i7) * (-15955)) ^ (-876049066);
        int i10 = -1421778791;
        while (true) {
            int i11 = m2566 ^ i10;
            while (true) {
                i6 = ((((i6 ^ i7) * 27933) >> 31) & i9) ^ i11;
                switch (i6) {
                    case -2006516208:
                    case 307225450:
                        s = f17942[49];
                        if (C4616.f14690 > 0) {
                            m6981 = (i7 - C0630.m2566("ᩴۤ")) * (-69);
                            i = ((m6981 ^ i8) * (-3651)) ^ 576086756;
                            i2 = 930027224;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("۠᩹") ^ i8;
                        i = ((m6981 ^ i7) * 25979) ^ (-583268684);
                        i2 = 1029302480;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -1946655762:
                    case -1884533277:
                        C3683.m11220(AbstractC2021.m6563(c23881, 2100023001 ^ i3));
                        break;
                    case -1927192106:
                    case 1931484769:
                        if (RunnableC0588.f2309 >= 0) {
                            m6981 = C2105.m6981("᩸ܽ") ^ i8;
                            i = ((m6981 ^ i7) * (-8483)) ^ 2127848658;
                            i2 = -265133754;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -1700316109:
                    case -1171797070:
                        if (ServiceConnectionC3453.f10921 < 0) {
                            m6981 = (i7 - C2105.m6981("۟ۚ")) * (-43);
                            i = ((m6981 ^ i8) * (-16387)) ^ 2012307084;
                            i2 = -2046678288;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -1642930462:
                    case -1241481268:
                        if (i4 - ((s * s2) + 1) < 0) {
                            m6981 = C0630.m2566("᩷᩹") ^ i8;
                            i = ((m6981 ^ i7) * (-18217)) ^ 172731414;
                            i2 = 1457767875;
                        } else {
                            m6981 = C0630.m2566("ܳ۫") ^ i7;
                            i = ((m6981 ^ i8) * 21547) ^ 1133720498;
                            i2 = 397869413;
                        }
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -1570288948:
                    case -886943290:
                        i5 = 21807;
                        m6981 = C2105.m6981("֡ۚ") ^ i8;
                        i = ((m6981 ^ i7) * (-22165)) ^ (-2007409818);
                        i2 = -1969129495;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -1330686894:
                    case 1561830229:
                        i3 = C2105.m6981(C3746.m11357(f17942, 58, 3, i5));
                        if (C2167.f7158 < 0) {
                            m6981 = C2105.m6981("ۙܰ") ^ i8;
                            i = ((m6981 ^ i7) * (-13837)) ^ 1825286766;
                            i2 = 2139060596;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C2105.m6981("᩸ܽ") ^ i8;
                        i = ((m6981 ^ i7) * (-8483)) ^ 2127848658;
                        i2 = -265133754;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -908147036:
                    case 1917106773:
                        C1711.m5736();
                        if (C3746.f11829 > 0) {
                            m6981 = C0630.m2566("֡ᩳ") ^ i7;
                            i = ((m6981 ^ i8) * 5411) ^ 374527179;
                            i2 = -1887056936;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -550311007:
                    case 2130084865:
                        int i12 = s + 1;
                        i4 = i12 * i12;
                        s2 = 2;
                        if (C3663.m11168() < 0) {
                            m6981 = C0630.m2566("ܳۚ") ^ i8;
                            i = ((m6981 ^ i7) * (-20321)) ^ 1927461073;
                            i2 = 1788213512;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C2105.m6981("᩸ܽ") ^ i8;
                        i = ((m6981 ^ i7) * (-8483)) ^ 2127848658;
                        i2 = -265133754;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -529522956:
                    case 445604975:
                        if (C0714.f2697 < 0) {
                            m6981 = C2105.m6981("᩷۬") ^ i7;
                            i = ((m6981 ^ i8) * (-22177)) ^ (-454532265);
                            i2 = 1958795278;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("֡ᩳ") ^ i7;
                        i = ((m6981 ^ i8) * 5411) ^ 374527179;
                        i2 = -1887056936;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -404905810:
                    case 244483389:
                        RunnableC0588.m2430(c23881, str);
                        C3911.m11920(c13136);
                        if (C1773.m5916(c23881)) {
                            m6981 = C0630.m2566("ۜۖ") ^ i8;
                            i = ((m6981 ^ i7) * (-16907)) ^ (-1095413327);
                            i2 = -535430969;
                        } else {
                            m6981 = C2105.m6981("ܽۗ") ^ i7;
                            i = ((m6981 ^ i8) * 29507) ^ 1812224723;
                            i2 = -1582147292;
                        }
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -351077834:
                    case 830995566:
                        i5 = 10156;
                        m6981 = C2105.m6981("֡ۚ") ^ i8;
                        i = ((m6981 ^ i7) * (-22165)) ^ (-2007409818);
                        i2 = -1969129495;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -286094478:
                    case 3957200:
                        if (C1294.m4372() > 0) {
                            m6981 = (C0630.m2566("֡᩷") ^ i8) * (-127);
                            i = ((m6981 ^ i7) * (-26335)) ^ (-2001311919);
                            i2 = 732252072;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("֡ᩳ") ^ i7;
                        i = ((m6981 ^ i8) * 5411) ^ 374527179;
                        i2 = -1887056936;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case -18127413:
                    case 79076206:
                        C4263.m12819();
                        if (C3537.m10746() <= 0) {
                            break;
                        }
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                        break;
                    case 32348180:
                    case 1161266502:
                        if (C4263.f13799 > 0) {
                            m6981 = (C2105.m6981("۫ۨ") + i7) * 47;
                            i = ((m6981 ^ i8) * (-18469)) ^ (-1974321051);
                            i2 = 853536383;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case 345170512:
                    case 1252344429:
                        C21923.m49330(view, false);
                        C1711.m5740(editText);
                        viewOnClickListenerC5850.m16389();
                        break;
                    case 376121536:
                    case 1101398565:
                        if (C0714.f2697 < 0) {
                            m6981 = C2105.m6981("ᩳۘ") ^ i8;
                            i = ((m6981 ^ i7) * (-6553)) ^ 784521550;
                            i2 = 351593948;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("۠᩹") ^ i8;
                        i = ((m6981 ^ i7) * 25979) ^ (-583268684);
                        i2 = 1029302480;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case 896100613:
                    case 1631952134:
                        C2520.m8026();
                        break;
                    case 983096330:
                    case 1594292935:
                        C0798.m2998();
                        C1294.m4372();
                        m6981 = C0630.m2566("᩶۫") ^ i7;
                        i = ((m6981 ^ i8) * 7455) ^ (-2022029874);
                        i2 = -909160581;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    case 1353116327:
                    case 1598176661:
                        if (C1773.f6144 > 0) {
                            m6981 = C0630.m2566("ۗܿ") ^ i8;
                            i = ((m6981 ^ i7) * 4745) ^ 1342836988;
                            i2 = -189039755;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("۠᩹") ^ i8;
                        i = ((m6981 ^ i7) * 25979) ^ (-583268684);
                        i2 = 1029302480;
                        i11 = m6981 ^ i2;
                        i9 = i;
                    default:
                        str = C3911.m11919(f17942, 50, 8, i5);
                        if (C4117.f13076 > 0) {
                            m6981 = (C2105.m6981("ܳ۟") ^ i7) * (-17);
                            i = ((m6981 ^ i8) * (-30733)) ^ 672505663;
                            i2 = 912840052;
                            i11 = m6981 ^ i2;
                            i9 = i;
                        }
                        m6981 = C0630.m2566("֡ᩳ") ^ i7;
                        i = ((m6981 ^ i8) * 5411) ^ 374527179;
                        i2 = -1887056936;
                        i11 = m6981 ^ i2;
                        i9 = i;
                }
                return;
            }
            m2566 = C0630.m2566("۠۟") ^ i7;
            i9 = ((m2566 ^ i8) * (-32429)) ^ (-1526916074);
            i10 = -1549583245;
        }
    }

    /* renamed from: ۨ, reason: not valid java name and contains not printable characters */
    private final void m16398() {
        int i;
        int i2;
        TextView textView;
        String str;
        EditText editText;
        DialogInterfaceC0206 dialogInterfaceC0206;
        short[] sArr;
        int i3;
        ViewOnClickListenerC5850 viewOnClickListenerC5850;
        KeyEvent.Callback callback;
        short[] sArr2;
        int m6981;
        int i4;
        int i5;
        int i6;
        int m2566;
        int i7;
        int i8;
        KeyEvent.Callback callback2;
        short[] sArr3;
        ViewOnClickListenerC5850 viewOnClickListenerC58502;
        int m25662;
        int i9;
        int i10;
        int i11;
        int i12;
        int i13;
        int i14;
        TextView textView2;
        EditText editText2;
        DialogInterfaceC0206 dialogInterfaceC02062;
        KeyEvent.Callback callback3;
        short[] sArr4;
        short[] sArr5;
        ViewOnClickListenerC5850 viewOnClickListenerC58503;
        int i15;
        ViewOnClickListenerC5850 viewOnClickListenerC58504 = this;
        int i16 = C3432.f10845;
        int i17 = C2167.f7158;
        int m69812 = C2105.m6981("ᩳۜ") ^ i17;
        int i18 = ((m69812 ^ i16) * 27367) ^ (-787650652);
        KeyEvent.Callback callback4 = null;
        String str2 = null;
        TextInputLayout textInputLayout = null;
        TextInputLayout textInputLayout2 = null;
        EditText editText3 = null;
        EditText editText4 = null;
        DialogInterfaceC0206 dialogInterfaceC02063 = null;
        TextView textView3 = null;
        String str3 = null;
        short[] sArr6 = null;
        short[] sArr7 = null;
        short[] sArr8 = null;
        int i19 = m69812 ^ 968016541;
        int i20 = 0;
        int i21 = 0;
        int i22 = 0;
        View view = null;
        int i23 = 0;
        int i24 = 0;
        int i25 = 0;
        int i26 = 0;
        int i27 = 0;
        int i28 = 0;
        int i29 = 0;
        short s = 0;
        int i30 = 0;
        int i31 = 128217860;
        while (true) {
            i31 = i19 ^ (i18 & (((i31 ^ i16) * 25851) >> 31));
            switch (i31) {
                case -2133806457:
                case -866895360:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    View m28028 = C11340.m28028(view, i25 ^ 2099560151);
                    C2126.m7031(m28028, str2);
                    textInputLayout2 = (TextInputLayout) m28028;
                    if (C0050.f910 >= 0) {
                        viewOnClickListenerC58502 = this;
                        callback2 = callback4;
                        sArr3 = sArr7;
                        i21 = i2;
                        int m69813 = C2105.m6981("ۙ۟") ^ i17;
                        i19 = m69813 ^ (-882562392);
                        callback4 = callback2;
                        sArr7 = sArr3;
                        viewOnClickListenerC58504 = viewOnClickListenerC58502;
                        i18 = ((m69813 ^ i16) * 1277) ^ (-1206471879);
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        textView3 = textView;
                    } else {
                        m25662 = (i16 - C0630.m2566("ܺۢ")) * (-109);
                        i9 = ((m25662 ^ i17) * 5459) ^ 879338006;
                        i10 = -394746253;
                        i19 = m25662 ^ i10;
                        viewOnClickListenerC58504 = this;
                        i18 = i9;
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                    }
                case -2116091438:
                case 190907689:
                    C14096.m33705(textView3);
                    C2126.m7039(textView3, new ViewOnClickListenerC11350(dialogInterfaceC02063, viewOnClickListenerC58504, 0));
                    break;
                case -2088333354:
                case -337517812:
                    i11 = i20;
                    int i32 = i21;
                    i3 = i22;
                    textView = textView3;
                    String str4 = str2;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    EditText editText5 = (EditText) C11340.m28028(view, i27 ^ i28);
                    C0287.m1629(textInputLayout);
                    C0287.m1629(textInputLayout2);
                    if (C1504.f5354) {
                        viewOnClickListenerC5850 = this;
                        editText = editText5;
                        callback = callback4;
                        str2 = str4;
                        sArr2 = sArr7;
                        i6 = i11;
                        i21 = i32;
                        m2566 = (i17 - C2105.m6981("۠ܰ")) * 41;
                        i7 = ((m2566 ^ i16) * 503) ^ (-1143347198);
                        i8 = -1315510330;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    } else {
                        int m25663 = C0630.m2566("ܳܶ") ^ i16;
                        i12 = ((m25663 ^ i17) * (-18891)) ^ (-1748282757);
                        i13 = m25663 ^ (-359542776);
                        viewOnClickListenerC58504 = this;
                        i22 = i3;
                        sArr6 = sArr;
                        str2 = str4;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i32;
                        textView3 = textView;
                        editText4 = editText5;
                        i19 = i13;
                        i18 = i12;
                        i20 = i11;
                    }
                case -1914209479:
                case -1164867269:
                    C0483.m2121();
                    if (RunnableC1108.f4040) {
                        i6 = i20;
                        textView = textView3;
                        editText = editText4;
                        dialogInterfaceC0206 = dialogInterfaceC02063;
                        callback = callback4;
                        sArr2 = sArr7;
                        sArr = sArr6;
                        i3 = i22;
                        viewOnClickListenerC5850 = viewOnClickListenerC58504;
                        m2566 = C2105.m6981("ܺ᩻") ^ i16;
                        i7 = ((m2566 ^ i17) * 29529) ^ 1906668225;
                        i8 = -1793042750;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    }
                    i = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback2 = callback4;
                    sArr3 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC58502 = viewOnClickListenerC58504;
                    int m698132 = C2105.m6981("ۙ۟") ^ i17;
                    i19 = m698132 ^ (-882562392);
                    callback4 = callback2;
                    sArr7 = sArr3;
                    viewOnClickListenerC58504 = viewOnClickListenerC58502;
                    i18 = ((m698132 ^ i16) * 1277) ^ (-1206471879);
                    i22 = i3;
                    sArr6 = sArr;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    textView3 = textView;
                case -1893431639:
                case 1602579779:
                    i11 = i20;
                    C19258 m5912 = C1773.m5912(this);
                    C1711.m5727(m5912, view);
                    DialogInterfaceC0206 m2438 = RunnableC0588.m2438(m5912);
                    C4925.m14329(editText3);
                    sArr8 = f17942;
                    int m25664 = C0630.m2566("᩸ۚ") ^ i17;
                    i12 = ((m25664 ^ i16) * 5123) ^ (-1060127915);
                    i13 = m25664 ^ 1131369587;
                    viewOnClickListenerC58504 = this;
                    i22 = i22;
                    sArr6 = sArr6;
                    str2 = str2;
                    editText4 = editText4;
                    i21 = i21;
                    textView3 = textView3;
                    dialogInterfaceC02063 = m2438;
                    i19 = i13;
                    i18 = i12;
                    i20 = i11;
                case -1707416777:
                case 835415334:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    str = str2;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    i29 = C0630.m2566(C3663.m11162(sArr8, HRSS1373Polynomial.M, 3, i3));
                    if (C2958.f9394 >= 0) {
                        viewOnClickListenerC5850 = this;
                        callback = callback4;
                        str2 = str;
                        sArr2 = sArr7;
                        i6 = i;
                        i21 = i2;
                        m2566 = C2105.m6981("ܺ᩻") ^ i16;
                        i7 = ((m2566 ^ i17) * 29529) ^ 1906668225;
                        i8 = -1793042750;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    } else {
                        m6981 = (C2105.m6981("۬᩷") ^ i16) * (-37);
                        i4 = ((m6981 ^ i17) * (-1279)) ^ (-1026888461);
                        i5 = -1921059690;
                        i15 = m6981 ^ i5;
                        viewOnClickListenerC58504 = this;
                        i22 = i3;
                        sArr6 = sArr;
                        str2 = str;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                        i19 = i15;
                        i18 = i4;
                    }
                case -1611664679:
                case 577023571:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    str = str2;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    editText3 = (EditText) C11340.m28028(view, i26 ^ 2120687857);
                    if (C5695.f17556 < 0) {
                        m6981 = (C0630.m2566("᩻ܶ") ^ i17) * 55;
                        i4 = ((m6981 ^ i16) * (-10141)) ^ (-1337123033);
                        i5 = 1313491453;
                        i15 = m6981 ^ i5;
                        viewOnClickListenerC58504 = this;
                        i22 = i3;
                        sArr6 = sArr;
                        str2 = str;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                        i19 = i15;
                        i18 = i4;
                    }
                    m6981 = C2105.m6981("ܽۚ") ^ i16;
                    i4 = ((m6981 ^ i17) * (-16099)) ^ (-721397549);
                    i5 = 1860703773;
                    i15 = m6981 ^ i5;
                    viewOnClickListenerC58504 = this;
                    i22 = i3;
                    sArr6 = sArr;
                    str2 = str;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i21 = i2;
                    textView3 = textView;
                    i19 = i15;
                    i18 = i4;
                case -1577276772:
                case 1598725851:
                    int i33 = i20;
                    str3 = C2167.m7159(f17942, 347, 3, i22);
                    if (C4616.m13552() != 0) {
                        i2 = i21;
                        textView = textView3;
                        editText = editText4;
                        dialogInterfaceC0206 = dialogInterfaceC02063;
                        i = i33;
                        sArr = sArr6;
                        i3 = i22;
                        str = str2;
                        m6981 = C2105.m6981("ܽۚ") ^ i16;
                        i4 = ((m6981 ^ i17) * (-16099)) ^ (-721397549);
                        i5 = 1860703773;
                        i15 = m6981 ^ i5;
                        viewOnClickListenerC58504 = this;
                        i22 = i3;
                        sArr6 = sArr;
                        str2 = str;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                        i19 = i15;
                        i18 = i4;
                    } else {
                        int m25665 = C0630.m2566("ۢܺ") ^ i16;
                        i4 = ((m25665 ^ i17) * (-29557)) ^ (-2101998699);
                        i15 = m25665 ^ 407393964;
                        i20 = i33;
                        i19 = i15;
                        i18 = i4;
                    }
                case -1462758808:
                case 1582320900:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    sArr2 = sArr7;
                    str2 = C1504.m5177(sArr2, 318, 17, i3);
                    callback = callback4;
                    C2126.m7031(callback, str2);
                    if (C0714.f2697 >= 0) {
                        viewOnClickListenerC5850 = this;
                        i6 = i;
                        i21 = i2;
                        m2566 = C2105.m6981("ܺ᩻") ^ i16;
                        i7 = ((m2566 ^ i17) * 29529) ^ 1906668225;
                        i8 = -1793042750;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    } else {
                        int m25666 = (i17 - C0630.m2566("ۜᩳ")) * (-49);
                        i19 = m25666 ^ 1733153824;
                        viewOnClickListenerC58504 = this;
                        callback4 = callback;
                        sArr7 = sArr2;
                        i18 = ((m25666 ^ i16) * 21135) ^ 1588144004;
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                    }
                case -1386426084:
                case -176781061:
                    textView3 = (TextView) C11340.m28028(view, C2105.m6981(str3) ^ 2125584366);
                    int m25667 = C0630.m2566("᩵᩵") ^ i16;
                    i4 = ((m25667 ^ i17) * (-25391)) ^ 1261992949;
                    i19 = m25667 ^ (-1099558751);
                    i18 = i4;
                case -1353487079:
                case 305364392:
                    C3537.m10746();
                    break;
                case -1353158782:
                case 30483457:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    textInputLayout = (TextInputLayout) callback4;
                    i25 = C0630.m2566(C1420.m4902(f17942, 335, 3, i3));
                    if (C4075.f12947 < 0) {
                        m25662 = (C0630.m2566("᩺ܳ") ^ i17) * (-63);
                        i9 = ((m25662 ^ i16) * (-31623)) ^ (-1250873224);
                        i10 = 53965464;
                        i19 = m25662 ^ i10;
                        viewOnClickListenerC58504 = this;
                        i18 = i9;
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                    }
                    m25662 = (C2105.m6981("ۗۤ") ^ i17) * 31;
                    i9 = ((m25662 ^ i16) * 26955) ^ (-1764180643);
                    i10 = -337310802;
                    i19 = m25662 ^ i10;
                    viewOnClickListenerC58504 = this;
                    i18 = i9;
                    i22 = i3;
                    sArr6 = sArr;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i21 = i2;
                    textView3 = textView;
                case -1291074747:
                case 2058907197:
                    i14 = i20;
                    textView2 = textView3;
                    editText2 = editText4;
                    dialogInterfaceC02062 = dialogInterfaceC02063;
                    callback3 = callback4;
                    sArr4 = sArr7;
                    sArr5 = sArr6;
                    viewOnClickListenerC58503 = viewOnClickListenerC58504;
                    i22 = 30888;
                    int m69814 = C2105.m6981("᩸ۘ") ^ i17;
                    int i34 = ((m69814 ^ i16) * (-14977)) ^ 757654129;
                    i19 = m69814 ^ 1715682862;
                    callback4 = callback3;
                    sArr7 = sArr4;
                    editText4 = editText2;
                    textView3 = textView2;
                    i20 = i14;
                    i18 = i34;
                    viewOnClickListenerC58504 = viewOnClickListenerC58503;
                    sArr6 = sArr5;
                    dialogInterfaceC02063 = dialogInterfaceC02062;
                case -1176969705:
                case 1678976717:
                    i14 = i20;
                    textView2 = textView3;
                    editText2 = editText4;
                    dialogInterfaceC02062 = dialogInterfaceC02063;
                    callback3 = callback4;
                    sArr4 = sArr7;
                    sArr5 = sArr6;
                    viewOnClickListenerC58503 = viewOnClickListenerC58504;
                    i22 = 63492;
                    int m698142 = C2105.m6981("᩸ۘ") ^ i17;
                    int i342 = ((m698142 ^ i16) * (-14977)) ^ 757654129;
                    i19 = m698142 ^ 1715682862;
                    callback4 = callback3;
                    sArr7 = sArr4;
                    editText4 = editText2;
                    textView3 = textView2;
                    i20 = i14;
                    i18 = i342;
                    viewOnClickListenerC58504 = viewOnClickListenerC58503;
                    sArr6 = sArr5;
                    dialogInterfaceC02063 = dialogInterfaceC02062;
                case -1089042072:
                case 285776779:
                    i6 = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback = callback4;
                    sArr2 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC5850 = viewOnClickListenerC58504;
                    i23 = C2105.m6981(C3683.m11225(f17942, 312, 3, i3));
                    i24 = 2118455350;
                    if (C2958.f9394 < 0) {
                        m2566 = (i16 - C0630.m2566("ۗ۟")) * (-37);
                        i7 = ((m2566 ^ i17) * 8329) ^ (-1605516265);
                        i8 = 1042844924;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    }
                    m2566 = (i17 - C2105.m6981("۠ܰ")) * 41;
                    i7 = ((m2566 ^ i16) * 503) ^ (-1143347198);
                    i8 = -1315510330;
                    i19 = m2566 ^ i8;
                    callback4 = callback;
                    sArr7 = sArr2;
                    viewOnClickListenerC58504 = viewOnClickListenerC5850;
                    i22 = i3;
                    sArr6 = sArr;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i20 = i6;
                    i18 = i7;
                    textView3 = textView;
                case -999636669:
                case 1501404263:
                    final EditText editText6 = editText3;
                    i = i20;
                    str = str2;
                    final EditText editText7 = editText4;
                    editText = editText4;
                    int i35 = i21;
                    final DialogInterfaceC0206 dialogInterfaceC02064 = dialogInterfaceC02063;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i2 = i35;
                    i3 = i22;
                    final TextInputLayout textInputLayout3 = textInputLayout;
                    textView = textView3;
                    final TextInputLayout textInputLayout4 = textInputLayout2;
                    C2126.m7039(C1005.m3507(view, i29 ^ 2127851275), new View.OnClickListener() { // from class: l.ۛ֡ۡ
                        /* JADX WARN: Code restructure failed: missing block: B:12:0x003f, code lost:
                        
                            if (l.C1420.f5096 > 0) goto L48;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:16:0x0045, code lost:
                        
                            if (l.C2126.f7087 != false) goto L54;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:22:0x004b, code lost:
                        
                            if (l.RunnableC0588.f2309 >= 0) goto L54;
                         */
                        @Override // android.view.View.OnClickListener
                        /*
                            Code decompiled incorrectly, please refer to instructions dump.
                            To view partially-correct add '--show-bad-code' argument
                        */
                        public final void onClick(android.view.View r18) {
                            /*
                                Method dump skipped, instructions count: 612
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5705.onClick(android.view.View):void");
                        }

                        {
                            int i36 = 1661253134;
                            int i37 = C0714.f2697;
                            int i38 = C1128.f4106;
                            int m69815 = C2105.m6981("۬ۙ") ^ i38;
                            int i39 = ((m69815 ^ i37) * (-12491)) ^ 79639549;
                            int i40 = -389439150;
                            while (true) {
                                i36 = ((((i36 ^ i37) * 28553) >> 31) & i39) ^ (m69815 ^ i40);
                                switch (i36) {
                                    case -1663317185:
                                    case 1809696379:
                                        if (C3911.m11924() <= 0) {
                                            m69815 = (i37 - C0630.m2566("ۛܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i39 = ((m69815 ^ i38) * 21597) ^ (-87130123);
                                            i40 = 1560135982;
                                        } else {
                                            m69815 = (i38 - C0630.m2566("֨ۧ")) * 31;
                                            i39 = ((m69815 ^ i37) * 5029) ^ 2079754632;
                                            i40 = 929634250;
                                        }
                                    case -1628370962:
                                    case 2035068262:
                                        if (C3019.f9544 >= 0) {
                                            m69815 = (i37 - C0630.m2566("ۛܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i39 = ((m69815 ^ i38) * 21597) ^ (-87130123);
                                            i40 = 1560135982;
                                        } else {
                                            m69815 = (C0630.m2566("֨ۛ") + i38) * (-127);
                                            i39 = ((m69815 ^ i37) * (-9051)) ^ (-503204020);
                                            i40 = 1757468863;
                                        }
                                    case -1555745496:
                                    case 890938033:
                                        if (C7106.f21815 != 0) {
                                            m69815 = C0630.m2566("ۖܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-4885)) ^ 922842928;
                                            i40 = 946295358;
                                        } else {
                                            m69815 = (C0630.m2566("ۧ᩷") ^ i37) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                                            i39 = ((m69815 ^ i38) * 22065) ^ (-576328063);
                                            i40 = 135486563;
                                        }
                                    case -1383927575:
                                    case 973584386:
                                        if (C0237.f1507 != 0) {
                                            m69815 = (i37 - C0630.m2566("ۛܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i39 = ((m69815 ^ i38) * 21597) ^ (-87130123);
                                            i40 = 1560135982;
                                        } else {
                                            m69815 = (C2105.m6981("ۨ᩶") + i38) * 73;
                                            i39 = ((m69815 ^ i37) * (-27047)) ^ (-1727861909);
                                            i40 = 346455520;
                                        }
                                    case -1360717628:
                                    case -355679178:
                                        if (C2105.f7037 != 0) {
                                            m69815 = C0630.m2566("ܳܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-23167)) ^ (-1842989635);
                                            i40 = 133529065;
                                        } else {
                                            m69815 = (C2105.m6981("᩵᩶") + i37) * 49;
                                            i39 = ((m69815 ^ i38) * 14013) ^ (-1525608858);
                                            i40 = -1924322084;
                                        }
                                    case -1333059454:
                                    case 1437474650:
                                        if (C3911.f12484 >= 0) {
                                            m69815 = C2105.m6981("ܿ۠") ^ i37;
                                            i39 = ((m69815 ^ i38) * (-24415)) ^ 370051414;
                                            i40 = -283589620;
                                        } else {
                                            m69815 = (i38 - C0630.m2566("֡ۜ")) * 41;
                                            i39 = ((m69815 ^ i37) * 14593) ^ (-1757308282);
                                            i40 = -1401141723;
                                        }
                                    case -977674246:
                                    case 43351986:
                                        if (C1504.f5354) {
                                            m69815 = C2105.m6981("ܿ۠") ^ i37;
                                            i39 = ((m69815 ^ i38) * (-24415)) ^ 370051414;
                                            i40 = -283589620;
                                        } else {
                                            m69815 = (C2105.m6981("ܶۡ") + i38) * (-27);
                                            i39 = ((m69815 ^ i37) * 10769) ^ 422116326;
                                            i40 = -2061423712;
                                        }
                                    case -850739522:
                                    case -244026032:
                                        if (C3245.f10203 <= 0) {
                                            m69815 = C2105.m6981("ܿ۠") ^ i37;
                                            i39 = ((m69815 ^ i38) * (-24415)) ^ 370051414;
                                            i40 = -283589620;
                                        } else {
                                            m69815 = C0630.m2566("᩸ۜ") ^ i37;
                                            i39 = ((m69815 ^ i38) * (-11571)) ^ 1628224036;
                                            i40 = -1151958072;
                                        }
                                    case -704755764:
                                    case 2098984059:
                                        return;
                                    case -698285893:
                                    case 820219615:
                                        if (C4075.f12947 < 0) {
                                            m69815 = C0630.m2566("ܳܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-23167)) ^ (-1842989635);
                                            i40 = 133529065;
                                        } else {
                                            m69815 = (i37 - C0630.m2566("ۛܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i39 = ((m69815 ^ i38) * 21597) ^ (-87130123);
                                            i40 = 1560135982;
                                        }
                                    case -531792905:
                                    case 213509650:
                                        if (C0630.f2410 <= 0) {
                                            m69815 = (i37 - C0630.m2566("ۛܽ")) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                                            i39 = ((m69815 ^ i38) * 21597) ^ (-87130123);
                                            i40 = 1560135982;
                                        } else {
                                            m69815 = (C0630.m2566("֡᩺") + i37) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                                            i39 = ((m69815 ^ i38) * 61) ^ 1605385889;
                                            i40 = -274289357;
                                        }
                                    case -149373751:
                                    case 259103821:
                                        C0382.m1848();
                                        m69815 = C2105.m6981("ܿ۠") ^ i37;
                                        i39 = ((m69815 ^ i38) * (-24415)) ^ 370051414;
                                        i40 = -283589620;
                                    case 48913021:
                                    case 410779079:
                                        if (C21923.m49329()) {
                                            m69815 = C0630.m2566("ܳܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-23167)) ^ (-1842989635);
                                            i40 = 133529065;
                                        } else {
                                            m69815 = C2105.m6981("ܿ۠") ^ i37;
                                            i39 = ((m69815 ^ i38) * (-24415)) ^ 370051414;
                                            i40 = -283589620;
                                        }
                                    case 527224359:
                                    case 814729309:
                                        if (C1005.f3721) {
                                            m69815 = (C0630.m2566("ܺۘ") + i37) * (-97);
                                            i39 = ((m69815 ^ i38) * (-19969)) ^ 1057034596;
                                            i40 = -967710935;
                                        } else {
                                            m69815 = (C2105.m6981("᩸ۙ") ^ i37) * (-55);
                                            i39 = ((m69815 ^ i38) * (-23149)) ^ 1052405821;
                                            i40 = 178178481;
                                        }
                                    case 866931756:
                                    case 1731856365:
                                        if (C3019.f9544 < 0) {
                                            m69815 = C0630.m2566("ܳܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-23167)) ^ (-1842989635);
                                            i40 = 133529065;
                                        } else {
                                            m69815 = C0630.m2566("ۖܿ") ^ i38;
                                            i39 = ((m69815 ^ i37) * (-4885)) ^ 922842928;
                                            i40 = 946295358;
                                        }
                                    default:
                                        C1294.m4372();
                                        C1294.m4372();
                                        throw new RuntimeException();
                                }
                            }
                        }
                    });
                    m6981 = C2105.m6981("᩸ܿ") ^ i17;
                    i4 = ((m6981 ^ i16) * (-6133)) ^ (-2045484828);
                    i5 = -2044778182;
                    i15 = m6981 ^ i5;
                    viewOnClickListenerC58504 = this;
                    i22 = i3;
                    sArr6 = sArr;
                    str2 = str;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i21 = i2;
                    textView3 = textView;
                    i19 = i15;
                    i18 = i4;
                case -985796448:
                case 2133839488:
                    if (C0964.f3626 == 0) {
                        i = i20;
                        i2 = i21;
                        textView = textView3;
                        editText = editText4;
                        dialogInterfaceC0206 = dialogInterfaceC02063;
                        sArr = sArr6;
                        i3 = i22;
                        m25662 = (C2105.m6981("ۗۤ") ^ i17) * 31;
                        i9 = ((m25662 ^ i16) * 26955) ^ (-1764180643);
                        i10 = -337310802;
                        i19 = m25662 ^ i10;
                        viewOnClickListenerC58504 = this;
                        i18 = i9;
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i21 = i2;
                        textView3 = textView;
                    }
                    i = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback2 = callback4;
                    sArr3 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC58502 = viewOnClickListenerC58504;
                    int m6981322 = C2105.m6981("ۙ۟") ^ i17;
                    i19 = m6981322 ^ (-882562392);
                    callback4 = callback2;
                    sArr7 = sArr3;
                    viewOnClickListenerC58504 = viewOnClickListenerC58502;
                    i18 = ((m6981322 ^ i16) * 1277) ^ (-1206471879);
                    i22 = i3;
                    sArr6 = sArr;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    textView3 = textView;
                case -904140985:
                case -521702286:
                    i6 = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback = callback4;
                    sArr2 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC5850 = viewOnClickListenerC58504;
                    short s2 = f17942[311];
                    int i36 = s2 + 19905;
                    if (C0050.f910 >= 0) {
                        s = s2;
                        i30 = i36;
                        m2566 = C2105.m6981("ܺ᩻") ^ i16;
                        i7 = ((m2566 ^ i17) * 29529) ^ 1906668225;
                        i8 = -1793042750;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    } else {
                        int m25668 = (i17 - C0630.m2566("۠ۨ")) * (-19);
                        i = i6;
                        i18 = ((m25668 ^ i16) * (-22125)) ^ (-1313282056);
                        i19 = m25668 ^ (-2067698345);
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        s = s2;
                        i30 = i36;
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        textView3 = textView;
                    }
                case -604198392:
                case -144827876:
                    C0050.m940();
                    if (C4263.f13799 <= 0) {
                        i6 = i20;
                        textView = textView3;
                        editText = editText4;
                        dialogInterfaceC0206 = dialogInterfaceC02063;
                        callback = callback4;
                        sArr2 = sArr7;
                        sArr = sArr6;
                        i3 = i22;
                        viewOnClickListenerC5850 = viewOnClickListenerC58504;
                        m2566 = (i17 - C2105.m6981("۠ܰ")) * 41;
                        i7 = ((m2566 ^ i16) * 503) ^ (-1143347198);
                        i8 = -1315510330;
                        i19 = m2566 ^ i8;
                        callback4 = callback;
                        sArr7 = sArr2;
                        viewOnClickListenerC58504 = viewOnClickListenerC5850;
                        i22 = i3;
                        sArr6 = sArr;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        i20 = i6;
                        i18 = i7;
                        textView3 = textView;
                    }
                    i = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback2 = callback4;
                    sArr3 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC58502 = viewOnClickListenerC58504;
                    int m69813222 = C2105.m6981("ۙ۟") ^ i17;
                    i19 = m69813222 ^ (-882562392);
                    callback4 = callback2;
                    sArr7 = sArr3;
                    viewOnClickListenerC58504 = viewOnClickListenerC58502;
                    i18 = ((m69813222 ^ i16) * 1277) ^ (-1206471879);
                    i22 = i3;
                    sArr6 = sArr;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    textView3 = textView;
                case -368641476:
                case 525351741:
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback2 = callback4;
                    sArr3 = sArr7;
                    i3 = i22;
                    viewOnClickListenerC58502 = this;
                    view = C3019.m9259(viewOnClickListenerC58502, i23 ^ i24);
                    short[] sArr9 = f17942;
                    i21 = 315;
                    if (C4263.f13799 <= 0) {
                        sArr = sArr9;
                        i = 3;
                        int m698132222 = C2105.m6981("ۙ۟") ^ i17;
                        i19 = m698132222 ^ (-882562392);
                        callback4 = callback2;
                        sArr7 = sArr3;
                        viewOnClickListenerC58504 = viewOnClickListenerC58502;
                        i18 = ((m698132222 ^ i16) * 1277) ^ (-1206471879);
                        i22 = i3;
                        sArr6 = sArr;
                        i20 = i;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        textView3 = textView;
                    } else {
                        int m69815 = (C2105.m6981("ᩴ᩻") + i17) * 87;
                        int i37 = ((m69815 ^ i16) * 31693) ^ 1846675934;
                        i19 = m69815 ^ (-1719070720);
                        callback4 = callback2;
                        sArr7 = sArr3;
                        i22 = i3;
                        editText4 = editText;
                        dialogInterfaceC02063 = dialogInterfaceC0206;
                        textView3 = textView;
                        i20 = 3;
                        sArr6 = sArr9;
                        i18 = i37;
                        viewOnClickListenerC58504 = viewOnClickListenerC58502;
                    }
                case -14510874:
                case 138438264:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    str = str2;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    i27 = C0630.m2566(C4159.m12578(f17942, 341, 3, i3));
                    i28 = 2130545957;
                    m6981 = (C0630.m2566("ۙۧ") + i17) * (-77);
                    i4 = ((m6981 ^ i16) * (-12683)) ^ 638560126;
                    i5 = 590570602;
                    i15 = m6981 ^ i5;
                    viewOnClickListenerC58504 = this;
                    i22 = i3;
                    sArr6 = sArr;
                    str2 = str;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i21 = i2;
                    textView3 = textView;
                    i19 = i15;
                    i18 = i4;
                case 216569373:
                case 540342123:
                    RunnableC3474.m10630();
                    i = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback2 = callback4;
                    sArr3 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC58502 = viewOnClickListenerC58504;
                    int m6981322222 = C2105.m6981("ۙ۟") ^ i17;
                    i19 = m6981322222 ^ (-882562392);
                    callback4 = callback2;
                    sArr7 = sArr3;
                    viewOnClickListenerC58504 = viewOnClickListenerC58502;
                    i18 = ((m6981322222 ^ i16) * 1277) ^ (-1206471879);
                    i22 = i3;
                    sArr6 = sArr;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    textView3 = textView;
                case 248456883:
                case 379619383:
                    i = i20;
                    i2 = i21;
                    textView = textView3;
                    str = str2;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    sArr = sArr6;
                    i3 = i22;
                    i26 = C0630.m2566(C1420.m4902(f17942, 338, 3, i3));
                    m6981 = (C2105.m6981("ܶۚ") + i16) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                    i4 = ((m6981 ^ i17) * (-15513)) ^ 445987492;
                    i5 = -1920545833;
                    i15 = m6981 ^ i5;
                    viewOnClickListenerC58504 = this;
                    i22 = i3;
                    sArr6 = sArr;
                    str2 = str;
                    i20 = i;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i21 = i2;
                    textView3 = textView;
                    i19 = i15;
                    i18 = i4;
                case 275438802:
                case 1140867275:
                    int i38 = i20;
                    EditText editText8 = editText4;
                    DialogInterfaceC0206 dialogInterfaceC02065 = dialogInterfaceC02063;
                    short[] sArr10 = sArr6;
                    int i39 = i22;
                    callback4 = C11340.m28028(view, C2105.m6981(C0422.m1955(sArr10, i21, i38, i39)) ^ 2121388998);
                    sArr7 = f17942;
                    int m25669 = (i16 - C0630.m2566("᩸ۧ")) * 55;
                    i19 = m25669 ^ (-1191338565);
                    viewOnClickListenerC58504 = this;
                    i22 = i39;
                    sArr6 = sArr10;
                    editText4 = editText8;
                    dialogInterfaceC02063 = dialogInterfaceC02065;
                    textView3 = textView3;
                    i20 = i38;
                    i18 = ((m25669 ^ i17) * 26583) ^ 685509651;
                default:
                    i6 = i20;
                    textView = textView3;
                    editText = editText4;
                    dialogInterfaceC0206 = dialogInterfaceC02063;
                    callback = callback4;
                    sArr2 = sArr7;
                    sArr = sArr6;
                    i3 = i22;
                    viewOnClickListenerC5850 = viewOnClickListenerC58504;
                    int i40 = (s * s) + 396209025;
                    if ((i40 + i40) - (i30 * i30) < 0) {
                        m2566 = C2105.m6981("ܳ᩻") ^ i16;
                        i7 = ((m2566 ^ i17) * (-26173)) ^ 141510312;
                        i8 = -788036531;
                    } else {
                        m2566 = (C2105.m6981("֫ܿ") ^ i16) * 91;
                        i7 = ((m2566 ^ i17) * 30811) ^ 313621534;
                        i8 = 617145097;
                    }
                    i19 = m2566 ^ i8;
                    callback4 = callback;
                    sArr7 = sArr2;
                    viewOnClickListenerC58504 = viewOnClickListenerC5850;
                    i22 = i3;
                    sArr6 = sArr;
                    editText4 = editText;
                    dialogInterfaceC02063 = dialogInterfaceC0206;
                    i20 = i6;
                    i18 = i7;
                    textView3 = textView;
            }
            return;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:28:0x0095, code lost:
    
        if (l.C4075.f12947 < 0) goto L13;
     */
    /* JADX WARN: Code restructure failed: missing block: B:29:0x0097, code lost:
    
        r34 = r3;
        r36 = r5;
        r32 = r8;
        r33 = r9;
        r35 = r11;
        r11 = r4;
        r13 = r13;
     */
    /* JADX WARN: Code restructure failed: missing block: B:35:0x00a9, code lost:
    
        if (l.RunnableC1108.f4040 == false) goto L18;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    private final void m16386(boolean r40) {
        /*
            Method dump skipped, instructions count: 1594
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16386(boolean):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:54:0x007f, code lost:
    
        if (l.C4075.m12263() > 0) goto L10;
     */
    /* JADX WARN: Code restructure failed: missing block: B:59:0x0099, code lost:
    
        if (l.C0237.f1507 == 0) goto L17;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16385(l.C13136 r29, l.ViewOnClickListenerC5850 r30, l.C23881 r31) {
        /*
            Method dump skipped, instructions count: 1270
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16385(l.۬۬ܿ, l.ۛۚۡ, l.᩻ᩴۡ):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x0074, code lost:
    
        if (l.C3746.f11829 <= 0) goto L70;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x007d, code lost:
    
        if (l.C5695.f17556 >= 0) goto L70;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x0086, code lost:
    
        if (l.C3663.f11553 == false) goto L70;
     */
    /* renamed from: ᩺, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    private final void m16407() {
        /*
            Method dump skipped, instructions count: 1016
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16407():void");
    }

    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    public static void m16403(ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        viewOnClickListenerC5850.m16407();
    }

    /* JADX WARN: Code restructure failed: missing block: B:21:0x0070, code lost:
    
        if (l.C3019.m9255() > 0) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:22:0x0072, code lost:
    
        r21 = r5;
        r24 = r9;
     */
    /* JADX WARN: Code restructure failed: missing block: B:31:0x007e, code lost:
    
        if (l.C0964.f3626 != 0) goto L9;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static boolean m16387(com.google.android.material.textfield.TextInputLayout r27, boolean r28) {
        /*
            Method dump skipped, instructions count: 1288
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16387(com.google.android.material.textfield.TextInputLayout, boolean):boolean");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m16384(C13136 c13136, ViewOnClickListenerC5850 viewOnClickListenerC5850, View view, EditText editText, EditText editText2, TextInputLayout textInputLayout, C23881 c23881) {
        int i;
        int i2;
        int m2566;
        int i3;
        int i4;
        int m6981;
        int i5;
        int i6;
        C23881 c238812 = c23881;
        int i7 = 0;
        int i8 = 0;
        int i9 = 0;
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i10 = 0;
        int i11 = 0;
        int i12 = 1333831528;
        int i13 = ServiceConnectionC3453.f10921;
        int i14 = C4616.f14690;
        int m69812 = C2105.m6981("ܺۘ") ^ i14;
        int i15 = ((m69812 ^ i13) * 15659) ^ 1237001316;
        int i16 = -576153478;
        while (true) {
            int i17 = m69812 ^ i16;
            while (true) {
                i12 = ((((i12 ^ i13) * 12241) >> 31) & i15) ^ i17;
                switch (i12) {
                    case -1998705457:
                    case -152750808:
                        int i18 = i7;
                        if (C22628.m50604(c23881) == 1100) {
                            m6981 = (C0630.m2566("᩷᩶") ^ i14) * (-25);
                            i5 = ((m6981 ^ i13) * (-11885)) ^ (-584390392);
                            i6 = 972125977;
                        } else {
                            m6981 = (C2105.m6981("ۨۨ") + i14) * (-15);
                            i5 = ((m6981 ^ i13) * 11389) ^ 1128717014;
                            i6 = -1413147197;
                        }
                        i17 = m6981 ^ i6;
                        i15 = i5;
                        i7 = i18;
                    case -1996506445:
                    case 1140684796:
                        viewOnClickListenerC5850.m16407();
                        i7 = C0630.m2566(C4117.m12355(f17942, 88, 3, i11));
                        if (C1294.m4372() <= 0) {
                            i8 = 2101019882;
                            int m25662 = (C0630.m2566("᩵ܶ") + i14) * (-67);
                            i15 = ((m25662 ^ i13) * 3765) ^ 1252512394;
                            i17 = m25662 ^ (-1314483579);
                            c238812 = c23881;
                        } else {
                            int m25663 = C0630.m2566("ۖۘ") ^ i13;
                            i15 = ((m25663 ^ i14) * (-21781)) ^ 318786717;
                            i17 = m25663 ^ (-371117022);
                            i8 = 2101019882;
                        }
                    case -1853606823:
                    case 1659177084:
                        i = i7;
                        i2 = i8;
                        i11 = 17916;
                        m2566 = C2105.m6981("ܳۧ") ^ i13;
                        i3 = ((m2566 ^ i14) * 4893) ^ (-2105713438);
                        i4 = 919045040;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -1778236595:
                    case -848376010:
                        C2958.m9034();
                        C22628.m50615();
                        break;
                    case -1483761891:
                    case 1127561672:
                        i = i7;
                        i2 = i8;
                        s = sArr[c];
                        i10 = (s * 2) + 1;
                        if (C1294.f4556 < 0) {
                            m2566 = C0630.m2566("֫᩺") ^ i13;
                            i3 = ((m2566 ^ i14) * 23957) ^ 1505483212;
                            i4 = -640247840;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                        m2566 = C0630.m2566("᩵ۛ") ^ i13;
                        i3 = ((m2566 ^ i14) * 31647) ^ 36998541;
                        i4 = 687246579;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -1315944317:
                    case 1784331224:
                        if (RunnableC0588.f2309 < 0) {
                            i = i7;
                            i2 = i8;
                            m2566 = C0630.m2566("᩵ۛ") ^ i13;
                            i3 = ((m2566 ^ i14) * 31647) ^ 36998541;
                            i4 = 687246579;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                        i = i7;
                        i2 = i8;
                        m2566 = C2105.m6981("ۧ᩸") ^ i14;
                        i3 = ((m2566 ^ i13) * (-9707)) ^ (-737112644);
                        i4 = 1730738508;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -1224494577:
                    case 1913308077:
                        i = i7;
                        i2 = i8;
                        if (C3663.f11553) {
                            i7 = i;
                            i8 = i2;
                            int m256622 = (C0630.m2566("᩵ܶ") + i14) * (-67);
                            i15 = ((m256622 ^ i13) * 3765) ^ 1252512394;
                            i17 = m256622 ^ (-1314483579);
                            c238812 = c23881;
                        } else {
                            m2566 = C0630.m2566("᩹ۖ") ^ i14;
                            i3 = ((m2566 ^ i13) * 16379) ^ 1739813805;
                            i4 = -578955964;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                    case -1171506540:
                    case 1100208125:
                        C1916.m6308();
                        break;
                    case -1100425805:
                    case -83601589:
                        i = i7;
                        i2 = i8;
                        if (ServiceConnectionC3453.f10921 < 0) {
                            m2566 = C2105.m6981("ܺܶ") ^ i14;
                            i3 = ((m2566 ^ i13) * (-9481)) ^ (-419613178);
                            i4 = -850143315;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                        m2566 = C0630.m2566("ܺۨ") ^ i13;
                        i3 = ((m2566 ^ i14) * (-22849)) ^ (-1320922210);
                        i4 = -1244594686;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -1070832136:
                    case 891398335:
                        i = i7;
                        i2 = i8;
                        int i19 = s + 1;
                        if ((i19 * i19) - i10 >= 0) {
                            m2566 = (C0630.m2566("ܺۙ") + i13) * 69;
                            i3 = ((m2566 ^ i14) * (-9475)) ^ 835203977;
                            i4 = -1626457088;
                        } else {
                            m2566 = (i14 - C2105.m6981("ܿۡ")) * 93;
                            i3 = ((m2566 ^ i13) * (-30407)) ^ (-1250632477);
                            i4 = 1930353146;
                        }
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -1006484859:
                    case 1645485058:
                        C0237.m1481();
                        if (!C1711.f5919) {
                            break;
                        }
                        i = i7;
                        i2 = i8;
                        m2566 = C0630.m2566("ܺۨ") ^ i13;
                        i3 = ((m2566 ^ i14) * (-22849)) ^ (-1320922210);
                        i4 = -1244594686;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                        break;
                    case -995538109:
                    case -337056175:
                        i = i7;
                        i2 = i8;
                        sArr = f17942;
                        c = 'O';
                        if (RunnableC0588.f2309 >= 0) {
                            i7 = i;
                            i8 = i2;
                            int m2566222 = (C0630.m2566("᩵ܶ") + i14) * (-67);
                            i15 = ((m2566222 ^ i13) * 3765) ^ 1252512394;
                            i17 = m2566222 ^ (-1314483579);
                            c238812 = c23881;
                        } else {
                            m2566 = C0630.m2566("۬۫") ^ i14;
                            i3 = ((m2566 ^ i13) * (-29659)) ^ (-1175228098);
                            i4 = -2127260510;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                    case -977552478:
                    case -634351404:
                        i = i7;
                        i2 = i8;
                        RunnableC0588.m2430(c238812, C1773.m5917(f17942, 80, 8, i11));
                        C3911.m11920(c13136);
                        if (C0483.m2131(c23881)) {
                            m2566 = (C0630.m2566("ۛܳ") ^ i14) * (-115);
                            i3 = ((m2566 ^ i13) * (-3177)) ^ (-1084323305);
                            i4 = 285421995;
                        } else {
                            m2566 = (C0630.m2566("᩶ۗ") + i14) * (-117);
                            i3 = ((m2566 ^ i13) * 14507) ^ (-1629745618);
                            i4 = -1135863549;
                        }
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -756912543:
                    case 519348496:
                        i = i7;
                        i2 = i8;
                        if (C1005.f3721) {
                            m2566 = C2105.m6981("ۢ۠") ^ i13;
                            i3 = ((m2566 ^ i14) * (-17259)) ^ 140959582;
                            i4 = 1386216701;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                        m2566 = C2105.m6981("ۧ᩸") ^ i14;
                        i3 = ((m2566 ^ i13) * (-9707)) ^ (-737112644);
                        i4 = 1730738508;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -561789795:
                    case 1075666251:
                        i = i7;
                        i2 = i8;
                        i11 = 36583;
                        m2566 = C2105.m6981("ܳۧ") ^ i13;
                        i3 = ((m2566 ^ i14) * 4893) ^ (-2105713438);
                        i4 = 919045040;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case -515182525:
                    case 235445216:
                        RunnableC3474.m10621(textInputLayout, C2105.m6981(C3746.m11357(f17942, 94, 3, i11)) ^ 2101404028);
                        break;
                    case -348733481:
                    case 1663686031:
                        C3683.m11220(AbstractC2021.m6563(c238812, 2123877697 ^ i9));
                        break;
                    case -177130630:
                    case -82599836:
                        i = i7;
                        i2 = i8;
                        if (C2167.f7158 < 0) {
                            int m25664 = (C0630.m2566("ۛ᩵") + i13) * 27;
                            i17 = m25664 ^ 1229169953;
                            i15 = ((m25664 ^ i14) * 28843) ^ (-578719656);
                            i7 = i;
                            i8 = i2;
                            c238812 = c23881;
                        }
                        i7 = i;
                        i8 = i2;
                        int m25662222 = (C0630.m2566("᩵ܶ") + i14) * (-67);
                        i15 = ((m25662222 ^ i13) * 3765) ^ 1252512394;
                        i17 = m25662222 ^ (-1314483579);
                        c238812 = c23881;
                    case -70962951:
                    case 1288808619:
                        i = i7;
                        i2 = i8;
                        if (C3019.f9544 < 0) {
                            m2566 = C2105.m6981("ۢܶ") ^ i14;
                            i3 = ((m2566 ^ i13) * 20821) ^ (-461042222);
                            i4 = 862431089;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                        m2566 = C0630.m2566("ܺۨ") ^ i13;
                        i3 = ((m2566 ^ i14) * (-22849)) ^ (-1320922210);
                        i4 = -1244594686;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                    case 125408032:
                    case 1495788956:
                        ViewOnClickListenerC1958.m6429();
                        if (ViewOnClickListenerC1958.f6529 <= 0) {
                            break;
                        }
                        i = i7;
                        i2 = i8;
                        m2566 = C2105.m6981("ۧ᩸") ^ i14;
                        i3 = ((m2566 ^ i13) * (-9707)) ^ (-737112644);
                        i4 = 1730738508;
                        i17 = m2566 ^ i4;
                        i15 = i3;
                        i7 = i;
                        i8 = i2;
                        break;
                    case 288745987:
                    case 1697990437:
                        i9 = C0630.m2566(RunnableC1937.m6385(f17942, 91, 3, i11));
                        if (C5695.f17556 >= 0) {
                            i = i7;
                            i2 = i8;
                            m2566 = C2105.m6981("ۧ᩸") ^ i14;
                            i3 = ((m2566 ^ i13) * (-9707)) ^ (-737112644);
                            i4 = 1730738508;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        } else {
                            int m69813 = (C2105.m6981("ۘ֡") + i13) * (-75);
                            i17 = m69813 ^ 2016277914;
                            i15 = ((m69813 ^ i14) * 15313) ^ (-1035293627);
                        }
                    case 366781733:
                    case 1956239875:
                        i = i7;
                        i2 = i8;
                        if (ServiceConnectionC3453.f10921 >= 0) {
                            i7 = i;
                            i8 = i2;
                            int m256622222 = (C0630.m2566("᩵ܶ") + i14) * (-67);
                            i15 = ((m256622222 ^ i13) * 3765) ^ 1252512394;
                            i17 = m256622222 ^ (-1314483579);
                            c238812 = c23881;
                        } else {
                            m2566 = C0630.m2566("ۨ֫") ^ i13;
                            i3 = ((m2566 ^ i14) * 12949) ^ 162047902;
                            i4 = -234647645;
                            i17 = m2566 ^ i4;
                            i15 = i3;
                            i7 = i;
                            i8 = i2;
                        }
                    default:
                        C21923.m49330(C11340.m28028(view, i7 ^ i8), false);
                        C21923.m49330(editText, false);
                        C0798.m3010(editText2);
                        viewOnClickListenerC5850.m16389();
                        break;
                }
                return;
            }
            m69812 = (i13 - C2105.m6981("ܿ᩸")) * (-39);
            i15 = ((m69812 ^ i14) * (-13665)) ^ (-293974374);
            i16 = 724636553;
        }
    }

    @Override // android.view.View.OnClickListener
    public final void onClick(View view) {
        int i;
        int i2;
        C19258 c19258;
        int i3;
        int i4;
        int i5;
        short[] sArr;
        SpannableString spannableString;
        View view2;
        int i6;
        int i7;
        boolean z;
        int i8;
        int m2566;
        int i9;
        int i10;
        boolean z2;
        int i11;
        int i12;
        View view3;
        TextInputLayout textInputLayout;
        int i13;
        EditText editText;
        int i14;
        SpannableString spannableString2;
        int i15;
        String str;
        int i16;
        View view4;
        int i17;
        short[] sArr2;
        int i18;
        int i19;
        int i20;
        TextInputLayout textInputLayout2;
        View view5;
        String str2;
        EditText editText2;
        int i21;
        int m6981;
        int i22;
        int i23;
        boolean z3;
        int i24;
        String str3;
        int i25;
        int i26;
        EditText editText3;
        int i27;
        SpannableString spannableString3;
        int i28;
        String str4;
        int i29;
        View view6;
        int i30;
        short[] sArr3;
        int i31;
        int i32;
        int i33;
        TextInputLayout textInputLayout3;
        View view7;
        int i34;
        TextInputLayout textInputLayout4;
        View view8;
        int i35;
        boolean z4;
        int m69812;
        int i36;
        int i37;
        int i38;
        int i39;
        int i40;
        EditText editText4;
        int i41;
        SpannableString spannableString4;
        int i42;
        int i43;
        short[] sArr4;
        int i44;
        String str5;
        int i45;
        TextInputLayout textInputLayout5;
        View view9;
        int m25662;
        int i46;
        int i47;
        boolean z5;
        int i48;
        int i49;
        int i50;
        EditText editText5;
        int i51;
        SpannableString spannableString5;
        int i52;
        int i53;
        int i54;
        short[] sArr5;
        boolean z6;
        boolean z7;
        boolean z8;
        boolean z9;
        int i55;
        int i56;
        int i57;
        int i58;
        boolean z10;
        int i59;
        int m69813;
        int i60;
        int i61;
        int i62;
        boolean z11;
        int i63;
        int m69814;
        int i64;
        int i65;
        int m25663;
        int i66;
        boolean z12;
        boolean z13;
        int m69815;
        int i67;
        boolean z14;
        int i68;
        int m69816;
        int i69;
        int i70;
        int m69817;
        int i71;
        boolean z15;
        boolean z16;
        EditText editText6 = null;
        int i72 = 1584964077;
        int i73 = C1047.f3863;
        int i74 = C1294.f4556;
        int m25664 = (i73 - C0630.m2566("᩵ۗ")) * (-55);
        int i75 = ((m25664 ^ i74) * (-26429)) ^ 832008715;
        int i76 = m25664 ^ (-1128673359);
        TextInputLayout textInputLayout6 = null;
        EditText editText7 = null;
        View view10 = null;
        TextInputLayout textInputLayout7 = null;
        View view11 = null;
        TextInputLayout textInputLayout8 = null;
        C19258 c192582 = null;
        String str6 = null;
        Object obj = null;
        SpannableString spannableString6 = null;
        C19258 c192583 = null;
        short[] sArr6 = null;
        int i77 = 0;
        int i78 = 0;
        int i79 = 0;
        int i80 = 0;
        int i81 = 0;
        int i82 = 0;
        int i83 = 0;
        int i84 = 0;
        int i85 = 0;
        int i86 = 0;
        int i87 = 0;
        int i88 = 0;
        int i89 = 0;
        int i90 = 0;
        int i91 = 0;
        int i92 = 0;
        int i93 = 0;
        boolean z17 = false;
        String str7 = null;
        View view12 = null;
        EditText editText8 = null;
        String[] strArr = null;
        int i94 = 0;
        int i95 = 0;
        TextInputLayout textInputLayout9 = null;
        int i96 = 0;
        while (true) {
            i72 = i76 ^ (i75 & (((i72 ^ i74) * 2397) >> 31));
            switch (i72) {
                case -2137502197:
                case -409928085:
                    i68 = i96;
                    spannableString6.setSpan(new AbsoluteSizeSpan(i96), i79 - 3, i79, 17);
                    m69816 = C0630.m2566("֨ۚ") ^ i74;
                    i69 = ((m69816 ^ i73) * 22073) ^ (-1707477888);
                    i70 = -1842059730;
                    int i97 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i97;
                    z17 = z17;
                    i75 = i69;
                case -2093957421:
                case 1380141679:
                    View view13 = view10;
                    final EditText editText9 = (EditText) C11340.m28028(view13, i85);
                    C0287.m1629(textInputLayout7);
                    C19258 m5912 = C1773.m5912(this);
                    C0798.m3013(m5912, view13);
                    final DialogInterfaceC0206 m11213 = C3683.m11213(m5912);
                    C4925.m14329(editText9);
                    final TextInputLayout textInputLayout10 = textInputLayout7;
                    C2126.m7039(C11340.m28028(view13, i87), new View.OnClickListener() { // from class: l.ܶ֡ۡ
                        @Override // android.view.View.OnClickListener
                        public final void onClick(View view14) {
                            EditText editText10 = null;
                            DialogInterfaceC0206 dialogInterfaceC0206 = null;
                            int i98 = -1371093466;
                            int i99 = C3432.f10845;
                            int i100 = C3683.f11629;
                            int m69818 = (C2105.m6981("ۛ۬") + i99) * 31;
                            int i101 = ((m69818 ^ i100) * 6669) ^ (-1436818596);
                            int i102 = -852860225;
                            while (true) {
                                i98 = ((((i98 ^ i100) * (-19283)) >> 31) & i101) ^ (m69818 ^ i102);
                                switch (i98) {
                                    case -2034219622:
                                    case 1410874188:
                                        C1504.m5179();
                                        if (C21923.f70183 == 0) {
                                            m69818 = C2105.m6981("ۧۤ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-4085)) ^ (-1083522084);
                                            i102 = -191450208;
                                        } else {
                                            m69818 = C2105.m6981("۟۬") ^ i100;
                                            i101 = ((m69818 ^ i99) * 30295) ^ 2136324462;
                                            i102 = -1400029562;
                                        }
                                    case -1869696317:
                                    case -1861809016:
                                        if (C2105.f7037 != 0) {
                                            m69818 = (C2105.m6981("ܽۤ") + i99) * (-77);
                                            i101 = ((m69818 ^ i100) * 19631) ^ (-1332721338);
                                            i102 = 240861447;
                                        } else {
                                            m69818 = (C0630.m2566("ۨ۫") ^ i100) * (-65);
                                            i101 = ((m69818 ^ i99) * (-31807)) ^ 2020004148;
                                            i102 = 240683496;
                                        }
                                    case -1857239422:
                                    case -1818930407:
                                        ViewOnClickListenerC5850.m16402(editText10, dialogInterfaceC0206, this, textInputLayout10);
                                        break;
                                    case -1709959098:
                                    case 837864687:
                                        if (C2958.f9394 >= 0) {
                                            m69818 = C2105.m6981("۟۬") ^ i100;
                                            i101 = ((m69818 ^ i99) * 30295) ^ 2136324462;
                                            i102 = -1400029562;
                                        } else {
                                            m69818 = (C2105.m6981("ܽۤ") + i99) * (-77);
                                            i101 = ((m69818 ^ i100) * 19631) ^ (-1332721338);
                                            i102 = 240861447;
                                        }
                                    case -1672020627:
                                    case -1460169261:
                                        if (C1773.f6144 <= 0) {
                                            m69818 = C2105.m6981("ۧۤ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-4085)) ^ (-1083522084);
                                            i102 = -191450208;
                                        } else {
                                            m69818 = C0630.m2566("۠۬") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-20025)) ^ 486864668;
                                            i102 = -1098824358;
                                        }
                                    case -873820429:
                                    case -781007772:
                                        RunnableC3474.m10630();
                                        C0483.m2121();
                                        m69818 = C2105.m6981("ۧۤ") ^ i100;
                                        i101 = ((m69818 ^ i99) * (-4085)) ^ (-1083522084);
                                        i102 = -191450208;
                                    case -777957224:
                                    case 1241929915:
                                        if (C7106.f21815 != 0) {
                                            m69818 = (C2105.m6981("ܽۤ") + i99) * (-77);
                                            i101 = ((m69818 ^ i100) * 19631) ^ (-1332721338);
                                            i102 = 240861447;
                                        } else {
                                            m69818 = C0630.m2566("᩹۬") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-12501)) ^ 1458078971;
                                            i102 = 379606029;
                                        }
                                    case -613691902:
                                    case 714034300:
                                        editText10 = editText9;
                                        if (C2167.f7158 >= 0) {
                                            m69818 = (C2105.m6981("ܽۤ") + i99) * (-77);
                                            i101 = ((m69818 ^ i100) * 19631) ^ (-1332721338);
                                            i102 = 240861447;
                                        } else {
                                            m69818 = (C2105.m6981("᩻ۚ") + i100) * (-123);
                                            i101 = ((m69818 ^ i99) * (-6761)) ^ 730293956;
                                            i102 = -1951709495;
                                        }
                                    case -526022150:
                                    case -500912525:
                                        if (C4075.f12947 >= 0) {
                                            m69818 = C2105.m6981("ۧۤ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-4085)) ^ (-1083522084);
                                            i102 = -191450208;
                                        } else {
                                            m69818 = C0630.m2566("֫ۢ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 17267) ^ (-1958086237);
                                            i102 = 10772066;
                                        }
                                    case -404148614:
                                    case 1395870068:
                                        if (C1711.f5919) {
                                            m69818 = C2105.m6981("۟۬") ^ i100;
                                            i101 = ((m69818 ^ i99) * 30295) ^ 2136324462;
                                            i102 = -1400029562;
                                        } else {
                                            m69818 = (C0630.m2566("۬᩻") ^ i99) * (-109);
                                            i101 = ((m69818 ^ i100) * 11175) ^ 1222224902;
                                            i102 = 1321474230;
                                        }
                                    case 1158800:
                                    case 596241988:
                                        C4616.m13552();
                                        C1294.m4372();
                                        break;
                                    case 25140998:
                                    case 549191224:
                                        if (C7811.m20844() != 0) {
                                            m69818 = C2105.m6981("᩹ۜ") ^ i100;
                                            i101 = ((m69818 ^ i99) * 19301) ^ (-1767115209);
                                            i102 = -982239615;
                                        } else {
                                            m69818 = (i99 - C2105.m6981("ۧܳ")) * (-83);
                                            i101 = ((m69818 ^ i100) * 10989) ^ (-316058810);
                                            i102 = -635398769;
                                        }
                                    case 177428629:
                                    case 1004373309:
                                        dialogInterfaceC0206 = m11213;
                                        if (C3019.f9544 >= 0) {
                                            m69818 = C2105.m6981("᩹ۜ") ^ i100;
                                            i101 = ((m69818 ^ i99) * 19301) ^ (-1767115209);
                                            i102 = -982239615;
                                        } else {
                                            m69818 = C2105.m6981("ۙ᩹") ^ i99;
                                            i101 = ((m69818 ^ i100) * (-7357)) ^ 2007718356;
                                            i102 = 609776490;
                                        }
                                    case 239864176:
                                    case 1477059718:
                                        if (C4075.f12947 >= 0) {
                                            m69818 = C2105.m6981("ۧۤ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-4085)) ^ (-1083522084);
                                            i102 = -191450208;
                                        } else {
                                            m69818 = C2105.m6981("ۤۙ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 1647) ^ (-132412217);
                                            i102 = 2130577838;
                                        }
                                    case 1265035522:
                                    case 2094245939:
                                        if (C1504.f5354) {
                                            m69818 = C2105.m6981("ۤۙ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 1647) ^ (-132412217);
                                            i102 = 2130577838;
                                        } else {
                                            m69818 = (C0630.m2566("ܰ᩺") + i99) * (-61);
                                            i101 = ((m69818 ^ i100) * 23149) ^ 1153525345;
                                            i102 = -211440470;
                                        }
                                    default:
                                        if (C21923.m49329()) {
                                            m69818 = (C2105.m6981("ܽۤ") + i99) * (-77);
                                            i101 = ((m69818 ^ i100) * 19631) ^ (-1332721338);
                                            i102 = 240861447;
                                        } else {
                                            m69818 = (i100 - C0630.m2566("ܽ֡")) * (-93);
                                            i101 = ((m69818 ^ i99) * (-31951)) ^ 1456850738;
                                            i102 = 1617229145;
                                        }
                                }
                                return;
                            }
                        }

                        {
                            int i98 = -1455457428;
                            int i99 = C0422.f1886;
                            int i100 = C22628.f73083;
                            int m69818 = C2105.m6981("ۖۡ") ^ i99;
                            int i101 = ((m69818 ^ i100) * (-16737)) ^ 869972380;
                            int i102 = -743641161;
                            while (true) {
                                i98 = ((((i98 ^ i100) * 24793) >> 31) & i101) ^ (m69818 ^ i102);
                                switch (i98) {
                                    case -2138620829:
                                    case 1178041629:
                                        if (C2272.m7503()) {
                                            m69818 = (i99 - C2105.m6981("ܰܶ")) * 101;
                                            i101 = ((m69818 ^ i100) * (-23337)) ^ (-489448499);
                                            i102 = -1293125101;
                                        } else {
                                            m69818 = (i99 - C2105.m6981("ᩳۘ")) * (-59);
                                            i101 = ((m69818 ^ i100) * 16589) ^ (-623834767);
                                            i102 = 825084494;
                                        }
                                    case -1727604250:
                                    case 1047250247:
                                        return;
                                    case -1557281998:
                                    case 1264625626:
                                        C1047.m3599();
                                        if (C3663.m11168() < 0) {
                                            m69818 = C2105.m6981("ۗۖ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-9599)) ^ 667899228;
                                            i102 = -2056824172;
                                        } else {
                                            m69818 = C0630.m2566("᩶ۛ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 629) ^ 43526722;
                                            i102 = -627887927;
                                        }
                                    case -1363779449:
                                    case 2023175701:
                                        if (C4075.f12947 >= 0) {
                                            m69818 = C0630.m2566("ܰ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-31089)) ^ (-1974777323);
                                            i102 = -191126910;
                                        } else {
                                            m69818 = (C0630.m2566("ۛ۠") ^ i99) * 21;
                                            i101 = ((m69818 ^ i100) * (-7631)) ^ (-1182772909);
                                            i102 = 116269603;
                                        }
                                    case -1333492056:
                                    case -16843703:
                                        C2272.m7503();
                                        throw new RuntimeException();
                                    case -1304590791:
                                    case 2118128758:
                                        if (C2958.f9394 >= 0) {
                                            m69818 = C0630.m2566("ܰ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-31089)) ^ (-1974777323);
                                            i102 = -191126910;
                                        } else {
                                            m69818 = C0630.m2566("ᩴۘ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 7375) ^ 157106555;
                                            i102 = 646167714;
                                        }
                                    case -1228606792:
                                    case -1049076440:
                                        if (RunnableC1108.f4040) {
                                            m69818 = (i99 - C2105.m6981("ܰܶ")) * 101;
                                            i101 = ((m69818 ^ i100) * (-23337)) ^ (-489448499);
                                            i102 = -1293125101;
                                        } else {
                                            m69818 = C2105.m6981("ۗۖ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-9599)) ^ 667899228;
                                            i102 = -2056824172;
                                        }
                                    case -1222804830:
                                    case -460724558:
                                        if (C0714.f2697 >= 0) {
                                            m69818 = C0630.m2566("ܰ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-31089)) ^ (-1974777323);
                                            i102 = -191126910;
                                        } else {
                                            m69818 = (i99 - C0630.m2566("ۚۜ")) * 99;
                                            i101 = ((m69818 ^ i100) * 30355) ^ 1414437416;
                                            i102 = -1359652462;
                                        }
                                    case -1032107795:
                                    case 1843207260:
                                        C1420.m4913();
                                        C0714.m2805();
                                        m69818 = C2105.m6981("ۗۖ") ^ i100;
                                        i101 = ((m69818 ^ i99) * (-9599)) ^ 667899228;
                                        i102 = -2056824172;
                                    case -884509059:
                                    case 1204782998:
                                        if (C1711.m5736() <= 0) {
                                            m69818 = C2105.m6981("ܿ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * 719) ^ (-1814217120);
                                            i102 = -1764868405;
                                        } else {
                                            m69818 = (C2105.m6981("ۡܿ") ^ i100) * 17;
                                            i101 = ((m69818 ^ i99) * (-2179)) ^ 1210172718;
                                            i102 = -323571080;
                                        }
                                    case -305880323:
                                    case 206784335:
                                        if (C0714.f2697 >= 0) {
                                            m69818 = C2105.m6981("ۗۖ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-9599)) ^ 667899228;
                                            i102 = -2056824172;
                                        } else {
                                            m69818 = C2105.m6981("۟᩸") ^ i100;
                                            i101 = ((m69818 ^ i99) * 9419) ^ 1563299879;
                                            i102 = -908390555;
                                        }
                                    case -71209373:
                                    case 230531607:
                                        if (C3019.f9544 >= 0) {
                                            m69818 = (i99 - C2105.m6981("ܰܶ")) * 101;
                                            i101 = ((m69818 ^ i100) * (-23337)) ^ (-489448499);
                                            i102 = -1293125101;
                                        } else {
                                            m69818 = (i100 - C2105.m6981("֫᩵")) * (-37);
                                            i101 = ((m69818 ^ i99) * 2851) ^ (-1060073247);
                                            i102 = 889427200;
                                        }
                                    case 55487555:
                                    case 1268625828:
                                        if (C0422.f1886 <= 0) {
                                            m69818 = C2105.m6981("ܿ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * 719) ^ (-1814217120);
                                            i102 = -1764868405;
                                        } else {
                                            m69818 = (C0630.m2566("۫۠") + i99) * UMErrorCode.E_UM_BE_RAW_OVERSIZE;
                                            i101 = ((m69818 ^ i100) * 16207) ^ 1176060523;
                                            i102 = -457989308;
                                        }
                                    case 803926181:
                                    case 1721423124:
                                        if (C0382.f1805) {
                                            m69818 = C2105.m6981("ܿ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * 719) ^ (-1814217120);
                                            i102 = -1764868405;
                                        } else {
                                            m69818 = C0630.m2566("᩶ۛ") ^ i99;
                                            i101 = ((m69818 ^ i100) * 629) ^ 43526722;
                                            i102 = -627887927;
                                        }
                                    case 1246824656:
                                    case 1940639842:
                                        if (C4159.f13567) {
                                            m69818 = C0630.m2566("ۙܽ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-16171)) ^ (-1662003055);
                                            i102 = 1269025041;
                                        } else {
                                            m69818 = C2105.m6981("ۗۖ") ^ i100;
                                            i101 = ((m69818 ^ i99) * (-9599)) ^ 667899228;
                                            i102 = -2056824172;
                                        }
                                    default:
                                        if (C21923.f70183 != 0) {
                                            m69818 = C2105.m6981("ܿ᩹") ^ i100;
                                            i101 = ((m69818 ^ i99) * 719) ^ (-1814217120);
                                            i102 = -1764868405;
                                        } else {
                                            m69818 = (i100 - C0630.m2566("۫֡")) * (-13);
                                            i101 = ((m69818 ^ i99) * 9699) ^ (-332553604);
                                            i102 = 95727242;
                                        }
                                }
                            }
                        }
                    });
                    break;
                case -2080997890:
                case 709994306:
                    if (C1047.m3599() < 0) {
                        i24 = i79;
                        i25 = i96;
                        view8 = view12;
                        textInputLayout4 = textInputLayout6;
                        i26 = i87;
                        editText3 = editText8;
                        i27 = i90;
                        z7 = z17 ? 1 : 0;
                        spannableString3 = spannableString6;
                        i28 = i94;
                        i34 = i85;
                        str4 = str7;
                        i29 = i86;
                        view6 = view11;
                        i30 = i93;
                        sArr3 = sArr6;
                        i31 = i78;
                        i32 = i81;
                        str3 = str6;
                        i33 = i84;
                        textInputLayout3 = textInputLayout7;
                        view7 = view10;
                        int m25665 = (i73 - C0630.m2566("ۡۚ")) * (-97);
                        i69 = ((m25665 ^ i74) * (-24963)) ^ (-1191823552);
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        str6 = str3;
                        i85 = i34;
                        i84 = i33;
                        spannableString6 = spannableString3;
                        i81 = i32;
                        i90 = i27;
                        sArr6 = sArr3;
                        i86 = i29;
                        i96 = i25;
                        i76 = m25665 ^ 565756069;
                        editText8 = editText3;
                        i78 = i31;
                        i87 = i26;
                        i93 = i30;
                        view12 = view8;
                        view11 = view6;
                        i79 = i24;
                        str7 = str4;
                        i94 = i28;
                        z17 = z7;
                        textInputLayout6 = textInputLayout4;
                        i75 = i69;
                    }
                    m69817 = C2105.m6981("֡֨") ^ i74;
                    i69 = ((m69817 ^ i73) * 10581) ^ 89088774;
                    i71 = 1392402215;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case -2061340634:
                case 1215844301:
                    int i98 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    spannableString3 = spannableString6;
                    int i99 = i78;
                    boolean z18 = z17 ? 1 : 0;
                    if (i77 == (C0630.m2566(C1711.m5726(f17942, 545, 3, i80)) ^ 2118562055)) {
                        m69815 = C0630.m2566("ۙۧ") ^ i73;
                        i60 = ((m69815 ^ i74) * (-26507)) ^ (-70839902);
                        i67 = -2004491272;
                    } else {
                        m69815 = (C2105.m6981("ܳۜ") ^ i73) * (-87);
                        i60 = ((m69815 ^ i74) * 30375) ^ 43146963;
                        i67 = -2021141049;
                    }
                    i62 = m69815 ^ i67;
                    z12 = z18;
                    i78 = i99;
                    i79 = i98;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -2060512544:
                case -1954748991:
                    if (C1047.m3599() < 0) {
                        i11 = i79;
                        i12 = i96;
                        view3 = view12;
                        textInputLayout = textInputLayout6;
                        i13 = i87;
                        editText = editText8;
                        i14 = i90;
                        z14 = z17 ? 1 : 0;
                        spannableString2 = spannableString6;
                        i15 = i94;
                        str = str7;
                        i16 = i86;
                        view4 = view11;
                        i17 = i93;
                        sArr2 = sArr6;
                        i18 = i78;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i100 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i100;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i101 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i101;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i102 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i102;
                    } else {
                        m69817 = C2105.m6981("֡֨") ^ i74;
                        i69 = ((m69817 ^ i73) * 10581) ^ 89088774;
                        i71 = 1392402215;
                        i76 = m69817 ^ i71;
                        z17 = z17;
                        i75 = i69;
                    }
                case -2048079360:
                case -1033783600:
                    i11 = i79;
                    i12 = i96;
                    view3 = view12;
                    textInputLayout = textInputLayout6;
                    i13 = i87;
                    editText = editText8;
                    i14 = i90;
                    z3 = z17 ? 1 : 0;
                    spannableString2 = spannableString6;
                    i15 = i94;
                    str = str7;
                    i16 = i86;
                    view4 = view11;
                    i17 = i93;
                    sArr2 = sArr6;
                    i18 = i78;
                    i19 = i81;
                    i20 = i84;
                    textInputLayout2 = textInputLayout7;
                    view5 = view10;
                    int i103 = i85;
                    str2 = str6;
                    editText2 = editText7;
                    i21 = i103;
                    i80 = 10505;
                    m6981 = C2105.m6981("ܳᩴ") ^ i74;
                    i22 = ((m6981 ^ i73) * (-3399)) ^ (-518278186);
                    i23 = 915334616;
                    z15 = z3;
                    int i1012 = m6981 ^ i23;
                    view10 = view5;
                    textInputLayout7 = textInputLayout2;
                    spannableString6 = spannableString2;
                    i84 = i20;
                    i90 = i14;
                    i96 = i12;
                    i81 = i19;
                    i76 = i1012;
                    i75 = i22;
                    sArr6 = sArr2;
                    i86 = i16;
                    i78 = i18;
                    i93 = i17;
                    editText8 = editText;
                    i87 = i13;
                    view11 = view4;
                    str7 = str;
                    view12 = view3;
                    i94 = i15;
                    z17 = z15;
                    textInputLayout6 = textInputLayout;
                    i79 = i11;
                    int i1022 = i21;
                    editText7 = editText2;
                    str6 = str2;
                    i85 = i1022;
                case -2003201117:
                case -457076825:
                    C0964.m3402(new C4439(this));
                    i68 = i96;
                    m69816 = C0630.m2566("᩵ܿ") ^ i74;
                    i69 = ((m69816 ^ i73) * (-8353)) ^ 968558613;
                    i70 = -1076659345;
                    int i972 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i972;
                    z17 = z17;
                    i75 = i69;
                case -1870538761:
                case -1753050382:
                    new C21175(this).m48120();
                    break;
                case -1733748735:
                case -922826340:
                    m16386(z17 ? 1 : 0);
                    break;
                case -1730633820:
                case -34185941:
                    C2272.m7503();
                    if (C1711.f5919) {
                        m69817 = (C2105.m6981("ܺ۫") ^ i73) * (-113);
                        i69 = ((m69817 ^ i74) * 31977) ^ (-1609057471);
                        i71 = -214719364;
                        i76 = m69817 ^ i71;
                        z17 = z17;
                        i75 = i69;
                    } else {
                        i11 = i79;
                        i12 = i96;
                        view3 = view12;
                        textInputLayout = textInputLayout6;
                        i13 = i87;
                        editText = editText8;
                        i14 = i90;
                        z14 = z17 ? 1 : 0;
                        spannableString2 = spannableString6;
                        i15 = i94;
                        str = str7;
                        i16 = i86;
                        view4 = view11;
                        i17 = i93;
                        sArr2 = sArr6;
                        i18 = i78;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i1002 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i1002;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i10122 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i10122;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i10222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i10222;
                    }
                case -1719227822:
                case -946819697:
                    i11 = i79;
                    i12 = i96;
                    view3 = view12;
                    textInputLayout = textInputLayout6;
                    i13 = i87;
                    editText = editText8;
                    i14 = i90;
                    boolean z19 = z17 ? 1 : 0;
                    spannableString2 = spannableString6;
                    i15 = i94;
                    str = str7;
                    i16 = i86;
                    view4 = view11;
                    i17 = i93;
                    sArr2 = sArr6;
                    i18 = i78;
                    i19 = i81;
                    i20 = i84;
                    textInputLayout2 = textInputLayout7;
                    view5 = view10;
                    int i104 = i85;
                    str2 = str6;
                    editText2 = editText7;
                    i21 = i104;
                    RunnableC0588.m2430(view, C5695.m16034(f17942, 440, 1, i80));
                    int m5737 = C1711.m5737(view);
                    i91 = C2105.m6981(C7811.m20837(f17942, 441, 3, i80));
                    if (RunnableC1937.f6483 >= 0) {
                        i77 = m5737;
                        z16 = z19;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i101222 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i101222;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i102222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i102222;
                    } else {
                        int m69818 = C2105.m6981("ܽ᩷") ^ i73;
                        spannableString6 = spannableString2;
                        i78 = i18;
                        i90 = i14;
                        i93 = i17;
                        i96 = i12;
                        i76 = m69818 ^ 1842324390;
                        i75 = ((m69818 ^ i74) * (-23563)) ^ 2128769980;
                        i77 = m5737;
                        view11 = view4;
                        str7 = str;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        i94 = i15;
                        i84 = i20;
                        z17 = z19;
                        i81 = i19;
                        textInputLayout6 = textInputLayout;
                        sArr6 = sArr2;
                        i86 = i16;
                        i79 = i11;
                        editText8 = editText;
                        i87 = i13;
                        view12 = view3;
                        int i1022222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i1022222;
                    }
                case -1685726030:
                case -1557344971:
                    spannableString5 = spannableString6;
                    i31 = i78;
                    i48 = i79;
                    i49 = i96;
                    boolean z20 = z17 ? 1 : 0;
                    i28 = i94;
                    i88 = C2105.m6981(C1294.m4373(f17942, 506, 3, i80)) ^ 2125012299;
                    i82 = 2;
                    int m25666 = C0630.m2566(ViewOnClickListenerC1958.m6435(f17942, 509, 3, i80)) ^ 2098622532;
                    sArr6 = f17942;
                    if (C11340.f33930 >= 0) {
                        i51 = m25666;
                        i52 = i85;
                        str4 = str7;
                        view6 = view11;
                        i50 = i87;
                        editText5 = editText8;
                        sArr5 = sArr6;
                        i30 = 1;
                        i53 = i81;
                        i54 = i84;
                        z11 = z20;
                        int m25667 = (i74 - C0630.m2566("ۢ᩸")) * 93;
                        short[] sArr7 = sArr5;
                        i85 = i52;
                        editText8 = editText5;
                        spannableString6 = spannableString5;
                        i87 = i50;
                        i75 = ((m25667 ^ i73) * (-18043)) ^ (-930029292);
                        i90 = i51;
                        i96 = i49;
                        i79 = i48;
                        i76 = m25667 ^ (-1081955421);
                        int i105 = i28;
                        z17 = z11;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i105;
                        i84 = i54;
                        i81 = i53;
                        sArr6 = sArr7;
                    } else {
                        int m69819 = (i73 - C2105.m6981("۠ۗ")) * (-45);
                        i75 = ((m69819 ^ i74) * 3769) ^ 1457961941;
                        i96 = i49;
                        i94 = i28;
                        z17 = z20;
                        i76 = m69819 ^ (-231407960);
                        i78 = i31;
                        i79 = i48;
                        i93 = 1;
                        i90 = m25666;
                        spannableString6 = spannableString5;
                    }
                case -1681435281:
                case -1036955032:
                    int i106 = i93;
                    char c = z17 ? 1 : 0;
                    C19258 m2130 = C0483.m2130(this);
                    Object[] objArr = new Object[i106];
                    objArr[c] = C0050.m946(this, C2105.m6981(ServiceConnectionC3453.m10568(f17942, 542, 3, i80)) ^ 2119278305);
                    String m12262 = C4075.m12262(this, i90, objArr);
                    C2126.m7031(m12262, str6);
                    CharSequence[] charSequenceArr = new CharSequence[i106];
                    charSequenceArr[c] = m12262;
                    m2130.m44430(charSequenceArr, new DialogInterface.OnClickListener() { // from class: l.ܽۚۡ

                        /* renamed from: ܺ֡᩶, reason: not valid java name and contains not printable characters */
                        private static final short[] f50543 = {4130, 14215, -692, -4264};

                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i107) {
                            int m698110;
                            int i108;
                            int i109;
                            int m25668;
                            int i110;
                            ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
                            Runnable runnable = null;
                            short[] sArr8 = null;
                            short s = 0;
                            int i111 = 0;
                            short s2 = 0;
                            int i112 = 0;
                            int i113 = -1356639108;
                            int i114 = C5695.f17556;
                            int i115 = C3432.f10845;
                            int m25669 = (i114 - C0630.m2566("ۛܳ")) * (-63);
                            int i116 = ((m25669 ^ i115) * (-30695)) ^ 64154205;
                            int i117 = 1414883081;
                            while (true) {
                                int i118 = m25669 ^ i117;
                                while (true) {
                                    C13136 c13136 = null;
                                    while (true) {
                                        i113 = ((((i113 ^ i115) * 16553) >> 31) & i116) ^ i118;
                                        switch (i113) {
                                            case -1939590790:
                                            case 268300669:
                                                C11340.m28031();
                                                if (C1916.f6442) {
                                                    m698110 = C0630.m2566("᩸ۤ") ^ i114;
                                                    i108 = ((m698110 ^ i115) * 20741) ^ 1929941764;
                                                    i109 = -466304431;
                                                    i118 = m698110 ^ i109;
                                                    i116 = i108;
                                                } else {
                                                    m25668 = (C2105.m6981("ۢᩴ") ^ i115) * 5;
                                                    i116 = ((m25668 ^ i114) * (-7139)) ^ (-1881596802);
                                                    i110 = -816397098;
                                                    i118 = m25668 ^ i110;
                                                }
                                            case -1910892960:
                                            case -1549777994:
                                                i111 = 57564 * s;
                                                s2 = 14391;
                                                if (C3746.m11369() >= 0) {
                                                    break;
                                                }
                                                m698110 = C2105.m6981("֨ۛ") ^ i114;
                                                i108 = ((m698110 ^ i115) * 2199) ^ 337246074;
                                                i109 = 1366910177;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                                break;
                                            case -1762719439:
                                            case 151050602:
                                                C2126.m7040();
                                                ServiceConnectionC3453.m10564();
                                                break;
                                            case -1569977388:
                                            case -1344653687:
                                                sArr8 = f50543;
                                                if (C7811.f24123 < 0) {
                                                    m698110 = C0630.m2566("֫ۡ") ^ i114;
                                                    i108 = ((m698110 ^ i115) * 3903) ^ 706402798;
                                                    i109 = -592572263;
                                                    i118 = m698110 ^ i109;
                                                    i116 = i108;
                                                }
                                                m698110 = C0630.m2566("᩸ۤ") ^ i114;
                                                i108 = ((m698110 ^ i115) * 20741) ^ 1929941764;
                                                i109 = -466304431;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case -1290252513:
                                            case 19130837:
                                                c13136.m31860(runnable);
                                                C11908.m29036(new C21373(c13136, viewOnClickListenerC5850), viewOnClickListenerC5850);
                                                break;
                                            case -1277201877:
                                            case -1135676795:
                                                int i119 = s + s2;
                                                if (i111 - (i119 * i119) <= 0) {
                                                    m698110 = C2105.m6981("ۨ᩷") ^ i114;
                                                    i108 = ((m698110 ^ i115) * (-6269)) ^ 463621618;
                                                    i109 = -2114875388;
                                                } else {
                                                    m698110 = (i115 - C0630.m2566("֡ۙ")) * (-109);
                                                    i108 = ((m698110 ^ i114) * (-32169)) ^ (-1957699147);
                                                    i109 = -203492213;
                                                }
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case -873432106:
                                            case -642339180:
                                                if (!C2126.f7087) {
                                                    m698110 = C2105.m6981("᩷ܿ") ^ i115;
                                                    i108 = ((m698110 ^ i114) * 4707) ^ 1421741176;
                                                    i109 = 449664521;
                                                    i118 = m698110 ^ i109;
                                                    i116 = i108;
                                                }
                                                m698110 = C0630.m2566("᩸ۤ") ^ i114;
                                                i108 = ((m698110 ^ i115) * 20741) ^ 1929941764;
                                                i109 = -466304431;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case -765260575:
                                            case 832144984:
                                                s = sArr8[0];
                                                if (C1128.f4106 <= 0) {
                                                    break;
                                                }
                                                m698110 = C2105.m6981("ܽᩴ") ^ i115;
                                                i108 = ((m698110 ^ i114) * (-10635)) ^ 1498342430;
                                                i109 = 380953161;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                                break;
                                            case -689821954:
                                            case 1824932060:
                                                i112 = 24785;
                                                m698110 = C0630.m2566("ۗ᩹") ^ i115;
                                                i108 = ((m698110 ^ i114) * (-11625)) ^ (-1015785765);
                                                i109 = -2095674642;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case -420834689:
                                            case 1846224614:
                                                runnable = null;
                                                if (!C2167.m7155()) {
                                                    m25668 = (i115 - C0630.m2566("ۚ۬")) * (-93);
                                                    i116 = ((m25668 ^ i114) * (-9393)) ^ 841046193;
                                                    i110 = 919168663;
                                                    i118 = m25668 ^ i110;
                                                }
                                                m25668 = (C2105.m6981("ۢᩴ") ^ i115) * 5;
                                                i116 = ((m25668 ^ i114) * (-7139)) ^ (-1881596802);
                                                i110 = -816397098;
                                                i118 = m25668 ^ i110;
                                            case -385821169:
                                            case 360485627:
                                                i112 = 2972;
                                                m698110 = C0630.m2566("ۗ᩹") ^ i115;
                                                i108 = ((m698110 ^ i114) * (-11625)) ^ (-1015785765);
                                                i109 = -2095674642;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case -68023624:
                                            case 100695424:
                                                C0382.m1848();
                                                m698110 = C0630.m2566("᩸ۤ") ^ i114;
                                                i108 = ((m698110 ^ i115) * 20741) ^ 1929941764;
                                                i109 = -466304431;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            case 906116932:
                                            case 1836870564:
                                                int i120 = ViewOnClickListenerC5850.f17941;
                                                short[] sArr9 = f50543;
                                                if (C1711.m5736() > 0 && C2520.f8000 < 0) {
                                                    int m698111 = C2105.m6981(RunnableC1937.m6385(sArr9, 1, 3, i112));
                                                    if (C3746.f11829 <= 0) {
                                                        break;
                                                    } else {
                                                        int i121 = m698111 ^ 2118744650;
                                                        if (ServiceConnectionC3453.f10921 >= 0) {
                                                            break;
                                                        }
                                                        viewOnClickListenerC5850 = ViewOnClickListenerC5850.this;
                                                        c13136 = new C13136(viewOnClickListenerC5850, i121);
                                                        C3746.m11365(c13136);
                                                        if (C21923.f70183 == 0) {
                                                            m698110 = (C0630.m2566("᩹᩷") ^ i114) * (-29);
                                                            i108 = ((m698110 ^ i115) * 6467) ^ (-457749792);
                                                            i109 = -941230396;
                                                            i118 = m698110 ^ i109;
                                                            i116 = i108;
                                                        }
                                                        m698110 = C0630.m2566("᩺᩸") ^ i114;
                                                        i108 = ((m698110 ^ i115) * 14477) ^ 380846026;
                                                        i109 = 1632656915;
                                                        i118 = m698110 ^ i109;
                                                        i116 = i108;
                                                    }
                                                }
                                                break;
                                            case 1128726731:
                                            case 1177635892:
                                                C3537.m10746();
                                                if (C0050.f910 < 0) {
                                                    break;
                                                }
                                                m698110 = C0630.m2566("᩸ۤ") ^ i114;
                                                i108 = ((m698110 ^ i115) * 20741) ^ 1929941764;
                                                i109 = -466304431;
                                                i118 = m698110 ^ i109;
                                                i116 = i108;
                                            default:
                                                if (C3911.m11924() <= 0) {
                                                    break;
                                                } else {
                                                    m698110 = C0630.m2566("᩺᩸") ^ i114;
                                                    i108 = ((m698110 ^ i115) * 14477) ^ 380846026;
                                                    i109 = 1632656915;
                                                    i118 = m698110 ^ i109;
                                                    i116 = i108;
                                                }
                                        }
                                        return;
                                    }
                                    int m698112 = C2105.m6981("᩷ۡ") ^ i114;
                                    int i122 = ((m698112 ^ i115) * 29573) ^ (-1200923215);
                                    i118 = m698112 ^ 382079397;
                                    i116 = i122;
                                }
                                m25669 = (C0630.m2566("᩸᩷") + i115) * (-79);
                                i116 = ((m25669 ^ i114) * 8951) ^ 326265626;
                                i117 = 2123806850;
                            }
                        }
                    });
                    RunnableC0588.m2438(m2130);
                    break;
                case -1655037932:
                case 97080647:
                    if (C5695.f17556 >= 0) {
                        m69817 = (C2105.m6981("ۡۜ") + i74) * 57;
                        i69 = ((m69817 ^ i73) * 565) ^ (-687994146);
                        i71 = 1116678886;
                        i76 = m69817 ^ i71;
                        z17 = z17;
                        i75 = i69;
                    }
                    m69817 = (C2105.m6981("ۚۘ") ^ i74) * (-103);
                    i69 = ((m69817 ^ i73) * 24357) ^ 1543569333;
                    i71 = -1152391690;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case -1641593760:
                case -1633394288:
                    C19258 m21302 = C0483.m2130(this);
                    String m1958 = C0422.m1958(this, i81);
                    C2126.m7031(m1958, str6);
                    String m19582 = C0422.m1958(this, i83);
                    C2126.m7031(m19582, str6);
                    CharSequence[] charSequenceArr2 = new CharSequence[i82];
                    charSequenceArr2[z17 ? 1 : 0] = m1958;
                    charSequenceArr2[i93] = m19582;
                    m21302.m44430(charSequenceArr2, new DialogInterface.OnClickListener() { // from class: l.ۖۚۡ

                        /* renamed from: ۤۧܽ, reason: not valid java name and contains not printable characters */
                        private static final short[] f7457 = {6725, -20277, -24654, -20374, 25768, -17679, 29456, 26641, 30155, 29721, -29663, -18822, 30863, -31166, -27483, -30365, -28537, -29015, -19839};

                        /* JADX WARN: Code restructure failed: missing block: B:26:0x008e, code lost:
                        
                            if (l.C4075.m12263() > 0) goto L32;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:6:0x006f, code lost:
                        
                            if (l.C4616.f14690 > 0) goto L32;
                         */
                        @Override // android.content.DialogInterface.OnClickListener
                        /*
                            Code decompiled incorrectly, please refer to instructions dump.
                            To view partially-correct add '--show-bad-code' argument
                        */
                        public final void onClick(android.content.DialogInterface r23, int r24) {
                            /*
                                Method dump skipped, instructions count: 1044
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: l.DialogInterfaceOnClickListenerC2323.onClick(android.content.DialogInterface, int):void");
                        }
                    });
                    C3683.m11213(m21302);
                    break;
                case -1591381195:
                case 776656819:
                    i68 = i96;
                    if (i78 < i94) {
                        m69816 = C2105.m6981("ܶۢ") ^ i73;
                        i69 = ((m69816 ^ i74) * 16025) ^ 947473476;
                        i70 = -1983848042;
                    } else {
                        m69816 = C2105.m6981("֡ܽ") ^ i73;
                        i69 = ((m69816 ^ i74) * 18285) ^ 1095714066;
                        i70 = 1619443291;
                    }
                    int i9722 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i9722;
                    z17 = z17;
                    i75 = i69;
                case -1528469659:
                case -1146176656:
                    if (C7106.m19120() <= 0) {
                        i68 = i96;
                        m69816 = C0630.m2566("ܳۙ") ^ i73;
                        i69 = ((m69816 ^ i74) * (-19047)) ^ (-589930887);
                        i70 = -651305190;
                        int i97222 = m69816 ^ i70;
                        i96 = i68;
                        i76 = i97222;
                        z17 = z17;
                        i75 = i69;
                    }
                    m69817 = (C2105.m6981("ܺ۫") ^ i73) * (-113);
                    i69 = ((m69817 ^ i74) * 31977) ^ (-1609057471);
                    i71 = -214719364;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case -1482754508:
                case 786291449:
                    i55 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    spannableString3 = spannableString6;
                    i58 = i78;
                    boolean z21 = z17 ? 1 : 0;
                    i59 = i94;
                    if (C23196.m51450().containsKey(C1773.m5917(f17942, 535, 2, i80))) {
                        m25663 = (C0630.m2566("۟ܺ") ^ i73) * 43;
                        i60 = ((m25663 ^ i74) * 3279) ^ 426731181;
                        i66 = -622941026;
                        z13 = z21;
                    } else {
                        m25663 = C2105.m6981("۫۬") ^ i74;
                        i60 = ((m25663 ^ i73) * 24693) ^ (-1084656904);
                        i66 = 1832466722;
                        z13 = z21;
                    }
                    i62 = m25663 ^ i66;
                    z10 = z13;
                    i94 = i59;
                    i79 = i55;
                    z12 = z10;
                    i78 = i58;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -1468643778:
                case -801552290:
                    int i107 = i79;
                    i25 = i96;
                    i27 = i90;
                    int i108 = i93;
                    spannableString3 = spannableString6;
                    int i109 = i78;
                    boolean z22 = z17 ? 1 : 0;
                    int i110 = i94;
                    short[] sArr8 = sArr6;
                    i83 = C2105.m6981(C0714.m2816(sArr8, 512, 3, i80)) ^ 2124706152;
                    i81 = C0630.m2566(C1711.m5726(f17942, 515, 3, i80)) ^ 2126137644;
                    str6 = C0237.m1483(f17942, 518, 14, i80);
                    int i111 = i88;
                    if (i77 == i111) {
                        m69814 = C2105.m6981("᩶ۨ") ^ i74;
                        i64 = ((m69814 ^ i73) * 21129) ^ (-121319619);
                        i65 = -2116659232;
                    } else {
                        m69814 = C2105.m6981("᩶۫") ^ i73;
                        i64 = ((m69814 ^ i74) * 5889) ^ 1958753883;
                        i65 = 1475950849;
                    }
                    i35 = m69814 ^ i65;
                    i88 = i111;
                    sArr6 = sArr8;
                    i75 = i64;
                    i94 = i110;
                    i79 = i107;
                    z4 = z22;
                    i78 = i109;
                    i93 = i108;
                    i63 = i25;
                    i76 = i35;
                    z17 = z4;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -1316327884:
                case -492915845:
                    i38 = i79;
                    i39 = i96;
                    TextInputLayout textInputLayout11 = textInputLayout7;
                    view9 = view10;
                    i40 = i87;
                    editText4 = editText8;
                    i41 = i90;
                    spannableString4 = spannableString6;
                    i42 = i85;
                    i43 = i86;
                    sArr4 = sArr6;
                    i44 = i81;
                    i45 = i84;
                    int i112 = i93;
                    i31 = i78;
                    boolean z23 = z17 ? 1 : 0;
                    i28 = i94;
                    str4 = str7;
                    view6 = view11;
                    i30 = i112;
                    textInputLayout5 = textInputLayout11;
                    str5 = str6;
                    if (i77 == (C2105.m6981(C2105.m6988(f17942, 479, 3, i80)) ^ 2126093560)) {
                        m25662 = (C2105.m6981("ᩳܰ") + i74) * (-49);
                        i46 = ((m25662 ^ i73) * 13201) ^ 798436773;
                        i47 = 1671449509;
                        z5 = z23;
                    } else {
                        m25662 = C0630.m2566("֫᩶") ^ i73;
                        i46 = ((m25662 ^ i74) * (-12231)) ^ (-1171563188);
                        i47 = -1608527838;
                        z5 = z23;
                    }
                    int i113 = m25662 ^ i47;
                    view10 = view9;
                    textInputLayout7 = textInputLayout5;
                    str6 = str5;
                    i85 = i42;
                    i84 = i45;
                    spannableString6 = spannableString4;
                    i81 = i44;
                    i90 = i41;
                    sArr6 = sArr4;
                    i86 = i43;
                    i96 = i39;
                    i76 = i113;
                    editText8 = editText4;
                    i79 = i38;
                    i87 = i40;
                    i75 = i46;
                    z8 = z5;
                    int i114 = i28;
                    z17 = z8;
                    i78 = i31;
                    i93 = i30;
                    view11 = view6;
                    str7 = str4;
                    i94 = i114;
                case -1305350268:
                case 620533743:
                    ServiceConnectionC3453.m10570(this, new Intent(this, (Class<?>) ActivityC6669.class));
                    break;
                case -1287184563:
                case 2081132707:
                    i55 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    spannableString3 = spannableString6;
                    i58 = i78;
                    boolean z24 = z17 ? 1 : 0;
                    i59 = i94;
                    obj = null;
                    if (i77 == (C0630.m2566(ServiceConnectionC3453.m10568(f17942, 537, 3, i80)) ^ 2125467045)) {
                        m25663 = C0630.m2566("ᩴ֫") ^ i74;
                        i60 = ((m25663 ^ i73) * (-9495)) ^ (-1010898485);
                        i66 = -2066048362;
                        z13 = z24;
                    } else {
                        m25663 = (C2105.m6981("ܺ᩷") + i74) * (-5);
                        i60 = ((m25663 ^ i73) * 22641) ^ (-1137077590);
                        i66 = -591936651;
                        z13 = z24;
                    }
                    i62 = m25663 ^ i66;
                    z10 = z13;
                    i94 = i59;
                    i79 = i55;
                    z12 = z10;
                    i78 = i58;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -1259398703:
                case -524854251:
                    i24 = i79;
                    str3 = str6;
                    i25 = i96;
                    View view14 = view12;
                    EditText editText10 = editText7;
                    TextInputLayout textInputLayout12 = textInputLayout6;
                    i26 = i87;
                    editText3 = editText8;
                    i27 = i90;
                    boolean z25 = z17 ? 1 : 0;
                    spannableString3 = spannableString6;
                    i28 = i94;
                    str4 = str7;
                    i29 = i86;
                    view6 = view11;
                    i30 = i93;
                    sArr3 = sArr6;
                    i31 = i78;
                    i32 = i81;
                    i33 = i84;
                    textInputLayout3 = textInputLayout7;
                    view7 = view10;
                    i95 = i91 ^ 2124363198;
                    int m698110 = C2105.m6981(C1294.m4373(f17942, 444, 3, i80)) ^ 2126403512;
                    if (C1711.f5919) {
                        i34 = m698110;
                        textInputLayout4 = textInputLayout12;
                        view8 = view14;
                        editText7 = editText10;
                        z7 = z25;
                        int m256652 = (i73 - C0630.m2566("ۡۚ")) * (-97);
                        i69 = ((m256652 ^ i74) * (-24963)) ^ (-1191823552);
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        str6 = str3;
                        i85 = i34;
                        i84 = i33;
                        spannableString6 = spannableString3;
                        i81 = i32;
                        i90 = i27;
                        sArr6 = sArr3;
                        i86 = i29;
                        i96 = i25;
                        i76 = m256652 ^ 565756069;
                        editText8 = editText3;
                        i78 = i31;
                        i87 = i26;
                        i93 = i30;
                        view12 = view8;
                        view11 = view6;
                        i79 = i24;
                        str7 = str4;
                        i94 = i28;
                        z17 = z7;
                        textInputLayout6 = textInputLayout4;
                        i75 = i69;
                    } else {
                        int m25668 = (C0630.m2566("۬᩺") ^ i73) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        int i115 = ((m25668 ^ i74) * 8151) ^ 667394678;
                        i35 = m25668 ^ 61414435;
                        editText7 = editText10;
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        str6 = str3;
                        i85 = m698110;
                        i75 = i115;
                        i84 = i33;
                        i78 = i31;
                        i81 = i32;
                        sArr6 = sArr3;
                        i93 = i30;
                        i86 = i29;
                        view11 = view6;
                        editText8 = editText3;
                        str7 = str4;
                        i87 = i26;
                        i94 = i28;
                        view12 = view14;
                        z4 = z25;
                        textInputLayout6 = textInputLayout12;
                        i79 = i24;
                        i63 = i25;
                        i76 = i35;
                        z17 = z4;
                        spannableString6 = spannableString3;
                        i90 = i27;
                        i96 = i63;
                    }
                case -1227785403:
                case -178751396:
                    i38 = i79;
                    i39 = i96;
                    i40 = i87;
                    editText4 = editText8;
                    i41 = i90;
                    spannableString4 = spannableString6;
                    i42 = i85;
                    i43 = i86;
                    sArr4 = sArr6;
                    i44 = i81;
                    str5 = str6;
                    i45 = i84;
                    textInputLayout5 = textInputLayout7;
                    view9 = view10;
                    int i116 = i93;
                    i31 = i78;
                    boolean z26 = z17 ? 1 : 0;
                    i28 = i94;
                    str4 = str7;
                    view6 = view11;
                    i30 = i116;
                    if (C23196.m51465()) {
                        m25662 = C0630.m2566("ܽۡ") ^ i73;
                        i46 = ((m25662 ^ i74) * 30241) ^ (-59828268);
                        i47 = 1113489611;
                        z5 = z26;
                    } else {
                        m25662 = (i74 - C0630.m2566("ᩳۘ")) * (-61);
                        i46 = ((m25662 ^ i73) * (-17997)) ^ 1147564732;
                        i47 = -753368909;
                        z5 = z26;
                    }
                    int i1132 = m25662 ^ i47;
                    view10 = view9;
                    textInputLayout7 = textInputLayout5;
                    str6 = str5;
                    i85 = i42;
                    i84 = i45;
                    spannableString6 = spannableString4;
                    i81 = i44;
                    i90 = i41;
                    sArr6 = sArr4;
                    i86 = i43;
                    i96 = i39;
                    i76 = i1132;
                    editText8 = editText4;
                    i79 = i38;
                    i87 = i40;
                    i75 = i46;
                    z8 = z5;
                    int i1142 = i28;
                    z17 = z8;
                    i78 = i31;
                    i93 = i30;
                    view11 = view6;
                    str7 = str4;
                    i94 = i1142;
                case -1207935317:
                case -1054296222:
                    i11 = i79;
                    i12 = i96;
                    view3 = view12;
                    textInputLayout = textInputLayout6;
                    i13 = i87;
                    editText = editText8;
                    i14 = i90;
                    z3 = z17 ? 1 : 0;
                    spannableString2 = spannableString6;
                    i15 = i94;
                    str = str7;
                    i16 = i86;
                    view4 = view11;
                    i17 = i93;
                    sArr2 = sArr6;
                    i18 = i78;
                    i19 = i81;
                    i20 = i84;
                    textInputLayout2 = textInputLayout7;
                    view5 = view10;
                    int i117 = i85;
                    str2 = str6;
                    editText2 = editText7;
                    i21 = i117;
                    i80 = 32132;
                    m6981 = C2105.m6981("ܳᩴ") ^ i74;
                    i22 = ((m6981 ^ i73) * (-3399)) ^ (-518278186);
                    i23 = 915334616;
                    z15 = z3;
                    int i1012222 = m6981 ^ i23;
                    view10 = view5;
                    textInputLayout7 = textInputLayout2;
                    spannableString6 = spannableString2;
                    i84 = i20;
                    i90 = i14;
                    i96 = i12;
                    i81 = i19;
                    i76 = i1012222;
                    i75 = i22;
                    sArr6 = sArr2;
                    i86 = i16;
                    i78 = i18;
                    i93 = i17;
                    editText8 = editText;
                    i87 = i13;
                    view11 = view4;
                    str7 = str;
                    view12 = view3;
                    i94 = i15;
                    z17 = z15;
                    textInputLayout6 = textInputLayout;
                    i79 = i11;
                    int i10222222 = i21;
                    editText7 = editText2;
                    str6 = str2;
                    i85 = i10222222;
                case -1119432874:
                case 429010008:
                    char c2 = z17 ? 1 : 0;
                    C19258 m21303 = C0483.m2130(this);
                    String m946 = C0050.m946(this, i81);
                    C4159.m12575(m946, str6);
                    String m19583 = C0422.m1958(this, i83);
                    C4159.m12575(m19583, str6);
                    CharSequence[] charSequenceArr3 = new CharSequence[i82];
                    charSequenceArr3[c2] = m946;
                    charSequenceArr3[i93] = m19583;
                    m21303.m44430(charSequenceArr3, new DialogInterface.OnClickListener() { // from class: l.ۤ֡ۡ

                        /* renamed from: ۨۗ۠, reason: not valid java name and contains not printable characters */
                        private static final short[] f30018 = {3160, -21075, -24767, 20840, 19084, 24217, 23604, -24433, -31423, 21821, -16946, -21255, -31247, -20567, 19438, 19262, -17030, 21437, 23054};

                        /* JADX WARN: Code restructure failed: missing block: B:68:0x0056, code lost:
                        
                            if (l.C3746.f11829 <= 0) goto L49;
                         */
                        @Override // android.content.DialogInterface.OnClickListener
                        /*
                            Code decompiled incorrectly, please refer to instructions dump.
                            To view partially-correct add '--show-bad-code' argument
                        */
                        public final void onClick(android.content.DialogInterface r23, int r24) {
                            /*
                                Method dump skipped, instructions count: 1036
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: l.DialogInterfaceOnClickListenerC9939.onClick(android.content.DialogInterface, int):void");
                        }
                    });
                    C3683.m11213(m21303);
                    break;
                case -1023170971:
                case -914016731:
                    m16388();
                    break;
                case -955081439:
                case 215121099:
                    C3663.m11161(C2105.m6981(C2167.m7159(f17942, 591, 3, i80)) ^ 2122409381);
                    break;
                case -954910621:
                case 1964035670:
                    i38 = i79;
                    i39 = i96;
                    i40 = i87;
                    editText4 = editText8;
                    i41 = i90;
                    spannableString4 = spannableString6;
                    i42 = i85;
                    i43 = i86;
                    sArr4 = sArr6;
                    i44 = i81;
                    str5 = str6;
                    i45 = i84;
                    textInputLayout5 = textInputLayout7;
                    view9 = view10;
                    int i118 = i93;
                    i31 = i78;
                    boolean z27 = z17 ? 1 : 0;
                    i28 = i94;
                    str4 = str7;
                    view6 = view11;
                    i30 = i118;
                    if (i77 == (C0630.m2566(C4616.m13542(f17942, 476, 3, i80)) ^ 2127107871)) {
                        m25662 = (i74 - C0630.m2566("ܶܳ")) * 21;
                        i46 = ((m25662 ^ i73) * 32629) ^ 1416421430;
                        i47 = 390026493;
                        z5 = z27;
                    } else {
                        m25662 = C0630.m2566("ۜ֫") ^ i73;
                        i46 = ((m25662 ^ i74) * (-26763)) ^ (-245534530);
                        i47 = 1877371997;
                        z5 = z27;
                    }
                    int i11322 = m25662 ^ i47;
                    view10 = view9;
                    textInputLayout7 = textInputLayout5;
                    str6 = str5;
                    i85 = i42;
                    i84 = i45;
                    spannableString6 = spannableString4;
                    i81 = i44;
                    i90 = i41;
                    sArr6 = sArr4;
                    i86 = i43;
                    i96 = i39;
                    i76 = i11322;
                    editText8 = editText4;
                    i79 = i38;
                    i87 = i40;
                    i75 = i46;
                    z8 = z5;
                    int i11422 = i28;
                    z17 = z8;
                    i78 = i31;
                    i93 = i30;
                    view11 = view6;
                    str7 = str4;
                    i94 = i11422;
                case -877279977:
                case 611471555:
                    i55 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    spannableString3 = spannableString6;
                    i58 = i78;
                    boolean z28 = z17 ? 1 : 0;
                    i59 = i94;
                    if (C23196.m51450().containsKey(C0483.m2128(f17942, 540, 2, i80))) {
                        m25663 = (C0630.m2566("ۨ֫") ^ i74) * (-15);
                        i60 = ((m25663 ^ i73) * 24945) ^ 2129882753;
                        i66 = 547801864;
                        z13 = z28;
                    } else {
                        m25663 = C2105.m6981("ܶۤ") ^ i73;
                        i60 = ((m25663 ^ i74) * 27507) ^ 735891256;
                        i66 = -1254403271;
                        z13 = z28;
                    }
                    i62 = m25663 ^ i66;
                    z10 = z13;
                    i94 = i59;
                    i79 = i55;
                    z12 = z10;
                    i78 = i58;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -872570001:
                case 1182507412:
                    i68 = i96;
                    if (C23196.m51456()) {
                        m69816 = C2105.m6981("᩻᩹") ^ i73;
                        i69 = ((m69816 ^ i74) * (-32761)) ^ (-1622804288);
                        i70 = 98752916;
                    } else {
                        m69816 = (C0630.m2566("᩺ᩴ") ^ i74) * 29;
                        i69 = ((m69816 ^ i73) * (-15983)) ^ 411193390;
                        i70 = 323595212;
                    }
                    int i972222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i972222;
                    z17 = z17;
                    i75 = i69;
                case -852385565:
                case 282654254:
                    break;
                case -851924374:
                case -375127831:
                    i68 = i96;
                    if (i77 == (C0630.m2566(RunnableC0588.m2436(f17942, 569, 3, i80)) ^ 2124965223)) {
                        m69816 = C2105.m6981("ۜܽ") ^ i73;
                        i69 = ((m69816 ^ i74) * 16881) ^ (-245325450);
                        i70 = 502860159;
                    } else {
                        m69816 = (C2105.m6981("֨۬") ^ i74) * (-107);
                        i69 = ((m69816 ^ i73) * 31011) ^ (-596542745);
                        i70 = 873304978;
                    }
                    int i9722222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i9722222;
                    z17 = z17;
                    i75 = i69;
                case -819567898:
                case 75296244:
                    i24 = i79;
                    i25 = i96;
                    int i119 = i87;
                    editText3 = editText8;
                    i27 = i90;
                    i30 = i93;
                    spannableString3 = spannableString6;
                    i31 = i78;
                    int i120 = i86;
                    boolean z29 = z17 ? 1 : 0;
                    sArr3 = sArr6;
                    i28 = i94;
                    str4 = str7;
                    i29 = i120;
                    View m9259 = C3019.m9259(this, C2105.m6981(C4075.m12252(f17942, 485, 3, i80)) ^ 2099465243);
                    i32 = i81;
                    View m3507 = C1005.m3507(m9259, C0630.m2566(C4159.m12578(f17942, 488, 3, i80)) ^ 2099306206);
                    C2126.m7031(m3507, str4);
                    textInputLayout8 = (TextInputLayout) m3507;
                    if (C0382.f1805) {
                        int m25669 = (i74 - C0630.m2566("᩸᩸")) * (-119);
                        str7 = str4;
                        i94 = i28;
                        i81 = i32;
                        z17 = z29;
                        sArr6 = sArr3;
                        i86 = i29;
                        i78 = i31;
                        i93 = i30;
                        editText8 = editText3;
                        i87 = i119;
                        view11 = m9259;
                        i75 = ((m25669 ^ i73) * (-27879)) ^ (-232296470);
                        spannableString6 = spannableString3;
                        i90 = i27;
                        i96 = i25;
                        i76 = m25669 ^ (-546198108);
                        i79 = i24;
                    } else {
                        view6 = m9259;
                        view8 = view12;
                        i33 = i84;
                        i34 = i85;
                        i26 = i119;
                        str3 = str6;
                        textInputLayout3 = textInputLayout7;
                        textInputLayout4 = textInputLayout6;
                        view7 = view10;
                        z6 = z29;
                        z7 = z6;
                        int m2566522 = (i73 - C0630.m2566("ۡۚ")) * (-97);
                        i69 = ((m2566522 ^ i74) * (-24963)) ^ (-1191823552);
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        str6 = str3;
                        i85 = i34;
                        i84 = i33;
                        spannableString6 = spannableString3;
                        i81 = i32;
                        i90 = i27;
                        sArr6 = sArr3;
                        i86 = i29;
                        i96 = i25;
                        i76 = m2566522 ^ 565756069;
                        editText8 = editText3;
                        i78 = i31;
                        i87 = i26;
                        i93 = i30;
                        view12 = view8;
                        view11 = view6;
                        i79 = i24;
                        str7 = str4;
                        i94 = i28;
                        z17 = z7;
                        textInputLayout6 = textInputLayout4;
                        i75 = i69;
                    }
                case -667578724:
                case 544614683:
                    int i121 = z17 ? 1 : 0;
                    final DialogInterfaceC0206 m2438 = RunnableC0588.m2438(c192582);
                    C4925.m14329(editText8);
                    View view15 = view11;
                    final EditText editText11 = editText8;
                    C4159.m12564(C11340.m28028(view15, i87), new ViewOnClickListenerC21933(i121, this, editText11));
                    View m28028 = C11340.m28028(view15, C2105.m6981(C0798.m3005(f17942, 500, 3, i80)) ^ 2122652239);
                    final EditText editText12 = editText6;
                    final TextInputLayout textInputLayout13 = textInputLayout9;
                    final TextInputLayout textInputLayout14 = textInputLayout8;
                    C4159.m12564(m28028, new View.OnClickListener() { // from class: l.᩶֡ۡ
                        {
                            int i122 = 1222337566;
                            int i123 = AbstractC2021.f6743;
                            int i124 = C5695.f17556;
                            int m256610 = C0630.m2566("᩸ۖ") ^ i123;
                            int i125 = ((m256610 ^ i124) * (-22931)) ^ (-403505167);
                            int i126 = 850442735;
                            while (true) {
                                i122 = ((((i122 ^ i124) * (-5573)) >> 31) & i125) ^ (m256610 ^ i126);
                                switch (i122) {
                                    case -2110838194:
                                    case 1834411228:
                                        if (RunnableC1937.m6387() != 0) {
                                            m256610 = C2105.m6981("᩻۫") ^ i124;
                                            i125 = ((m256610 ^ i123) * 23591) ^ 1209621164;
                                            i126 = -1841212096;
                                        } else {
                                            m256610 = C2105.m6981("᩺۫") ^ i124;
                                            i125 = ((m256610 ^ i123) * 4495) ^ (-1445110780);
                                            i126 = -2106062919;
                                        }
                                    case -2098705156:
                                    case 221634062:
                                        if (C0630.m2564()) {
                                            m256610 = C2105.m6981("ܽۙ") ^ i124;
                                            i125 = ((m256610 ^ i123) * 2463) ^ (-675774870);
                                            i126 = -174103667;
                                        } else {
                                            m256610 = C2105.m6981("ۡ۫") ^ i123;
                                            i125 = ((m256610 ^ i124) * 14093) ^ (-1830133220);
                                            i126 = -87103958;
                                        }
                                    case -1906256602:
                                    case 1986566160:
                                        if (C1128.f4106 <= 0) {
                                            m256610 = C0630.m2566("۟֨") ^ i123;
                                            i125 = ((m256610 ^ i124) * 24033) ^ (-40564984);
                                            i126 = 1869234013;
                                        } else {
                                            m256610 = C0630.m2566("ۢۘ") ^ i124;
                                            i125 = ((m256610 ^ i123) * (-24941)) ^ 1810487133;
                                            i126 = 900274380;
                                        }
                                    case -1901241706:
                                    case -474406089:
                                        if (C3019.f9544 >= 0) {
                                            m256610 = C0630.m2566("۟֨") ^ i123;
                                            i125 = ((m256610 ^ i124) * 24033) ^ (-40564984);
                                            i126 = 1869234013;
                                        } else {
                                            m256610 = (C2105.m6981("ᩴܿ") ^ i124) * (-125);
                                            i125 = ((m256610 ^ i123) * 22503) ^ 735684188;
                                            i126 = -963040960;
                                        }
                                    case -1812014800:
                                    case 1867258975:
                                        if (C3911.f12484 >= 0) {
                                            m256610 = C2105.m6981("ܽۙ") ^ i124;
                                            i125 = ((m256610 ^ i123) * 2463) ^ (-675774870);
                                            i126 = -174103667;
                                        } else {
                                            m256610 = (i123 - C0630.m2566("᩹ܿ")) * 37;
                                            i125 = ((m256610 ^ i124) * (-29645)) ^ (-1347136842);
                                            i126 = -1581650531;
                                        }
                                    case -1582872575:
                                    case 1679363378:
                                        if (C2105.f7037 != 0) {
                                            m256610 = (C2105.m6981("ۖᩴ") + i123) * 47;
                                            i125 = ((m256610 ^ i124) * (-9393)) ^ 492511046;
                                            i126 = 1285871841;
                                        } else {
                                            m256610 = (C2105.m6981("ۡ᩷") + i124) * (-101);
                                            i125 = ((m256610 ^ i123) * 15645) ^ 2042082718;
                                            i126 = 1708422353;
                                        }
                                    case -1523193609:
                                    case 2138394311:
                                        C11340.m28031();
                                        if (C4117.m12364() == 0) {
                                            m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                            i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                            i126 = -393308372;
                                        } else {
                                            m256610 = (C2105.m6981("ۖᩴ") + i123) * 47;
                                            i125 = ((m256610 ^ i124) * (-9393)) ^ 492511046;
                                            i126 = 1285871841;
                                        }
                                    case -1512520530:
                                    case -888420224:
                                        C2126.m7040();
                                        if (C1773.f6144 <= 0) {
                                            m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                            i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                            i126 = -393308372;
                                        } else {
                                            m256610 = C0630.m2566("۟֨") ^ i123;
                                            i125 = ((m256610 ^ i124) * 24033) ^ (-40564984);
                                            i126 = 1869234013;
                                        }
                                    case -1402686077:
                                    case 1684316793:
                                        if (C0964.m3413()) {
                                            m256610 = (C2105.m6981("ᩴۘ") ^ i123) * (-69);
                                            i125 = ((m256610 ^ i124) * 723) ^ 453162495;
                                            i126 = 720322987;
                                        } else {
                                            m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                            i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                            i126 = -393308372;
                                        }
                                    case -1290785975:
                                    case -350754284:
                                        if (C1047.f3863 >= 0) {
                                            m256610 = (C2105.m6981("ۖᩴ") + i123) * 47;
                                            i125 = ((m256610 ^ i124) * (-9393)) ^ 492511046;
                                            i126 = 1285871841;
                                        } else {
                                            m256610 = (C0630.m2566("᩹᩻") ^ i123) * 13;
                                            i125 = ((m256610 ^ i124) * (-31969)) ^ 185063920;
                                            i126 = -385999605;
                                        }
                                    case -1051678060:
                                    case 413705446:
                                        if (ServiceConnectionC3453.f10921 >= 0) {
                                            m256610 = C0630.m2566("۟֨") ^ i123;
                                            i125 = ((m256610 ^ i124) * 24033) ^ (-40564984);
                                            i126 = 1869234013;
                                        } else {
                                            m256610 = C2105.m6981("᩻۫") ^ i124;
                                            i125 = ((m256610 ^ i123) * 23591) ^ 1209621164;
                                            i126 = -1841212096;
                                        }
                                    case -716951992:
                                    case 664205356:
                                        return;
                                    case -582498654:
                                    case 968911479:
                                        C1047.m3599();
                                        C3911.m11924();
                                        m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                        i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                        i126 = -393308372;
                                    case -561996067:
                                    case 1626704526:
                                        if (C1005.f3721) {
                                            m256610 = (C0630.m2566("᩻۟") ^ i124) * 7;
                                            i125 = ((m256610 ^ i123) * 983) ^ (-804369896);
                                            i126 = -29103285;
                                        } else {
                                            m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                            i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                            i126 = -393308372;
                                        }
                                    case 1020828497:
                                    case 1373421078:
                                        RunnableC0588.m2441();
                                        throw new RuntimeException();
                                    default:
                                        if (C3537.f11231 >= 0) {
                                            m256610 = (C0630.m2566("۠ܶ") ^ i124) * q.h;
                                            i125 = ((m256610 ^ i123) * (-10305)) ^ 608627141;
                                            i126 = -393308372;
                                        } else {
                                            m256610 = C2105.m6981("֡᩺") ^ i123;
                                            i125 = ((m256610 ^ i124) * (-15843)) ^ (-1616716214);
                                            i126 = -2010457689;
                                        }
                                }
                            }
                        }

                        /* JADX WARN: Code restructure failed: missing block: B:12:0x003e, code lost:
                        
                            if (l.C22628.m50615() == 0) goto L14;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:15:0x0047, code lost:
                        
                            r1 = l.C0630.m2566("᩵֨") ^ r8;
                            r10 = ((r1 ^ r7) * 6497) ^ (-907353511);
                            r2 = 2027885209;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:18:0x0043, code lost:
                        
                            if (l.C3746.f11829 <= 0) goto L49;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:22:0x005e, code lost:
                        
                            if (l.C1294.f4556 < 0) goto L49;
                         */
                        @Override // android.view.View.OnClickListener
                        /*
                            Code decompiled incorrectly, please refer to instructions dump.
                            To view partially-correct add '--show-bad-code' argument
                        */
                        public final void onClick(android.view.View r18) {
                            /*
                                Method dump skipped, instructions count: 602
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC19817.onClick(android.view.View):void");
                        }
                    });
                    break;
                case -629012643:
                case 770967665:
                    i55 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    spannableString3 = spannableString6;
                    i58 = i78;
                    boolean z30 = z17 ? 1 : 0;
                    i59 = i94;
                    if (i77 == (C0630.m2566(C1047.m3603(f17942, 532, 3, i80)) ^ 2121623727)) {
                        m25663 = C2105.m6981("ۙܳ") ^ i73;
                        i60 = ((m25663 ^ i74) * (-23739)) ^ (-1649923380);
                        i66 = 1187846916;
                        z13 = z30;
                    } else {
                        m25663 = (C0630.m2566("ۧ᩶") ^ i73) * 37;
                        i60 = ((m25663 ^ i74) * (-25705)) ^ 682753901;
                        i66 = 242284925;
                        z13 = z30;
                    }
                    i62 = m25663 ^ i66;
                    z10 = z13;
                    i94 = i59;
                    i79 = i55;
                    z12 = z10;
                    i78 = i58;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case -588847556:
                case 735122698:
                    i12 = i96;
                    i14 = i90;
                    int i122 = i93;
                    C19258 m59122 = C1773.m5912(this);
                    spannableString2 = spannableString6;
                    i18 = i78;
                    i11 = i79;
                    C3432.m10490(m59122, C0630.m2566(C2958.m9031(f17942, 548, 3, i80)) ^ 2118400182);
                    C1916.m6295(m59122, C2105.m6981(C2958.m9031(f17942, 551, 3, i80)) ^ 2119055428);
                    if (C3537.f11231 < 0) {
                        ViewOnClickListenerC1958.m6441(m59122, C2105.m6981(C1916.m6311(f17942, 554, 3, i80)) ^ 2125768354, new DialogInterfaceOnClickListenerC19257(z17 ? 1 : 0, this));
                        C2520.m8029(m59122, C2105.m6981(C3245.m9934(f17942, 557, 3, i80)) ^ 2119347200, obj);
                        RunnableC0588.m2438(m59122);
                        break;
                    } else {
                        textInputLayout = textInputLayout6;
                        z14 = z17 ? 1 : 0;
                        i15 = i94;
                        str = str7;
                        view4 = view11;
                        i17 = i122;
                        view3 = view12;
                        i13 = i87;
                        editText = editText8;
                        i16 = i86;
                        sArr2 = sArr6;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i10022 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i10022;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i10122222 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i10122222;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i102222222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i102222222;
                    }
                case -570622265:
                case 1125290278:
                    int i123 = i79;
                    int i124 = i96;
                    View view16 = view12;
                    TextInputLayout textInputLayout15 = textInputLayout6;
                    int i125 = i87;
                    EditText editText13 = editText8;
                    int i126 = i90;
                    SpannableString spannableString7 = spannableString6;
                    int i127 = i85;
                    int i128 = i86;
                    short[] sArr9 = sArr6;
                    int i129 = i81;
                    String str8 = str6;
                    EditText editText14 = editText7;
                    int i130 = i84;
                    TextInputLayout textInputLayout16 = textInputLayout7;
                    View view17 = view10;
                    int i131 = i93;
                    int i132 = i78;
                    boolean z31 = z17 ? 1 : 0;
                    int i133 = i94;
                    String str9 = str7;
                    View view18 = view11;
                    if (i77 == (C2105.m6981(C0237.m1483(f17942, FloatingActionButton.AUTO_MINI_LARGEST_SCREEN_WIDTH, 3, i80)) ^ 2120775946)) {
                        m69812 = (C0630.m2566("ۡܶ") ^ i73) * (-43);
                        i36 = ((m69812 ^ i74) * (-30165)) ^ (-1036451244);
                        i37 = -1973226743;
                    } else {
                        m69812 = C2105.m6981("᩺۟") ^ i74;
                        i36 = ((m69812 ^ i73) * 5755) ^ (-918333752);
                        i37 = 1746843117;
                    }
                    int i134 = m69812 ^ i37;
                    view10 = view17;
                    textInputLayout7 = textInputLayout16;
                    i78 = i132;
                    i84 = i130;
                    i93 = i131;
                    i81 = i129;
                    view11 = view18;
                    sArr6 = sArr9;
                    i86 = i128;
                    str7 = str9;
                    editText8 = editText13;
                    i94 = i133;
                    i87 = i125;
                    z17 = z31;
                    textInputLayout6 = textInputLayout15;
                    view12 = view16;
                    i79 = i123;
                    i76 = i134;
                    i75 = i36;
                    spannableString6 = spannableString7;
                    i90 = i126;
                    i96 = i124;
                    editText7 = editText14;
                    str6 = str8;
                    i85 = i127;
                case -554984479:
                case 478905990:
                    m16399();
                    break;
                case -475381239:
                case 127617016:
                    i68 = i96;
                    if (i77 == (C0630.m2566(C3537.m10748(f17942, 576, 3, i80)) ^ 2097687319)) {
                        m69816 = C2105.m6981("᩵ۤ") ^ i73;
                        i69 = ((m69816 ^ i74) * (-10771)) ^ (-337823710);
                        i70 = 1061868002;
                    } else {
                        m69816 = (C2105.m6981("ۘ֨") ^ i74) * 3;
                        i69 = ((m69816 ^ i73) * 9325) ^ 1527848999;
                        i70 = 394809474;
                    }
                    int i97222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i97222222;
                    z17 = z17;
                    i75 = i69;
                case -446026162:
                case 523861112:
                    C3663.m11168();
                    ViewOnClickListenerC1958.m6429();
                    m69817 = (C2105.m6981("ܺ۫") ^ i73) * (-113);
                    i69 = ((m69817 ^ i74) * 31977) ^ (-1609057471);
                    i71 = -214719364;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case -422448112:
                case 58794015:
                    int i135 = z17 ? 1 : 0;
                    C0287.m1629(textInputLayout6);
                    final EditText editText15 = editText7;
                    RunnableC1937.m6377(editText15, C23196.m51463());
                    editText15.setSelection(i135, RunnableC1937.m6384(editText15));
                    C19258 m59123 = C1773.m5912(this);
                    View view19 = view12;
                    C0798.m3013(m59123, view19);
                    final DialogInterfaceC0206 m24382 = RunnableC0588.m2438(m59123);
                    C4925.m14329(editText15);
                    final TextInputLayout textInputLayout17 = textInputLayout6;
                    C2126.m7039(C11340.m28028(view19, i87), new View.OnClickListener() { // from class: l.۠֡ۡ
                        {
                            int i136 = 1107014000;
                            int i137 = C4263.f13799;
                            int i138 = C3537.f11231;
                            int m256610 = C0630.m2566("ۖۡ") ^ i137;
                            int i139 = ((m256610 ^ i138) * 31159) ^ 100507760;
                            int i140 = 1449366325;
                            while (true) {
                                i136 = ((((i136 ^ i138) * (-16885)) >> 31) & i139) ^ (m256610 ^ i140);
                                switch (i136) {
                                    case -1865022832:
                                    case -395401314:
                                        if (C3019.f9544 >= 0) {
                                            m256610 = (C2105.m6981("᩻ܺ") + i137) * (-73);
                                            i139 = ((m256610 ^ i138) * (-12655)) ^ (-1659559657);
                                            i140 = 1800890890;
                                        } else {
                                            m256610 = C2105.m6981("֡ܺ") ^ i137;
                                            i139 = ((m256610 ^ i138) * 21769) ^ 269561324;
                                            i140 = 25553708;
                                        }
                                    case -1661230252:
                                    case 1076569479:
                                        return;
                                    case -1509188605:
                                    case -1239112327:
                                        RunnableC0588.m2441();
                                        if (AbstractC2021.f6743 > 0) {
                                            m256610 = C2105.m6981("ܺ᩶") ^ i138;
                                            i139 = ((m256610 ^ i137) * 30507) ^ (-447246932);
                                            i140 = -456320126;
                                        } else {
                                            m256610 = (C2105.m6981("᩻ܺ") + i137) * (-73);
                                            i139 = ((m256610 ^ i138) * (-12655)) ^ (-1659559657);
                                            i140 = 1800890890;
                                        }
                                    case -1470655180:
                                    case 769750892:
                                        if (C0237.f1507 != 0) {
                                            m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                            i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                            i140 = 1006071319;
                                        } else {
                                            m256610 = (C2105.m6981("ۘۙ") ^ i138) * (-115);
                                            i139 = ((m256610 ^ i137) * (-12407)) ^ 384779537;
                                            i140 = 1498565599;
                                        }
                                    case -1469051886:
                                    case 896855476:
                                        AbstractC2021.m6574();
                                        C0630.m2564();
                                        m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                        i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                        i140 = 1006071319;
                                    case -932492441:
                                    case 1445255397:
                                        if (C1916.f6442) {
                                            m256610 = (C2105.m6981("ܰ᩹") + i138) * 37;
                                            i139 = ((m256610 ^ i137) * 2431) ^ (-989530694);
                                            i140 = -753308309;
                                        } else {
                                            m256610 = (C2105.m6981("ܿۚ") + i137) * (-95);
                                            i139 = ((m256610 ^ i138) * (-26565)) ^ 1477887026;
                                            i140 = 1865622316;
                                        }
                                    case -672453416:
                                    case -224164731:
                                        if (C4263.m12819() >= 0) {
                                            m256610 = (C2105.m6981("ܿۚ") + i137) * (-95);
                                            i139 = ((m256610 ^ i138) * (-26565)) ^ 1477887026;
                                            i140 = 1865622316;
                                        } else {
                                            m256610 = C0630.m2566("֡۠") ^ i137;
                                            i139 = ((m256610 ^ i138) * (-11993)) ^ 2117227977;
                                            i140 = 1652049042;
                                        }
                                    case -626139186:
                                    case -28970833:
                                        if (ViewOnClickListenerC1958.f6529 <= 0) {
                                            m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                            i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                            i140 = 1006071319;
                                        } else {
                                            m256610 = (C0630.m2566("ۗۜ") ^ i138) * 19;
                                            i139 = ((m256610 ^ i137) * 11507) ^ 894923349;
                                            i140 = 918647550;
                                        }
                                    case -626127995:
                                    case 874788711:
                                        if (C1128.f4106 <= 0) {
                                            m256610 = C2105.m6981("ܺ᩶") ^ i138;
                                            i139 = ((m256610 ^ i137) * 30507) ^ (-447246932);
                                            i140 = -456320126;
                                        } else {
                                            m256610 = (C2105.m6981("֡ܿ") ^ i137) * (-81);
                                            i139 = ((m256610 ^ i138) * (-1433)) ^ (-1812677338);
                                            i140 = 1641831679;
                                        }
                                    case -621695511:
                                    case 1344836553:
                                        if (C0483.f2088 >= 0) {
                                            m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                            i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                            i140 = 1006071319;
                                        } else {
                                            m256610 = C0630.m2566("ܶۨ") ^ i138;
                                            i139 = ((m256610 ^ i137) * 15207) ^ (-1645471854);
                                            i140 = -442639009;
                                        }
                                    case -383568854:
                                    case -185201228:
                                        if (C22628.m50615() != 0) {
                                            m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                            i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                            i140 = 1006071319;
                                        } else {
                                            m256610 = C2105.m6981("ۙᩳ") ^ i137;
                                            i139 = ((m256610 ^ i138) * (-21891)) ^ 737234981;
                                            i140 = -956349673;
                                        }
                                    case 903444413:
                                    case 1810011362:
                                        if (C11340.f33930 >= 0) {
                                            m256610 = (C2105.m6981("ܿۚ") + i137) * (-95);
                                            i139 = ((m256610 ^ i138) * (-26565)) ^ 1477887026;
                                            i140 = 1865622316;
                                        } else {
                                            m256610 = C2105.m6981("᩵ۗ") ^ i138;
                                            i139 = ((m256610 ^ i137) * (-26377)) ^ (-563515264);
                                            i140 = 189504161;
                                        }
                                    case 1396576103:
                                    case 2073785547:
                                        C3683.m11222();
                                        if (C0714.f2697 < 0) {
                                            m256610 = (i137 - C2105.m6981("ۜ᩹")) * (-57);
                                            i139 = ((m256610 ^ i138) * (-6901)) ^ (-664814728);
                                            i140 = 1006071319;
                                        } else {
                                            m256610 = C2105.m6981("ܺ᩶") ^ i138;
                                            i139 = ((m256610 ^ i137) * 30507) ^ (-447246932);
                                            i140 = -456320126;
                                        }
                                    case 1648320726:
                                    case 1786929769:
                                        if (C21923.f70183 != 0) {
                                            m256610 = (C2105.m6981("᩻ܺ") + i137) * (-73);
                                            i139 = ((m256610 ^ i138) * (-12655)) ^ (-1659559657);
                                            i140 = 1800890890;
                                        } else {
                                            m256610 = (C2105.m6981("ᩳۛ") ^ i137) * (-75);
                                            i139 = ((m256610 ^ i138) * 25803) ^ (-294365674);
                                            i140 = 7518292;
                                        }
                                    case 1816624538:
                                    case 2014488175:
                                        C3911.m11924();
                                        C0714.m2805();
                                        throw new RuntimeException();
                                    default:
                                        if (C4263.f13799 <= 0) {
                                            m256610 = C2105.m6981("ܺ᩶") ^ i138;
                                            i139 = ((m256610 ^ i137) * 30507) ^ (-447246932);
                                            i140 = -456320126;
                                        } else {
                                            m256610 = (C2105.m6981("۫۠") ^ i138) * (-119);
                                            i139 = ((m256610 ^ i137) * 15877) ^ 523144485;
                                            i140 = 1986643747;
                                        }
                                }
                            }
                        }

                        @Override // android.view.View.OnClickListener
                        public final void onClick(View view20) {
                            DialogInterfaceC0206 dialogInterfaceC0206 = null;
                            ViewOnClickListenerC5850 viewOnClickListenerC5850 = null;
                            int i136 = -805872554;
                            int i137 = C3537.f11231;
                            int i138 = C3019.f9544;
                            int m698111 = (C2105.m6981("ۘۨ") + i137) * (-49);
                            int i139 = ((m698111 ^ i138) * (-17085)) ^ (-1073537146);
                            int i140 = 670701561;
                            while (true) {
                                i136 = ((((i136 ^ i138) * (-18045)) >> 31) & i139) ^ (m698111 ^ i140);
                                switch (i136) {
                                    case -2106925976:
                                    case -2001040063:
                                        AbstractC2021.m6574();
                                        if (C1916.f6442) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = (C2105.m6981("᩷ۤ") + i137) * 13;
                                            i139 = ((m698111 ^ i138) * 18771) ^ (-1437865745);
                                            i140 = -114675963;
                                        }
                                    case -1859687073:
                                    case -1249866359:
                                        if (C0483.f2088 >= 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = (i137 - C2105.m6981("ܰ۬")) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                                            i139 = ((m698111 ^ i138) * 20845) ^ (-132855650);
                                            i140 = 1144037973;
                                        }
                                    case -1659290445:
                                    case 137510515:
                                        if (RunnableC1937.f6483 >= 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = C2105.m6981("᩵᩹") ^ i138;
                                            i139 = ((m698111 ^ i137) * (-19855)) ^ 416069970;
                                            i140 = -151102960;
                                        }
                                    case -1294767384:
                                    case 263586219:
                                        if (C3663.f11553) {
                                            m698111 = (C2105.m6981("᩷ۤ") + i137) * 13;
                                            i139 = ((m698111 ^ i138) * 18771) ^ (-1437865745);
                                            i140 = -114675963;
                                        } else {
                                            m698111 = (C2105.m6981("᩸ۘ") + i137) * (-13);
                                            i139 = ((m698111 ^ i138) * (-28093)) ^ 668889016;
                                            i140 = -1894268642;
                                        }
                                    case -1033646566:
                                    case 1176831969:
                                        ViewOnClickListenerC5850.m16392(editText15, dialogInterfaceC0206, viewOnClickListenerC5850, textInputLayout17);
                                        break;
                                    case -922880572:
                                    case 2757907:
                                        if (C3245.f10203 <= 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = C2105.m6981("ܿ֨") ^ i138;
                                            i139 = ((m698111 ^ i137) * (-23779)) ^ (-690754735);
                                            i140 = 1478615600;
                                        }
                                    case -865346315:
                                    case -727172681:
                                        if (C2105.m6982() != 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = (C2105.m6981("֫ۘ") ^ i138) * 23;
                                            i139 = ((m698111 ^ i137) * 4527) ^ 1859965366;
                                            i140 = -1556767013;
                                        }
                                    case -95868192:
                                    case 889023849:
                                        if (C0630.m2564()) {
                                            m698111 = (C2105.m6981("᩷ۤ") + i137) * 13;
                                            i139 = ((m698111 ^ i138) * 18771) ^ (-1437865745);
                                            i140 = -114675963;
                                        } else {
                                            m698111 = (C2105.m6981("ܽᩳ") ^ i137) * 11;
                                            i139 = ((m698111 ^ i138) * 27949) ^ (-1906369501);
                                            i140 = -905941648;
                                        }
                                    case -57630657:
                                    case 427465115:
                                        if (C1128.m3851() <= 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = (i137 - C0630.m2566("۠᩷")) * (-55);
                                            i139 = ((m698111 ^ i138) * 21047) ^ (-157245137);
                                            i140 = 1025116542;
                                        }
                                    case 254811992:
                                    case 1786287458:
                                        if (C1504.f5354) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = C2105.m6981("֡ܶ") ^ i137;
                                            i139 = ((m698111 ^ i138) * (-24119)) ^ 459874175;
                                            i140 = -455471738;
                                        }
                                    case 334602280:
                                    case 459054404:
                                        if (C3537.m10746() <= 0) {
                                            m698111 = (C2105.m6981("᩺᩹") + i138) * 127;
                                            i139 = ((m698111 ^ i137) * (-22445)) ^ 2009013634;
                                            i140 = 1444205753;
                                        } else {
                                            m698111 = C2105.m6981("᩻ۚ") ^ i138;
                                            i139 = ((m698111 ^ i137) * 12035) ^ (-1451315403);
                                            i140 = -493703913;
                                        }
                                    case 455246273:
                                    case 895726713:
                                        dialogInterfaceC0206 = m24382;
                                        if (C2126.f7087) {
                                            m698111 = (C2105.m6981("᩺᩹") + i138) * 127;
                                            i139 = ((m698111 ^ i137) * (-22445)) ^ 2009013634;
                                            i140 = 1444205753;
                                        } else {
                                            m698111 = C2105.m6981("ۢۙ") ^ i138;
                                            i139 = ((m698111 ^ i137) * (-28261)) ^ (-1671804360);
                                            i140 = -2054123965;
                                        }
                                    case 612444478:
                                    case 1827044126:
                                        C3746.m11369();
                                        C1916.m6308();
                                        m698111 = (C2105.m6981("᩷ۤ") + i137) * 13;
                                        i139 = ((m698111 ^ i138) * 18771) ^ (-1437865745);
                                        i140 = -114675963;
                                    case 662799587:
                                    case 1748097924:
                                        viewOnClickListenerC5850 = this;
                                        if (C2126.f7087) {
                                            m698111 = (C2105.m6981("᩺᩹") + i138) * 127;
                                            i139 = ((m698111 ^ i137) * (-22445)) ^ 2009013634;
                                            i140 = 1444205753;
                                        } else {
                                            m698111 = (C2105.m6981("᩻᩶") ^ i137) * 5;
                                            i139 = ((m698111 ^ i138) * 5599) ^ 602954560;
                                            i140 = -624918193;
                                        }
                                    case 1604685230:
                                    case 2142987456:
                                        C0237.m1481();
                                        C2105.m6982();
                                        break;
                                    default:
                                        if (C2520.f8000 < 0) {
                                            m698111 = (C0630.m2566("᩺֨") ^ i138) * UMErrorCode.E_UM_BE_EMPTY_URL_PATH;
                                            i139 = ((m698111 ^ i137) * 32597) ^ 2089260692;
                                            i140 = 1023450800;
                                        } else {
                                            m698111 = (C2105.m6981("ܽ۟") ^ i138) * 85;
                                            i139 = ((m698111 ^ i137) * (-11403)) ^ 1731630265;
                                            i140 = 1693654386;
                                        }
                                }
                                return;
                            }
                        }
                    });
                    break;
                case -339654841:
                case 1027368503:
                    i78++;
                    i89 = i79;
                    m69817 = C2105.m6981("֡᩷") ^ i74;
                    i69 = ((m69817 ^ i73) * (-11431)) ^ (-1137444590);
                    i71 = 237833704;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case -322308799:
                case 100482495:
                    ServiceConnectionC3453.m10570(this, new Intent(this, (Class<?>) ActivityC6242.class));
                    break;
                case -302117234:
                case 387065786:
                    i68 = i96;
                    c192583 = C0483.m2130(this);
                    C0382.m1849(c192583, C2105.m6981(C4075.m12252(f17942, 582, 3, i80)) ^ 2098098248);
                    C3019.m9252(c192583, spannableString6);
                    i92 = C2105.m6981(C7811.m20837(f17942, GF16Utils.GF16_MASK, 3, i80));
                    if (!C3663.f11553) {
                        m69816 = (C2105.m6981("᩺ܰ") ^ i74) * IShizukuService.Stub.TRANSACTION_dispatchPermissionConfirmationResult;
                        i69 = ((m69816 ^ i73) * (-16095)) ^ (-496989254);
                        i70 = -1667105835;
                        int i972222222 = m69816 ^ i70;
                        i96 = i68;
                        i76 = i972222222;
                        z17 = z17;
                        i75 = i69;
                    }
                    m69816 = C0630.m2566("ܳۙ") ^ i73;
                    i69 = ((m69816 ^ i74) * (-19047)) ^ (-589930887);
                    i70 = -651305190;
                    int i9722222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i9722222222;
                    z17 = z17;
                    i75 = i69;
                case -184204631:
                case 79168147:
                    i68 = i96;
                    i79 = i89 + C1711.m5741(strArr[i78]) + 3;
                    if (i79 < spannableString6.length()) {
                        m69816 = (C0630.m2566("ܶܽ") ^ i74) * 119;
                        i69 = ((m69816 ^ i73) * 17841) ^ (-222629459);
                        i70 = -599403585;
                        int i97222222222 = m69816 ^ i70;
                        i96 = i68;
                        i76 = i97222222222;
                        z17 = z17;
                        i75 = i69;
                    }
                    m69816 = C0630.m2566("֨ۚ") ^ i74;
                    i69 = ((m69816 ^ i73) * 22073) ^ (-1707477888);
                    i70 = -1842059730;
                    int i972222222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i972222222222;
                    z17 = z17;
                    i75 = i69;
                case -76080718:
                case 572996398:
                    int i136 = i79;
                    int i137 = i94;
                    int i138 = i96;
                    TextInputLayout textInputLayout18 = textInputLayout7;
                    View view20 = view12;
                    TextInputLayout textInputLayout19 = textInputLayout6;
                    View view21 = view10;
                    View view22 = view11;
                    EditText editText16 = editText8;
                    int i139 = i90;
                    int i140 = i93;
                    SpannableString spannableString8 = spannableString6;
                    int i141 = i78;
                    int i142 = i86;
                    short[] sArr10 = sArr6;
                    int i143 = i81;
                    int i144 = i85;
                    String str10 = str6;
                    EditText editText17 = editText7;
                    int m256610 = C0630.m2566(C4159.m12578(f17942, Scalar448.TARGET_LENGTH, 3, i80)) ^ 2102776127;
                    int m256611 = C0630.m2566(C1294.m4373(f17942, Ed448.PRECOMP_RANGE, 3, i80)) ^ 2102756544;
                    String m12355 = C4117.m12355(f17942, 453, 17, i80);
                    int i145 = i95;
                    if (i77 == i145) {
                        int m256612 = C0630.m2566("ۨۚ") ^ i74;
                        i75 = ((m256612 ^ i73) * (-9089)) ^ 2132558000;
                        textInputLayout6 = textInputLayout19;
                        view12 = view20;
                        view10 = view21;
                        textInputLayout7 = textInputLayout18;
                        i79 = i136;
                        i84 = m256610;
                        i95 = i145;
                        i94 = i137;
                        z17 = false;
                        i87 = m256611;
                        spannableString6 = spannableString8;
                        i90 = i139;
                        i96 = i138;
                        i76 = m256612 ^ (-1417639611);
                        i81 = i143;
                        sArr6 = sArr10;
                        i86 = i142;
                        editText8 = editText16;
                    } else {
                        int m698111 = C2105.m6981("ۡܽ") ^ i74;
                        textInputLayout6 = textInputLayout19;
                        view12 = view20;
                        view10 = view21;
                        textInputLayout7 = textInputLayout18;
                        i79 = i136;
                        i84 = m256610;
                        i95 = i145;
                        i94 = i137;
                        z17 = false;
                        i76 = m698111 ^ (-333776015);
                        i75 = ((m698111 ^ i73) * (-10421)) ^ (-1947089205);
                        i81 = i143;
                        sArr6 = sArr10;
                        i86 = i142;
                        editText8 = editText16;
                        i87 = m256611;
                        spannableString6 = spannableString8;
                        i90 = i139;
                        i96 = i138;
                    }
                    str7 = m12355;
                    i78 = i141;
                    i93 = i140;
                    view11 = view22;
                    editText7 = editText17;
                    str6 = str10;
                    i85 = i144;
                case 51059277:
                case 761732960:
                    i55 = i79;
                    i56 = i96;
                    i27 = i90;
                    i57 = i93;
                    short[] sArr11 = sArr6;
                    spannableString3 = spannableString6;
                    i58 = i78;
                    z10 = z17 ? 1 : 0;
                    i59 = i94;
                    if (i77 == (C0630.m2566(C0630.m2575(f17942, 503, 3, i80)) ^ 2122927627)) {
                        m69813 = C2105.m6981("֡ۗ") ^ i74;
                        i60 = ((m69813 ^ i73) * 10851) ^ 1882307803;
                        i61 = -1283226117;
                    } else {
                        m69813 = (i74 - C2105.m6981("ۘ᩵")) * IShizukuService.Stub.TRANSACTION_dispatchPackageChanged;
                        i60 = ((m69813 ^ i73) * (-15357)) ^ (-1914746778);
                        i61 = -140208496;
                    }
                    i62 = m69813 ^ i61;
                    sArr6 = sArr11;
                    i94 = i59;
                    i79 = i55;
                    z12 = z10;
                    i78 = i58;
                    i93 = i57;
                    i63 = i56;
                    i76 = i62;
                    i75 = i60;
                    z17 = z12;
                    spannableString6 = spannableString3;
                    i90 = i27;
                    i96 = i63;
                case 76080028:
                case 1032194940:
                    i24 = i79;
                    i25 = i96;
                    int i146 = i87;
                    editText3 = editText8;
                    i27 = i90;
                    spannableString3 = spannableString6;
                    i34 = i85;
                    i29 = i86;
                    sArr3 = sArr6;
                    i32 = i81;
                    str3 = str6;
                    i33 = i84;
                    textInputLayout3 = textInputLayout7;
                    view7 = view10;
                    int i147 = i93;
                    i31 = i78;
                    boolean z32 = z17 ? 1 : 0;
                    i28 = i94;
                    str4 = str7;
                    view6 = view11;
                    i30 = i147;
                    view8 = C3019.m9259(this, C0630.m2566(C4075.m12252(f17942, 473, 3, i80)) ^ 2101893688);
                    View m280282 = C11340.m28028(view8, i33);
                    C2126.m7031(m280282, str4);
                    textInputLayout6 = (TextInputLayout) m280282;
                    editText7 = (EditText) C1005.m3507(view8, i34);
                    if (ServiceConnectionC3453.f10921 >= 0) {
                        i26 = i146;
                        textInputLayout4 = textInputLayout6;
                        z6 = z32;
                        z7 = z6;
                        int m25665222 = (i73 - C0630.m2566("ۡۚ")) * (-97);
                        i69 = ((m25665222 ^ i74) * (-24963)) ^ (-1191823552);
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        str6 = str3;
                        i85 = i34;
                        i84 = i33;
                        spannableString6 = spannableString3;
                        i81 = i32;
                        i90 = i27;
                        sArr6 = sArr3;
                        i86 = i29;
                        i96 = i25;
                        i76 = m25665222 ^ 565756069;
                        editText8 = editText3;
                        i78 = i31;
                        i87 = i26;
                        i93 = i30;
                        view12 = view8;
                        view11 = view6;
                        i79 = i24;
                        str7 = str4;
                        i94 = i28;
                        z17 = z7;
                        textInputLayout6 = textInputLayout4;
                        i75 = i69;
                    } else {
                        int m698112 = (C2105.m6981("ܶ۠") + i73) * 9;
                        view12 = view8;
                        view10 = view7;
                        textInputLayout7 = textInputLayout3;
                        i79 = i24;
                        i84 = i33;
                        i81 = i32;
                        sArr6 = sArr3;
                        i86 = i29;
                        editText8 = editText3;
                        i87 = i146;
                        i75 = ((m698112 ^ i74) * (-27847)) ^ (-947372465);
                        str6 = str3;
                        i85 = i34;
                        spannableString6 = spannableString3;
                        i90 = i27;
                        i96 = i25;
                        i76 = m698112 ^ (-87987596);
                        z8 = z32;
                        int i114222 = i28;
                        z17 = z8;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i114222;
                    }
                case 293967995:
                case 1804107303:
                    i68 = i96;
                    if (i77 == (C2105.m6981(ViewOnClickListenerC1958.m6435(f17942, 566, 3, i80)) ^ 2120866398)) {
                        m69816 = (C0630.m2566("ۨ۟") ^ i73) * (-25);
                        i69 = ((m69816 ^ i74) * 29305) ^ 2021343985;
                        i70 = 1671705223;
                    } else {
                        m69816 = C2105.m6981("ܺ֨") ^ i74;
                        i69 = ((m69816 ^ i73) * (-771)) ^ 1664523711;
                        i70 = 1647376879;
                    }
                    int i9722222222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i9722222222222;
                    z17 = z17;
                    i75 = i69;
                case 376053228:
                case 445718387:
                    i68 = i96;
                    if (i77 == (C2105.m6981(C4159.m12578(f17942, 579, 3, i80)) ^ 2098891443)) {
                        m69816 = (C2105.m6981("ܳۗ") ^ i73) * (-67);
                        i69 = ((m69816 ^ i74) * (-17545)) ^ (-874585371);
                        i70 = -1087906835;
                        int i97222222222222 = m69816 ^ i70;
                        i96 = i68;
                        i76 = i97222222222222;
                        z17 = z17;
                        i75 = i69;
                    }
                    m69816 = C0630.m2566("᩵ܿ") ^ i74;
                    i69 = ((m69816 ^ i73) * (-8353)) ^ 968558613;
                    i70 = -1076659345;
                    int i972222222222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i972222222222222;
                    z17 = z17;
                    i75 = i69;
                case 488020637:
                case 2129908697:
                    m16398();
                    break;
                case 615213992:
                case 1414872181:
                    C2105.m6982();
                    if (C7106.f21815 != 0) {
                        i11 = i79;
                        i12 = i96;
                        view3 = view12;
                        textInputLayout = textInputLayout6;
                        i13 = i87;
                        editText = editText8;
                        i14 = i90;
                        z14 = z17 ? 1 : 0;
                        spannableString2 = spannableString6;
                        i15 = i94;
                        str = str7;
                        i16 = i86;
                        view4 = view11;
                        i17 = i93;
                        sArr2 = sArr6;
                        i18 = i78;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i100222 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i100222;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i101222222 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i101222222;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i1022222222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i1022222222;
                    } else {
                        m69817 = (C2105.m6981("ۚۘ") ^ i74) * (-103);
                        i69 = ((m69817 ^ i73) * 24357) ^ 1543569333;
                        i71 = -1152391690;
                        i76 = m69817 ^ i71;
                        z17 = z17;
                        i75 = i69;
                    }
                case 639354553:
                case 659639406:
                    i11 = i79;
                    i12 = i96;
                    view3 = view12;
                    textInputLayout = textInputLayout6;
                    i13 = i87;
                    editText = editText8;
                    i14 = i90;
                    boolean z33 = z17 ? 1 : 0;
                    spannableString2 = spannableString6;
                    i15 = i94;
                    str = str7;
                    i16 = i86;
                    view4 = view11;
                    i17 = i93;
                    sArr2 = sArr6;
                    i18 = i78;
                    i19 = i81;
                    i20 = i84;
                    textInputLayout2 = textInputLayout7;
                    view5 = view10;
                    int i148 = i85;
                    str2 = str6;
                    editText2 = editText7;
                    i21 = i148;
                    short s = f17942[439];
                    int i149 = s + 18807;
                    int i150 = (s * s) + 353703249;
                    if ((i149 * i149) - (i150 + i150) > 0) {
                        m6981 = C2105.m6981("ܰۙ") ^ i74;
                        i22 = ((m6981 ^ i73) * (-14731)) ^ 237701047;
                        i23 = 719624578;
                        z15 = z33;
                    } else {
                        m6981 = C2105.m6981("᩷ۚ") ^ i73;
                        i22 = ((m6981 ^ i74) * 5237) ^ (-1136273988);
                        i23 = 1280543048;
                        z15 = z33;
                    }
                    int i1012222222 = m6981 ^ i23;
                    view10 = view5;
                    textInputLayout7 = textInputLayout2;
                    spannableString6 = spannableString2;
                    i84 = i20;
                    i90 = i14;
                    i96 = i12;
                    i81 = i19;
                    i76 = i1012222222;
                    i75 = i22;
                    sArr6 = sArr2;
                    i86 = i16;
                    i78 = i18;
                    i93 = i17;
                    editText8 = editText;
                    i87 = i13;
                    view11 = view4;
                    str7 = str;
                    view12 = view3;
                    i94 = i15;
                    z17 = z15;
                    textInputLayout6 = textInputLayout;
                    i79 = i11;
                    int i10222222222 = i21;
                    editText7 = editText2;
                    str6 = str2;
                    i85 = i10222222222;
                case 684980603:
                case 1749049146:
                    C5695.m16023();
                    if (C1005.f3721) {
                        i11 = i79;
                        i12 = i96;
                        view3 = view12;
                        textInputLayout = textInputLayout6;
                        i13 = i87;
                        editText = editText8;
                        i14 = i90;
                        z14 = z17 ? 1 : 0;
                        spannableString2 = spannableString6;
                        i15 = i94;
                        str = str7;
                        i16 = i86;
                        view4 = view11;
                        i17 = i93;
                        sArr2 = sArr6;
                        i18 = i78;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i1002222 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i1002222;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i10122222222 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i10122222222;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i102222222222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i102222222222;
                    } else {
                        i = i79;
                        i2 = i96;
                        c19258 = c192582;
                        i3 = i86;
                        i4 = i87;
                        i5 = i90;
                        sArr = sArr6;
                        spannableString = spannableString6;
                        view2 = view11;
                        i6 = i93;
                        i7 = i78;
                        z = z17 ? 1 : 0;
                        i8 = i94;
                        m2566 = (C0630.m2566("֡۟") ^ i73) * 13;
                        i9 = ((m2566 ^ i74) * 4745) ^ 1681353921;
                        i10 = -1537468662;
                        z2 = z;
                        int i151 = m2566 ^ i10;
                        i87 = i4;
                        i75 = i9;
                        sArr6 = sArr;
                        i86 = i3;
                        c192582 = c19258;
                        i79 = i;
                        int i152 = i6;
                        view11 = view2;
                        spannableString6 = spannableString;
                        i90 = i5;
                        i96 = i2;
                        i76 = i151;
                        i94 = i8;
                        z17 = z2;
                        i78 = i7;
                        i93 = i152;
                    }
                case 748556166:
                case 1461507184:
                    ViewOnClickListenerC1958.m6441(c192583, i92 ^ 2125299710, obj);
                    C5695.m16017(c192583, C2105.m6981(C1773.m5917(f17942, 588, 3, i80)) ^ 2100237717, new DialogInterface.OnClickListener() { // from class: l.۠ۚۡ

                        /* renamed from: ֫᩺ܰ, reason: not valid java name and contains not printable characters */
                        private static final short[] f24609 = {2143, 32564, 32550, 32555, 32629, -1591, 10156, 4684};

                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i153) {
                            InterfaceC13049 interfaceC13049;
                            InterfaceC13049 interfaceC130492;
                            int m256613;
                            InterfaceC13049 interfaceC130493;
                            int i154;
                            int i155;
                            int m256614;
                            int i156;
                            int i157;
                            short[] sArr12;
                            InterfaceC13049 interfaceC130494;
                            int i158;
                            String str11;
                            int i159;
                            int i160;
                            int i161;
                            int i162 = C0050.f910;
                            int i163 = ServiceConnectionC3453.f10921;
                            int m698113 = (i162 - C2105.m6981("ۡۘ")) * UMErrorCode.E_UM_BE_CREATE_FAILED;
                            int i164 = ((m698113 ^ i163) * 27671) ^ (-1992283341);
                            String str12 = null;
                            short[] sArr13 = null;
                            short[] sArr14 = null;
                            short[] sArr15 = null;
                            int i165 = m698113 ^ (-596913092);
                            int i166 = 0;
                            int i167 = 0;
                            short s2 = 0;
                            int i168 = 0;
                            int i169 = 0;
                            int i170 = 0;
                            int i171 = 0;
                            int i172 = 0;
                            int i173 = -915589471;
                            InterfaceC13049 interfaceC130495 = null;
                            InterfaceC13049 interfaceC130496 = null;
                            while (true) {
                                i173 = i165 ^ (i164 & (((i173 ^ i163) * (-23395)) >> 31));
                                switch (i173) {
                                    case -2101875931:
                                    case 1563050566:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        i170 = 32583;
                                        m256614 = C0630.m2566("֡ܿ") ^ i163;
                                        i156 = ((m256614 ^ i162) * 25253) ^ (-967796242);
                                        i157 = -438224136;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case -1570781000:
                                    case -159949985:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        i171 = 1;
                                        i172 = 4;
                                        if (C3746.f11829 > 0) {
                                            m256614 = C0630.m2566("ᩴᩳ") ^ i163;
                                            i156 = ((m256614 ^ i162) * (-31645)) ^ (-771479179);
                                            i157 = -550784059;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                        m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                        i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                        i157 = 1114470979;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case -1542581979:
                                    case -1174635364:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        if (i168 - (239878144 + i169) <= 0) {
                                            m256614 = C2105.m6981("ۛۙ") ^ i162;
                                            i156 = ((m256614 ^ i163) * 6449) ^ (-111338954);
                                            i157 = 2115120432;
                                        } else {
                                            m256614 = (C2105.m6981("ۜۤ") ^ i163) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                                            i156 = ((m256614 ^ i162) * 3913) ^ (-3162190);
                                            i157 = -592918466;
                                        }
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case -1300736518:
                                    case 1461912366:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        i168 = s2 * 30976;
                                        i169 = s2 * s2;
                                        if (C3911.f12484 < 0) {
                                            m256614 = C0630.m2566("᩶ܳ") ^ i163;
                                            i156 = ((m256614 ^ i162) * 26763) ^ 128993979;
                                            i157 = 1224400680;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                        m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                        i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                        i157 = 1114470979;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case -1254443747:
                                    case 1424942856:
                                        i166 = C0630.m2566(str12);
                                        if (C3683.m11222()) {
                                            interfaceC13049 = interfaceC130496;
                                            interfaceC130492 = interfaceC130495;
                                            i167 = 2098089140;
                                            m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                            i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                            i157 = 1114470979;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        } else {
                                            int m256615 = C0630.m2566("ۨᩳ") ^ i163;
                                            i165 = m256615 ^ 1420531522;
                                            i164 = ((m256615 ^ i162) * (-12135)) ^ 574990226;
                                            i167 = 2098089140;
                                        }
                                    case -1225838527:
                                    case 736299734:
                                        C1294.m4372();
                                        if (C7811.m20844() == 0) {
                                            interfaceC13049 = interfaceC130496;
                                            interfaceC130492 = interfaceC130495;
                                            m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                            i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                            i157 = 1114470979;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        } else {
                                            int m256616 = (C0630.m2566("ۤ᩹") ^ i163) * 37;
                                            i165 = m256616 ^ 1480257853;
                                            i164 = ((m256616 ^ i162) * (-11871)) ^ 1974822701;
                                        }
                                    case -1201892679:
                                    case -965282789:
                                        C3746.m11360(C0964.m3409(ViewOnClickListenerC5850.this, i166 ^ i167), 8);
                                        break;
                                    case -1153481682:
                                    case 1340585350:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        sArr12 = f24609;
                                        if (RunnableC0588.f2309 >= 0) {
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130496 = interfaceC13049;
                                            int m256617 = (i163 - C0630.m2566("ۚۗ")) * 3;
                                            sArr13 = sArr12;
                                            i164 = ((m256617 ^ i162) * 2631) ^ 916871095;
                                            i165 = m256617 ^ 936678584;
                                        } else {
                                            int m256618 = (i163 - C0630.m2566("ۛۢ")) * (-125);
                                            sArr13 = sArr12;
                                            i164 = ((m256618 ^ i162) * 865) ^ 1141427324;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = m256618 ^ 1547639302;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                    case -1068622431:
                                    case -729018560:
                                        C1916.m6308();
                                        C4159.m12565();
                                        break;
                                    case -1012542623:
                                    case 152468022:
                                        interfaceC130493 = interfaceC130495;
                                        int i174 = ViewOnClickListenerC5850.f17941;
                                        interfaceC130496 = ViewOnClickListenerC1958.m6438(ApplicationC20075.f65008);
                                        sArr14 = f24609;
                                        if (RunnableC0588.f2309 >= 0) {
                                            sArr12 = sArr13;
                                            interfaceC130495 = interfaceC130493;
                                            int m2566172 = (i163 - C0630.m2566("ۚۗ")) * 3;
                                            sArr13 = sArr12;
                                            i164 = ((m2566172 ^ i162) * 2631) ^ 916871095;
                                            i165 = m2566172 ^ 936678584;
                                        } else {
                                            m256613 = C2105.m6981("ܿ֫") ^ i162;
                                            i154 = ((m256613 ^ i163) * (-3093)) ^ (-2067812390);
                                            i155 = 181575768;
                                            i165 = m256613 ^ i155;
                                            i164 = i154;
                                            interfaceC130495 = interfaceC130493;
                                        }
                                    case -1000609849:
                                    case 480893070:
                                        if (C0630.m2564()) {
                                            sArr12 = sArr13;
                                            int m25661722 = (i163 - C0630.m2566("ۚۗ")) * 3;
                                            sArr13 = sArr12;
                                            i164 = ((m25661722 ^ i162) * 2631) ^ 916871095;
                                            i165 = m25661722 ^ 936678584;
                                        } else {
                                            interfaceC13049 = interfaceC130496;
                                            interfaceC130492 = interfaceC130495;
                                            m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                            i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                            i157 = 1114470979;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                    case -671585898:
                                    case 856948639:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        i170 = 9066;
                                        m256614 = C0630.m2566("֡ܿ") ^ i163;
                                        i156 = ((m256614 ^ i162) * 25253) ^ (-967796242);
                                        i157 = -438224136;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case -248391135:
                                    case 1821048488:
                                        if (ViewOnClickListenerC1958.f6529 <= 0) {
                                            interfaceC13049 = interfaceC130496;
                                            interfaceC130492 = interfaceC130495;
                                            m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                            i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                            i157 = 1114470979;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        } else {
                                            i161 = C2105.m6981("۫ܽ") ^ i162;
                                            str11 = str12;
                                            i160 = ((i161 ^ i163) * (-23937)) ^ 1949071968;
                                            i159 = 1246425272;
                                            i165 = i161 ^ i159;
                                            i164 = i160;
                                            str12 = str11;
                                        }
                                    case -40628943:
                                    case 392647581:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        s2 = sArr13[0];
                                        if (C1420.f5096 > 0) {
                                            m256614 = C2105.m6981("ۙ֫") ^ i162;
                                            i156 = ((m256614 ^ i163) * (-10353)) ^ 380356755;
                                            i157 = 1323143491;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                        m256614 = (i162 - C2105.m6981("᩷֡")) * 97;
                                        i156 = ((m256614 ^ i163) * 15109) ^ 467462748;
                                        i157 = 2098003046;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    case 584154611:
                                    case 870254794:
                                        interfaceC130495 = C4616.m13549(interfaceC130496, ViewOnClickListenerC1958.m6435(sArr14, i171, i172, i170), false);
                                        if (C3432.f10845 >= 0) {
                                            sArr12 = sArr13;
                                            int m256617222 = (i163 - C0630.m2566("ۚۗ")) * 3;
                                            sArr13 = sArr12;
                                            i164 = ((m256617222 ^ i162) * 2631) ^ 916871095;
                                            i165 = m256617222 ^ 936678584;
                                        } else {
                                            int m256619 = C0630.m2566("᩻ۜ") ^ i162;
                                            interfaceC13049 = interfaceC130496;
                                            i156 = ((m256619 ^ i163) * (-919)) ^ (-216153824);
                                            i158 = m256619 ^ (-92102339);
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                    case 742427687:
                                    case 1465094576:
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        if (C2126.m7040()) {
                                            sArr12 = sArr13;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130496 = interfaceC13049;
                                            int m2566172222 = (i163 - C0630.m2566("ۚۗ")) * 3;
                                            sArr13 = sArr12;
                                            i164 = ((m2566172222 ^ i162) * 2631) ^ 916871095;
                                            i165 = m2566172222 ^ 936678584;
                                        } else {
                                            m256614 = (C0630.m2566("᩻ۗ") + i162) * (-49);
                                            i156 = ((m256614 ^ i163) * 17849) ^ (-1686312839);
                                            i157 = -333365201;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        }
                                    case 1010542108:
                                    case 1253771856:
                                        str12 = C22628.m50602(sArr15, 5, 3, i170);
                                        if (!C1504.f5354) {
                                            i161 = (i162 - C2105.m6981("ۗ۫")) * (-59);
                                            str11 = str12;
                                            i160 = ((i161 ^ i163) * (-23391)) ^ (-495440778);
                                            i159 = 1931346158;
                                            i165 = i161 ^ i159;
                                            i164 = i160;
                                            str12 = str11;
                                        }
                                        i161 = C2105.m6981("۫ܽ") ^ i162;
                                        str11 = str12;
                                        i160 = ((i161 ^ i163) * (-23937)) ^ 1949071968;
                                        i159 = 1246425272;
                                        i165 = i161 ^ i159;
                                        i164 = i160;
                                        str12 = str11;
                                    case 1737045668:
                                    case 1829716379:
                                        RunnableC1937.m6387();
                                        interfaceC13049 = interfaceC130496;
                                        interfaceC130492 = interfaceC130495;
                                        m256614 = (C0630.m2566("֡ۛ") ^ i162) * (-45);
                                        i156 = ((m256614 ^ i163) * (-27407)) ^ 1681685154;
                                        i157 = 1114470979;
                                        i158 = m256614 ^ i157;
                                        interfaceC130495 = interfaceC130492;
                                        interfaceC130494 = interfaceC13049;
                                        i165 = i158;
                                        i164 = i156;
                                        interfaceC130496 = interfaceC130494;
                                    default:
                                        C1916.m6302(interfaceC130495);
                                        sArr15 = f24609;
                                        if (ViewOnClickListenerC1958.f6529 <= 0) {
                                            interfaceC13049 = interfaceC130496;
                                            interfaceC130492 = interfaceC130495;
                                            m256614 = (i162 - C2105.m6981("᩷֡")) * 97;
                                            i156 = ((m256614 ^ i163) * 15109) ^ 467462748;
                                            i157 = 2098003046;
                                            i158 = m256614 ^ i157;
                                            interfaceC130495 = interfaceC130492;
                                            interfaceC130494 = interfaceC13049;
                                            i165 = i158;
                                            i164 = i156;
                                            interfaceC130496 = interfaceC130494;
                                        } else {
                                            m256613 = (C0630.m2566("ܽ᩵") ^ i163) * (-69);
                                            interfaceC130493 = interfaceC130495;
                                            i154 = ((m256613 ^ i162) * (-24711)) ^ (-1596537449);
                                            i155 = 492003748;
                                            i165 = m256613 ^ i155;
                                            i164 = i154;
                                            interfaceC130495 = interfaceC130493;
                                        }
                                }
                                return;
                            }
                        }
                    });
                    C8960.m23095(C3683.m11213(c192583));
                    break;
                case 943960126:
                case 2140199362:
                    C19258 m21304 = C0483.m2130(this);
                    int i153 = i93;
                    Object[] objArr2 = new Object[i153];
                    objArr2[z17 ? 1 : 0] = C0050.m946(this, C2105.m6981(C3432.m10488(f17942, 560, 3, i80)) ^ 2102755948);
                    String m10566 = ServiceConnectionC3453.m10566(this, i90, objArr2);
                    C4159.m12575(m10566, str6);
                    CharSequence[] charSequenceArr4 = new CharSequence[i153];
                    charSequenceArr4[z17 ? 1 : 0] = m10566;
                    m21304.m44430(charSequenceArr4, new DialogInterface.OnClickListener() { // from class: l.ᩴۚۡ

                        /* renamed from: ۡܺ֨, reason: not valid java name and contains not printable characters */
                        private static final short[] f57586 = {2512, -18893, -21720, -25944};

                        /* JADX WARN: Code restructure failed: missing block: B:11:0x01ff, code lost:
                        
                            r0 = l.C0630.m2566("ܿ֨") ^ r11;
                            r14 = ((r0 ^ r12) * 721) ^ (-49715479);
                            r15 = 274806509;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:39:0x016c, code lost:
                        
                            r0 = l.C2105.m6981("ۤۢ") ^ r12;
                            r14 = ((r0 ^ r11) * 1925) ^ 343256374;
                            r15 = 674556194;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:44:0x01d6, code lost:
                        
                            r0 = (l.C2105.m6981("ۖ᩶") ^ r12) * (-83);
                            r14 = ((r0 ^ r11) * 1071) ^ (-682856947);
                            r15 = 397033893;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:85:0x0038, code lost:
                        
                            if (l.C4159.f13567 == false) goto L11;
                         */
                        /* JADX WARN: Code restructure failed: missing block: B:88:0x0047, code lost:
                        
                            if (l.C0714.f2697 >= 0) goto L11;
                         */
                        @Override // android.content.DialogInterface.OnClickListener
                        /*
                            Code decompiled incorrectly, please refer to instructions dump.
                            To view partially-correct add '--show-bad-code' argument
                        */
                        public final void onClick(android.content.DialogInterface r18, int r19) {
                            /*
                                Method dump skipped, instructions count: 672
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: l.DialogInterfaceOnClickListenerC18551.onClick(android.content.DialogInterface, int):void");
                        }
                    });
                    C3683.m11213(m21304);
                    break;
                case 1147246613:
                case 1472038138:
                    if (AbstractC2021.f6743 <= 0) {
                        i11 = i79;
                        i12 = i96;
                        view3 = view12;
                        textInputLayout = textInputLayout6;
                        i13 = i87;
                        editText = editText8;
                        i14 = i90;
                        z14 = z17 ? 1 : 0;
                        spannableString2 = spannableString6;
                        i15 = i94;
                        str = str7;
                        i16 = i86;
                        view4 = view11;
                        i17 = i93;
                        sArr2 = sArr6;
                        i18 = i78;
                        i19 = i81;
                        i20 = i84;
                        textInputLayout2 = textInputLayout7;
                        view5 = view10;
                        int i10022222 = i85;
                        str2 = str6;
                        editText2 = editText7;
                        i21 = i10022222;
                        z16 = z14;
                        m6981 = C0630.m2566("ۤܳ") ^ i73;
                        i22 = ((m6981 ^ i74) * 27387) ^ (-1472294135);
                        i23 = 1746073576;
                        z15 = z16;
                        int i101222222222 = m6981 ^ i23;
                        view10 = view5;
                        textInputLayout7 = textInputLayout2;
                        spannableString6 = spannableString2;
                        i84 = i20;
                        i90 = i14;
                        i96 = i12;
                        i81 = i19;
                        i76 = i101222222222;
                        i75 = i22;
                        sArr6 = sArr2;
                        i86 = i16;
                        i78 = i18;
                        i93 = i17;
                        editText8 = editText;
                        i87 = i13;
                        view11 = view4;
                        str7 = str;
                        view12 = view3;
                        i94 = i15;
                        z17 = z15;
                        textInputLayout6 = textInputLayout;
                        i79 = i11;
                        int i1022222222222 = i21;
                        editText7 = editText2;
                        str6 = str2;
                        i85 = i1022222222222;
                    } else {
                        m69817 = (C0630.m2566("֫᩺") + i74) * (-11);
                        i69 = ((m69817 ^ i73) * (-23731)) ^ 191121884;
                        i71 = 2136877413;
                        i76 = m69817 ^ i71;
                        z17 = z17;
                        i75 = i69;
                    }
                case 1194276245:
                case 1284934933:
                    String m9462 = C0050.m946(this, C0630.m2566(C3663.m11162(f17942, 572, 3, i80)) ^ 2123127688);
                    int m4384 = C1294.m4384(6.0f);
                    String[] m6436 = ViewOnClickListenerC1958.m6436(C0050.m947(m9462), C4117.m12355(f17942, 575, 1, i80));
                    SpannableString spannableString9 = new SpannableString(C9679.m24613(m6436));
                    i94 = m6436.length;
                    strArr = m6436;
                    i96 = m4384;
                    spannableString6 = spannableString9;
                    i78 = z17 ? 1 : 0;
                    i89 = 0;
                    m69817 = C2105.m6981("֡᩷") ^ i74;
                    i69 = ((m69817 ^ i73) * (-11431)) ^ (-1137444590);
                    i71 = 237833704;
                    i76 = m69817 ^ i71;
                    z17 = z17;
                    i75 = i69;
                case 1285247227:
                case 1337264246:
                    i48 = i79;
                    i49 = i96;
                    i50 = i87;
                    editText5 = editText8;
                    i51 = i90;
                    spannableString5 = spannableString6;
                    i52 = i85;
                    int i154 = i86;
                    short[] sArr12 = sArr6;
                    i53 = i81;
                    int i155 = i93;
                    i31 = i78;
                    boolean z34 = z17 ? 1 : 0;
                    i28 = i94;
                    str4 = str7;
                    view6 = view11;
                    i30 = i155;
                    View m10739 = C3537.m10739(this, C2105.m6981(C0050.m948(f17942, 482, 3, i80)) ^ 2121422037);
                    i54 = i84;
                    View m35072 = C1005.m3507(m10739, i54);
                    C4159.m12575(m35072, str4);
                    textInputLayout7 = (TextInputLayout) m35072;
                    if (C3537.m10746() <= 0) {
                        view10 = m10739;
                        sArr5 = sArr12;
                        i86 = i154;
                        z11 = z34;
                        int m256672 = (i74 - C0630.m2566("ۢ᩸")) * 93;
                        short[] sArr72 = sArr5;
                        i85 = i52;
                        editText8 = editText5;
                        spannableString6 = spannableString5;
                        i87 = i50;
                        i75 = ((m256672 ^ i73) * (-18043)) ^ (-930029292);
                        i90 = i51;
                        i96 = i49;
                        i79 = i48;
                        i76 = m256672 ^ (-1081955421);
                        int i1052 = i28;
                        z17 = z11;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i1052;
                        i84 = i54;
                        i81 = i53;
                        sArr6 = sArr72;
                    } else {
                        int m256613 = (C0630.m2566("ۙ֡") + i74) * (-29);
                        i85 = i52;
                        view10 = m10739;
                        spannableString6 = spannableString5;
                        i84 = i54;
                        i90 = i51;
                        i96 = i49;
                        i81 = i53;
                        i76 = m256613 ^ 2041178038;
                        sArr6 = sArr12;
                        i86 = i154;
                        editText8 = editText5;
                        i87 = i50;
                        i75 = ((m256613 ^ i73) * (-9963)) ^ (-2094599476);
                        z9 = z34;
                        i79 = i48;
                        z8 = z9;
                        int i1142222 = i28;
                        z17 = z8;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i1142222;
                    }
                case 1340057497:
                case 1819111335:
                    i68 = i96;
                    if (i77 == (C0630.m2566(C1420.m4902(f17942, 563, 3, i80)) ^ 2098900180)) {
                        m69816 = C0630.m2566("ܺ֫") ^ i73;
                        i69 = ((m69816 ^ i74) * (-14809)) ^ (-1041456827);
                        i70 = 1157486333;
                    } else {
                        m69816 = (C2105.m6981("۠᩺") + i74) * (-85);
                        i69 = ((m69816 ^ i73) * (-18491)) ^ 751690538;
                        i70 = -263295508;
                    }
                    int i9722222222222222 = m69816 ^ i70;
                    i96 = i68;
                    i76 = i9722222222222222;
                    z17 = z17;
                    i75 = i69;
                case 1399885591:
                case 2064426663:
                    i48 = i79;
                    i49 = i96;
                    i50 = i87;
                    i51 = i90;
                    short[] sArr13 = sArr6;
                    spannableString5 = spannableString6;
                    View view23 = view11;
                    i30 = i93;
                    i31 = i78;
                    boolean z35 = z17 ? 1 : 0;
                    i28 = i94;
                    editText5 = editText8;
                    View m35073 = C1005.m3507(view23, C0630.m2566(RunnableC3474.m10633(f17942, 491, 3, i80)) ^ 2124014149);
                    str4 = str7;
                    C2126.m7031(m35073, str4);
                    textInputLayout9 = (TextInputLayout) m35073;
                    view6 = view23;
                    int m256614 = C0630.m2566(C4075.m12252(f17942, 494, 3, i80)) ^ 2101029258;
                    if (C3245.f10203 <= 0) {
                        i53 = i81;
                        i54 = i84;
                        sArr5 = sArr13;
                        i86 = m256614;
                        i52 = i85;
                        z11 = z35;
                        int m2566722 = (i74 - C0630.m2566("ۢ᩸")) * 93;
                        short[] sArr722 = sArr5;
                        i85 = i52;
                        editText8 = editText5;
                        spannableString6 = spannableString5;
                        i87 = i50;
                        i75 = ((m2566722 ^ i73) * (-18043)) ^ (-930029292);
                        i90 = i51;
                        i96 = i49;
                        i79 = i48;
                        i76 = m2566722 ^ (-1081955421);
                        int i10522 = i28;
                        z17 = z11;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i10522;
                        i84 = i54;
                        i81 = i53;
                        sArr6 = sArr722;
                    } else {
                        int m698113 = (i73 - C2105.m6981("᩸ۚ")) * (-37);
                        sArr6 = sArr13;
                        editText8 = editText5;
                        i87 = i50;
                        i86 = m256614;
                        i75 = ((m698113 ^ i74) * (-31393)) ^ (-378052246);
                        spannableString6 = spannableString5;
                        i90 = i51;
                        i96 = i49;
                        i76 = m698113 ^ (-1106629436);
                        z9 = z35;
                        i79 = i48;
                        z8 = z9;
                        int i11422222 = i28;
                        z17 = z8;
                        i78 = i31;
                        i93 = i30;
                        view11 = view6;
                        str7 = str4;
                        i94 = i11422222;
                    }
                case 1580788398:
                case 2123378068:
                    C4263.m12819();
                    C0630.m2564();
                    break;
                default:
                    i = i79;
                    i2 = i96;
                    i4 = i87;
                    i5 = i90;
                    int i156 = i93;
                    spannableString = spannableString6;
                    i7 = i78;
                    view2 = view11;
                    boolean z36 = z17 ? 1 : 0;
                    i8 = i94;
                    int i157 = i86;
                    editText6 = (EditText) C11340.m28028(view2, i157);
                    sArr = sArr6;
                    i3 = i157;
                    i6 = i156;
                    editText8 = (EditText) C1005.m3507(view2, C0630.m2566(C22628.m50602(f17942, 497, 3, i80)) ^ 2101439018);
                    C0287.m1629(textInputLayout8);
                    C0287.m1629(textInputLayout9);
                    c19258 = C0483.m2130(this);
                    C0798.m3013(c19258, view2);
                    c19258.m44420(new DialogInterface.OnDismissListener() { // from class: l.᩸֡ۡ
                        @Override // android.content.DialogInterface.OnDismissListener
                        public final void onDismiss(DialogInterface dialogInterface) {
                            ViewOnClickListenerC5850.m16393(ViewOnClickListenerC5850.this);
                        }
                    });
                    z = z36;
                    if (RunnableC1108.f4040) {
                        m2566 = C2105.m6981("۠ۧ") ^ i73;
                        i9 = ((m2566 ^ i74) * 27463) ^ 1945310372;
                        i10 = 1431132146;
                        z2 = z36;
                        int i1512 = m2566 ^ i10;
                        i87 = i4;
                        i75 = i9;
                        sArr6 = sArr;
                        i86 = i3;
                        c192582 = c19258;
                        i79 = i;
                        int i1522 = i6;
                        view11 = view2;
                        spannableString6 = spannableString;
                        i90 = i5;
                        i96 = i2;
                        i76 = i1512;
                        i94 = i8;
                        z17 = z2;
                        i78 = i7;
                        i93 = i1522;
                    }
                    m2566 = (C0630.m2566("֡۟") ^ i73) * 13;
                    i9 = ((m2566 ^ i74) * 4745) ^ 1681353921;
                    i10 = -1537468662;
                    z2 = z;
                    int i15122 = m2566 ^ i10;
                    i87 = i4;
                    i75 = i9;
                    sArr6 = sArr;
                    i86 = i3;
                    c192582 = c19258;
                    i79 = i;
                    int i15222 = i6;
                    view11 = view2;
                    spannableString6 = spannableString;
                    i90 = i5;
                    i96 = i2;
                    i76 = i15122;
                    i94 = i8;
                    z17 = z2;
                    i78 = i7;
                    i93 = i15222;
            }
            return;
        }
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static void m16393(ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        viewOnClickListenerC5850.m16407();
    }

    /* JADX WARN: Code restructure failed: missing block: B:18:0x0056, code lost:
    
        r16 = r2;
     */
    /* JADX WARN: Code restructure failed: missing block: B:19:0x005c, code lost:
    
        r17 = r10;
     */
    /* JADX WARN: Code restructure failed: missing block: B:20:0x0260, code lost:
    
        r1 = l.C2105.m6981("᩷ܰ") ^ r11;
        r2 = ((r1 ^ r12) * 6507) ^ (-525085007);
        r10 = -1235093083;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16376(final android.view.View r18, final android.widget.EditText r19, final l.ViewOnClickListenerC5850 r20) {
        /*
            Method dump skipped, instructions count: 858
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16376(android.view.View, android.widget.EditText, l.ۛۚۡ):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:24:0x0072, code lost:
    
        if (l.C1420.f5096 <= 0) goto L10;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16383(l.C13136 r20, l.DialogInterfaceC0206 r21, l.C23881 r22, l.ViewOnClickListenerC5850 r23, com.google.android.material.textfield.TextInputLayout r24) {
        /*
            Method dump skipped, instructions count: 1024
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16383(l.۬۬ܿ, l.֡ۚۢ, l.᩻ᩴۡ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    public static void m16394(C13136 c13136, View view, EditText editText, ViewOnClickListenerC5850 viewOnClickListenerC5850, C23881 c23881) {
        int i;
        int m6981;
        int i2;
        int m2566;
        int i3;
        C23881 c238812 = c23881;
        String str = null;
        int i4 = 0;
        String str2 = null;
        int i5 = 0;
        int i6 = 0;
        short[] sArr = null;
        char c = 0;
        short s = 0;
        int i7 = 0;
        int i8 = 0;
        int i9 = -316269007;
        int i10 = C4117.f13076;
        int i11 = C11340.f33930;
        int m69812 = C2105.m6981("ۖۢ") ^ i11;
        int i12 = ((m69812 ^ i10) * (-32257)) ^ (-1960292444);
        int i13 = 1316107524;
        while (true) {
            int i14 = m69812 ^ i13;
            while (true) {
                i9 = ((((i9 ^ i10) * 13867) >> 31) & i12) ^ i14;
                switch (i9) {
                    case -2125512199:
                    case -1705457420:
                        i = i5;
                        if (!C1711.f5919) {
                            m2566 = (C0630.m2566("ۖ۠") ^ i10) * (-15);
                            i12 = (-2134455085) ^ ((m2566 ^ i11) * 19033);
                            i3 = -2040757435;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        }
                        m2566 = (C0630.m2566("᩹᩵") ^ i10) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        i12 = (-2133906982) ^ ((m2566 ^ i11) * (-16911));
                        i3 = 370474825;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                    case -2100544273:
                    case 648525591:
                        i = i5;
                        if ((77428 * s) - i7 <= 0) {
                            m6981 = (i10 - C0630.m2566("֫᩵")) * (-87);
                            i12 = ((m6981 ^ i11) * (-7857)) ^ (-528248585);
                            i2 = -1489005833;
                        } else {
                            m6981 = C0630.m2566("ۚ۠") ^ i11;
                            i12 = ((m6981 ^ i10) * (-32287)) ^ 47060271;
                            i2 = 1325018738;
                        }
                        i14 = m6981 ^ i2;
                        i5 = i;
                    case -1587092462:
                    case 1679604458:
                        i = i5;
                        s = sArr[c];
                        int i15 = s + 19357;
                        i7 = i15 * i15;
                        if (C0382.f1805) {
                            m6981 = C0630.m2566("᩸۟") ^ i11;
                            i12 = ((m6981 ^ i10) * 4839) ^ 1182535324;
                            i2 = 1457856692;
                            i14 = m6981 ^ i2;
                            i5 = i;
                        } else {
                            i5 = i;
                            int m69813 = C2105.m6981("ۛ֫") ^ i10;
                            i14 = m69813 ^ (-1312847234);
                            i12 = ((m69813 ^ i11) * 26979) ^ (-1082906582);
                            c238812 = c23881;
                        }
                    case -1585567105:
                    case -660233029:
                        if (C0483.f2088 >= 0) {
                            break;
                        }
                        i = i5;
                        m2566 = (C0630.m2566("᩹᩵") ^ i10) * IShizukuService.Stub.TRANSACTION_updateFlagsForUid;
                        i12 = (-2133906982) ^ ((m2566 ^ i11) * (-16911));
                        i3 = 370474825;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                        break;
                    case -1513039034:
                    case -1450136896:
                        i = i5;
                        if (C4075.f12947 < 0) {
                            m2566 = C2105.m6981("᩺ۢ") ^ i11;
                            i12 = (-1558989872) ^ ((m2566 ^ i10) * (-6687));
                            i3 = -675726212;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        }
                        i5 = i;
                        int m698132 = C2105.m6981("ۛ֫") ^ i10;
                        i14 = m698132 ^ (-1312847234);
                        i12 = ((m698132 ^ i11) * 26979) ^ (-1082906582);
                        c238812 = c23881;
                    case -1408360237:
                    case 31124338:
                        C4616.m13552();
                        C1773.m5908();
                        break;
                    case -1369606755:
                    case -558091759:
                        C3683.m11220(RunnableC3474.m10631(c238812, 2119478984 ^ i4));
                        break;
                    case -1149970206:
                    case -411645207:
                        if (C0798.m2998() != 0) {
                            break;
                        }
                        i = i5;
                        m2566 = (C0630.m2566("۠۟") + i11) * 21;
                        i12 = (-1456159750) ^ ((m2566 ^ i10) * 30729);
                        i3 = 1538718815;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                        break;
                    case -934520942:
                    case 654227314:
                        i = i5;
                        i8 = 38565;
                        m6981 = (C0630.m2566("᩹᩺") + i10) * (-5);
                        i12 = ((m6981 ^ i11) * 26647) ^ 967903443;
                        i2 = 1858636169;
                        i14 = m6981 ^ i2;
                        i5 = i;
                    case -804283419:
                    case 1226859100:
                        i = i5;
                        i4 = C0630.m2566(ViewOnClickListenerC1958.m6435(f17942, 222, 3, i8));
                        if (C11340.m28031()) {
                            m6981 = C0630.m2566("۬֨") ^ i11;
                            i12 = ((m6981 ^ i10) * (-10267)) ^ (-635183889);
                            i2 = 2054655645;
                            i14 = m6981 ^ i2;
                            i5 = i;
                        } else {
                            m2566 = C0630.m2566("ۢ᩻") ^ i11;
                            i12 = (-806874522) ^ ((m2566 ^ i10) * (-28879));
                            i3 = 1968497306;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        }
                    case -518508714:
                    case 1881452214:
                        i = i5;
                        str2 = RunnableC1937.m6385(f17942, HideBottomViewOnScrollBehavior.DEFAULT_ENTER_ANIMATION_DURATION_MS, 3, i8);
                        if (C3911.m11924() <= 0) {
                            m2566 = C0630.m2566("ۢ᩻") ^ i11;
                            i12 = (-806874522) ^ ((m2566 ^ i10) * (-28879));
                            i3 = 1968497306;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        } else {
                            m6981 = (i11 - C0630.m2566("ۡ᩻")) * (-13);
                            i12 = ((m6981 ^ i10) * 11189) ^ (-391271887);
                            i2 = -901862014;
                            i14 = m6981 ^ i2;
                            i5 = i;
                        }
                    case -204045340:
                    case 659168928:
                        i5 = C0630.m2566(str2);
                        if (RunnableC0588.f2309 >= 0) {
                            i6 = 2128991662;
                            int m6981322 = C2105.m6981("ۛ֫") ^ i10;
                            i14 = m6981322 ^ (-1312847234);
                            i12 = ((m6981322 ^ i11) * 26979) ^ (-1082906582);
                            c238812 = c23881;
                        } else {
                            int m69814 = C2105.m6981("ۧ᩹") ^ i11;
                            i14 = m69814 ^ (-1895311776);
                            i12 = ((m69814 ^ i10) * 26095) ^ (-1822128345);
                            i6 = 2128991662;
                        }
                    case -106102037:
                    case 59777256:
                        i = i5;
                        sArr = f17942;
                        c = 213;
                        if (C0630.f2410 <= 0) {
                            i5 = i;
                            int m69813222 = C2105.m6981("ۛ֫") ^ i10;
                            i14 = m69813222 ^ (-1312847234);
                            i12 = ((m69813222 ^ i11) * 26979) ^ (-1082906582);
                            c238812 = c23881;
                        } else {
                            m6981 = C2105.m6981("ۙᩳ") ^ i10;
                            i12 = ((m6981 ^ i11) * (-13389)) ^ (-1312352789);
                            i2 = -139489265;
                            i14 = m6981 ^ i2;
                            i5 = i;
                        }
                    case -55548545:
                    case 1356048992:
                        C1916.m6308();
                        C2126.m7040();
                        break;
                    case 398143374:
                    case 1529676078:
                        C22628.m50613(C1005.m3507(view, i5 ^ i6), false);
                        C0798.m3010(editText);
                        viewOnClickListenerC5850.m16389();
                        break;
                    case 536956359:
                    case 1935235308:
                        i = i5;
                        C3683.m11210(c238812, str);
                        C3911.m11920(c13136);
                        if (C0483.m2131(c23881)) {
                            m6981 = (C0630.m2566("᩻֨") ^ i10) * (-57);
                            i12 = ((m6981 ^ i11) * 13675) ^ 1785781438;
                            i2 = 1308260848;
                        } else {
                            m6981 = C0630.m2566("ۨۚ") ^ i10;
                            i12 = ((m6981 ^ i11) * 6411) ^ 1298630970;
                            i2 = -2033787472;
                        }
                        i14 = m6981 ^ i2;
                        i5 = i;
                    case 590866065:
                    case 1845425534:
                        i = i5;
                        str = C0483.m2128(f17942, 214, 8, i8);
                        if (C7811.f24123 >= 0) {
                            m2566 = (C0630.m2566("۠۟") + i11) * 21;
                            i12 = (-1456159750) ^ ((m2566 ^ i10) * 30729);
                            i3 = 1538718815;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        } else {
                            m6981 = C2105.m6981("ۡۜ") ^ i11;
                            i12 = ((m6981 ^ i10) * 28605) ^ 1786605227;
                            i2 = -198461728;
                            i14 = m6981 ^ i2;
                            i5 = i;
                        }
                    case 615995522:
                    case 1009893256:
                        if (C1916.m6308() >= 0) {
                            break;
                        }
                        i = i5;
                        m2566 = C0630.m2566("ۢ᩻") ^ i11;
                        i12 = (-806874522) ^ ((m2566 ^ i10) * (-28879));
                        i3 = 1968497306;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                        break;
                    case 1326035521:
                    case 1544324183:
                        i = i5;
                        if (!C2272.f7362) {
                            m2566 = (i10 - C2105.m6981("ۨ᩷")) * 41;
                            i12 = 9858442 ^ ((m2566 ^ i11) * (-8805));
                            i3 = 1140057758;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        }
                        m2566 = C0630.m2566("ۢ᩻") ^ i11;
                        i12 = (-806874522) ^ ((m2566 ^ i10) * (-28879));
                        i3 = 1968497306;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                    case 1818868440:
                    case 2063817202:
                        i = i5;
                        if (C2958.f9394 < 0) {
                            m2566 = C0630.m2566("᩺᩹") ^ i11;
                            i12 = (-1408394598) ^ ((m2566 ^ i10) * 7403);
                            i3 = -2010780588;
                            i14 = m2566 ^ i3;
                            i5 = i;
                            c238812 = c23881;
                        }
                        m2566 = (C0630.m2566("۠۟") + i11) * 21;
                        i12 = (-1456159750) ^ ((m2566 ^ i10) * 30729);
                        i3 = 1538718815;
                        i14 = m2566 ^ i3;
                        i5 = i;
                        c238812 = c23881;
                    default:
                        i = i5;
                        i8 = 39094;
                        m6981 = (C0630.m2566("᩹᩺") + i10) * (-5);
                        i12 = ((m6981 ^ i11) * 26647) ^ 967903443;
                        i2 = 1858636169;
                        i14 = m6981 ^ i2;
                        i5 = i;
                }
                return;
            }
            m69812 = (C2105.m6981("᩶᩺") ^ i10) * 63;
            i12 = ((m69812 ^ i11) * 10659) ^ (-88275870);
            i13 = 1513140015;
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:156:0x00d7, code lost:
    
        if (l.C4117.f13076 <= 0) goto L38;
     */
    /* JADX WARN: Type inference failed for: r4v86, types: [l.ܰ֡ۡ] */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16392(android.widget.EditText r28, final l.DialogInterfaceC0206 r29, final l.ViewOnClickListenerC5850 r30, final com.google.android.material.textfield.TextInputLayout r31) {
        /*
            Method dump skipped, instructions count: 1876
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16392(android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:37:0x0055, code lost:
    
        if (l.C0422.f1886 <= 0) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:44:0x0069, code lost:
    
        if (l.C5695.f17556 >= 0) goto L14;
     */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16395(l.C13136 r18, l.DialogInterfaceC0206 r19, l.C23881 r20, l.ViewOnClickListenerC5850 r21, com.google.android.material.textfield.TextInputLayout r22) {
        /*
            Method dump skipped, instructions count: 1040
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16395(l.۬۬ܿ, l.֡ۚۢ, l.᩻ᩴۡ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:22:0x0054, code lost:
    
        if (l.ViewOnClickListenerC1958.f6529 <= 0) goto L13;
     */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16396(l.C13136 r17, l.ViewOnClickListenerC5850 r18, l.C23881 r19) {
        /*
            Method dump skipped, instructions count: 850
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16396(l.۬۬ܿ, l.ۛۚۡ, l.᩻ᩴۡ):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:12:0x0069, code lost:
    
        if (l.C0422.f1886 <= 0) goto L48;
     */
    /* JADX WARN: Code restructure failed: missing block: B:18:0x0074, code lost:
    
        if (l.C3911.m11924() <= 0) goto L64;
     */
    /* JADX WARN: Code restructure failed: missing block: B:20:0x007a, code lost:
    
        if (l.C4263.f13799 > 0) goto L44;
     */
    /* renamed from: ۟, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    private final void m16389() {
        /*
            Method dump skipped, instructions count: 844
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16389():void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:29:0x00d2, code lost:
    
        if (l.C1005.f3721 == false) goto L33;
     */
    /* renamed from: ܰ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    private final void m16399() {
        /*
            Method dump skipped, instructions count: 2168
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16399():void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:36:0x006a, code lost:
    
        if (l.C1294.f4556 < 0) goto L14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:37:0x006c, code lost:
    
        r19 = r1;
        r17 = r14;
     */
    /* JADX WARN: Code restructure failed: missing block: B:40:0x0079, code lost:
    
        if (l.C0483.f2088 >= 0) goto L17;
     */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static l.C8058 m16375(l.ViewOnClickListenerC5850 r21, l.C5537 r22) {
        /*
            Method dump skipped, instructions count: 962
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16375(l.ۛۚۡ, l.ۚᩴۡ):l.۠۠᩵");
    }

    /* JADX WARN: Code restructure failed: missing block: B:13:0x0066, code lost:
    
        if (l.C3663.f11553 != false) goto L11;
     */
    /* JADX WARN: Type inference failed for: r2v1, types: [l.ۜۚۡ] */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16391(android.widget.EditText r16, android.widget.EditText r17, final l.DialogInterfaceC0206 r18, l.ViewOnClickListenerC5850 r19, final com.google.android.material.textfield.TextInputLayout r20, com.google.android.material.textfield.TextInputLayout r21) {
        /*
            Method dump skipped, instructions count: 956
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16391(android.widget.EditText, android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m16381(ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        viewOnClickListenerC5850.m16407();
    }

    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    public static void m16380(DialogInterfaceC0206 dialogInterfaceC0206, ViewOnClickListenerC5850 viewOnClickListenerC5850) {
        C3663.m11167(dialogInterfaceC0206);
        viewOnClickListenerC5850.m16398();
    }

    /* JADX WARN: Code restructure failed: missing block: B:47:0x0057, code lost:
    
        if (l.C1711.m5736() > 0) goto L14;
     */
    /* JADX WARN: Type inference failed for: r4v74, types: [l.۟֡ۡ] */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16378(android.widget.EditText r19, final l.DialogInterfaceC0206 r20, l.ViewOnClickListenerC5850 r21, final com.google.android.material.textfield.TextInputLayout r22) {
        /*
            Method dump skipped, instructions count: 956
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16378(android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:40:0x0060, code lost:
    
        if (l.C4075.f12947 >= 0) goto L12;
     */
    /* JADX WARN: Code restructure failed: missing block: B:41:0x0062, code lost:
    
        r19 = r9;
        r9 = r6;
     */
    /* JADX WARN: Code restructure failed: missing block: B:45:0x006b, code lost:
    
        if (l.C1420.m4913() == false) goto L15;
     */
    /* JADX WARN: Multi-variable type inference failed */
    /* JADX WARN: Type inference failed for: r18v0, types: [l.᩷ۚۡ] */
    /* renamed from: ֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16379(final com.google.android.material.textfield.TextInputLayout r20, final android.widget.EditText r21, final l.ViewOnClickListenerC5850 r22, final android.view.View r23, final android.widget.EditText r24) {
        /*
            Method dump skipped, instructions count: 984
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16379(com.google.android.material.textfield.TextInputLayout, android.widget.EditText, l.ۛۚۡ, android.view.View, android.widget.EditText):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:65:0x009a, code lost:
    
        if (l.C0714.m2805() == false) goto L10;
     */
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16404(l.C13136 r28, l.ViewOnClickListenerC5850 r29, l.C23881 r30) {
        /*
            Method dump skipped, instructions count: 1262
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16404(l.۬۬ܿ, l.ۛۚۡ, l.᩻ᩴۡ):void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:36:0x01c5, code lost:
    
        r10 = (r8 - l.C0630.m2566("ܶܳ")) * 69;
        r12 = ((r10 ^ r9) * (-9385)) ^ 640459000;
        r14 = 1324897639;
     */
    /* renamed from: ܽ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16402(android.widget.EditText r16, l.DialogInterfaceC0206 r17, l.ViewOnClickListenerC5850 r18, com.google.android.material.textfield.TextInputLayout r19) {
        /*
            Method dump skipped, instructions count: 826
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16402(android.widget.EditText, l.֡ۚۢ, l.ۛۚۡ, com.google.android.material.textfield.TextInputLayout):void");
    }

    /* JADX INFO: Access modifiers changed from: private */
    /* JADX WARN: Code restructure failed: missing block: B:91:0x0053, code lost:
    
        if (l.C7811.f24123 < 0) goto L18;
     */
    /* renamed from: ֫֫, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void m16388() {
        /*
            Method dump skipped, instructions count: 920
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16388():void");
    }

    /* JADX WARN: Code restructure failed: missing block: B:37:0x003a, code lost:
    
        if (l.C11340.f33930 >= 0) goto L11;
     */
    /* renamed from: ۧ, reason: not valid java name and contains not printable characters */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static void m16390(final android.view.View r18, final android.widget.EditText r19, final l.ViewOnClickListenerC5850 r20) {
        /*
            Method dump skipped, instructions count: 854
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC5850.m16390(android.view.View, android.widget.EditText, l.ۛۚۡ):void");
    }
}
