package l;

import android.view.View;
import com.google.android.material.slider.BaseSlider;
import java.util.List;

/* compiled from: F1FO */
/* renamed from: l.ܿۘۡ, reason: contains not printable characters */
/* loaded from: classes4.dex */
public final /* synthetic */ class ViewOnClickListenerC17097 implements View.OnClickListener {

    /* renamed from: ᩸۟۫, reason: not valid java name and contains not printable characters */
    private static final short[] f52405 = {5293, -9648, -9652, -9652, -9636, -9651, -9644, -9721, -9710, -9710, -9637, -9646, -9649, -9654, -9636, -9649, -9639, -9710, -9656, -9649, -9647, -9726, -9650, -9649, -9634, -9630, -9655, -9660, -9651, -9640, -9728, -9654, -9640, -9633, -9701, -9653, -9640, -9649, -9650, -9644, -9646, -9645, -9728, -9716, -9701, -9656, -9649, -9647, -9630, -9651, -9649, -9640, -9637, -9644, -9659, -9728, -9636, -9645, -9639, -9649, -9646, -9644, -9639, -9709, -9644, -9645, -9655, -9640, -9645, -9655, -9709, -9636, -9634, -9655, -9644, -9646, -9645, -9709, -9621, -9612, -9608, -9622, -9638, -9640, -9655, -9601, -9660, -9655, -9640, -9650, -9707, -9709, -9709, -9709, -9708};

    /* renamed from: ᩶, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ Object f52406;

    /* renamed from: ᩸, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ int f52407;

    /* renamed from: ᩹, reason: not valid java name and contains not printable characters */
    public final /* synthetic */ AbstractActivityC3346 f52408;

    public /* synthetic */ ViewOnClickListenerC17097(C11182 c11182, AbstractActivityC3346 abstractActivityC3346, List list) {
        int i = 1162623092;
        int i2 = C2958.f9394;
        int i3 = C4117.f13076;
        this.f52407 = 0;
        int m6981 = (C2105.m6981("ܳۛ") + i3) * 55;
        int i4 = ((m6981 ^ i2) * 27235) ^ (-549906027);
        int i5 = 804040671;
        while (true) {
            i = ((((i ^ i2) * (-30991)) >> 31) & i4) ^ (m6981 ^ i5);
            switch (i) {
                case -1972565434:
                case -1266549319:
                    this.f52408 = abstractActivityC3346;
                    if (C2958.m9034() <= 0) {
                        m6981 = (C0630.m2566("ۙۜ") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * (-14065)) ^ (-120252353);
                        i5 = 773138420;
                    } else {
                        m6981 = (C0630.m2566("ۡۚ") ^ i2) * (-61);
                        i4 = ((m6981 ^ i3) * 27279) ^ (-1414958717);
                        i5 = -2126142297;
                    }
                case -1867699310:
                case 1230370441:
                    if (C11340.f33930 >= 0) {
                        m6981 = (i2 - C2105.m6981("᩹ۛ")) * (-107);
                        i4 = ((m6981 ^ i3) * 32503) ^ 1382838610;
                        i5 = -1948017635;
                    } else {
                        m6981 = (C2105.m6981("ܳۜ") + i2) * 55;
                        i4 = ((m6981 ^ i3) * 26325) ^ 2112844220;
                        i5 = -2035607832;
                    }
                case -1804866812:
                case 2825764:
                    if (AbstractC2021.f6743 > 0) {
                        m6981 = C0630.m2566("ۛۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16563) ^ 536973397;
                        i5 = -1765807768;
                    } else {
                        m6981 = C2105.m6981("۟ۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28119) ^ 985061725;
                        i5 = -1755350694;
                    }
                case -1569710294:
                case -705962376:
                    if (C3019.f9544 >= 0) {
                        m6981 = C2105.m6981("۟ۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28119) ^ 985061725;
                        i5 = -1755350694;
                    } else {
                        m6981 = (i3 - C2105.m6981("ۨۜ")) * 49;
                        i4 = ((m6981 ^ i2) * 30091) ^ 1420732125;
                        i5 = 1973609045;
                    }
                case -1537756298:
                case 502321380:
                    C7106.m19120();
                    C0050.m940();
                    m6981 = (C0630.m2566("ۙۜ") ^ i3) * (-35);
                    i4 = ((m6981 ^ i2) * (-14065)) ^ (-120252353);
                    i5 = 773138420;
                case -1522190889:
                case -372331242:
                    if (C0382.f1805) {
                        m6981 = C2105.m6981("ۛ۠") ^ i2;
                        i4 = ((m6981 ^ i3) * (-25381)) ^ (-366335048);
                        i5 = -980441263;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩹ۛ")) * (-107);
                        i4 = ((m6981 ^ i3) * 32503) ^ 1382838610;
                        i5 = -1948017635;
                    }
                case -1277574330:
                case -1056533195:
                    if (C11340.m28031()) {
                        m6981 = C0630.m2566("ۨܽ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-17479)) ^ 471432263;
                        i5 = -914221979;
                    } else {
                        m6981 = C2105.m6981("۟ۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28119) ^ 985061725;
                        i5 = -1755350694;
                    }
                case -1047119830:
                case 123841398:
                    if (C3911.m11924() > 0) {
                        m6981 = C0630.m2566("֨ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-7905)) ^ (-15481173);
                        i5 = -388842268;
                    } else {
                        m6981 = C0630.m2566("ۛۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16563) ^ 536973397;
                        i5 = -1765807768;
                    }
                case -881539598:
                case 208219392:
                    AbstractC2021.m6574();
                    C3537.m10746();
                    throw new RuntimeException();
                case -748557539:
                case 1017123751:
                    if (C1773.f6144 <= 0) {
                        m6981 = C0630.m2566("ۛۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16563) ^ 536973397;
                        i5 = -1765807768;
                    } else {
                        m6981 = (C2105.m6981("ۡۨ") ^ i3) * (-73);
                        i4 = ((m6981 ^ i2) * 23899) ^ 1586566454;
                        i5 = -801649134;
                    }
                case -707480928:
                case 862645940:
                    if (C0714.m2805()) {
                        m6981 = C0630.m2566("᩸۠") ^ i3;
                        i4 = ((m6981 ^ i2) * 17073) ^ 1176259353;
                        i5 = 372447898;
                    } else {
                        m6981 = C0630.m2566("֨ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-7905)) ^ (-15481173);
                        i5 = -388842268;
                    }
                case -523451443:
                case 396481677:
                    if (AbstractC2021.f6743 <= 0) {
                        m6981 = C2105.m6981("۟ۖ") ^ i3;
                        i4 = ((m6981 ^ i2) * 28119) ^ 985061725;
                        i5 = -1755350694;
                    } else {
                        m6981 = C0630.m2566("ܿᩴ") ^ i3;
                        i4 = ((m6981 ^ i2) * 91) ^ 860899189;
                        i5 = -189170024;
                    }
                case -345562964:
                case 816686755:
                    if (C0422.f1886 <= 0) {
                        m6981 = C0630.m2566("ۛۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16563) ^ 536973397;
                        i5 = -1765807768;
                    } else {
                        m6981 = (i2 - C2105.m6981("᩸ۢ")) * (-103);
                        i4 = ((m6981 ^ i3) * 22429) ^ (-758034322);
                        i5 = 1395399249;
                    }
                case 738555016:
                case 1045119655:
                    this.f52406 = list;
                    return;
                case 1090108245:
                case 1164707732:
                    if (RunnableC1108.m3790()) {
                        m6981 = C0630.m2566("ۛۨ") ^ i2;
                        i4 = ((m6981 ^ i3) * 16563) ^ 536973397;
                        i5 = -1765807768;
                    } else {
                        m6981 = C0630.m2566("᩵ۛ") ^ i3;
                        i4 = ((m6981 ^ i2) * 809) ^ (-1955460139);
                        i5 = -1748224876;
                    }
                default:
                    if (C1773.f6144 <= 0) {
                        m6981 = (C0630.m2566("ۙۜ") ^ i3) * (-35);
                        i4 = ((m6981 ^ i2) * (-14065)) ^ (-120252353);
                        i5 = 773138420;
                    } else {
                        m6981 = C0630.m2566("֨ܿ") ^ i2;
                        i4 = ((m6981 ^ i3) * (-7905)) ^ (-15481173);
                        i5 = -388842268;
                    }
            }
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:65:0x0110, code lost:
    
        if (l.ViewOnClickListenerC1958.f6529 > 0) goto L18;
     */
    @Override // android.view.View.OnClickListener
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public final void onClick(android.view.View r25) {
        /*
            Method dump skipped, instructions count: 1428
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: l.ViewOnClickListenerC17097.onClick(android.view.View):void");
    }

    public /* synthetic */ ViewOnClickListenerC17097(AbstractC20546 abstractC20546, AbstractActivityC3346 abstractActivityC3346) {
        int i = 1191580478;
        int i2 = C3911.f12484;
        int i3 = C2167.f7158;
        this.f52407 = 1;
        int m2566 = (i2 - C0630.m2566("ܶܿ")) * 73;
        int i4 = ((m2566 ^ i3) * 911) ^ (-1963122785);
        int i5 = 295451327;
        while (true) {
            i = ((((i ^ i3) * (-15847)) >> 31) & i4) ^ (m2566 ^ i5);
            switch (i) {
                case -1929121618:
                case -1028765068:
                    C7106.m19120();
                    throw new RuntimeException();
                case -1734479053:
                case 805594505:
                    if (C0422.m1963()) {
                        m2566 = C0630.m2566("᩷ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-13493)) ^ (-2025306517);
                        i5 = 1123389128;
                    } else {
                        m2566 = C2105.m6981("ۚ᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 15157) ^ (-1195090229);
                        i5 = 469248140;
                    }
                case -1600430645:
                case 1589712908:
                    if (C0382.m1848()) {
                        m2566 = C2105.m6981("᩷᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * (-2371)) ^ 1920004007;
                        i5 = -1260549485;
                    } else {
                        m2566 = (C2105.m6981("ۗۤ") ^ i2) * 3;
                        i4 = ((m2566 ^ i3) * (-5817)) ^ 333257624;
                        i5 = -2068868255;
                    }
                case -1593942580:
                case 832131632:
                    if (C0237.f1507 == 0) {
                        m2566 = C2105.m6981("ۚ᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 15157) ^ (-1195090229);
                        i5 = 469248140;
                    } else {
                        m2566 = C2105.m6981("ۘܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * 25925) ^ 1153564914;
                        i5 = 1111625585;
                    }
                case -1542089827:
                case -50194361:
                    if (C2167.f7158 >= 0) {
                        m2566 = (C2105.m6981("۬ۤ") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m2566 ^ i2) * (-9603)) ^ 305019371;
                        i5 = 1701451526;
                    } else {
                        m2566 = C0630.m2566("ۙ֫") ^ i3;
                        i4 = ((m2566 ^ i2) * (-12991)) ^ 163829620;
                        i5 = -2027667027;
                    }
                case -1532890564:
                case 566573593:
                    if (C1711.f5919) {
                        m2566 = C2105.m6981("᩷᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * (-2371)) ^ 1920004007;
                        i5 = -1260549485;
                    } else {
                        m2566 = C2105.m6981("ۚ᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 15157) ^ (-1195090229);
                        i5 = 469248140;
                    }
                case -1487932572:
                case -747171834:
                    C3911.m11924();
                    if (AbstractC2021.f6743 > 0) {
                        m2566 = C2105.m6981("ۚ᩸") ^ i3;
                        i4 = ((m2566 ^ i2) * 15157) ^ (-1195090229);
                        i5 = 469248140;
                    } else {
                        m2566 = (C2105.m6981("۬ۤ") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m2566 ^ i2) * (-9603)) ^ 305019371;
                        i5 = 1701451526;
                    }
                case -1338049784:
                case 754336109:
                    if (RunnableC1108.f4040) {
                        m2566 = (C0630.m2566("᩺ۖ") + i3) * (-99);
                        i4 = ((m2566 ^ i2) * 20863) ^ 479825000;
                        i5 = -175821002;
                    } else {
                        m2566 = C2105.m6981("᩶ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-15005)) ^ (-468578156);
                        i5 = 1102048848;
                    }
                case -984037438:
                case 1379787353:
                    C1773.m5908();
                    C4117.m12364();
                    m2566 = C2105.m6981("ۚ᩸") ^ i3;
                    i4 = ((m2566 ^ i2) * 15157) ^ (-1195090229);
                    i5 = 469248140;
                case -954714605:
                case 66208410:
                    this.f52406 = abstractC20546;
                    if (RunnableC0588.f2309 >= 0) {
                        m2566 = C2105.m6981("᩶ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-15005)) ^ (-468578156);
                        i5 = 1102048848;
                    } else {
                        m2566 = (C0630.m2566("ܳ֫") + i2) * 41;
                        i4 = ((m2566 ^ i3) * (-1951)) ^ 1688093031;
                        i5 = 221799658;
                    }
                case -553732940:
                case -442322808:
                    if (C7811.m20844() != 0) {
                        m2566 = (C2105.m6981("۬ۤ") + i3) * BaseSlider.DEFAULT_LABEL_ANIMATION_EXIT_DURATION;
                        i4 = ((m2566 ^ i2) * (-9603)) ^ 305019371;
                        i5 = 1701451526;
                    } else {
                        m2566 = C0630.m2566("᩷᩵") ^ i3;
                        i4 = ((m2566 ^ i2) * (-18417)) ^ (-1257339868);
                        i5 = -2020287756;
                    }
                case -138552545:
                case 1783337099:
                    if (C0964.f3626 != 0) {
                        m2566 = C2105.m6981("ۘܰ") ^ i2;
                        i4 = ((m2566 ^ i3) * 25925) ^ 1153564914;
                        i5 = 1111625585;
                    } else {
                        m2566 = (i3 - C0630.m2566("ۜ᩸")) * (-109);
                        i4 = ((m2566 ^ i2) * (-9421)) ^ (-2127744211);
                        i5 = -1825664458;
                    }
                case 77535285:
                case 120547006:
                    if (C7106.f21815 != 0) {
                        m2566 = C2105.m6981("᩶ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-15005)) ^ (-468578156);
                        i5 = 1102048848;
                    } else {
                        m2566 = (C2105.m6981("ᩴۛ") + i2) * (-103);
                        i4 = ((m2566 ^ i3) * 25523) ^ 262350760;
                        i5 = 1529391440;
                    }
                case 130191564:
                case 1225252917:
                    this.f52408 = abstractActivityC3346;
                    return;
                case 1353921036:
                case 1584534649:
                    if (C0050.f910 >= 0) {
                        m2566 = C2105.m6981("᩷᩶") ^ i2;
                        i4 = ((m2566 ^ i3) * (-2371)) ^ 1920004007;
                        i5 = -1260549485;
                    } else {
                        m2566 = (C2105.m6981("֫ܶ") + i3) * (-65);
                        i4 = ((m2566 ^ i2) * (-2639)) ^ 927759889;
                        i5 = -671572463;
                    }
                default:
                    if (C3537.f11231 >= 0) {
                        m2566 = C2105.m6981("᩶ۗ") ^ i2;
                        i4 = ((m2566 ^ i3) * (-15005)) ^ (-468578156);
                        i5 = 1102048848;
                    } else {
                        m2566 = C0630.m2566("ۛ᩹") ^ i2;
                        i4 = ((m2566 ^ i3) * (-12037)) ^ (-451101030);
                        i5 = -904558202;
                    }
            }
        }
    }
}
